svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
/**************************************************************************
**
** Version: @(#)regtc27x.xml	1.15 12/03/05
** Generated by @(#)XmlSfrfilePrinter.java	1.38 12/03/05
** 
** This file contains all SFR and BIT names and on-chip register definitions
** It is based on the following document(s):
** - mira/TC27xA_TS_V3.0.xml (V3.0)
** 
** Copyright 2002-2012 Altium BV
**
**************************************************************************/
#ifndef _REGTC27X_H
#define _REGTC27X_H

/* Core Base */
#define core_base	0xf881	/* The base address off the memory for the CSFR's */
#define core_base_0	0xf881	/* The base address off the memory for the CSFR's CPU0 */
#define core_base_1	0xf883	/* The base address off the memory for the CSFR's CPU1 */
#define core_base_2	0xf885	/* The base address off the memory for the CSFR's CPU2 */

/* Core Special Function Registers (CSFR). Macros, such as TASK_ASI, that expand to a 16-bit number do not directly represent a memory address.
   They are intended to be used with the intrinsic functions __mfcr(...) and __mtcr(...). */
#define TASK_ASI	0x8004	/* CPUn Task Address Space Identifier Register */
#define PMA0	0x8100	/* Data Access CacheabilityRegister */
#define PMA1	0x8104	/* Code Access CacheabilityRegister */
#define PMA2	0x8108	/* Peripheral Space Identifier register */
#define SMACON	0x900c	/* SIST Mode Access Control Register */
#define DIEAR	0x9020	/* Data Integrity Error Address Register */
#define DIETR	0x9024	/* Data Integrity Error Trap Register */
#define PCON1	0x9204	/* Program Control 1 */
#define PCON2	0x9208	/* Program Control 2 */
#define PCON0	0x920c	/* Program Control 0 */
#define PSTR	0x9200	/* Program Synchronous Trap Register */
#define DCON0	0x9040	/* Data Memory Control Register */
#define DCON2	0x9000	/* Data Control Register 2 */
#define DSTR	0x9010	/* Data Synchronous Trap Register */
#define DATR	0x9018	/* Data Asynchronous Trap Register */
#define DEADD	0x901c	/* Data Error Address Register */
#define PIEAR	0x9210	/* Program Integrity Error Address Register */
#define PIETR	0x9214	/* Program Integrity Error Trap Register */
#define COMPAT	0x9400	/* Compatibility Control Register */
#define FPU_TRAP_CON	0xa000	/* CPUn Trap Control Register */
#define FPU_TRAP_PC	0xa004	/* CPUn Trapping Instruction Program Counter Register */
#define FPU_TRAP_OPC	0xa008	/* CPUn Trapping Instruction Opcode Register */
#define FPU_TRAP_SRC1	0xa010	/* CPUn Trapping Instruction Operand Register */
#define FPU_TRAP_SRC2	0xa014	/* CPUn Trapping Instruction Operand Register */
#define FPU_TRAP_SRC3	0xa018	/* Trapping Instruction Operand Register */
#define DPR0_L	0xc000	/* CPUn Data Protection Range 0, Lower Bound Register */
#define DPR1_L	0xc008	/* CPUn Data Protection Range 1, Lower Bound Register */
#define DPR2_L	0xc010	/* CPUn Data Protection Range 2, Lower Bound Register */
#define DPR3_L	0xc018	/* CPUn Data Protection Range 3, Lower Bound Register */
#define DPR4_L	0xc020	/* CPUn Data Protection Range 4, Lower Bound Register */
#define DPR5_L	0xc028	/* CPUn Data Protection Range 5, Lower Bound Register */
#define DPR6_L	0xc030	/* CPUn Data Protection Range 6, Lower Bound Register */
#define DPR7_L	0xc038	/* CPUn Data Protection Range 7, Lower Bound Register */
#define DPR8_L	0xc040	/* CPUn Data Protection Range 8, Lower Bound Register */
#define DPR9_L	0xc048	/* CPUn Data Protection Range 9, Lower Bound Register */
#define DPR10_L	0xc050	/* CPUn Data Protection Range 10, Lower Bound Register */
#define DPR11_L	0xc058	/* CPUn Data Protection Range 11, Lower Bound Register */
#define DPR12_L	0xc060	/* CPUn Data Protection Range 12, Lower Bound Register */
#define DPR13_L	0xc068	/* CPUn Data Protection Range 13, Lower Bound Register */
#define DPR14_L	0xc070	/* CPUn Data Protection Range 14, Lower Bound Register */
#define DPR15_L	0xc078	/* CPUn Data Protection Range 15, Lower Bound Register */
#define DPR0_U	0xc004	/* CPUn Data Protection Range 0, Upper Bound Register */
#define DPR1_U	0xc00c	/* CPUn Data Protection Range 1, Upper Bound Register */
#define DPR2_U	0xc014	/* CPUn Data Protection Range 2, Upper Bound Register */
#define DPR3_U	0xc01c	/* CPUn Data Protection Range 3, Upper Bound Register */
#define DPR4_U	0xc024	/* CPUn Data Protection Range 4, Upper Bound Register */
#define DPR5_U	0xc02c	/* CPUn Data Protection Range 5, Upper Bound Register */
#define DPR6_U	0xc034	/* CPUn Data Protection Range 6, Upper Bound Register */
#define DPR7_U	0xc03c	/* CPUn Data Protection Range 7, Upper Bound Register */
#define DPR8_U	0xc044	/* CPUn Data Protection Range 8, Upper Bound Register */
#define DPR9_U	0xc04c	/* CPUn Data Protection Range 9, Upper Bound Register */
#define DPR10_U	0xc054	/* CPUn Data Protection Range 10, Upper Bound Register */
#define DPR11_U	0xc05c	/* CPUn Data Protection Range 11, Upper Bound Register */
#define DPR12_U	0xc064	/* CPUn Data Protection Range 12, Upper Bound Register */
#define DPR13_U	0xc06c	/* CPUn Data Protection Range 13, Upper Bound Register */
#define DPR14_U	0xc074	/* CPUn Data Protection Range 14, Upper Bound Register */
#define DPR15_U	0xc07c	/* CPUn Data Protection Range 15, Upper Bound Register */
#define CPR0_L	0xd000	/* CPUn Code Protection Range 0 Lower Bound Register */
#define CPR1_L	0xd008	/* CPUn Code Protection Range 1 Lower Bound Register */
#define CPR2_L	0xd010	/* CPUn Code Protection Range 2 Lower Bound Register */
#define CPR3_L	0xd018	/* CPUn Code Protection Range 3 Lower Bound Register */
#define CPR4_L	0xd020	/* CPUn Code Protection Range 4 Lower Bound Register */
#define CPR5_L	0xd028	/* CPUn Code Protection Range 5 Lower Bound Register */
#define CPR6_L	0xd030	/* CPUn Code Protection Range 6 Lower Bound Register */
#define CPR7_L	0xd038	/* CPUn Code Protection Range 7 Lower Bound Register */
#define CPR0_U	0xd004	/* CPUn Code Protection Range 0 Upper Bound Register */
#define CPR1_U	0xd00c	/* CPUn Code Protection Range 1 Upper Bound Register */
#define CPR2_U	0xd014	/* CPUn Code Protection Range 2 Upper Bound Register */
#define CPR3_U	0xd01c	/* CPUn Code Protection Range 3 Upper Bound Register */
#define CPR4_U	0xd024	/* CPUn Code Protection Range 4 Upper Bound Register */
#define CPR5_U	0xd02c	/* CPUn Code Protection Range 5 Upper Bound Register */
#define CPR6_U	0xd034	/* CPUn Code Protection Range 6 Upper Bound Register */
#define CPR7_U	0xd03c	/* CPUn Code Protection Range 7 Upper Bound Register */
#define DPRE_0	0xe010	/* CPUn Data Protection Read Enable Register Set 0 */
#define DPRE_1	0xe014	/* CPUn Data Protection Read Enable Register Set 1 */
#define DPRE_2	0xe018	/* CPUn Data Protection Read Enable Register Set 2 */
#define DPRE_3	0xe01c	/* CPUn Data Protection Read Enable Register Set 3 */
#define DPWE_0	0xe020	/* CPUn Data Protection Write Enable Register Set 0 */
#define DPWE_1	0xe024	/* CPUn Data Protection Write Enable Register Set 1 */
#define DPWE_2	0xe028	/* CPUn Data Protection Write Enable Register Set 2 */
#define DPWE_3	0xe02c	/* CPUn Data Protection Write Enable Register Set 3 */
#define CPXE_0	0xe000	/* CPUn Code Protection Execute Enable Register Set 0 */
#define CPXE_1	0xe004	/* CPUn Code Protection Execute Enable Register Set 1 */
#define CPXE_2	0xe008	/* CPUn Code Protection Execute Enable Register Set 2 */
#define CPXE_3	0xe00c	/* CPUn Code Protection Execute Enable Register Set 3 */
#define TPS_TIMER0	0xe404	/* CPUn Temporal Protection System Timer Register 0 */
#define TPS_TIMER1	0xe408	/* CPUn Temporal Protection System Timer Register 0 */
#define TPS_TIMER2	0xe40c	/* CPUn Temporal Protection System Timer Register 0 */
#define TPS_CON	0xe400	/* CPUn Temporal Protection System Control Register */
#define DBGSR	0xfd00	/* Debug Status Register */
#define EXEVT	0xfd08	/* External Event Register */
#define CREVT	0xfd0c	/* Core Register Access Event */
#define SWEVT	0xfd10	/* Software Debug Event */
#define TR0EVT	0xf000	/* Trigger Event 0 */
#define TR1EVT	0xf008	/* Trigger Event 1 */
#define TR2EVT	0xf010	/* Trigger Event 2 */
#define TR3EVT	0xf018	/* Trigger Event 3 */
#define TR4EVT	0xf020	/* Trigger Event 4 */
#define TR5EVT	0xf028	/* Trigger Event 5 */
#define TR6EVT	0xf030	/* Trigger Event 6 */
#define TR7EVT	0xf038	/* Trigger Event 7 */
#define TR0ADR	0xf004	/* Trigger Address 0 */
#define TR1ADR	0xf00c	/* Trigger Address 1 */
#define TR2ADR	0xf014	/* Trigger Address 2 */
#define TR3ADR	0xf01c	/* Trigger Address 3 */
#define TR4ADR	0xf024	/* Trigger Address 4 */
#define TR5ADR	0xf02c	/* Trigger Address 5 */
#define TR6ADR	0xf034	/* Trigger Address 6 */
#define TR7ADR	0xf03c	/* Trigger Address 7 */
#define TRIG_ACC	0xfd30	/* CPUn Trigger Address x */
#define DMS	0xfd40	/* Debug Monitor Start Address */
#define DCX	0xfd44	/* Debug Context Save Area Pointer */
#define DBGTCR	0xfd48	/* Debug Trap Control Register */
#define CCTRL	0xfc00	/* Counter Control */
#define CCNT	0xfc04	/* CPU Clock Cycle Count */
#define ICNT	0xfc08	/* Instruction Count */
#define M1CNT	0xfc0c	/* Multi-Count Register 1 */
#define M2CNT	0xfc10	/* Multi-Count Register 2 */
#define M3CNT	0xfc14	/* Multi-Count Register 3 */
#define PCXI	0xfe00	/* Previous Context Information Register */
#define PSW	0xfe04	/* Program Status Word */
#define PC	0xfe08	/* Program Counter */
#define SYSCON	0xfe14	/* System Configuration Register */
#define CORE_ID	0xfe1c	/* CPUn Core Identification Register */
#define CPU_ID	0xfe18	/* CPUn Identification Register TC1.6P */
#define CUS_ID	0xfe50	/* CPUn Customer ID register */
#define BIV	0xfe20	/* Base Interrupt Vector Table Pointer */
#define BTV	0xfe24	/* Base Trap Vector Table Pointer */
#define ISP	0xfe28	/* Interrupt Stack Pointer */
#define ICR	0xfe2c	/* Interrupt Control Register */
#define FCX	0xfe38	/* Free CSA List Head Pointer */
#define LCX	0xfe3c	/* Free CSA List Limit Pointer */
#define SEGEN	0x1030	/* SRI Error Generation Register */

/* MCHK */
typedef volatile union
{
	struct
	{ 
		unsigned int MCHKCRC        : 32;	/* Memory Checker CRC */
	} B;
	int I;
	unsigned int U;

} MCHK_CRC0_type;
