svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MCHK_CRC0	(*( MCHK_CRC0_type *) 0xf0004024u)	/* Memory Checker CRC Register */
#define MCHK_CRC1	(*( MCHK_CRC0_type *) 0xf0004028u)	/* Memory Checker CRC Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} MCHK_ID_type;
#define MCHK_ID	(*( MCHK_ID_type *) 0xf0004008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MCHKIN         : 32;	/* Memory Checker Input */
	} B;
	int I;
	unsigned int U;

} MCHK_IR0_type;
#define MCHK_IR0	(*( MCHK_IR0_type *) 0xf0004010u)	/* Memory Checker Input Register */
#define MCHK_IR1	(*( MCHK_IR0_type *) 0xf0004018u)	/* Memory Checker Input Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MCHKR          : 32;	/* Memory Checker Result */
	} B;
	int I;
	unsigned int U;

} MCHK_RR0_type;
#define MCHK_RR0	(*( MCHK_RR0_type *) 0xf0004014u)	/* Memory Checker Result Register */
#define MCHK_RR1	(*( MCHK_RR0_type *) 0xf000401cu)	/* Memory Checker Result Register */

typedef volatile union
{
	struct
	{ 
		unsigned int WO             : 32;	/* Write-Only */
	} B;
	int I;
	unsigned int U;

} MCHK_WR_type;
#define MCHK_WR	(*( MCHK_WR_type *) 0xf0004020u)	/* Memory Checker Write Register */


/* MTU */
typedef volatile union
{
	struct
	{ 
		unsigned int ACCSTYPE       : 8;	/* Access type */
		/* const */ unsigned int Res            : 4;	/* Reserved */
		unsigned int NUMACCS        : 4;	/* Number of accesses per address */
	} B;
	short S;
	unsigned short US;

} MC0_CONFIG0_type;
#define MC0_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061000u)	/* Configuration Register 0 */
#define MC10_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061a00u)	/* Configuration Register 0 */
#define MC11_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061b00u)	/* Configuration Register 0 */
#define MC12_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061c00u)	/* Configuration Register 0 */
#define MC13_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061d00u)	/* Configuration Register 0 */
#define MC14_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061e00u)	/* Configuration Register 0 */
#define MC15_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061f00u)	/* Configuration Register 0 */
#define MC16_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062000u)	/* Configuration Register 0 */
#define MC17_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062100u)	/* Configuration Register 0 */
#define MC18_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062200u)	/* Configuration Register 0 */
#define MC19_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062300u)	/* Configuration Register 0 */
#define MC1_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061100u)	/* Configuration Register 0 */
#define MC20_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062400u)	/* Configuration Register 0 */
#define MC21_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062500u)	/* Configuration Register 0 */
#define MC22_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062600u)	/* Configuration Register 0 */
#define MC23_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062700u)	/* Configuration Register 0 */
#define MC24_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062800u)	/* Configuration Register 0 */
#define MC25_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062900u)	/* Configuration Register 0 */
#define MC26_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062a00u)	/* Configuration Register 0 */
#define MC27_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062b00u)	/* Configuration Register 0 */
#define MC28_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062c00u)	/* Configuration Register 0 */
#define MC29_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062d00u)	/* Configuration Register 0 */
#define MC2_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061200u)	/* Configuration Register 0 */
#define MC30_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062e00u)	/* Configuration Register 0 */
#define MC31_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0062f00u)	/* Configuration Register 0 */
#define MC32_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063000u)	/* Configuration Register 0 */
#define MC33_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063100u)	/* Configuration Register 0 */
#define MC34_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063200u)	/* Configuration Register 0 */
#define MC35_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063300u)	/* Configuration Register 0 */
#define MC36_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063400u)	/* Configuration Register 0 */
#define MC37_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063500u)	/* Configuration Register 0 */
#define MC38_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063600u)	/* Configuration Register 0 */
#define MC39_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063700u)	/* Configuration Register 0 */
#define MC3_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061300u)	/* Configuration Register 0 */
#define MC40_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063800u)	/* Configuration Register 0 */
#define MC41_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063900u)	/* Configuration Register 0 */
#define MC42_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063a00u)	/* Configuration Register 0 */
#define MC43_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063b00u)	/* Configuration Register 0 */
#define MC44_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063c00u)	/* Configuration Register 0 */
#define MC45_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063d00u)	/* Configuration Register 0 */
#define MC46_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063e00u)	/* Configuration Register 0 */
#define MC47_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0063f00u)	/* Configuration Register 0 */
#define MC48_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064000u)	/* Configuration Register 0 */
#define MC49_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064100u)	/* Configuration Register 0 */
#define MC4_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061400u)	/* Configuration Register 0 */
#define MC50_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064200u)	/* Configuration Register 0 */
#define MC51_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064300u)	/* Configuration Register 0 */
#define MC52_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064400u)	/* Configuration Register 0 */
#define MC53_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064500u)	/* Configuration Register 0 */
#define MC54_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064600u)	/* Configuration Register 0 */
#define MC55_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064700u)	/* Configuration Register 0 */
#define MC56_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064800u)	/* Configuration Register 0 */
#define MC57_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064900u)	/* Configuration Register 0 */
#define MC58_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064a00u)	/* Configuration Register 0 */
#define MC59_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064b00u)	/* Configuration Register 0 */
#define MC5_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061500u)	/* Configuration Register 0 */
#define MC60_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064c00u)	/* Configuration Register 0 */
#define MC61_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064d00u)	/* Configuration Register 0 */
#define MC62_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064e00u)	/* Configuration Register 0 */
#define MC63_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0064f00u)	/* Configuration Register 0 */
#define MC64_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065000u)	/* Configuration Register 0 */
#define MC65_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065100u)	/* Configuration Register 0 */
#define MC66_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065200u)	/* Configuration Register 0 */
#define MC67_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065300u)	/* Configuration Register 0 */
#define MC68_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065400u)	/* Configuration Register 0 */
#define MC69_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065500u)	/* Configuration Register 0 */
#define MC6_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061600u)	/* Configuration Register 0 */
#define MC70_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065600u)	/* Configuration Register 0 */
#define MC71_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065700u)	/* Configuration Register 0 */
#define MC72_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065800u)	/* Configuration Register 0 */
#define MC73_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065900u)	/* Configuration Register 0 */
#define MC74_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065a00u)	/* Configuration Register 0 */
#define MC75_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065b00u)	/* Configuration Register 0 */
#define MC76_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065c00u)	/* Configuration Register 0 */
#define MC77_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065d00u)	/* Configuration Register 0 */
#define MC78_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065e00u)	/* Configuration Register 0 */
#define MC79_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0065f00u)	/* Configuration Register 0 */
#define MC7_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061700u)	/* Configuration Register 0 */
#define MC80_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066000u)	/* Configuration Register 0 */
#define MC81_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066100u)	/* Configuration Register 0 */
#define MC82_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066200u)	/* Configuration Register 0 */
#define MC83_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066300u)	/* Configuration Register 0 */
#define MC84_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066400u)	/* Configuration Register 0 */
#define MC85_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066500u)	/* Configuration Register 0 */
#define MC86_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066600u)	/* Configuration Register 0 */
#define MC87_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0066700u)	/* Configuration Register 0 */
#define MC8_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061800u)	/* Configuration Register 0 */
#define MC9_CONFIG0	(*( MC0_CONFIG0_type *) 0xf0061900u)	/* Configuration Register 0 */

