svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ACCSPAT        : 8;	/* Access pattern */
		/* const */ unsigned int Res            : 3;	/* Reserved */
		unsigned int DIR            : 1;	/* Direction */
		unsigned int AG_MOD         : 4;	/* Address Generator Mode */
	} B;
	short S;
	unsigned short US;

} MC0_CONFIG1_type;
#define MC0_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061002u)	/* Configuration Register 1 */
#define MC10_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061a02u)	/* Configuration Register 1 */
#define MC11_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061b02u)	/* Configuration Register 1 */
#define MC12_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061c02u)	/* Configuration Register 1 */
#define MC13_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061d02u)	/* Configuration Register 1 */
#define MC14_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061e02u)	/* Configuration Register 1 */
#define MC15_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061f02u)	/* Configuration Register 1 */
#define MC16_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062002u)	/* Configuration Register 1 */
#define MC17_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062102u)	/* Configuration Register 1 */
#define MC18_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062202u)	/* Configuration Register 1 */
#define MC19_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062302u)	/* Configuration Register 1 */
#define MC1_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061102u)	/* Configuration Register 1 */
#define MC20_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062402u)	/* Configuration Register 1 */
#define MC21_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062502u)	/* Configuration Register 1 */
#define MC22_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062602u)	/* Configuration Register 1 */
#define MC23_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062702u)	/* Configuration Register 1 */
#define MC24_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062802u)	/* Configuration Register 1 */
#define MC25_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062902u)	/* Configuration Register 1 */
#define MC26_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062a02u)	/* Configuration Register 1 */
#define MC27_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062b02u)	/* Configuration Register 1 */
#define MC28_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062c02u)	/* Configuration Register 1 */
#define MC29_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062d02u)	/* Configuration Register 1 */
#define MC2_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061202u)	/* Configuration Register 1 */
#define MC30_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062e02u)	/* Configuration Register 1 */
#define MC31_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0062f02u)	/* Configuration Register 1 */
#define MC32_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063002u)	/* Configuration Register 1 */
#define MC33_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063102u)	/* Configuration Register 1 */
#define MC34_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063202u)	/* Configuration Register 1 */
#define MC35_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063302u)	/* Configuration Register 1 */
#define MC36_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063402u)	/* Configuration Register 1 */
#define MC37_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063502u)	/* Configuration Register 1 */
#define MC38_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063602u)	/* Configuration Register 1 */
#define MC39_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063702u)	/* Configuration Register 1 */
#define MC3_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061302u)	/* Configuration Register 1 */
#define MC40_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063802u)	/* Configuration Register 1 */
#define MC41_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063902u)	/* Configuration Register 1 */
#define MC42_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063a02u)	/* Configuration Register 1 */
#define MC43_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063b02u)	/* Configuration Register 1 */
#define MC44_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063c02u)	/* Configuration Register 1 */
#define MC45_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063d02u)	/* Configuration Register 1 */
#define MC46_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063e02u)	/* Configuration Register 1 */
#define MC47_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0063f02u)	/* Configuration Register 1 */
#define MC48_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064002u)	/* Configuration Register 1 */
#define MC49_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064102u)	/* Configuration Register 1 */
#define MC4_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061402u)	/* Configuration Register 1 */
#define MC50_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064202u)	/* Configuration Register 1 */
#define MC51_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064302u)	/* Configuration Register 1 */
#define MC52_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064402u)	/* Configuration Register 1 */
#define MC53_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064502u)	/* Configuration Register 1 */
#define MC54_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064602u)	/* Configuration Register 1 */
#define MC55_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064702u)	/* Configuration Register 1 */
#define MC56_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064802u)	/* Configuration Register 1 */
#define MC57_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064902u)	/* Configuration Register 1 */
#define MC58_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064a02u)	/* Configuration Register 1 */
#define MC59_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064b02u)	/* Configuration Register 1 */
#define MC5_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061502u)	/* Configuration Register 1 */
#define MC60_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064c02u)	/* Configuration Register 1 */
#define MC61_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064d02u)	/* Configuration Register 1 */
#define MC62_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064e02u)	/* Configuration Register 1 */
#define MC63_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0064f02u)	/* Configuration Register 1 */
#define MC64_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065002u)	/* Configuration Register 1 */
#define MC65_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065102u)	/* Configuration Register 1 */
#define MC66_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065202u)	/* Configuration Register 1 */
#define MC67_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065302u)	/* Configuration Register 1 */
#define MC68_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065402u)	/* Configuration Register 1 */
#define MC69_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065502u)	/* Configuration Register 1 */
#define MC6_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061602u)	/* Configuration Register 1 */
#define MC70_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065602u)	/* Configuration Register 1 */
#define MC71_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065702u)	/* Configuration Register 1 */
#define MC72_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065802u)	/* Configuration Register 1 */
#define MC73_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065902u)	/* Configuration Register 1 */
#define MC74_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065a02u)	/* Configuration Register 1 */
#define MC75_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065b02u)	/* Configuration Register 1 */
#define MC76_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065c02u)	/* Configuration Register 1 */
#define MC77_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065d02u)	/* Configuration Register 1 */
#define MC78_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065e02u)	/* Configuration Register 1 */
#define MC79_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0065f02u)	/* Configuration Register 1 */
#define MC7_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061702u)	/* Configuration Register 1 */
#define MC80_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066002u)	/* Configuration Register 1 */
#define MC81_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066102u)	/* Configuration Register 1 */
#define MC82_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066202u)	/* Configuration Register 1 */
#define MC83_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066302u)	/* Configuration Register 1 */
#define MC84_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066402u)	/* Configuration Register 1 */
#define MC85_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066502u)	/* Configuration Register 1 */
#define MC86_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066602u)	/* Configuration Register 1 */
#define MC87_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0066702u)	/* Configuration Register 1 */
#define MC8_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061802u)	/* Configuration Register 1 */
#define MC9_CONFIG1	(*( MC0_CONFIG1_type *) 0xf0061902u)	/* Configuration Register 1 */

