svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SERR           : 1;	/* Error Detected */
		unsigned int CERR           : 1;	/* Correctable Error Detected */
		unsigned int UERR           : 1;	/* Uncorrectable Error Detected */
		unsigned int AERR           : 1;	/* Address Error Detected */
		/* const */ unsigned int TRC            : 1;	/* Tracking Clear */
		/* const */ unsigned int VAL            : 4;	/* Valid Bits */
		/* const */ unsigned int Res            : 6;	/* Reserved */
		/* const */ unsigned int EOV            : 1;	/* Error Overflow */
	} B;
	short S;
	unsigned short US;

} MC0_ECCD_type;
#define MC0_ECCD	(*( MC0_ECCD_type *) 0xf0061010u)	/* Memory ECC Detection Register */
#define MC10_ECCD	(*( MC0_ECCD_type *) 0xf0061a10u)	/* Memory ECC Detection Register */
#define MC11_ECCD	(*( MC0_ECCD_type *) 0xf0061b10u)	/* Memory ECC Detection Register */
#define MC12_ECCD	(*( MC0_ECCD_type *) 0xf0061c10u)	/* Memory ECC Detection Register */
#define MC13_ECCD	(*( MC0_ECCD_type *) 0xf0061d10u)	/* Memory ECC Detection Register */
#define MC14_ECCD	(*( MC0_ECCD_type *) 0xf0061e10u)	/* Memory ECC Detection Register */
#define MC15_ECCD	(*( MC0_ECCD_type *) 0xf0061f10u)	/* Memory ECC Detection Register */
#define MC16_ECCD	(*( MC0_ECCD_type *) 0xf0062010u)	/* Memory ECC Detection Register */
#define MC17_ECCD	(*( MC0_ECCD_type *) 0xf0062110u)	/* Memory ECC Detection Register */
#define MC18_ECCD	(*( MC0_ECCD_type *) 0xf0062210u)	/* Memory ECC Detection Register */
#define MC19_ECCD	(*( MC0_ECCD_type *) 0xf0062310u)	/* Memory ECC Detection Register */
#define MC1_ECCD	(*( MC0_ECCD_type *) 0xf0061110u)	/* Memory ECC Detection Register */
#define MC20_ECCD	(*( MC0_ECCD_type *) 0xf0062410u)	/* Memory ECC Detection Register */
#define MC21_ECCD	(*( MC0_ECCD_type *) 0xf0062510u)	/* Memory ECC Detection Register */
#define MC22_ECCD	(*( MC0_ECCD_type *) 0xf0062610u)	/* Memory ECC Detection Register */
#define MC23_ECCD	(*( MC0_ECCD_type *) 0xf0062710u)	/* Memory ECC Detection Register */
#define MC24_ECCD	(*( MC0_ECCD_type *) 0xf0062810u)	/* Memory ECC Detection Register */
#define MC25_ECCD	(*( MC0_ECCD_type *) 0xf0062910u)	/* Memory ECC Detection Register */
#define MC26_ECCD	(*( MC0_ECCD_type *) 0xf0062a10u)	/* Memory ECC Detection Register */
#define MC27_ECCD	(*( MC0_ECCD_type *) 0xf0062b10u)	/* Memory ECC Detection Register */
#define MC28_ECCD	(*( MC0_ECCD_type *) 0xf0062c10u)	/* Memory ECC Detection Register */
#define MC29_ECCD	(*( MC0_ECCD_type *) 0xf0062d10u)	/* Memory ECC Detection Register */
#define MC2_ECCD	(*( MC0_ECCD_type *) 0xf0061210u)	/* Memory ECC Detection Register */
#define MC30_ECCD	(*( MC0_ECCD_type *) 0xf0062e10u)	/* Memory ECC Detection Register */
#define MC31_ECCD	(*( MC0_ECCD_type *) 0xf0062f10u)	/* Memory ECC Detection Register */
#define MC32_ECCD	(*( MC0_ECCD_type *) 0xf0063010u)	/* Memory ECC Detection Register */
#define MC33_ECCD	(*( MC0_ECCD_type *) 0xf0063110u)	/* Memory ECC Detection Register */
#define MC34_ECCD	(*( MC0_ECCD_type *) 0xf0063210u)	/* Memory ECC Detection Register */
#define MC35_ECCD	(*( MC0_ECCD_type *) 0xf0063310u)	/* Memory ECC Detection Register */
#define MC36_ECCD	(*( MC0_ECCD_type *) 0xf0063410u)	/* Memory ECC Detection Register */
#define MC37_ECCD	(*( MC0_ECCD_type *) 0xf0063510u)	/* Memory ECC Detection Register */
#define MC38_ECCD	(*( MC0_ECCD_type *) 0xf0063610u)	/* Memory ECC Detection Register */
#define MC39_ECCD	(*( MC0_ECCD_type *) 0xf0063710u)	/* Memory ECC Detection Register */
#define MC3_ECCD	(*( MC0_ECCD_type *) 0xf0061310u)	/* Memory ECC Detection Register */
#define MC40_ECCD	(*( MC0_ECCD_type *) 0xf0063810u)	/* Memory ECC Detection Register */
#define MC41_ECCD	(*( MC0_ECCD_type *) 0xf0063910u)	/* Memory ECC Detection Register */
#define MC42_ECCD	(*( MC0_ECCD_type *) 0xf0063a10u)	/* Memory ECC Detection Register */
#define MC43_ECCD	(*( MC0_ECCD_type *) 0xf0063b10u)	/* Memory ECC Detection Register */
#define MC44_ECCD	(*( MC0_ECCD_type *) 0xf0063c10u)	/* Memory ECC Detection Register */
#define MC45_ECCD	(*( MC0_ECCD_type *) 0xf0063d10u)	/* Memory ECC Detection Register */
#define MC46_ECCD	(*( MC0_ECCD_type *) 0xf0063e10u)	/* Memory ECC Detection Register */
#define MC47_ECCD	(*( MC0_ECCD_type *) 0xf0063f10u)	/* Memory ECC Detection Register */
#define MC48_ECCD	(*( MC0_ECCD_type *) 0xf0064010u)	/* Memory ECC Detection Register */
#define MC49_ECCD	(*( MC0_ECCD_type *) 0xf0064110u)	/* Memory ECC Detection Register */
#define MC4_ECCD	(*( MC0_ECCD_type *) 0xf0061410u)	/* Memory ECC Detection Register */
#define MC50_ECCD	(*( MC0_ECCD_type *) 0xf0064210u)	/* Memory ECC Detection Register */
#define MC51_ECCD	(*( MC0_ECCD_type *) 0xf0064310u)	/* Memory ECC Detection Register */
#define MC52_ECCD	(*( MC0_ECCD_type *) 0xf0064410u)	/* Memory ECC Detection Register */
#define MC53_ECCD	(*( MC0_ECCD_type *) 0xf0064510u)	/* Memory ECC Detection Register */
#define MC54_ECCD	(*( MC0_ECCD_type *) 0xf0064610u)	/* Memory ECC Detection Register */
#define MC55_ECCD	(*( MC0_ECCD_type *) 0xf0064710u)	/* Memory ECC Detection Register */
#define MC56_ECCD	(*( MC0_ECCD_type *) 0xf0064810u)	/* Memory ECC Detection Register */
#define MC57_ECCD	(*( MC0_ECCD_type *) 0xf0064910u)	/* Memory ECC Detection Register */
#define MC58_ECCD	(*( MC0_ECCD_type *) 0xf0064a10u)	/* Memory ECC Detection Register */
#define MC59_ECCD	(*( MC0_ECCD_type *) 0xf0064b10u)	/* Memory ECC Detection Register */
#define MC5_ECCD	(*( MC0_ECCD_type *) 0xf0061510u)	/* Memory ECC Detection Register */
#define MC60_ECCD	(*( MC0_ECCD_type *) 0xf0064c10u)	/* Memory ECC Detection Register */
#define MC61_ECCD	(*( MC0_ECCD_type *) 0xf0064d10u)	/* Memory ECC Detection Register */
#define MC62_ECCD	(*( MC0_ECCD_type *) 0xf0064e10u)	/* Memory ECC Detection Register */
#define MC63_ECCD	(*( MC0_ECCD_type *) 0xf0064f10u)	/* Memory ECC Detection Register */
#define MC64_ECCD	(*( MC0_ECCD_type *) 0xf0065010u)	/* Memory ECC Detection Register */
#define MC65_ECCD	(*( MC0_ECCD_type *) 0xf0065110u)	/* Memory ECC Detection Register */
#define MC66_ECCD	(*( MC0_ECCD_type *) 0xf0065210u)	/* Memory ECC Detection Register */
#define MC67_ECCD	(*( MC0_ECCD_type *) 0xf0065310u)	/* Memory ECC Detection Register */
#define MC68_ECCD	(*( MC0_ECCD_type *) 0xf0065410u)	/* Memory ECC Detection Register */
#define MC69_ECCD	(*( MC0_ECCD_type *) 0xf0065510u)	/* Memory ECC Detection Register */
#define MC6_ECCD	(*( MC0_ECCD_type *) 0xf0061610u)	/* Memory ECC Detection Register */
#define MC70_ECCD	(*( MC0_ECCD_type *) 0xf0065610u)	/* Memory ECC Detection Register */
#define MC71_ECCD	(*( MC0_ECCD_type *) 0xf0065710u)	/* Memory ECC Detection Register */
#define MC72_ECCD	(*( MC0_ECCD_type *) 0xf0065810u)	/* Memory ECC Detection Register */
#define MC73_ECCD	(*( MC0_ECCD_type *) 0xf0065910u)	/* Memory ECC Detection Register */
#define MC74_ECCD	(*( MC0_ECCD_type *) 0xf0065a10u)	/* Memory ECC Detection Register */
#define MC75_ECCD	(*( MC0_ECCD_type *) 0xf0065b10u)	/* Memory ECC Detection Register */
#define MC76_ECCD	(*( MC0_ECCD_type *) 0xf0065c10u)	/* Memory ECC Detection Register */
#define MC77_ECCD	(*( MC0_ECCD_type *) 0xf0065d10u)	/* Memory ECC Detection Register */
#define MC78_ECCD	(*( MC0_ECCD_type *) 0xf0065e10u)	/* Memory ECC Detection Register */
#define MC79_ECCD	(*( MC0_ECCD_type *) 0xf0065f10u)	/* Memory ECC Detection Register */
#define MC7_ECCD	(*( MC0_ECCD_type *) 0xf0061710u)	/* Memory ECC Detection Register */
#define MC80_ECCD	(*( MC0_ECCD_type *) 0xf0066010u)	/* Memory ECC Detection Register */
#define MC81_ECCD	(*( MC0_ECCD_type *) 0xf0066110u)	/* Memory ECC Detection Register */
#define MC82_ECCD	(*( MC0_ECCD_type *) 0xf0066210u)	/* Memory ECC Detection Register */
#define MC83_ECCD	(*( MC0_ECCD_type *) 0xf0066310u)	/* Memory ECC Detection Register */
#define MC84_ECCD	(*( MC0_ECCD_type *) 0xf0066410u)	/* Memory ECC Detection Register */
#define MC85_ECCD	(*( MC0_ECCD_type *) 0xf0066510u)	/* Memory ECC Detection Register */
#define MC86_ECCD	(*( MC0_ECCD_type *) 0xf0066610u)	/* Memory ECC Detection Register */
#define MC87_ECCD	(*( MC0_ECCD_type *) 0xf0066710u)	/* Memory ECC Detection Register */
#define MC8_ECCD	(*( MC0_ECCD_type *) 0xf0061810u)	/* Memory ECC Detection Register */
#define MC9_ECCD	(*( MC0_ECCD_type *) 0xf0061910u)	/* Memory ECC Detection Register */

