svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CENE           : 1;	/* Correctable Error Notification Enable */
		unsigned int UENE           : 1;	/* Uncorrectable Error Notification Enable */
		unsigned int AENE           : 1;	/* Address Error Notification Enable */
		unsigned int ECE            : 1;	/* Error Correction Enable */
		unsigned int TRE            : 1;	/* Tracking Enable */
		unsigned int BFLE           : 1;	/* Bit Flip Enable */
		unsigned int SFLE           : 2;	/* Signature Bit Flip Enables */
		unsigned int ECCMAP         : 2;	/* ECC Bit Mapping Mode */
		unsigned int TC_WAY_SEL     : 2;	/* TriCore Cache Way Select */
		/* const */ unsigned int Res            : 4;	/* Reserved */
	} B;
	short S;
	unsigned short US;

} MC0_ECCS_type;
#define MC0_ECCS	(*( MC0_ECCS_type *) 0xf006100eu)	/* ECC Safety Register */
#define MC10_ECCS	(*( MC0_ECCS_type *) 0xf0061a0eu)	/* ECC Safety Register */
#define MC11_ECCS	(*( MC0_ECCS_type *) 0xf0061b0eu)	/* ECC Safety Register */
#define MC12_ECCS	(*( MC0_ECCS_type *) 0xf0061c0eu)	/* ECC Safety Register */
#define MC13_ECCS	(*( MC0_ECCS_type *) 0xf0061d0eu)	/* ECC Safety Register */
#define MC14_ECCS	(*( MC0_ECCS_type *) 0xf0061e0eu)	/* ECC Safety Register */
#define MC15_ECCS	(*( MC0_ECCS_type *) 0xf0061f0eu)	/* ECC Safety Register */
#define MC16_ECCS	(*( MC0_ECCS_type *) 0xf006200eu)	/* ECC Safety Register */
#define MC17_ECCS	(*( MC0_ECCS_type *) 0xf006210eu)	/* ECC Safety Register */
#define MC18_ECCS	(*( MC0_ECCS_type *) 0xf006220eu)	/* ECC Safety Register */
#define MC19_ECCS	(*( MC0_ECCS_type *) 0xf006230eu)	/* ECC Safety Register */
#define MC1_ECCS	(*( MC0_ECCS_type *) 0xf006110eu)	/* ECC Safety Register */
#define MC20_ECCS	(*( MC0_ECCS_type *) 0xf006240eu)	/* ECC Safety Register */
#define MC21_ECCS	(*( MC0_ECCS_type *) 0xf006250eu)	/* ECC Safety Register */
#define MC22_ECCS	(*( MC0_ECCS_type *) 0xf006260eu)	/* ECC Safety Register */
#define MC23_ECCS	(*( MC0_ECCS_type *) 0xf006270eu)	/* ECC Safety Register */
#define MC24_ECCS	(*( MC0_ECCS_type *) 0xf006280eu)	/* ECC Safety Register */
#define MC25_ECCS	(*( MC0_ECCS_type *) 0xf006290eu)	/* ECC Safety Register */
#define MC26_ECCS	(*( MC0_ECCS_type *) 0xf0062a0eu)	/* ECC Safety Register */
#define MC27_ECCS	(*( MC0_ECCS_type *) 0xf0062b0eu)	/* ECC Safety Register */
#define MC28_ECCS	(*( MC0_ECCS_type *) 0xf0062c0eu)	/* ECC Safety Register */
#define MC29_ECCS	(*( MC0_ECCS_type *) 0xf0062d0eu)	/* ECC Safety Register */
#define MC2_ECCS	(*( MC0_ECCS_type *) 0xf006120eu)	/* ECC Safety Register */
#define MC30_ECCS	(*( MC0_ECCS_type *) 0xf0062e0eu)	/* ECC Safety Register */
#define MC31_ECCS	(*( MC0_ECCS_type *) 0xf0062f0eu)	/* ECC Safety Register */
#define MC32_ECCS	(*( MC0_ECCS_type *) 0xf006300eu)	/* ECC Safety Register */
#define MC33_ECCS	(*( MC0_ECCS_type *) 0xf006310eu)	/* ECC Safety Register */
#define MC34_ECCS	(*( MC0_ECCS_type *) 0xf006320eu)	/* ECC Safety Register */
#define MC35_ECCS	(*( MC0_ECCS_type *) 0xf006330eu)	/* ECC Safety Register */
#define MC36_ECCS	(*( MC0_ECCS_type *) 0xf006340eu)	/* ECC Safety Register */
#define MC37_ECCS	(*( MC0_ECCS_type *) 0xf006350eu)	/* ECC Safety Register */
#define MC38_ECCS	(*( MC0_ECCS_type *) 0xf006360eu)	/* ECC Safety Register */
#define MC39_ECCS	(*( MC0_ECCS_type *) 0xf006370eu)	/* ECC Safety Register */
#define MC3_ECCS	(*( MC0_ECCS_type *) 0xf006130eu)	/* ECC Safety Register */
#define MC40_ECCS	(*( MC0_ECCS_type *) 0xf006380eu)	/* ECC Safety Register */
#define MC41_ECCS	(*( MC0_ECCS_type *) 0xf006390eu)	/* ECC Safety Register */
#define MC42_ECCS	(*( MC0_ECCS_type *) 0xf0063a0eu)	/* ECC Safety Register */
#define MC43_ECCS	(*( MC0_ECCS_type *) 0xf0063b0eu)	/* ECC Safety Register */
#define MC44_ECCS	(*( MC0_ECCS_type *) 0xf0063c0eu)	/* ECC Safety Register */
#define MC45_ECCS	(*( MC0_ECCS_type *) 0xf0063d0eu)	/* ECC Safety Register */
#define MC46_ECCS	(*( MC0_ECCS_type *) 0xf0063e0eu)	/* ECC Safety Register */
#define MC47_ECCS	(*( MC0_ECCS_type *) 0xf0063f0eu)	/* ECC Safety Register */
#define MC48_ECCS	(*( MC0_ECCS_type *) 0xf006400eu)	/* ECC Safety Register */
#define MC49_ECCS	(*( MC0_ECCS_type *) 0xf006410eu)	/* ECC Safety Register */
#define MC4_ECCS	(*( MC0_ECCS_type *) 0xf006140eu)	/* ECC Safety Register */
#define MC50_ECCS	(*( MC0_ECCS_type *) 0xf006420eu)	/* ECC Safety Register */
#define MC51_ECCS	(*( MC0_ECCS_type *) 0xf006430eu)	/* ECC Safety Register */
#define MC52_ECCS	(*( MC0_ECCS_type *) 0xf006440eu)	/* ECC Safety Register */
#define MC53_ECCS	(*( MC0_ECCS_type *) 0xf006450eu)	/* ECC Safety Register */
#define MC54_ECCS	(*( MC0_ECCS_type *) 0xf006460eu)	/* ECC Safety Register */
#define MC55_ECCS	(*( MC0_ECCS_type *) 0xf006470eu)	/* ECC Safety Register */
#define MC56_ECCS	(*( MC0_ECCS_type *) 0xf006480eu)	/* ECC Safety Register */
#define MC57_ECCS	(*( MC0_ECCS_type *) 0xf006490eu)	/* ECC Safety Register */
#define MC58_ECCS	(*( MC0_ECCS_type *) 0xf0064a0eu)	/* ECC Safety Register */
#define MC59_ECCS	(*( MC0_ECCS_type *) 0xf0064b0eu)	/* ECC Safety Register */
#define MC5_ECCS	(*( MC0_ECCS_type *) 0xf006150eu)	/* ECC Safety Register */
#define MC60_ECCS	(*( MC0_ECCS_type *) 0xf0064c0eu)	/* ECC Safety Register */
#define MC61_ECCS	(*( MC0_ECCS_type *) 0xf0064d0eu)	/* ECC Safety Register */
#define MC62_ECCS	(*( MC0_ECCS_type *) 0xf0064e0eu)	/* ECC Safety Register */
#define MC63_ECCS	(*( MC0_ECCS_type *) 0xf0064f0eu)	/* ECC Safety Register */
#define MC64_ECCS	(*( MC0_ECCS_type *) 0xf006500eu)	/* ECC Safety Register */
#define MC65_ECCS	(*( MC0_ECCS_type *) 0xf006510eu)	/* ECC Safety Register */
#define MC66_ECCS	(*( MC0_ECCS_type *) 0xf006520eu)	/* ECC Safety Register */
#define MC67_ECCS	(*( MC0_ECCS_type *) 0xf006530eu)	/* ECC Safety Register */
#define MC68_ECCS	(*( MC0_ECCS_type *) 0xf006540eu)	/* ECC Safety Register */
#define MC69_ECCS	(*( MC0_ECCS_type *) 0xf006550eu)	/* ECC Safety Register */
#define MC6_ECCS	(*( MC0_ECCS_type *) 0xf006160eu)	/* ECC Safety Register */
#define MC70_ECCS	(*( MC0_ECCS_type *) 0xf006560eu)	/* ECC Safety Register */
#define MC71_ECCS	(*( MC0_ECCS_type *) 0xf006570eu)	/* ECC Safety Register */
#define MC72_ECCS	(*( MC0_ECCS_type *) 0xf006580eu)	/* ECC Safety Register */
#define MC73_ECCS	(*( MC0_ECCS_type *) 0xf006590eu)	/* ECC Safety Register */
#define MC74_ECCS	(*( MC0_ECCS_type *) 0xf0065a0eu)	/* ECC Safety Register */
#define MC75_ECCS	(*( MC0_ECCS_type *) 0xf0065b0eu)	/* ECC Safety Register */
#define MC76_ECCS	(*( MC0_ECCS_type *) 0xf0065c0eu)	/* ECC Safety Register */
#define MC77_ECCS	(*( MC0_ECCS_type *) 0xf0065d0eu)	/* ECC Safety Register */
#define MC78_ECCS	(*( MC0_ECCS_type *) 0xf0065e0eu)	/* ECC Safety Register */
#define MC79_ECCS	(*( MC0_ECCS_type *) 0xf0065f0eu)	/* ECC Safety Register */
#define MC7_ECCS	(*( MC0_ECCS_type *) 0xf006170eu)	/* ECC Safety Register */
#define MC80_ECCS	(*( MC0_ECCS_type *) 0xf006600eu)	/* ECC Safety Register */
#define MC81_ECCS	(*( MC0_ECCS_type *) 0xf006610eu)	/* ECC Safety Register */
#define MC82_ECCS	(*( MC0_ECCS_type *) 0xf006620eu)	/* ECC Safety Register */
#define MC83_ECCS	(*( MC0_ECCS_type *) 0xf006630eu)	/* ECC Safety Register */
#define MC84_ECCS	(*( MC0_ECCS_type *) 0xf006640eu)	/* ECC Safety Register */
#define MC85_ECCS	(*( MC0_ECCS_type *) 0xf006650eu)	/* ECC Safety Register */
#define MC86_ECCS	(*( MC0_ECCS_type *) 0xf006660eu)	/* ECC Safety Register */
#define MC87_ECCS	(*( MC0_ECCS_type *) 0xf006670eu)	/* ECC Safety Register */
#define MC8_ECCS	(*( MC0_ECCS_type *) 0xf006180eu)	/* ECC Safety Register */
#define MC9_ECCS	(*( MC0_ECCS_type *) 0xf006190eu)	/* ECC Safety Register */

