svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ADDR           : 16;	/* Address of Error(i) */
	} B;
	short S;
	unsigned short US;

} MC0_ETRR0_type;
#define MC0_ETRR0	(*( MC0_ETRR0_type *) 0xf0061012u)	/* Error Tracking Register */
#define MC0_ETRR1	(*( MC0_ETRR0_type *) 0xf0061014u)	/* Error Tracking Register */
#define MC0_ETRR2	(*( MC0_ETRR0_type *) 0xf0061016u)	/* Error Tracking Register */
#define MC0_ETRR3	(*( MC0_ETRR0_type *) 0xf0061018u)	/* Error Tracking Register */
#define MC10_ETRR0	(*( MC0_ETRR0_type *) 0xf0061a12u)	/* Error Tracking Register */
#define MC10_ETRR1	(*( MC0_ETRR0_type *) 0xf0061a14u)	/* Error Tracking Register */
#define MC10_ETRR2	(*( MC0_ETRR0_type *) 0xf0061a16u)	/* Error Tracking Register */
#define MC10_ETRR3	(*( MC0_ETRR0_type *) 0xf0061a18u)	/* Error Tracking Register */
#define MC11_ETRR0	(*( MC0_ETRR0_type *) 0xf0061b12u)	/* Error Tracking Register */
#define MC11_ETRR1	(*( MC0_ETRR0_type *) 0xf0061b14u)	/* Error Tracking Register */
#define MC11_ETRR2	(*( MC0_ETRR0_type *) 0xf0061b16u)	/* Error Tracking Register */
#define MC11_ETRR3	(*( MC0_ETRR0_type *) 0xf0061b18u)	/* Error Tracking Register */
#define MC12_ETRR0	(*( MC0_ETRR0_type *) 0xf0061c12u)	/* Error Tracking Register */
#define MC12_ETRR1	(*( MC0_ETRR0_type *) 0xf0061c14u)	/* Error Tracking Register */
#define MC12_ETRR2	(*( MC0_ETRR0_type *) 0xf0061c16u)	/* Error Tracking Register */
#define MC12_ETRR3	(*( MC0_ETRR0_type *) 0xf0061c18u)	/* Error Tracking Register */
#define MC13_ETRR0	(*( MC0_ETRR0_type *) 0xf0061d12u)	/* Error Tracking Register */
#define MC13_ETRR1	(*( MC0_ETRR0_type *) 0xf0061d14u)	/* Error Tracking Register */
#define MC13_ETRR2	(*( MC0_ETRR0_type *) 0xf0061d16u)	/* Error Tracking Register */
#define MC13_ETRR3	(*( MC0_ETRR0_type *) 0xf0061d18u)	/* Error Tracking Register */
#define MC14_ETRR0	(*( MC0_ETRR0_type *) 0xf0061e12u)	/* Error Tracking Register */
#define MC14_ETRR1	(*( MC0_ETRR0_type *) 0xf0061e14u)	/* Error Tracking Register */
#define MC14_ETRR2	(*( MC0_ETRR0_type *) 0xf0061e16u)	/* Error Tracking Register */
#define MC14_ETRR3	(*( MC0_ETRR0_type *) 0xf0061e18u)	/* Error Tracking Register */
#define MC15_ETRR0	(*( MC0_ETRR0_type *) 0xf0061f12u)	/* Error Tracking Register */
#define MC15_ETRR1	(*( MC0_ETRR0_type *) 0xf0061f14u)	/* Error Tracking Register */
#define MC15_ETRR2	(*( MC0_ETRR0_type *) 0xf0061f16u)	/* Error Tracking Register */
#define MC15_ETRR3	(*( MC0_ETRR0_type *) 0xf0061f18u)	/* Error Tracking Register */
#define MC16_ETRR0	(*( MC0_ETRR0_type *) 0xf0062012u)	/* Error Tracking Register */
#define MC16_ETRR1	(*( MC0_ETRR0_type *) 0xf0062014u)	/* Error Tracking Register */
#define MC16_ETRR2	(*( MC0_ETRR0_type *) 0xf0062016u)	/* Error Tracking Register */
#define MC16_ETRR3	(*( MC0_ETRR0_type *) 0xf0062018u)	/* Error Tracking Register */
#define MC17_ETRR0	(*( MC0_ETRR0_type *) 0xf0062112u)	/* Error Tracking Register */
#define MC17_ETRR1	(*( MC0_ETRR0_type *) 0xf0062114u)	/* Error Tracking Register */
#define MC17_ETRR2	(*( MC0_ETRR0_type *) 0xf0062116u)	/* Error Tracking Register */
#define MC17_ETRR3	(*( MC0_ETRR0_type *) 0xf0062118u)	/* Error Tracking Register */
#define MC18_ETRR0	(*( MC0_ETRR0_type *) 0xf0062212u)	/* Error Tracking Register */
#define MC18_ETRR1	(*( MC0_ETRR0_type *) 0xf0062214u)	/* Error Tracking Register */
#define MC18_ETRR2	(*( MC0_ETRR0_type *) 0xf0062216u)	/* Error Tracking Register */
#define MC18_ETRR3	(*( MC0_ETRR0_type *) 0xf0062218u)	/* Error Tracking Register */
#define MC19_ETRR0	(*( MC0_ETRR0_type *) 0xf0062312u)	/* Error Tracking Register */
#define MC19_ETRR1	(*( MC0_ETRR0_type *) 0xf0062314u)	/* Error Tracking Register */
#define MC19_ETRR2	(*( MC0_ETRR0_type *) 0xf0062316u)	/* Error Tracking Register */
#define MC19_ETRR3	(*( MC0_ETRR0_type *) 0xf0062318u)	/* Error Tracking Register */
#define MC1_ETRR0	(*( MC0_ETRR0_type *) 0xf0061112u)	/* Error Tracking Register */
#define MC1_ETRR1	(*( MC0_ETRR0_type *) 0xf0061114u)	/* Error Tracking Register */
#define MC1_ETRR2	(*( MC0_ETRR0_type *) 0xf0061116u)	/* Error Tracking Register */
#define MC1_ETRR3	(*( MC0_ETRR0_type *) 0xf0061118u)	/* Error Tracking Register */
#define MC20_ETRR0	(*( MC0_ETRR0_type *) 0xf0062412u)	/* Error Tracking Register */
#define MC20_ETRR1	(*( MC0_ETRR0_type *) 0xf0062414u)	/* Error Tracking Register */
#define MC20_ETRR2	(*( MC0_ETRR0_type *) 0xf0062416u)	/* Error Tracking Register */
#define MC20_ETRR3	(*( MC0_ETRR0_type *) 0xf0062418u)	/* Error Tracking Register */
#define MC21_ETRR0	(*( MC0_ETRR0_type *) 0xf0062512u)	/* Error Tracking Register */
#define MC21_ETRR1	(*( MC0_ETRR0_type *) 0xf0062514u)	/* Error Tracking Register */
#define MC21_ETRR2	(*( MC0_ETRR0_type *) 0xf0062516u)	/* Error Tracking Register */
#define MC21_ETRR3	(*( MC0_ETRR0_type *) 0xf0062518u)	/* Error Tracking Register */
#define MC22_ETRR0	(*( MC0_ETRR0_type *) 0xf0062612u)	/* Error Tracking Register */
#define MC22_ETRR1	(*( MC0_ETRR0_type *) 0xf0062614u)	/* Error Tracking Register */
#define MC22_ETRR2	(*( MC0_ETRR0_type *) 0xf0062616u)	/* Error Tracking Register */
#define MC22_ETRR3	(*( MC0_ETRR0_type *) 0xf0062618u)	/* Error Tracking Register */
#define MC23_ETRR0	(*( MC0_ETRR0_type *) 0xf0062712u)	/* Error Tracking Register */
#define MC23_ETRR1	(*( MC0_ETRR0_type *) 0xf0062714u)	/* Error Tracking Register */
#define MC23_ETRR2	(*( MC0_ETRR0_type *) 0xf0062716u)	/* Error Tracking Register */
#define MC23_ETRR3	(*( MC0_ETRR0_type *) 0xf0062718u)	/* Error Tracking Register */
#define MC24_ETRR0	(*( MC0_ETRR0_type *) 0xf0062812u)	/* Error Tracking Register */
#define MC24_ETRR1	(*( MC0_ETRR0_type *) 0xf0062814u)	/* Error Tracking Register */
#define MC24_ETRR2	(*( MC0_ETRR0_type *) 0xf0062816u)	/* Error Tracking Register */
#define MC24_ETRR3	(*( MC0_ETRR0_type *) 0xf0062818u)	/* Error Tracking Register */
#define MC25_ETRR0	(*( MC0_ETRR0_type *) 0xf0062912u)	/* Error Tracking Register */
#define MC25_ETRR1	(*( MC0_ETRR0_type *) 0xf0062914u)	/* Error Tracking Register */
#define MC25_ETRR2	(*( MC0_ETRR0_type *) 0xf0062916u)	/* Error Tracking Register */
#define MC25_ETRR3	(*( MC0_ETRR0_type *) 0xf0062918u)	/* Error Tracking Register */
#define MC26_ETRR0	(*( MC0_ETRR0_type *) 0xf0062a12u)	/* Error Tracking Register */
#define MC26_ETRR1	(*( MC0_ETRR0_type *) 0xf0062a14u)	/* Error Tracking Register */
#define MC26_ETRR2	(*( MC0_ETRR0_type *) 0xf0062a16u)	/* Error Tracking Register */
#define MC26_ETRR3	(*( MC0_ETRR0_type *) 0xf0062a18u)	/* Error Tracking Register */
#define MC27_ETRR0	(*( MC0_ETRR0_type *) 0xf0062b12u)	/* Error Tracking Register */
#define MC27_ETRR1	(*( MC0_ETRR0_type *) 0xf0062b14u)	/* Error Tracking Register */
#define MC27_ETRR2	(*( MC0_ETRR0_type *) 0xf0062b16u)	/* Error Tracking Register */
#define MC27_ETRR3	(*( MC0_ETRR0_type *) 0xf0062b18u)	/* Error Tracking Register */
#define MC28_ETRR0	(*( MC0_ETRR0_type *) 0xf0062c12u)	/* Error Tracking Register */
#define MC28_ETRR1	(*( MC0_ETRR0_type *) 0xf0062c14u)	/* Error Tracking Register */
#define MC28_ETRR2	(*( MC0_ETRR0_type *) 0xf0062c16u)	/* Error Tracking Register */
#define MC28_ETRR3	(*( MC0_ETRR0_type *) 0xf0062c18u)	/* Error Tracking Register */
#define MC29_ETRR0	(*( MC0_ETRR0_type *) 0xf0062d12u)	/* Error Tracking Register */
#define MC29_ETRR1	(*( MC0_ETRR0_type *) 0xf0062d14u)	/* Error Tracking Register */
#define MC29_ETRR2	(*( MC0_ETRR0_type *) 0xf0062d16u)	/* Error Tracking Register */
#define MC29_ETRR3	(*( MC0_ETRR0_type *) 0xf0062d18u)	/* Error Tracking Register */
#define MC2_ETRR0	(*( MC0_ETRR0_type *) 0xf0061212u)	/* Error Tracking Register */
#define MC2_ETRR1	(*( MC0_ETRR0_type *) 0xf0061214u)	/* Error Tracking Register */
#define MC2_ETRR2	(*( MC0_ETRR0_type *) 0xf0061216u)	/* Error Tracking Register */
#define MC2_ETRR3	(*( MC0_ETRR0_type *) 0xf0061218u)	/* Error Tracking Register */
#define MC30_ETRR0	(*( MC0_ETRR0_type *) 0xf0062e12u)	/* Error Tracking Register */
#define MC30_ETRR1	(*( MC0_ETRR0_type *) 0xf0062e14u)	/* Error Tracking Register */
#define MC30_ETRR2	(*( MC0_ETRR0_type *) 0xf0062e16u)	/* Error Tracking Register */
#define MC30_ETRR3	(*( MC0_ETRR0_type *) 0xf0062e18u)	/* Error Tracking Register */
#define MC31_ETRR0	(*( MC0_ETRR0_type *) 0xf0062f12u)	/* Error Tracking Register */
#define MC31_ETRR1	(*( MC0_ETRR0_type *) 0xf0062f14u)	/* Error Tracking Register */
#define MC31_ETRR2	(*( MC0_ETRR0_type *) 0xf0062f16u)	/* Error Tracking Register */
#define MC31_ETRR3	(*( MC0_ETRR0_type *) 0xf0062f18u)	/* Error Tracking Register */
#define MC32_ETRR0	(*( MC0_ETRR0_type *) 0xf0063012u)	/* Error Tracking Register */
#define MC32_ETRR1	(*( MC0_ETRR0_type *) 0xf0063014u)	/* Error Tracking Register */
#define MC32_ETRR2	(*( MC0_ETRR0_type *) 0xf0063016u)	/* Error Tracking Register */
#define MC32_ETRR3	(*( MC0_ETRR0_type *) 0xf0063018u)	/* Error Tracking Register */
#define MC33_ETRR0	(*( MC0_ETRR0_type *) 0xf0063112u)	/* Error Tracking Register */
#define MC33_ETRR1	(*( MC0_ETRR0_type *) 0xf0063114u)	/* Error Tracking Register */
#define MC33_ETRR2	(*( MC0_ETRR0_type *) 0xf0063116u)	/* Error Tracking Register */
#define MC33_ETRR3	(*( MC0_ETRR0_type *) 0xf0063118u)	/* Error Tracking Register */
#define MC34_ETRR0	(*( MC0_ETRR0_type *) 0xf0063212u)	/* Error Tracking Register */
#define MC34_ETRR1	(*( MC0_ETRR0_type *) 0xf0063214u)	/* Error Tracking Register */
#define MC34_ETRR2	(*( MC0_ETRR0_type *) 0xf0063216u)	/* Error Tracking Register */
#define MC34_ETRR3	(*( MC0_ETRR0_type *) 0xf0063218u)	/* Error Tracking Register */
#define MC35_ETRR0	(*( MC0_ETRR0_type *) 0xf0063312u)	/* Error Tracking Register */
#define MC35_ETRR1	(*( MC0_ETRR0_type *) 0xf0063314u)	/* Error Tracking Register */
#define MC35_ETRR2	(*( MC0_ETRR0_type *) 0xf0063316u)	/* Error Tracking Register */
#define MC35_ETRR3	(*( MC0_ETRR0_type *) 0xf0063318u)	/* Error Tracking Register */
#define MC36_ETRR0	(*( MC0_ETRR0_type *) 0xf0063412u)	/* Error Tracking Register */
#define MC36_ETRR1	(*( MC0_ETRR0_type *) 0xf0063414u)	/* Error Tracking Register */
#define MC36_ETRR2	(*( MC0_ETRR0_type *) 0xf0063416u)	/* Error Tracking Register */
#define MC36_ETRR3	(*( MC0_ETRR0_type *) 0xf0063418u)	/* Error Tracking Register */
#define MC37_ETRR0	(*( MC0_ETRR0_type *) 0xf0063512u)	/* Error Tracking Register */
#define MC37_ETRR1	(*( MC0_ETRR0_type *) 0xf0063514u)	/* Error Tracking Register */
#define MC37_ETRR2	(*( MC0_ETRR0_type *) 0xf0063516u)	/* Error Tracking Register */
#define MC37_ETRR3	(*( MC0_ETRR0_type *) 0xf0063518u)	/* Error Tracking Register */
#define MC38_ETRR0	(*( MC0_ETRR0_type *) 0xf0063612u)	/* Error Tracking Register */
#define MC38_ETRR1	(*( MC0_ETRR0_type *) 0xf0063614u)	/* Error Tracking Register */
#define MC38_ETRR2	(*( MC0_ETRR0_type *) 0xf0063616u)	/* Error Tracking Register */
#define MC38_ETRR3	(*( MC0_ETRR0_type *) 0xf0063618u)	/* Error Tracking Register */
#define MC39_ETRR0	(*( MC0_ETRR0_type *) 0xf0063712u)	/* Error Tracking Register */
#define MC39_ETRR1	(*( MC0_ETRR0_type *) 0xf0063714u)	/* Error Tracking Register */
#define MC39_ETRR2	(*( MC0_ETRR0_type *) 0xf0063716u)	/* Error Tracking Register */
#define MC39_ETRR3	(*( MC0_ETRR0_type *) 0xf0063718u)	/* Error Tracking Register */
#define MC3_ETRR0	(*( MC0_ETRR0_type *) 0xf0061312u)	/* Error Tracking Register */
#define MC3_ETRR1	(*( MC0_ETRR0_type *) 0xf0061314u)	/* Error Tracking Register */
#define MC3_ETRR2	(*( MC0_ETRR0_type *) 0xf0061316u)	/* Error Tracking Register */
#define MC3_ETRR3	(*( MC0_ETRR0_type *) 0xf0061318u)	/* Error Tracking Register */
#define MC40_ETRR0	(*( MC0_ETRR0_type *) 0xf0063812u)	/* Error Tracking Register */
#define MC40_ETRR1	(*( MC0_ETRR0_type *) 0xf0063814u)	/* Error Tracking Register */
#define MC40_ETRR2	(*( MC0_ETRR0_type *) 0xf0063816u)	/* Error Tracking Register */
#define MC40_ETRR3	(*( MC0_ETRR0_type *) 0xf0063818u)	/* Error Tracking Register */
#define MC41_ETRR0	(*( MC0_ETRR0_type *) 0xf0063912u)	/* Error Tracking Register */
#define MC41_ETRR1	(*( MC0_ETRR0_type *) 0xf0063914u)	/* Error Tracking Register */
#define MC41_ETRR2	(*( MC0_ETRR0_type *) 0xf0063916u)	/* Error Tracking Register */
#define MC41_ETRR3	(*( MC0_ETRR0_type *) 0xf0063918u)	/* Error Tracking Register */
#define MC42_ETRR0	(*( MC0_ETRR0_type *) 0xf0063a12u)	/* Error Tracking Register */
#define MC42_ETRR1	(*( MC0_ETRR0_type *) 0xf0063a14u)	/* Error Tracking Register */
#define MC42_ETRR2	(*( MC0_ETRR0_type *) 0xf0063a16u)	/* Error Tracking Register */
#define MC42_ETRR3	(*( MC0_ETRR0_type *) 0xf0063a18u)	/* Error Tracking Register */
#define MC43_ETRR0	(*( MC0_ETRR0_type *) 0xf0063b12u)	/* Error Tracking Register */
#define MC43_ETRR1	(*( MC0_ETRR0_type *) 0xf0063b14u)	/* Error Tracking Register */
#define MC43_ETRR2	(*( MC0_ETRR0_type *) 0xf0063b16u)	/* Error Tracking Register */
#define MC43_ETRR3	(*( MC0_ETRR0_type *) 0xf0063b18u)	/* Error Tracking Register */
#define MC44_ETRR0	(*( MC0_ETRR0_type *) 0xf0063c12u)	/* Error Tracking Register */
#define MC44_ETRR1	(*( MC0_ETRR0_type *) 0xf0063c14u)	/* Error Tracking Register */
#define MC44_ETRR2	(*( MC0_ETRR0_type *) 0xf0063c16u)	/* Error Tracking Register */
#define MC44_ETRR3	(*( MC0_ETRR0_type *) 0xf0063c18u)	/* Error Tracking Register */
#define MC45_ETRR0	(*( MC0_ETRR0_type *) 0xf0063d12u)	/* Error Tracking Register */
#define MC45_ETRR1	(*( MC0_ETRR0_type *) 0xf0063d14u)	/* Error Tracking Register */
#define MC45_ETRR2	(*( MC0_ETRR0_type *) 0xf0063d16u)	/* Error Tracking Register */
#define MC45_ETRR3	(*( MC0_ETRR0_type *) 0xf0063d18u)	/* Error Tracking Register */
#define MC46_ETRR0	(*( MC0_ETRR0_type *) 0xf0063e12u)	/* Error Tracking Register */
#define MC46_ETRR1	(*( MC0_ETRR0_type *) 0xf0063e14u)	/* Error Tracking Register */
#define MC46_ETRR2	(*( MC0_ETRR0_type *) 0xf0063e16u)	/* Error Tracking Register */
#define MC46_ETRR3	(*( MC0_ETRR0_type *) 0xf0063e18u)	/* Error Tracking Register */
#define MC47_ETRR0	(*( MC0_ETRR0_type *) 0xf0063f12u)	/* Error Tracking Register */
#define MC47_ETRR1	(*( MC0_ETRR0_type *) 0xf0063f14u)	/* Error Tracking Register */
#define MC47_ETRR2	(*( MC0_ETRR0_type *) 0xf0063f16u)	/* Error Tracking Register */
#define MC47_ETRR3	(*( MC0_ETRR0_type *) 0xf0063f18u)	/* Error Tracking Register */
#define MC48_ETRR0	(*( MC0_ETRR0_type *) 0xf0064012u)	/* Error Tracking Register */
#define MC48_ETRR1	(*( MC0_ETRR0_type *) 0xf0064014u)	/* Error Tracking Register */
#define MC48_ETRR2	(*( MC0_ETRR0_type *) 0xf0064016u)	/* Error Tracking Register */
#define MC48_ETRR3	(*( MC0_ETRR0_type *) 0xf0064018u)	/* Error Tracking Register */
#define MC49_ETRR0	(*( MC0_ETRR0_type *) 0xf0064112u)	/* Error Tracking Register */
#define MC49_ETRR1	(*( MC0_ETRR0_type *) 0xf0064114u)	/* Error Tracking Register */
#define MC49_ETRR2	(*( MC0_ETRR0_type *) 0xf0064116u)	/* Error Tracking Register */
#define MC49_ETRR3	(*( MC0_ETRR0_type *) 0xf0064118u)	/* Error Tracking Register */
#define MC4_ETRR0	(*( MC0_ETRR0_type *) 0xf0061412u)	/* Error Tracking Register */
#define MC4_ETRR1	(*( MC0_ETRR0_type *) 0xf0061414u)	/* Error Tracking Register */
#define MC4_ETRR2	(*( MC0_ETRR0_type *) 0xf0061416u)	/* Error Tracking Register */
#define MC4_ETRR3	(*( MC0_ETRR0_type *) 0xf0061418u)	/* Error Tracking Register */
#define MC50_ETRR0	(*( MC0_ETRR0_type *) 0xf0064212u)	/* Error Tracking Register */
#define MC50_ETRR1	(*( MC0_ETRR0_type *) 0xf0064214u)	/* Error Tracking Register */
#define MC50_ETRR2	(*( MC0_ETRR0_type *) 0xf0064216u)	/* Error Tracking Register */
#define MC50_ETRR3	(*( MC0_ETRR0_type *) 0xf0064218u)	/* Error Tracking Register */
#define MC51_ETRR0	(*( MC0_ETRR0_type *) 0xf0064312u)	/* Error Tracking Register */
#define MC51_ETRR1	(*( MC0_ETRR0_type *) 0xf0064314u)	/* Error Tracking Register */
#define MC51_ETRR2	(*( MC0_ETRR0_type *) 0xf0064316u)	/* Error Tracking Register */
#define MC51_ETRR3	(*( MC0_ETRR0_type *) 0xf0064318u)	/* Error Tracking Register */
#define MC52_ETRR0	(*( MC0_ETRR0_type *) 0xf0064412u)	/* Error Tracking Register */
#define MC52_ETRR1	(*( MC0_ETRR0_type *) 0xf0064414u)	/* Error Tracking Register */
#define MC52_ETRR2	(*( MC0_ETRR0_type *) 0xf0064416u)	/* Error Tracking Register */
#define MC52_ETRR3	(*( MC0_ETRR0_type *) 0xf0064418u)	/* Error Tracking Register */
#define MC53_ETRR0	(*( MC0_ETRR0_type *) 0xf0064512u)	/* Error Tracking Register */
#define MC53_ETRR1	(*( MC0_ETRR0_type *) 0xf0064514u)	/* Error Tracking Register */
#define MC53_ETRR2	(*( MC0_ETRR0_type *) 0xf0064516u)	/* Error Tracking Register */
#define MC53_ETRR3	(*( MC0_ETRR0_type *) 0xf0064518u)	/* Error Tracking Register */
#define MC54_ETRR0	(*( MC0_ETRR0_type *) 0xf0064612u)	/* Error Tracking Register */
#define MC54_ETRR1	(*( MC0_ETRR0_type *) 0xf0064614u)	/* Error Tracking Register */
#define MC54_ETRR2	(*( MC0_ETRR0_type *) 0xf0064616u)	/* Error Tracking Register */
#define MC54_ETRR3	(*( MC0_ETRR0_type *) 0xf0064618u)	/* Error Tracking Register */
#define MC55_ETRR0	(*( MC0_ETRR0_type *) 0xf0064712u)	/* Error Tracking Register */
#define MC55_ETRR1	(*( MC0_ETRR0_type *) 0xf0064714u)	/* Error Tracking Register */
#define MC55_ETRR2	(*( MC0_ETRR0_type *) 0xf0064716u)	/* Error Tracking Register */
#define MC55_ETRR3	(*( MC0_ETRR0_type *) 0xf0064718u)	/* Error Tracking Register */
#define MC56_ETRR0	(*( MC0_ETRR0_type *) 0xf0064812u)	/* Error Tracking Register */
#define MC56_ETRR1	(*( MC0_ETRR0_type *) 0xf0064814u)	/* Error Tracking Register */
#define MC56_ETRR2	(*( MC0_ETRR0_type *) 0xf0064816u)	/* Error Tracking Register */
#define MC56_ETRR3	(*( MC0_ETRR0_type *) 0xf0064818u)	/* Error Tracking Register */
#define MC57_ETRR0	(*( MC0_ETRR0_type *) 0xf0064912u)	/* Error Tracking Register */
#define MC57_ETRR1	(*( MC0_ETRR0_type *) 0xf0064914u)	/* Error Tracking Register */
#define MC57_ETRR2	(*( MC0_ETRR0_type *) 0xf0064916u)	/* Error Tracking Register */
#define MC57_ETRR3	(*( MC0_ETRR0_type *) 0xf0064918u)	/* Error Tracking Register */
#define MC58_ETRR0	(*( MC0_ETRR0_type *) 0xf0064a12u)	/* Error Tracking Register */
#define MC58_ETRR1	(*( MC0_ETRR0_type *) 0xf0064a14u)	/* Error Tracking Register */
#define MC58_ETRR2	(*( MC0_ETRR0_type *) 0xf0064a16u)	/* Error Tracking Register */
#define MC58_ETRR3	(*( MC0_ETRR0_type *) 0xf0064a18u)	/* Error Tracking Register */
#define MC59_ETRR0	(*( MC0_ETRR0_type *) 0xf0064b12u)	/* Error Tracking Register */
#define MC59_ETRR1	(*( MC0_ETRR0_type *) 0xf0064b14u)	/* Error Tracking Register */
#define MC59_ETRR2	(*( MC0_ETRR0_type *) 0xf0064b16u)	/* Error Tracking Register */
#define MC59_ETRR3	(*( MC0_ETRR0_type *) 0xf0064b18u)	/* Error Tracking Register */
#define MC5_ETRR0	(*( MC0_ETRR0_type *) 0xf0061512u)	/* Error Tracking Register */
#define MC5_ETRR1	(*( MC0_ETRR0_type *) 0xf0061514u)	/* Error Tracking Register */
#define MC5_ETRR2	(*( MC0_ETRR0_type *) 0xf0061516u)	/* Error Tracking Register */
#define MC5_ETRR3	(*( MC0_ETRR0_type *) 0xf0061518u)	/* Error Tracking Register */
#define MC60_ETRR0	(*( MC0_ETRR0_type *) 0xf0064c12u)	/* Error Tracking Register */
#define MC60_ETRR1	(*( MC0_ETRR0_type *) 0xf0064c14u)	/* Error Tracking Register */
#define MC60_ETRR2	(*( MC0_ETRR0_type *) 0xf0064c16u)	/* Error Tracking Register */
#define MC60_ETRR3	(*( MC0_ETRR0_type *) 0xf0064c18u)	/* Error Tracking Register */
#define MC61_ETRR0	(*( MC0_ETRR0_type *) 0xf0064d12u)	/* Error Tracking Register */
#define MC61_ETRR1	(*( MC0_ETRR0_type *) 0xf0064d14u)	/* Error Tracking Register */
#define MC61_ETRR2	(*( MC0_ETRR0_type *) 0xf0064d16u)	/* Error Tracking Register */
#define MC61_ETRR3	(*( MC0_ETRR0_type *) 0xf0064d18u)	/* Error Tracking Register */
#define MC62_ETRR0	(*( MC0_ETRR0_type *) 0xf0064e12u)	/* Error Tracking Register */
#define MC62_ETRR1	(*( MC0_ETRR0_type *) 0xf0064e14u)	/* Error Tracking Register */
#define MC62_ETRR2	(*( MC0_ETRR0_type *) 0xf0064e16u)	/* Error Tracking Register */
#define MC62_ETRR3	(*( MC0_ETRR0_type *) 0xf0064e18u)	/* Error Tracking Register */
#define MC63_ETRR0	(*( MC0_ETRR0_type *) 0xf0064f12u)	/* Error Tracking Register */
#define MC63_ETRR1	(*( MC0_ETRR0_type *) 0xf0064f14u)	/* Error Tracking Register */
#define MC63_ETRR2	(*( MC0_ETRR0_type *) 0xf0064f16u)	/* Error Tracking Register */
#define MC63_ETRR3	(*( MC0_ETRR0_type *) 0xf0064f18u)	/* Error Tracking Register */
#define MC64_ETRR0	(*( MC0_ETRR0_type *) 0xf0065012u)	/* Error Tracking Register */
#define MC64_ETRR1	(*( MC0_ETRR0_type *) 0xf0065014u)	/* Error Tracking Register */
#define MC64_ETRR2	(*( MC0_ETRR0_type *) 0xf0065016u)	/* Error Tracking Register */
#define MC64_ETRR3	(*( MC0_ETRR0_type *) 0xf0065018u)	/* Error Tracking Register */
#define MC65_ETRR0	(*( MC0_ETRR0_type *) 0xf0065112u)	/* Error Tracking Register */
#define MC65_ETRR1	(*( MC0_ETRR0_type *) 0xf0065114u)	/* Error Tracking Register */
#define MC65_ETRR2	(*( MC0_ETRR0_type *) 0xf0065116u)	/* Error Tracking Register */
#define MC65_ETRR3	(*( MC0_ETRR0_type *) 0xf0065118u)	/* Error Tracking Register */
#define MC66_ETRR0	(*( MC0_ETRR0_type *) 0xf0065212u)	/* Error Tracking Register */
#define MC66_ETRR1	(*( MC0_ETRR0_type *) 0xf0065214u)	/* Error Tracking Register */
#define MC66_ETRR2	(*( MC0_ETRR0_type *) 0xf0065216u)	/* Error Tracking Register */
#define MC66_ETRR3	(*( MC0_ETRR0_type *) 0xf0065218u)	/* Error Tracking Register */
#define MC67_ETRR0	(*( MC0_ETRR0_type *) 0xf0065312u)	/* Error Tracking Register */
#define MC67_ETRR1	(*( MC0_ETRR0_type *) 0xf0065314u)	/* Error Tracking Register */
#define MC67_ETRR2	(*( MC0_ETRR0_type *) 0xf0065316u)	/* Error Tracking Register */
#define MC67_ETRR3	(*( MC0_ETRR0_type *) 0xf0065318u)	/* Error Tracking Register */
#define MC68_ETRR0	(*( MC0_ETRR0_type *) 0xf0065412u)	/* Error Tracking Register */
#define MC68_ETRR1	(*( MC0_ETRR0_type *) 0xf0065414u)	/* Error Tracking Register */
#define MC68_ETRR2	(*( MC0_ETRR0_type *) 0xf0065416u)	/* Error Tracking Register */
#define MC68_ETRR3	(*( MC0_ETRR0_type *) 0xf0065418u)	/* Error Tracking Register */
#define MC69_ETRR0	(*( MC0_ETRR0_type *) 0xf0065512u)	/* Error Tracking Register */
#define MC69_ETRR1	(*( MC0_ETRR0_type *) 0xf0065514u)	/* Error Tracking Register */
#define MC69_ETRR2	(*( MC0_ETRR0_type *) 0xf0065516u)	/* Error Tracking Register */
#define MC69_ETRR3	(*( MC0_ETRR0_type *) 0xf0065518u)	/* Error Tracking Register */
#define MC6_ETRR0	(*( MC0_ETRR0_type *) 0xf0061612u)	/* Error Tracking Register */
#define MC6_ETRR1	(*( MC0_ETRR0_type *) 0xf0061614u)	/* Error Tracking Register */
#define MC6_ETRR2	(*( MC0_ETRR0_type *) 0xf0061616u)	/* Error Tracking Register */
#define MC6_ETRR3	(*( MC0_ETRR0_type *) 0xf0061618u)	/* Error Tracking Register */
#define MC70_ETRR0	(*( MC0_ETRR0_type *) 0xf0065612u)	/* Error Tracking Register */
#define MC70_ETRR1	(*( MC0_ETRR0_type *) 0xf0065614u)	/* Error Tracking Register */
#define MC70_ETRR2	(*( MC0_ETRR0_type *) 0xf0065616u)	/* Error Tracking Register */
#define MC70_ETRR3	(*( MC0_ETRR0_type *) 0xf0065618u)	/* Error Tracking Register */
#define MC71_ETRR0	(*( MC0_ETRR0_type *) 0xf0065712u)	/* Error Tracking Register */
#define MC71_ETRR1	(*( MC0_ETRR0_type *) 0xf0065714u)	/* Error Tracking Register */
#define MC71_ETRR2	(*( MC0_ETRR0_type *) 0xf0065716u)	/* Error Tracking Register */
#define MC71_ETRR3	(*( MC0_ETRR0_type *) 0xf0065718u)	/* Error Tracking Register */
#define MC72_ETRR0	(*( MC0_ETRR0_type *) 0xf0065812u)	/* Error Tracking Register */
#define MC72_ETRR1	(*( MC0_ETRR0_type *) 0xf0065814u)	/* Error Tracking Register */
#define MC72_ETRR2	(*( MC0_ETRR0_type *) 0xf0065816u)	/* Error Tracking Register */
#define MC72_ETRR3	(*( MC0_ETRR0_type *) 0xf0065818u)	/* Error Tracking Register */
