svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC73_ETRR0	(*( MC0_ETRR0_type *) 0xf0065912u)	/* Error Tracking Register */
#define MC73_ETRR1	(*( MC0_ETRR0_type *) 0xf0065914u)	/* Error Tracking Register */
#define MC73_ETRR2	(*( MC0_ETRR0_type *) 0xf0065916u)	/* Error Tracking Register */
#define MC73_ETRR3	(*( MC0_ETRR0_type *) 0xf0065918u)	/* Error Tracking Register */
#define MC74_ETRR0	(*( MC0_ETRR0_type *) 0xf0065a12u)	/* Error Tracking Register */
#define MC74_ETRR1	(*( MC0_ETRR0_type *) 0xf0065a14u)	/* Error Tracking Register */
#define MC74_ETRR2	(*( MC0_ETRR0_type *) 0xf0065a16u)	/* Error Tracking Register */
#define MC74_ETRR3	(*( MC0_ETRR0_type *) 0xf0065a18u)	/* Error Tracking Register */
#define MC75_ETRR0	(*( MC0_ETRR0_type *) 0xf0065b12u)	/* Error Tracking Register */
#define MC75_ETRR1	(*( MC0_ETRR0_type *) 0xf0065b14u)	/* Error Tracking Register */
#define MC75_ETRR2	(*( MC0_ETRR0_type *) 0xf0065b16u)	/* Error Tracking Register */
#define MC75_ETRR3	(*( MC0_ETRR0_type *) 0xf0065b18u)	/* Error Tracking Register */
#define MC76_ETRR0	(*( MC0_ETRR0_type *) 0xf0065c12u)	/* Error Tracking Register */
#define MC76_ETRR1	(*( MC0_ETRR0_type *) 0xf0065c14u)	/* Error Tracking Register */
#define MC76_ETRR2	(*( MC0_ETRR0_type *) 0xf0065c16u)	/* Error Tracking Register */
#define MC76_ETRR3	(*( MC0_ETRR0_type *) 0xf0065c18u)	/* Error Tracking Register */
#define MC77_ETRR0	(*( MC0_ETRR0_type *) 0xf0065d12u)	/* Error Tracking Register */
#define MC77_ETRR1	(*( MC0_ETRR0_type *) 0xf0065d14u)	/* Error Tracking Register */
#define MC77_ETRR2	(*( MC0_ETRR0_type *) 0xf0065d16u)	/* Error Tracking Register */
#define MC77_ETRR3	(*( MC0_ETRR0_type *) 0xf0065d18u)	/* Error Tracking Register */
#define MC78_ETRR0	(*( MC0_ETRR0_type *) 0xf0065e12u)	/* Error Tracking Register */
#define MC78_ETRR1	(*( MC0_ETRR0_type *) 0xf0065e14u)	/* Error Tracking Register */
#define MC78_ETRR2	(*( MC0_ETRR0_type *) 0xf0065e16u)	/* Error Tracking Register */
#define MC78_ETRR3	(*( MC0_ETRR0_type *) 0xf0065e18u)	/* Error Tracking Register */
#define MC79_ETRR0	(*( MC0_ETRR0_type *) 0xf0065f12u)	/* Error Tracking Register */
#define MC79_ETRR1	(*( MC0_ETRR0_type *) 0xf0065f14u)	/* Error Tracking Register */
#define MC79_ETRR2	(*( MC0_ETRR0_type *) 0xf0065f16u)	/* Error Tracking Register */
#define MC79_ETRR3	(*( MC0_ETRR0_type *) 0xf0065f18u)	/* Error Tracking Register */
#define MC7_ETRR0	(*( MC0_ETRR0_type *) 0xf0061712u)	/* Error Tracking Register */
#define MC7_ETRR1	(*( MC0_ETRR0_type *) 0xf0061714u)	/* Error Tracking Register */
#define MC7_ETRR2	(*( MC0_ETRR0_type *) 0xf0061716u)	/* Error Tracking Register */
#define MC7_ETRR3	(*( MC0_ETRR0_type *) 0xf0061718u)	/* Error Tracking Register */
#define MC80_ETRR0	(*( MC0_ETRR0_type *) 0xf0066012u)	/* Error Tracking Register */
#define MC80_ETRR1	(*( MC0_ETRR0_type *) 0xf0066014u)	/* Error Tracking Register */
#define MC80_ETRR2	(*( MC0_ETRR0_type *) 0xf0066016u)	/* Error Tracking Register */
#define MC80_ETRR3	(*( MC0_ETRR0_type *) 0xf0066018u)	/* Error Tracking Register */
#define MC81_ETRR0	(*( MC0_ETRR0_type *) 0xf0066112u)	/* Error Tracking Register */
#define MC81_ETRR1	(*( MC0_ETRR0_type *) 0xf0066114u)	/* Error Tracking Register */
#define MC81_ETRR2	(*( MC0_ETRR0_type *) 0xf0066116u)	/* Error Tracking Register */
#define MC81_ETRR3	(*( MC0_ETRR0_type *) 0xf0066118u)	/* Error Tracking Register */
#define MC82_ETRR0	(*( MC0_ETRR0_type *) 0xf0066212u)	/* Error Tracking Register */
#define MC82_ETRR1	(*( MC0_ETRR0_type *) 0xf0066214u)	/* Error Tracking Register */
#define MC82_ETRR2	(*( MC0_ETRR0_type *) 0xf0066216u)	/* Error Tracking Register */
#define MC82_ETRR3	(*( MC0_ETRR0_type *) 0xf0066218u)	/* Error Tracking Register */
#define MC83_ETRR0	(*( MC0_ETRR0_type *) 0xf0066312u)	/* Error Tracking Register */
#define MC83_ETRR1	(*( MC0_ETRR0_type *) 0xf0066314u)	/* Error Tracking Register */
#define MC83_ETRR2	(*( MC0_ETRR0_type *) 0xf0066316u)	/* Error Tracking Register */
#define MC83_ETRR3	(*( MC0_ETRR0_type *) 0xf0066318u)	/* Error Tracking Register */
#define MC84_ETRR0	(*( MC0_ETRR0_type *) 0xf0066412u)	/* Error Tracking Register */
#define MC84_ETRR1	(*( MC0_ETRR0_type *) 0xf0066414u)	/* Error Tracking Register */
#define MC84_ETRR2	(*( MC0_ETRR0_type *) 0xf0066416u)	/* Error Tracking Register */
#define MC84_ETRR3	(*( MC0_ETRR0_type *) 0xf0066418u)	/* Error Tracking Register */
#define MC85_ETRR0	(*( MC0_ETRR0_type *) 0xf0066512u)	/* Error Tracking Register */
#define MC85_ETRR1	(*( MC0_ETRR0_type *) 0xf0066514u)	/* Error Tracking Register */
#define MC85_ETRR2	(*( MC0_ETRR0_type *) 0xf0066516u)	/* Error Tracking Register */
#define MC85_ETRR3	(*( MC0_ETRR0_type *) 0xf0066518u)	/* Error Tracking Register */
#define MC86_ETRR0	(*( MC0_ETRR0_type *) 0xf0066612u)	/* Error Tracking Register */
#define MC86_ETRR1	(*( MC0_ETRR0_type *) 0xf0066614u)	/* Error Tracking Register */
#define MC86_ETRR2	(*( MC0_ETRR0_type *) 0xf0066616u)	/* Error Tracking Register */
#define MC86_ETRR3	(*( MC0_ETRR0_type *) 0xf0066618u)	/* Error Tracking Register */
#define MC87_ETRR0	(*( MC0_ETRR0_type *) 0xf0066712u)	/* Error Tracking Register */
#define MC87_ETRR1	(*( MC0_ETRR0_type *) 0xf0066714u)	/* Error Tracking Register */
#define MC87_ETRR2	(*( MC0_ETRR0_type *) 0xf0066716u)	/* Error Tracking Register */
#define MC87_ETRR3	(*( MC0_ETRR0_type *) 0xf0066718u)	/* Error Tracking Register */
#define MC8_ETRR0	(*( MC0_ETRR0_type *) 0xf0061812u)	/* Error Tracking Register */
#define MC8_ETRR1	(*( MC0_ETRR0_type *) 0xf0061814u)	/* Error Tracking Register */
#define MC8_ETRR2	(*( MC0_ETRR0_type *) 0xf0061816u)	/* Error Tracking Register */
#define MC8_ETRR3	(*( MC0_ETRR0_type *) 0xf0061818u)	/* Error Tracking Register */
#define MC9_ETRR0	(*( MC0_ETRR0_type *) 0xf0061912u)	/* Error Tracking Register */
#define MC9_ETRR1	(*( MC0_ETRR0_type *) 0xf0061914u)	/* Error Tracking Register */
#define MC9_ETRR2	(*( MC0_ETRR0_type *) 0xf0061916u)	/* Error Tracking Register */
#define MC9_ETRR3	(*( MC0_ETRR0_type *) 0xf0061918u)	/* Error Tracking Register */

