svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int START          : 1;	/* START */
		unsigned int MAREN          : 1;	/* Marching Algorithm Enable */
		unsigned int MARS           : 1;	/* Marching Algorithm Select */
		unsigned int CHEN           : 1;	/* Checkerboard Enable */
		unsigned int DINIT          : 1;	/* Data Initialization Enable */
		unsigned int RCADR          : 1;	/* Fast Row / Fast Column Addressing Scheme Select */
		unsigned int ROWTOG         : 1;	/* Row toggling */
		unsigned int BITTOG         : 1;	/* Bit toggling */
		unsigned int GP_BASE        : 1;	/* Galpat Base */
		unsigned int FAILDMP        : 1;	/* Fail bitmap dump */
		unsigned int RSF            : 1;	/* RESET_STICKY_FLAGS */
		unsigned int RESUME         : 1;	/* Resume failed test */
		unsigned int INITRED        : 1;	/* Initialize Redundancy Settings */
		unsigned int LDRED          : 1;	/* Load RedundancyShould not be used together with USERED =?1?. */
		unsigned int USERED         : 1;	/* Use RedundancyShould not be used together with LEDRED =?1?. */
		unsigned int RAR_ECC        : 1;	/* RAR_ECC saver */
	} B;
	short S;
	unsigned short US;

} MC0_MCONTROL_type;
#define MC0_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061004u)	/* MBIST Control Register */
#define MC10_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061a04u)	/* MBIST Control Register */
#define MC11_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061b04u)	/* MBIST Control Register */
#define MC12_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061c04u)	/* MBIST Control Register */
#define MC13_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061d04u)	/* MBIST Control Register */
#define MC14_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061e04u)	/* MBIST Control Register */
#define MC15_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061f04u)	/* MBIST Control Register */
#define MC16_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062004u)	/* MBIST Control Register */
#define MC17_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062104u)	/* MBIST Control Register */
#define MC18_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062204u)	/* MBIST Control Register */
#define MC19_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062304u)	/* MBIST Control Register */
#define MC1_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061104u)	/* MBIST Control Register */
#define MC20_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062404u)	/* MBIST Control Register */
#define MC21_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062504u)	/* MBIST Control Register */
#define MC22_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062604u)	/* MBIST Control Register */
#define MC23_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062704u)	/* MBIST Control Register */
#define MC24_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062804u)	/* MBIST Control Register */
#define MC25_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062904u)	/* MBIST Control Register */
#define MC26_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062a04u)	/* MBIST Control Register */
#define MC27_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062b04u)	/* MBIST Control Register */
#define MC28_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062c04u)	/* MBIST Control Register */
#define MC29_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062d04u)	/* MBIST Control Register */
#define MC2_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061204u)	/* MBIST Control Register */
#define MC30_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062e04u)	/* MBIST Control Register */
#define MC31_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0062f04u)	/* MBIST Control Register */
#define MC32_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063004u)	/* MBIST Control Register */
#define MC33_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063104u)	/* MBIST Control Register */
#define MC34_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063204u)	/* MBIST Control Register */
#define MC35_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063304u)	/* MBIST Control Register */
#define MC36_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063404u)	/* MBIST Control Register */
#define MC37_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063504u)	/* MBIST Control Register */
#define MC38_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063604u)	/* MBIST Control Register */
#define MC39_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063704u)	/* MBIST Control Register */
#define MC3_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061304u)	/* MBIST Control Register */
#define MC40_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063804u)	/* MBIST Control Register */
#define MC41_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063904u)	/* MBIST Control Register */
#define MC42_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063a04u)	/* MBIST Control Register */
#define MC43_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063b04u)	/* MBIST Control Register */
#define MC44_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063c04u)	/* MBIST Control Register */
#define MC45_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063d04u)	/* MBIST Control Register */
#define MC46_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063e04u)	/* MBIST Control Register */
#define MC47_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0063f04u)	/* MBIST Control Register */
#define MC48_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064004u)	/* MBIST Control Register */
#define MC49_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064104u)	/* MBIST Control Register */
#define MC4_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061404u)	/* MBIST Control Register */
#define MC50_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064204u)	/* MBIST Control Register */
#define MC51_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064304u)	/* MBIST Control Register */
#define MC52_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064404u)	/* MBIST Control Register */
#define MC53_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064504u)	/* MBIST Control Register */
#define MC54_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064604u)	/* MBIST Control Register */
#define MC55_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064704u)	/* MBIST Control Register */
#define MC56_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064804u)	/* MBIST Control Register */
#define MC57_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064904u)	/* MBIST Control Register */
#define MC58_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064a04u)	/* MBIST Control Register */
#define MC59_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064b04u)	/* MBIST Control Register */
#define MC5_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061504u)	/* MBIST Control Register */
#define MC60_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064c04u)	/* MBIST Control Register */
#define MC61_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064d04u)	/* MBIST Control Register */
#define MC62_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064e04u)	/* MBIST Control Register */
#define MC63_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0064f04u)	/* MBIST Control Register */
#define MC64_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065004u)	/* MBIST Control Register */
#define MC65_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065104u)	/* MBIST Control Register */
#define MC66_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065204u)	/* MBIST Control Register */
#define MC67_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065304u)	/* MBIST Control Register */
#define MC68_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065404u)	/* MBIST Control Register */
#define MC69_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065504u)	/* MBIST Control Register */
#define MC6_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061604u)	/* MBIST Control Register */
#define MC70_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065604u)	/* MBIST Control Register */
#define MC71_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065704u)	/* MBIST Control Register */
#define MC72_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065804u)	/* MBIST Control Register */
#define MC73_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065904u)	/* MBIST Control Register */
#define MC74_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065a04u)	/* MBIST Control Register */
#define MC75_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065b04u)	/* MBIST Control Register */
#define MC76_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065c04u)	/* MBIST Control Register */
#define MC77_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065d04u)	/* MBIST Control Register */
#define MC78_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065e04u)	/* MBIST Control Register */
#define MC79_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0065f04u)	/* MBIST Control Register */
#define MC7_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061704u)	/* MBIST Control Register */
#define MC80_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066004u)	/* MBIST Control Register */
#define MC81_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066104u)	/* MBIST Control Register */
#define MC82_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066204u)	/* MBIST Control Register */
#define MC83_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066304u)	/* MBIST Control Register */
#define MC84_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066404u)	/* MBIST Control Register */
#define MC85_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066504u)	/* MBIST Control Register */
#define MC86_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066604u)	/* MBIST Control Register */
#define MC87_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0066704u)	/* MBIST Control Register */
#define MC8_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061804u)	/* MBIST Control Register */
#define MC9_MCONTROL	(*( MC0_MCONTROL_type *) 0xf0061904u)	/* MBIST Control Register */

