svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DONE           : 1;	/* DONE */
		/* const */ unsigned int FAIL           : 1;	/* FAIL */
		/* const */ unsigned int FAIL_COUNT     : 6;	/* FAIL_COUNT */
		/* const */ unsigned int RUPD           : 1;	/* RAR_UPDATED */
		/* const */ unsigned int MTOF           : 1;	/* MORE_THAN_ONE_FAIL */
		unsigned int FDA            : 1;	/* Fail Dump Available */
		/* const */ unsigned int Res            : 5;	/* Reserved */
	} B;
	short S;
	unsigned short US;

} MC0_MSTATUS_type;
#define MC0_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061006u)	/* Status Register */
#define MC10_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061a06u)	/* Status Register */
#define MC11_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061b06u)	/* Status Register */
#define MC12_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061c06u)	/* Status Register */
#define MC13_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061d06u)	/* Status Register */
#define MC14_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061e06u)	/* Status Register */
#define MC15_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061f06u)	/* Status Register */
#define MC16_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062006u)	/* Status Register */
#define MC17_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062106u)	/* Status Register */
#define MC18_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062206u)	/* Status Register */
#define MC19_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062306u)	/* Status Register */
#define MC1_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061106u)	/* Status Register */
#define MC20_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062406u)	/* Status Register */
#define MC21_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062506u)	/* Status Register */
#define MC22_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062606u)	/* Status Register */
#define MC23_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062706u)	/* Status Register */
#define MC24_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062806u)	/* Status Register */
#define MC25_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062906u)	/* Status Register */
#define MC26_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062a06u)	/* Status Register */
#define MC27_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062b06u)	/* Status Register */
#define MC28_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062c06u)	/* Status Register */
#define MC29_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062d06u)	/* Status Register */
#define MC2_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061206u)	/* Status Register */
#define MC30_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062e06u)	/* Status Register */
#define MC31_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0062f06u)	/* Status Register */
#define MC32_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063006u)	/* Status Register */
#define MC33_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063106u)	/* Status Register */
#define MC34_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063206u)	/* Status Register */
#define MC35_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063306u)	/* Status Register */
#define MC36_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063406u)	/* Status Register */
#define MC37_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063506u)	/* Status Register */
#define MC38_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063606u)	/* Status Register */
#define MC39_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063706u)	/* Status Register */
#define MC3_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061306u)	/* Status Register */
#define MC40_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063806u)	/* Status Register */
#define MC41_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063906u)	/* Status Register */
#define MC42_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063a06u)	/* Status Register */
#define MC43_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063b06u)	/* Status Register */
#define MC44_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063c06u)	/* Status Register */
#define MC45_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063d06u)	/* Status Register */
#define MC46_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063e06u)	/* Status Register */
#define MC47_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0063f06u)	/* Status Register */
#define MC48_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064006u)	/* Status Register */
#define MC49_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064106u)	/* Status Register */
#define MC4_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061406u)	/* Status Register */
#define MC50_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064206u)	/* Status Register */
#define MC51_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064306u)	/* Status Register */
#define MC52_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064406u)	/* Status Register */
#define MC53_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064506u)	/* Status Register */
#define MC54_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064606u)	/* Status Register */
#define MC55_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064706u)	/* Status Register */
#define MC56_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064806u)	/* Status Register */
#define MC57_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064906u)	/* Status Register */
#define MC58_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064a06u)	/* Status Register */
#define MC59_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064b06u)	/* Status Register */
#define MC5_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061506u)	/* Status Register */
#define MC60_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064c06u)	/* Status Register */
#define MC61_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064d06u)	/* Status Register */
#define MC62_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064e06u)	/* Status Register */
#define MC63_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0064f06u)	/* Status Register */
#define MC64_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065006u)	/* Status Register */
#define MC65_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065106u)	/* Status Register */
#define MC66_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065206u)	/* Status Register */
#define MC67_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065306u)	/* Status Register */
#define MC68_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065406u)	/* Status Register */
#define MC69_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065506u)	/* Status Register */
#define MC6_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061606u)	/* Status Register */
#define MC70_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065606u)	/* Status Register */
#define MC71_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065706u)	/* Status Register */
#define MC72_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065806u)	/* Status Register */
#define MC73_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065906u)	/* Status Register */
#define MC74_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065a06u)	/* Status Register */
#define MC75_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065b06u)	/* Status Register */
#define MC76_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065c06u)	/* Status Register */
#define MC77_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065d06u)	/* Status Register */
#define MC78_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065e06u)	/* Status Register */
#define MC79_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0065f06u)	/* Status Register */
#define MC7_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061706u)	/* Status Register */
#define MC80_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066006u)	/* Status Register */
#define MC81_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066106u)	/* Status Register */
#define MC82_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066206u)	/* Status Register */
#define MC83_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066306u)	/* Status Register */
#define MC84_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066406u)	/* Status Register */
#define MC85_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066506u)	/* Status Register */
#define MC86_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066606u)	/* Status Register */
#define MC87_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0066706u)	/* Status Register */
#define MC8_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061806u)	/* Status Register */
#define MC9_MSTATUS	(*( MC0_MSTATUS_type *) 0xf0061906u)	/* Status Register */

