svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 15;	/* Address */
		unsigned int RAEN           : 1;	/* Range Enable */
	} B;
	short S;
	unsigned short US;

} MC0_RANGE_type;
#define MC0_RANGE	(*( MC0_RANGE_type *) 0xf0061008u)	/* Range Register, single address mode */
#define MC10_RANGE	(*( MC0_RANGE_type *) 0xf0061a08u)	/* Range Register, single address mode */
#define MC11_RANGE	(*( MC0_RANGE_type *) 0xf0061b08u)	/* Range Register, single address mode */
#define MC12_RANGE	(*( MC0_RANGE_type *) 0xf0061c08u)	/* Range Register, single address mode */
#define MC13_RANGE	(*( MC0_RANGE_type *) 0xf0061d08u)	/* Range Register, single address mode */
#define MC14_RANGE	(*( MC0_RANGE_type *) 0xf0061e08u)	/* Range Register, single address mode */
#define MC15_RANGE	(*( MC0_RANGE_type *) 0xf0061f08u)	/* Range Register, single address mode */
#define MC16_RANGE	(*( MC0_RANGE_type *) 0xf0062008u)	/* Range Register, single address mode */
#define MC17_RANGE	(*( MC0_RANGE_type *) 0xf0062108u)	/* Range Register, single address mode */
#define MC18_RANGE	(*( MC0_RANGE_type *) 0xf0062208u)	/* Range Register, single address mode */
#define MC19_RANGE	(*( MC0_RANGE_type *) 0xf0062308u)	/* Range Register, single address mode */
#define MC1_RANGE	(*( MC0_RANGE_type *) 0xf0061108u)	/* Range Register, single address mode */
#define MC20_RANGE	(*( MC0_RANGE_type *) 0xf0062408u)	/* Range Register, single address mode */
#define MC21_RANGE	(*( MC0_RANGE_type *) 0xf0062508u)	/* Range Register, single address mode */
#define MC22_RANGE	(*( MC0_RANGE_type *) 0xf0062608u)	/* Range Register, single address mode */
#define MC23_RANGE	(*( MC0_RANGE_type *) 0xf0062708u)	/* Range Register, single address mode */
#define MC24_RANGE	(*( MC0_RANGE_type *) 0xf0062808u)	/* Range Register, single address mode */
#define MC25_RANGE	(*( MC0_RANGE_type *) 0xf0062908u)	/* Range Register, single address mode */
#define MC26_RANGE	(*( MC0_RANGE_type *) 0xf0062a08u)	/* Range Register, single address mode */
#define MC27_RANGE	(*( MC0_RANGE_type *) 0xf0062b08u)	/* Range Register, single address mode */
#define MC28_RANGE	(*( MC0_RANGE_type *) 0xf0062c08u)	/* Range Register, single address mode */
#define MC29_RANGE	(*( MC0_RANGE_type *) 0xf0062d08u)	/* Range Register, single address mode */
#define MC2_RANGE	(*( MC0_RANGE_type *) 0xf0061208u)	/* Range Register, single address mode */
#define MC30_RANGE	(*( MC0_RANGE_type *) 0xf0062e08u)	/* Range Register, single address mode */
#define MC31_RANGE	(*( MC0_RANGE_type *) 0xf0062f08u)	/* Range Register, single address mode */
#define MC32_RANGE	(*( MC0_RANGE_type *) 0xf0063008u)	/* Range Register, single address mode */
#define MC33_RANGE	(*( MC0_RANGE_type *) 0xf0063108u)	/* Range Register, single address mode */
#define MC34_RANGE	(*( MC0_RANGE_type *) 0xf0063208u)	/* Range Register, single address mode */
#define MC35_RANGE	(*( MC0_RANGE_type *) 0xf0063308u)	/* Range Register, single address mode */
#define MC36_RANGE	(*( MC0_RANGE_type *) 0xf0063408u)	/* Range Register, single address mode */
#define MC37_RANGE	(*( MC0_RANGE_type *) 0xf0063508u)	/* Range Register, single address mode */
#define MC38_RANGE	(*( MC0_RANGE_type *) 0xf0063608u)	/* Range Register, single address mode */
#define MC39_RANGE	(*( MC0_RANGE_type *) 0xf0063708u)	/* Range Register, single address mode */
#define MC3_RANGE	(*( MC0_RANGE_type *) 0xf0061308u)	/* Range Register, single address mode */
#define MC40_RANGE	(*( MC0_RANGE_type *) 0xf0063808u)	/* Range Register, single address mode */
#define MC41_RANGE	(*( MC0_RANGE_type *) 0xf0063908u)	/* Range Register, single address mode */
#define MC42_RANGE	(*( MC0_RANGE_type *) 0xf0063a08u)	/* Range Register, single address mode */
#define MC43_RANGE	(*( MC0_RANGE_type *) 0xf0063b08u)	/* Range Register, single address mode */
#define MC44_RANGE	(*( MC0_RANGE_type *) 0xf0063c08u)	/* Range Register, single address mode */
#define MC45_RANGE	(*( MC0_RANGE_type *) 0xf0063d08u)	/* Range Register, single address mode */
#define MC46_RANGE	(*( MC0_RANGE_type *) 0xf0063e08u)	/* Range Register, single address mode */
#define MC47_RANGE	(*( MC0_RANGE_type *) 0xf0063f08u)	/* Range Register, single address mode */
#define MC48_RANGE	(*( MC0_RANGE_type *) 0xf0064008u)	/* Range Register, single address mode */
#define MC49_RANGE	(*( MC0_RANGE_type *) 0xf0064108u)	/* Range Register, single address mode */
#define MC4_RANGE	(*( MC0_RANGE_type *) 0xf0061408u)	/* Range Register, single address mode */
#define MC50_RANGE	(*( MC0_RANGE_type *) 0xf0064208u)	/* Range Register, single address mode */
#define MC51_RANGE	(*( MC0_RANGE_type *) 0xf0064308u)	/* Range Register, single address mode */
#define MC52_RANGE	(*( MC0_RANGE_type *) 0xf0064408u)	/* Range Register, single address mode */
#define MC53_RANGE	(*( MC0_RANGE_type *) 0xf0064508u)	/* Range Register, single address mode */
#define MC54_RANGE	(*( MC0_RANGE_type *) 0xf0064608u)	/* Range Register, single address mode */
#define MC55_RANGE	(*( MC0_RANGE_type *) 0xf0064708u)	/* Range Register, single address mode */
#define MC56_RANGE	(*( MC0_RANGE_type *) 0xf0064808u)	/* Range Register, single address mode */
#define MC57_RANGE	(*( MC0_RANGE_type *) 0xf0064908u)	/* Range Register, single address mode */
#define MC58_RANGE	(*( MC0_RANGE_type *) 0xf0064a08u)	/* Range Register, single address mode */
#define MC59_RANGE	(*( MC0_RANGE_type *) 0xf0064b08u)	/* Range Register, single address mode */
#define MC5_RANGE	(*( MC0_RANGE_type *) 0xf0061508u)	/* Range Register, single address mode */
#define MC60_RANGE	(*( MC0_RANGE_type *) 0xf0064c08u)	/* Range Register, single address mode */
#define MC61_RANGE	(*( MC0_RANGE_type *) 0xf0064d08u)	/* Range Register, single address mode */
#define MC62_RANGE	(*( MC0_RANGE_type *) 0xf0064e08u)	/* Range Register, single address mode */
#define MC63_RANGE	(*( MC0_RANGE_type *) 0xf0064f08u)	/* Range Register, single address mode */
#define MC64_RANGE	(*( MC0_RANGE_type *) 0xf0065008u)	/* Range Register, single address mode */
#define MC65_RANGE	(*( MC0_RANGE_type *) 0xf0065108u)	/* Range Register, single address mode */
#define MC66_RANGE	(*( MC0_RANGE_type *) 0xf0065208u)	/* Range Register, single address mode */
#define MC67_RANGE	(*( MC0_RANGE_type *) 0xf0065308u)	/* Range Register, single address mode */
#define MC68_RANGE	(*( MC0_RANGE_type *) 0xf0065408u)	/* Range Register, single address mode */
#define MC69_RANGE	(*( MC0_RANGE_type *) 0xf0065508u)	/* Range Register, single address mode */
#define MC6_RANGE	(*( MC0_RANGE_type *) 0xf0061608u)	/* Range Register, single address mode */
#define MC70_RANGE	(*( MC0_RANGE_type *) 0xf0065608u)	/* Range Register, single address mode */
#define MC71_RANGE	(*( MC0_RANGE_type *) 0xf0065708u)	/* Range Register, single address mode */
#define MC72_RANGE	(*( MC0_RANGE_type *) 0xf0065808u)	/* Range Register, single address mode */
#define MC73_RANGE	(*( MC0_RANGE_type *) 0xf0065908u)	/* Range Register, single address mode */
#define MC74_RANGE	(*( MC0_RANGE_type *) 0xf0065a08u)	/* Range Register, single address mode */
#define MC75_RANGE	(*( MC0_RANGE_type *) 0xf0065b08u)	/* Range Register, single address mode */
#define MC76_RANGE	(*( MC0_RANGE_type *) 0xf0065c08u)	/* Range Register, single address mode */
#define MC77_RANGE	(*( MC0_RANGE_type *) 0xf0065d08u)	/* Range Register, single address mode */
#define MC78_RANGE	(*( MC0_RANGE_type *) 0xf0065e08u)	/* Range Register, single address mode */
#define MC79_RANGE	(*( MC0_RANGE_type *) 0xf0065f08u)	/* Range Register, single address mode */
#define MC7_RANGE	(*( MC0_RANGE_type *) 0xf0061708u)	/* Range Register, single address mode */
#define MC80_RANGE	(*( MC0_RANGE_type *) 0xf0066008u)	/* Range Register, single address mode */
#define MC81_RANGE	(*( MC0_RANGE_type *) 0xf0066108u)	/* Range Register, single address mode */
#define MC82_RANGE	(*( MC0_RANGE_type *) 0xf0066208u)	/* Range Register, single address mode */
#define MC83_RANGE	(*( MC0_RANGE_type *) 0xf0066308u)	/* Range Register, single address mode */
#define MC84_RANGE	(*( MC0_RANGE_type *) 0xf0066408u)	/* Range Register, single address mode */
#define MC85_RANGE	(*( MC0_RANGE_type *) 0xf0066508u)	/* Range Register, single address mode */
#define MC86_RANGE	(*( MC0_RANGE_type *) 0xf0066608u)	/* Range Register, single address mode */
#define MC87_RANGE	(*( MC0_RANGE_type *) 0xf0066708u)	/* Range Register, single address mode */
#define MC8_RANGE	(*( MC0_RANGE_type *) 0xf0061808u)	/* Range Register, single address mode */
#define MC9_RANGE	(*( MC0_RANGE_type *) 0xf0061908u)	/* Range Register, single address mode */

