svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int WDATA          : 16;	/* Word Data */
	} B;
	short S;
	unsigned short US;

} MC0_RDBFL0_type;
#define MC0_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00610a0u)	/* Read Data and Bit Flip Register 0 */
#define MC0_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00610a2u)	/* Read Data and Bit Flip Register 1 */
#define MC0_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00610b4u)	/* Read Data and Bit Flip Register 10 */
#define MC0_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00610b6u)	/* Read Data and Bit Flip Register 11 */
#define MC0_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00610b8u)	/* Read Data and Bit Flip Register 12 */
#define MC0_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00610bau)	/* Read Data and Bit Flip Register 13 */
#define MC0_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00610bcu)	/* Read Data and Bit Flip Register 14 */
#define MC0_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00610beu)	/* Read Data and Bit Flip Register 15 */
#define MC0_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00610c0u)	/* Read Data and Bit Flip Register 16 */
#define MC0_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00610c2u)	/* Read Data and Bit Flip Register 17 */
#define MC0_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00610c4u)	/* Read Data and Bit Flip Register 18 */
#define MC0_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00610c6u)	/* Read Data and Bit Flip Register 19 */
#define MC0_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00610a4u)	/* Read Data and Bit Flip Register 2 */
#define MC0_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00610c8u)	/* Read Data and Bit Flip Register 20 */
#define MC0_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00610cau)	/* Read Data and Bit Flip Register 21 */
#define MC0_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00610ccu)	/* Read Data and Bit Flip Register 22 */
#define MC0_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00610ceu)	/* Read Data and Bit Flip Register 23 */
#define MC0_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00610d0u)	/* Read Data and Bit Flip Register 24 */
#define MC0_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00610d2u)	/* Read Data and Bit Flip Register 25 */
#define MC0_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00610d4u)	/* Read Data and Bit Flip Register 26 */
#define MC0_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00610d6u)	/* Read Data and Bit Flip Register 27 */
#define MC0_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00610d8u)	/* Read Data and Bit Flip Register 28 */
#define MC0_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00610dau)	/* Read Data and Bit Flip Register 29 */
#define MC0_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00610a6u)	/* Read Data and Bit Flip Register 3 */
#define MC0_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00610dcu)	/* Read Data and Bit Flip Register 30 */
#define MC0_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00610deu)	/* Read Data and Bit Flip Register 31 */
#define MC0_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00610e0u)	/* Read Data and Bit Flip Register 32 */
#define MC0_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00610e2u)	/* Read Data and Bit Flip Register 33 */
#define MC0_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00610e4u)	/* Read Data and Bit Flip Register 34 */
#define MC0_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00610e6u)	/* Read Data and Bit Flip Register 35 */
#define MC0_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00610e8u)	/* Read Data and Bit Flip Register 36 */
#define MC0_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00610eau)	/* Read Data and Bit Flip Register 37 */
#define MC0_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00610ecu)	/* Read Data and Bit Flip Register 38 */
#define MC0_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00610eeu)	/* Read Data and Bit Flip Register 39 */
#define MC0_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00610a8u)	/* Read Data and Bit Flip Register 4 */
#define MC0_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00610aau)	/* Read Data and Bit Flip Register 5 */
#define MC0_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00610acu)	/* Read Data and Bit Flip Register 6 */
#define MC0_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00610aeu)	/* Read Data and Bit Flip Register 7 */
#define MC0_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00610b0u)	/* Read Data and Bit Flip Register 8 */
#define MC0_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00610b2u)	/* Read Data and Bit Flip Register 9 */
#define MC10_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0061aa0u)	/* Read Data and Bit Flip Register 0 */
#define MC10_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0061aa2u)	/* Read Data and Bit Flip Register 1 */
#define MC10_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0061ab4u)	/* Read Data and Bit Flip Register 10 */
#define MC10_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0061ab6u)	/* Read Data and Bit Flip Register 11 */
#define MC10_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0061ab8u)	/* Read Data and Bit Flip Register 12 */
#define MC10_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0061abau)	/* Read Data and Bit Flip Register 13 */
#define MC10_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0061abcu)	/* Read Data and Bit Flip Register 14 */
#define MC10_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0061abeu)	/* Read Data and Bit Flip Register 15 */
#define MC10_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0061ac0u)	/* Read Data and Bit Flip Register 16 */
#define MC10_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0061ac2u)	/* Read Data and Bit Flip Register 17 */
#define MC10_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0061ac4u)	/* Read Data and Bit Flip Register 18 */
#define MC10_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0061ac6u)	/* Read Data and Bit Flip Register 19 */
#define MC10_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0061aa4u)	/* Read Data and Bit Flip Register 2 */
#define MC10_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0061ac8u)	/* Read Data and Bit Flip Register 20 */
#define MC10_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0061acau)	/* Read Data and Bit Flip Register 21 */
#define MC10_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0061accu)	/* Read Data and Bit Flip Register 22 */
#define MC10_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0061aceu)	/* Read Data and Bit Flip Register 23 */
#define MC10_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0061ad0u)	/* Read Data and Bit Flip Register 24 */
#define MC10_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0061ad2u)	/* Read Data and Bit Flip Register 25 */
#define MC10_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0061ad4u)	/* Read Data and Bit Flip Register 26 */
#define MC10_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0061ad6u)	/* Read Data and Bit Flip Register 27 */
#define MC10_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0061ad8u)	/* Read Data and Bit Flip Register 28 */
#define MC10_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0061adau)	/* Read Data and Bit Flip Register 29 */
#define MC10_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0061aa6u)	/* Read Data and Bit Flip Register 3 */
#define MC10_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0061adcu)	/* Read Data and Bit Flip Register 30 */
#define MC10_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0061adeu)	/* Read Data and Bit Flip Register 31 */
#define MC10_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0061ae0u)	/* Read Data and Bit Flip Register 32 */
#define MC10_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0061ae2u)	/* Read Data and Bit Flip Register 33 */
#define MC10_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0061ae4u)	/* Read Data and Bit Flip Register 34 */
#define MC10_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0061ae6u)	/* Read Data and Bit Flip Register 35 */
#define MC10_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0061ae8u)	/* Read Data and Bit Flip Register 36 */
#define MC10_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0061aeau)	/* Read Data and Bit Flip Register 37 */
#define MC10_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0061aecu)	/* Read Data and Bit Flip Register 38 */
#define MC10_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0061aeeu)	/* Read Data and Bit Flip Register 39 */
#define MC10_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0061aa8u)	/* Read Data and Bit Flip Register 4 */
#define MC10_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0061aaau)	/* Read Data and Bit Flip Register 5 */
#define MC10_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0061aacu)	/* Read Data and Bit Flip Register 6 */
#define MC10_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0061aaeu)	/* Read Data and Bit Flip Register 7 */
#define MC10_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0061ab0u)	/* Read Data and Bit Flip Register 8 */
#define MC10_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0061ab2u)	/* Read Data and Bit Flip Register 9 */
#define MC11_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0061ba0u)	/* Read Data and Bit Flip Register 0 */
#define MC11_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0061ba2u)	/* Read Data and Bit Flip Register 1 */
#define MC11_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0061bb4u)	/* Read Data and Bit Flip Register 10 */
#define MC11_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0061bb6u)	/* Read Data and Bit Flip Register 11 */
#define MC11_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0061bb8u)	/* Read Data and Bit Flip Register 12 */
#define MC11_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0061bbau)	/* Read Data and Bit Flip Register 13 */
#define MC11_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0061bbcu)	/* Read Data and Bit Flip Register 14 */
#define MC11_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0061bbeu)	/* Read Data and Bit Flip Register 15 */
#define MC11_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0061bc0u)	/* Read Data and Bit Flip Register 16 */
#define MC11_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0061bc2u)	/* Read Data and Bit Flip Register 17 */
#define MC11_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0061bc4u)	/* Read Data and Bit Flip Register 18 */
#define MC11_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0061bc6u)	/* Read Data and Bit Flip Register 19 */
#define MC11_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0061ba4u)	/* Read Data and Bit Flip Register 2 */
#define MC11_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0061bc8u)	/* Read Data and Bit Flip Register 20 */
#define MC11_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0061bcau)	/* Read Data and Bit Flip Register 21 */
#define MC11_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0061bccu)	/* Read Data and Bit Flip Register 22 */
#define MC11_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0061bceu)	/* Read Data and Bit Flip Register 23 */
#define MC11_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0061bd0u)	/* Read Data and Bit Flip Register 24 */
#define MC11_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0061bd2u)	/* Read Data and Bit Flip Register 25 */
#define MC11_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0061bd4u)	/* Read Data and Bit Flip Register 26 */
#define MC11_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0061bd6u)	/* Read Data and Bit Flip Register 27 */
#define MC11_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0061bd8u)	/* Read Data and Bit Flip Register 28 */
#define MC11_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0061bdau)	/* Read Data and Bit Flip Register 29 */
#define MC11_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0061ba6u)	/* Read Data and Bit Flip Register 3 */
#define MC11_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0061bdcu)	/* Read Data and Bit Flip Register 30 */
#define MC11_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0061bdeu)	/* Read Data and Bit Flip Register 31 */
#define MC11_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0061be0u)	/* Read Data and Bit Flip Register 32 */
#define MC11_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0061be2u)	/* Read Data and Bit Flip Register 33 */
#define MC11_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0061be4u)	/* Read Data and Bit Flip Register 34 */
#define MC11_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0061be6u)	/* Read Data and Bit Flip Register 35 */
#define MC11_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0061be8u)	/* Read Data and Bit Flip Register 36 */
#define MC11_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0061beau)	/* Read Data and Bit Flip Register 37 */
#define MC11_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0061becu)	/* Read Data and Bit Flip Register 38 */
#define MC11_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0061beeu)	/* Read Data and Bit Flip Register 39 */
#define MC11_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0061ba8u)	/* Read Data and Bit Flip Register 4 */
#define MC11_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0061baau)	/* Read Data and Bit Flip Register 5 */
#define MC11_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0061bacu)	/* Read Data and Bit Flip Register 6 */
#define MC11_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0061baeu)	/* Read Data and Bit Flip Register 7 */
#define MC11_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0061bb0u)	/* Read Data and Bit Flip Register 8 */
#define MC11_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0061bb2u)	/* Read Data and Bit Flip Register 9 */
#define MC12_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0061ca0u)	/* Read Data and Bit Flip Register 0 */
#define MC12_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0061ca2u)	/* Read Data and Bit Flip Register 1 */
#define MC12_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0061cb4u)	/* Read Data and Bit Flip Register 10 */
#define MC12_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0061cb6u)	/* Read Data and Bit Flip Register 11 */
#define MC12_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0061cb8u)	/* Read Data and Bit Flip Register 12 */
#define MC12_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0061cbau)	/* Read Data and Bit Flip Register 13 */
#define MC12_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0061cbcu)	/* Read Data and Bit Flip Register 14 */
#define MC12_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0061cbeu)	/* Read Data and Bit Flip Register 15 */
#define MC12_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0061cc0u)	/* Read Data and Bit Flip Register 16 */
#define MC12_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0061cc2u)	/* Read Data and Bit Flip Register 17 */
#define MC12_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0061cc4u)	/* Read Data and Bit Flip Register 18 */
#define MC12_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0061cc6u)	/* Read Data and Bit Flip Register 19 */
#define MC12_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0061ca4u)	/* Read Data and Bit Flip Register 2 */
#define MC12_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0061cc8u)	/* Read Data and Bit Flip Register 20 */
#define MC12_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0061ccau)	/* Read Data and Bit Flip Register 21 */
#define MC12_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0061cccu)	/* Read Data and Bit Flip Register 22 */
#define MC12_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0061cceu)	/* Read Data and Bit Flip Register 23 */
#define MC12_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0061cd0u)	/* Read Data and Bit Flip Register 24 */
#define MC12_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0061cd2u)	/* Read Data and Bit Flip Register 25 */
#define MC12_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0061cd4u)	/* Read Data and Bit Flip Register 26 */
#define MC12_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0061cd6u)	/* Read Data and Bit Flip Register 27 */
#define MC12_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0061cd8u)	/* Read Data and Bit Flip Register 28 */
#define MC12_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0061cdau)	/* Read Data and Bit Flip Register 29 */
#define MC12_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0061ca6u)	/* Read Data and Bit Flip Register 3 */
#define MC12_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0061cdcu)	/* Read Data and Bit Flip Register 30 */
#define MC12_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0061cdeu)	/* Read Data and Bit Flip Register 31 */
#define MC12_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0061ce0u)	/* Read Data and Bit Flip Register 32 */
#define MC12_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0061ce2u)	/* Read Data and Bit Flip Register 33 */
#define MC12_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0061ce4u)	/* Read Data and Bit Flip Register 34 */
#define MC12_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0061ce6u)	/* Read Data and Bit Flip Register 35 */
#define MC12_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0061ce8u)	/* Read Data and Bit Flip Register 36 */
#define MC12_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0061ceau)	/* Read Data and Bit Flip Register 37 */
#define MC12_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0061cecu)	/* Read Data and Bit Flip Register 38 */
#define MC12_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0061ceeu)	/* Read Data and Bit Flip Register 39 */
#define MC12_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0061ca8u)	/* Read Data and Bit Flip Register 4 */
#define MC12_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0061caau)	/* Read Data and Bit Flip Register 5 */
#define MC12_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0061cacu)	/* Read Data and Bit Flip Register 6 */
#define MC12_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0061caeu)	/* Read Data and Bit Flip Register 7 */
#define MC12_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0061cb0u)	/* Read Data and Bit Flip Register 8 */
#define MC12_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0061cb2u)	/* Read Data and Bit Flip Register 9 */
#define MC13_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0061da0u)	/* Read Data and Bit Flip Register 0 */
#define MC13_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0061da2u)	/* Read Data and Bit Flip Register 1 */
#define MC13_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0061db4u)	/* Read Data and Bit Flip Register 10 */
#define MC13_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0061db6u)	/* Read Data and Bit Flip Register 11 */
#define MC13_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0061db8u)	/* Read Data and Bit Flip Register 12 */
#define MC13_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0061dbau)	/* Read Data and Bit Flip Register 13 */
#define MC13_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0061dbcu)	/* Read Data and Bit Flip Register 14 */
#define MC13_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0061dbeu)	/* Read Data and Bit Flip Register 15 */
#define MC13_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0061dc0u)	/* Read Data and Bit Flip Register 16 */
#define MC13_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0061dc2u)	/* Read Data and Bit Flip Register 17 */
#define MC13_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0061dc4u)	/* Read Data and Bit Flip Register 18 */
#define MC13_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0061dc6u)	/* Read Data and Bit Flip Register 19 */
#define MC13_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0061da4u)	/* Read Data and Bit Flip Register 2 */
#define MC13_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0061dc8u)	/* Read Data and Bit Flip Register 20 */
#define MC13_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0061dcau)	/* Read Data and Bit Flip Register 21 */
#define MC13_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0061dccu)	/* Read Data and Bit Flip Register 22 */
#define MC13_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0061dceu)	/* Read Data and Bit Flip Register 23 */
#define MC13_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0061dd0u)	/* Read Data and Bit Flip Register 24 */
#define MC13_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0061dd2u)	/* Read Data and Bit Flip Register 25 */
#define MC13_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0061dd4u)	/* Read Data and Bit Flip Register 26 */
#define MC13_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0061dd6u)	/* Read Data and Bit Flip Register 27 */
#define MC13_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0061dd8u)	/* Read Data and Bit Flip Register 28 */
#define MC13_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0061ddau)	/* Read Data and Bit Flip Register 29 */
#define MC13_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0061da6u)	/* Read Data and Bit Flip Register 3 */
#define MC13_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0061ddcu)	/* Read Data and Bit Flip Register 30 */
#define MC13_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0061ddeu)	/* Read Data and Bit Flip Register 31 */
#define MC13_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0061de0u)	/* Read Data and Bit Flip Register 32 */
#define MC13_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0061de2u)	/* Read Data and Bit Flip Register 33 */
#define MC13_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0061de4u)	/* Read Data and Bit Flip Register 34 */
#define MC13_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0061de6u)	/* Read Data and Bit Flip Register 35 */
#define MC13_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0061de8u)	/* Read Data and Bit Flip Register 36 */
#define MC13_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0061deau)	/* Read Data and Bit Flip Register 37 */
#define MC13_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0061decu)	/* Read Data and Bit Flip Register 38 */
#define MC13_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0061deeu)	/* Read Data and Bit Flip Register 39 */
#define MC13_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0061da8u)	/* Read Data and Bit Flip Register 4 */
#define MC13_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0061daau)	/* Read Data and Bit Flip Register 5 */
#define MC13_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0061dacu)	/* Read Data and Bit Flip Register 6 */
#define MC13_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0061daeu)	/* Read Data and Bit Flip Register 7 */
#define MC13_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0061db0u)	/* Read Data and Bit Flip Register 8 */
#define MC13_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0061db2u)	/* Read Data and Bit Flip Register 9 */
#define MC14_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0061ea0u)	/* Read Data and Bit Flip Register 0 */
#define MC14_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0061ea2u)	/* Read Data and Bit Flip Register 1 */
#define MC14_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0061eb4u)	/* Read Data and Bit Flip Register 10 */
#define MC14_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0061eb6u)	/* Read Data and Bit Flip Register 11 */
#define MC14_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0061eb8u)	/* Read Data and Bit Flip Register 12 */
#define MC14_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0061ebau)	/* Read Data and Bit Flip Register 13 */
#define MC14_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0061ebcu)	/* Read Data and Bit Flip Register 14 */
#define MC14_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0061ebeu)	/* Read Data and Bit Flip Register 15 */
#define MC14_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0061ec0u)	/* Read Data and Bit Flip Register 16 */
#define MC14_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0061ec2u)	/* Read Data and Bit Flip Register 17 */
#define MC14_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0061ec4u)	/* Read Data and Bit Flip Register 18 */
#define MC14_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0061ec6u)	/* Read Data and Bit Flip Register 19 */
#define MC14_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0061ea4u)	/* Read Data and Bit Flip Register 2 */
#define MC14_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0061ec8u)	/* Read Data and Bit Flip Register 20 */
#define MC14_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0061ecau)	/* Read Data and Bit Flip Register 21 */
#define MC14_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0061eccu)	/* Read Data and Bit Flip Register 22 */
#define MC14_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0061eceu)	/* Read Data and Bit Flip Register 23 */
#define MC14_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0061ed0u)	/* Read Data and Bit Flip Register 24 */
#define MC14_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0061ed2u)	/* Read Data and Bit Flip Register 25 */
#define MC14_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0061ed4u)	/* Read Data and Bit Flip Register 26 */
#define MC14_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0061ed6u)	/* Read Data and Bit Flip Register 27 */
#define MC14_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0061ed8u)	/* Read Data and Bit Flip Register 28 */
#define MC14_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0061edau)	/* Read Data and Bit Flip Register 29 */
#define MC14_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0061ea6u)	/* Read Data and Bit Flip Register 3 */
#define MC14_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0061edcu)	/* Read Data and Bit Flip Register 30 */
#define MC14_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0061edeu)	/* Read Data and Bit Flip Register 31 */
#define MC14_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0061ee0u)	/* Read Data and Bit Flip Register 32 */
#define MC14_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0061ee2u)	/* Read Data and Bit Flip Register 33 */
#define MC14_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0061ee4u)	/* Read Data and Bit Flip Register 34 */
#define MC14_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0061ee6u)	/* Read Data and Bit Flip Register 35 */
#define MC14_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0061ee8u)	/* Read Data and Bit Flip Register 36 */
#define MC14_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0061eeau)	/* Read Data and Bit Flip Register 37 */
#define MC14_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0061eecu)	/* Read Data and Bit Flip Register 38 */
#define MC14_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0061eeeu)	/* Read Data and Bit Flip Register 39 */
#define MC14_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0061ea8u)	/* Read Data and Bit Flip Register 4 */
#define MC14_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0061eaau)	/* Read Data and Bit Flip Register 5 */
#define MC14_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0061eacu)	/* Read Data and Bit Flip Register 6 */
#define MC14_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0061eaeu)	/* Read Data and Bit Flip Register 7 */
#define MC14_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0061eb0u)	/* Read Data and Bit Flip Register 8 */
#define MC14_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0061eb2u)	/* Read Data and Bit Flip Register 9 */
#define MC15_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0061fa0u)	/* Read Data and Bit Flip Register 0 */
#define MC15_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0061fa2u)	/* Read Data and Bit Flip Register 1 */
