svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC15_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0061fb4u)	/* Read Data and Bit Flip Register 10 */
#define MC15_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0061fb6u)	/* Read Data and Bit Flip Register 11 */
#define MC15_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0061fb8u)	/* Read Data and Bit Flip Register 12 */
#define MC15_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0061fbau)	/* Read Data and Bit Flip Register 13 */
#define MC15_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0061fbcu)	/* Read Data and Bit Flip Register 14 */
#define MC15_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0061fbeu)	/* Read Data and Bit Flip Register 15 */
#define MC15_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0061fc0u)	/* Read Data and Bit Flip Register 16 */
#define MC15_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0061fc2u)	/* Read Data and Bit Flip Register 17 */
#define MC15_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0061fc4u)	/* Read Data and Bit Flip Register 18 */
#define MC15_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0061fc6u)	/* Read Data and Bit Flip Register 19 */
#define MC15_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0061fa4u)	/* Read Data and Bit Flip Register 2 */
#define MC15_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0061fc8u)	/* Read Data and Bit Flip Register 20 */
#define MC15_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0061fcau)	/* Read Data and Bit Flip Register 21 */
#define MC15_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0061fccu)	/* Read Data and Bit Flip Register 22 */
#define MC15_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0061fceu)	/* Read Data and Bit Flip Register 23 */
#define MC15_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0061fd0u)	/* Read Data and Bit Flip Register 24 */
#define MC15_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0061fd2u)	/* Read Data and Bit Flip Register 25 */
#define MC15_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0061fd4u)	/* Read Data and Bit Flip Register 26 */
#define MC15_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0061fd6u)	/* Read Data and Bit Flip Register 27 */
#define MC15_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0061fd8u)	/* Read Data and Bit Flip Register 28 */
#define MC15_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0061fdau)	/* Read Data and Bit Flip Register 29 */
#define MC15_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0061fa6u)	/* Read Data and Bit Flip Register 3 */
#define MC15_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0061fdcu)	/* Read Data and Bit Flip Register 30 */
#define MC15_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0061fdeu)	/* Read Data and Bit Flip Register 31 */
#define MC15_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0061fe0u)	/* Read Data and Bit Flip Register 32 */
#define MC15_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0061fe2u)	/* Read Data and Bit Flip Register 33 */
#define MC15_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0061fe4u)	/* Read Data and Bit Flip Register 34 */
#define MC15_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0061fe6u)	/* Read Data and Bit Flip Register 35 */
#define MC15_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0061fe8u)	/* Read Data and Bit Flip Register 36 */
#define MC15_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0061feau)	/* Read Data and Bit Flip Register 37 */
#define MC15_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0061fecu)	/* Read Data and Bit Flip Register 38 */
#define MC15_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0061feeu)	/* Read Data and Bit Flip Register 39 */
#define MC15_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0061fa8u)	/* Read Data and Bit Flip Register 4 */
#define MC15_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0061faau)	/* Read Data and Bit Flip Register 5 */
#define MC15_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0061facu)	/* Read Data and Bit Flip Register 6 */
#define MC15_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0061faeu)	/* Read Data and Bit Flip Register 7 */
#define MC15_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0061fb0u)	/* Read Data and Bit Flip Register 8 */
#define MC15_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0061fb2u)	/* Read Data and Bit Flip Register 9 */
#define MC16_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00620a0u)	/* Read Data and Bit Flip Register 0 */
#define MC16_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00620a2u)	/* Read Data and Bit Flip Register 1 */
#define MC16_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00620b4u)	/* Read Data and Bit Flip Register 10 */
#define MC16_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00620b6u)	/* Read Data and Bit Flip Register 11 */
#define MC16_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00620b8u)	/* Read Data and Bit Flip Register 12 */
#define MC16_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00620bau)	/* Read Data and Bit Flip Register 13 */
#define MC16_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00620bcu)	/* Read Data and Bit Flip Register 14 */
#define MC16_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00620beu)	/* Read Data and Bit Flip Register 15 */
#define MC16_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00620c0u)	/* Read Data and Bit Flip Register 16 */
#define MC16_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00620c2u)	/* Read Data and Bit Flip Register 17 */
#define MC16_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00620c4u)	/* Read Data and Bit Flip Register 18 */
#define MC16_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00620c6u)	/* Read Data and Bit Flip Register 19 */
#define MC16_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00620a4u)	/* Read Data and Bit Flip Register 2 */
#define MC16_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00620c8u)	/* Read Data and Bit Flip Register 20 */
#define MC16_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00620cau)	/* Read Data and Bit Flip Register 21 */
#define MC16_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00620ccu)	/* Read Data and Bit Flip Register 22 */
#define MC16_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00620ceu)	/* Read Data and Bit Flip Register 23 */
#define MC16_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00620d0u)	/* Read Data and Bit Flip Register 24 */
#define MC16_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00620d2u)	/* Read Data and Bit Flip Register 25 */
#define MC16_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00620d4u)	/* Read Data and Bit Flip Register 26 */
#define MC16_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00620d6u)	/* Read Data and Bit Flip Register 27 */
#define MC16_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00620d8u)	/* Read Data and Bit Flip Register 28 */
#define MC16_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00620dau)	/* Read Data and Bit Flip Register 29 */
#define MC16_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00620a6u)	/* Read Data and Bit Flip Register 3 */
#define MC16_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00620dcu)	/* Read Data and Bit Flip Register 30 */
#define MC16_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00620deu)	/* Read Data and Bit Flip Register 31 */
#define MC16_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00620e0u)	/* Read Data and Bit Flip Register 32 */
#define MC16_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00620e2u)	/* Read Data and Bit Flip Register 33 */
#define MC16_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00620e4u)	/* Read Data and Bit Flip Register 34 */
#define MC16_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00620e6u)	/* Read Data and Bit Flip Register 35 */
#define MC16_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00620e8u)	/* Read Data and Bit Flip Register 36 */
#define MC16_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00620eau)	/* Read Data and Bit Flip Register 37 */
#define MC16_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00620ecu)	/* Read Data and Bit Flip Register 38 */
#define MC16_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00620eeu)	/* Read Data and Bit Flip Register 39 */
#define MC16_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00620a8u)	/* Read Data and Bit Flip Register 4 */
#define MC16_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00620aau)	/* Read Data and Bit Flip Register 5 */
#define MC16_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00620acu)	/* Read Data and Bit Flip Register 6 */
#define MC16_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00620aeu)	/* Read Data and Bit Flip Register 7 */
#define MC16_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00620b0u)	/* Read Data and Bit Flip Register 8 */
#define MC16_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00620b2u)	/* Read Data and Bit Flip Register 9 */
#define MC17_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00621a0u)	/* Read Data and Bit Flip Register 0 */
#define MC17_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00621a2u)	/* Read Data and Bit Flip Register 1 */
#define MC17_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00621b4u)	/* Read Data and Bit Flip Register 10 */
#define MC17_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00621b6u)	/* Read Data and Bit Flip Register 11 */
#define MC17_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00621b8u)	/* Read Data and Bit Flip Register 12 */
#define MC17_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00621bau)	/* Read Data and Bit Flip Register 13 */
#define MC17_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00621bcu)	/* Read Data and Bit Flip Register 14 */
#define MC17_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00621beu)	/* Read Data and Bit Flip Register 15 */
#define MC17_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00621c0u)	/* Read Data and Bit Flip Register 16 */
#define MC17_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00621c2u)	/* Read Data and Bit Flip Register 17 */
#define MC17_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00621c4u)	/* Read Data and Bit Flip Register 18 */
#define MC17_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00621c6u)	/* Read Data and Bit Flip Register 19 */
#define MC17_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00621a4u)	/* Read Data and Bit Flip Register 2 */
#define MC17_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00621c8u)	/* Read Data and Bit Flip Register 20 */
#define MC17_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00621cau)	/* Read Data and Bit Flip Register 21 */
#define MC17_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00621ccu)	/* Read Data and Bit Flip Register 22 */
#define MC17_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00621ceu)	/* Read Data and Bit Flip Register 23 */
#define MC17_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00621d0u)	/* Read Data and Bit Flip Register 24 */
#define MC17_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00621d2u)	/* Read Data and Bit Flip Register 25 */
#define MC17_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00621d4u)	/* Read Data and Bit Flip Register 26 */
#define MC17_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00621d6u)	/* Read Data and Bit Flip Register 27 */
#define MC17_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00621d8u)	/* Read Data and Bit Flip Register 28 */
#define MC17_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00621dau)	/* Read Data and Bit Flip Register 29 */
#define MC17_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00621a6u)	/* Read Data and Bit Flip Register 3 */
#define MC17_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00621dcu)	/* Read Data and Bit Flip Register 30 */
#define MC17_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00621deu)	/* Read Data and Bit Flip Register 31 */
#define MC17_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00621e0u)	/* Read Data and Bit Flip Register 32 */
#define MC17_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00621e2u)	/* Read Data and Bit Flip Register 33 */
#define MC17_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00621e4u)	/* Read Data and Bit Flip Register 34 */
#define MC17_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00621e6u)	/* Read Data and Bit Flip Register 35 */
#define MC17_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00621e8u)	/* Read Data and Bit Flip Register 36 */
#define MC17_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00621eau)	/* Read Data and Bit Flip Register 37 */
#define MC17_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00621ecu)	/* Read Data and Bit Flip Register 38 */
#define MC17_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00621eeu)	/* Read Data and Bit Flip Register 39 */
#define MC17_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00621a8u)	/* Read Data and Bit Flip Register 4 */
#define MC17_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00621aau)	/* Read Data and Bit Flip Register 5 */
#define MC17_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00621acu)	/* Read Data and Bit Flip Register 6 */
#define MC17_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00621aeu)	/* Read Data and Bit Flip Register 7 */
#define MC17_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00621b0u)	/* Read Data and Bit Flip Register 8 */
#define MC17_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00621b2u)	/* Read Data and Bit Flip Register 9 */
#define MC18_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00622a0u)	/* Read Data and Bit Flip Register 0 */
#define MC18_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00622a2u)	/* Read Data and Bit Flip Register 1 */
#define MC18_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00622b4u)	/* Read Data and Bit Flip Register 10 */
#define MC18_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00622b6u)	/* Read Data and Bit Flip Register 11 */
#define MC18_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00622b8u)	/* Read Data and Bit Flip Register 12 */
#define MC18_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00622bau)	/* Read Data and Bit Flip Register 13 */
#define MC18_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00622bcu)	/* Read Data and Bit Flip Register 14 */
#define MC18_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00622beu)	/* Read Data and Bit Flip Register 15 */
#define MC18_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00622c0u)	/* Read Data and Bit Flip Register 16 */
#define MC18_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00622c2u)	/* Read Data and Bit Flip Register 17 */
#define MC18_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00622c4u)	/* Read Data and Bit Flip Register 18 */
#define MC18_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00622c6u)	/* Read Data and Bit Flip Register 19 */
#define MC18_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00622a4u)	/* Read Data and Bit Flip Register 2 */
#define MC18_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00622c8u)	/* Read Data and Bit Flip Register 20 */
#define MC18_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00622cau)	/* Read Data and Bit Flip Register 21 */
#define MC18_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00622ccu)	/* Read Data and Bit Flip Register 22 */
#define MC18_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00622ceu)	/* Read Data and Bit Flip Register 23 */
#define MC18_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00622d0u)	/* Read Data and Bit Flip Register 24 */
#define MC18_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00622d2u)	/* Read Data and Bit Flip Register 25 */
#define MC18_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00622d4u)	/* Read Data and Bit Flip Register 26 */
#define MC18_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00622d6u)	/* Read Data and Bit Flip Register 27 */
#define MC18_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00622d8u)	/* Read Data and Bit Flip Register 28 */
#define MC18_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00622dau)	/* Read Data and Bit Flip Register 29 */
#define MC18_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00622a6u)	/* Read Data and Bit Flip Register 3 */
#define MC18_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00622dcu)	/* Read Data and Bit Flip Register 30 */
#define MC18_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00622deu)	/* Read Data and Bit Flip Register 31 */
#define MC18_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00622e0u)	/* Read Data and Bit Flip Register 32 */
#define MC18_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00622e2u)	/* Read Data and Bit Flip Register 33 */
#define MC18_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00622e4u)	/* Read Data and Bit Flip Register 34 */
#define MC18_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00622e6u)	/* Read Data and Bit Flip Register 35 */
#define MC18_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00622e8u)	/* Read Data and Bit Flip Register 36 */
#define MC18_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00622eau)	/* Read Data and Bit Flip Register 37 */
#define MC18_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00622ecu)	/* Read Data and Bit Flip Register 38 */
#define MC18_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00622eeu)	/* Read Data and Bit Flip Register 39 */
#define MC18_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00622a8u)	/* Read Data and Bit Flip Register 4 */
#define MC18_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00622aau)	/* Read Data and Bit Flip Register 5 */
#define MC18_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00622acu)	/* Read Data and Bit Flip Register 6 */
#define MC18_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00622aeu)	/* Read Data and Bit Flip Register 7 */
#define MC18_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00622b0u)	/* Read Data and Bit Flip Register 8 */
#define MC18_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00622b2u)	/* Read Data and Bit Flip Register 9 */
#define MC19_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00623a0u)	/* Read Data and Bit Flip Register 0 */
#define MC19_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00623a2u)	/* Read Data and Bit Flip Register 1 */
#define MC19_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00623b4u)	/* Read Data and Bit Flip Register 10 */
#define MC19_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00623b6u)	/* Read Data and Bit Flip Register 11 */
#define MC19_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00623b8u)	/* Read Data and Bit Flip Register 12 */
#define MC19_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00623bau)	/* Read Data and Bit Flip Register 13 */
#define MC19_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00623bcu)	/* Read Data and Bit Flip Register 14 */
#define MC19_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00623beu)	/* Read Data and Bit Flip Register 15 */
#define MC19_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00623c0u)	/* Read Data and Bit Flip Register 16 */
#define MC19_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00623c2u)	/* Read Data and Bit Flip Register 17 */
#define MC19_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00623c4u)	/* Read Data and Bit Flip Register 18 */
#define MC19_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00623c6u)	/* Read Data and Bit Flip Register 19 */
#define MC19_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00623a4u)	/* Read Data and Bit Flip Register 2 */
#define MC19_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00623c8u)	/* Read Data and Bit Flip Register 20 */
#define MC19_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00623cau)	/* Read Data and Bit Flip Register 21 */
#define MC19_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00623ccu)	/* Read Data and Bit Flip Register 22 */
#define MC19_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00623ceu)	/* Read Data and Bit Flip Register 23 */
#define MC19_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00623d0u)	/* Read Data and Bit Flip Register 24 */
#define MC19_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00623d2u)	/* Read Data and Bit Flip Register 25 */
#define MC19_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00623d4u)	/* Read Data and Bit Flip Register 26 */
#define MC19_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00623d6u)	/* Read Data and Bit Flip Register 27 */
#define MC19_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00623d8u)	/* Read Data and Bit Flip Register 28 */
#define MC19_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00623dau)	/* Read Data and Bit Flip Register 29 */
#define MC19_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00623a6u)	/* Read Data and Bit Flip Register 3 */
#define MC19_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00623dcu)	/* Read Data and Bit Flip Register 30 */
#define MC19_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00623deu)	/* Read Data and Bit Flip Register 31 */
#define MC19_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00623e0u)	/* Read Data and Bit Flip Register 32 */
#define MC19_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00623e2u)	/* Read Data and Bit Flip Register 33 */
#define MC19_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00623e4u)	/* Read Data and Bit Flip Register 34 */
#define MC19_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00623e6u)	/* Read Data and Bit Flip Register 35 */
#define MC19_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00623e8u)	/* Read Data and Bit Flip Register 36 */
#define MC19_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00623eau)	/* Read Data and Bit Flip Register 37 */
#define MC19_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00623ecu)	/* Read Data and Bit Flip Register 38 */
#define MC19_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00623eeu)	/* Read Data and Bit Flip Register 39 */
#define MC19_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00623a8u)	/* Read Data and Bit Flip Register 4 */
#define MC19_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00623aau)	/* Read Data and Bit Flip Register 5 */
#define MC19_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00623acu)	/* Read Data and Bit Flip Register 6 */
#define MC19_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00623aeu)	/* Read Data and Bit Flip Register 7 */
#define MC19_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00623b0u)	/* Read Data and Bit Flip Register 8 */
#define MC19_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00623b2u)	/* Read Data and Bit Flip Register 9 */
#define MC1_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00611a0u)	/* Read Data and Bit Flip Register 0 */
#define MC1_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00611a2u)	/* Read Data and Bit Flip Register 1 */
#define MC1_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00611b4u)	/* Read Data and Bit Flip Register 10 */
#define MC1_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00611b6u)	/* Read Data and Bit Flip Register 11 */
#define MC1_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00611b8u)	/* Read Data and Bit Flip Register 12 */
#define MC1_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00611bau)	/* Read Data and Bit Flip Register 13 */
#define MC1_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00611bcu)	/* Read Data and Bit Flip Register 14 */
#define MC1_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00611beu)	/* Read Data and Bit Flip Register 15 */
#define MC1_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00611c0u)	/* Read Data and Bit Flip Register 16 */
#define MC1_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00611c2u)	/* Read Data and Bit Flip Register 17 */
#define MC1_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00611c4u)	/* Read Data and Bit Flip Register 18 */
#define MC1_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00611c6u)	/* Read Data and Bit Flip Register 19 */
#define MC1_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00611a4u)	/* Read Data and Bit Flip Register 2 */
#define MC1_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00611c8u)	/* Read Data and Bit Flip Register 20 */
#define MC1_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00611cau)	/* Read Data and Bit Flip Register 21 */
#define MC1_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00611ccu)	/* Read Data and Bit Flip Register 22 */
#define MC1_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00611ceu)	/* Read Data and Bit Flip Register 23 */
#define MC1_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00611d0u)	/* Read Data and Bit Flip Register 24 */
#define MC1_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00611d2u)	/* Read Data and Bit Flip Register 25 */
#define MC1_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00611d4u)	/* Read Data and Bit Flip Register 26 */
#define MC1_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00611d6u)	/* Read Data and Bit Flip Register 27 */
#define MC1_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00611d8u)	/* Read Data and Bit Flip Register 28 */
#define MC1_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00611dau)	/* Read Data and Bit Flip Register 29 */
#define MC1_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00611a6u)	/* Read Data and Bit Flip Register 3 */
#define MC1_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00611dcu)	/* Read Data and Bit Flip Register 30 */
#define MC1_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00611deu)	/* Read Data and Bit Flip Register 31 */
#define MC1_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00611e0u)	/* Read Data and Bit Flip Register 32 */
#define MC1_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00611e2u)	/* Read Data and Bit Flip Register 33 */
#define MC1_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00611e4u)	/* Read Data and Bit Flip Register 34 */
#define MC1_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00611e6u)	/* Read Data and Bit Flip Register 35 */
#define MC1_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00611e8u)	/* Read Data and Bit Flip Register 36 */
#define MC1_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00611eau)	/* Read Data and Bit Flip Register 37 */
#define MC1_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00611ecu)	/* Read Data and Bit Flip Register 38 */
#define MC1_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00611eeu)	/* Read Data and Bit Flip Register 39 */
#define MC1_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00611a8u)	/* Read Data and Bit Flip Register 4 */
#define MC1_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00611aau)	/* Read Data and Bit Flip Register 5 */
#define MC1_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00611acu)	/* Read Data and Bit Flip Register 6 */
#define MC1_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00611aeu)	/* Read Data and Bit Flip Register 7 */
#define MC1_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00611b0u)	/* Read Data and Bit Flip Register 8 */
#define MC1_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00611b2u)	/* Read Data and Bit Flip Register 9 */
#define MC20_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00624a0u)	/* Read Data and Bit Flip Register 0 */
#define MC20_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00624a2u)	/* Read Data and Bit Flip Register 1 */
#define MC20_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00624b4u)	/* Read Data and Bit Flip Register 10 */
#define MC20_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00624b6u)	/* Read Data and Bit Flip Register 11 */
#define MC20_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00624b8u)	/* Read Data and Bit Flip Register 12 */
#define MC20_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00624bau)	/* Read Data and Bit Flip Register 13 */
