svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC20_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00624bcu)	/* Read Data and Bit Flip Register 14 */
#define MC20_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00624beu)	/* Read Data and Bit Flip Register 15 */
#define MC20_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00624c0u)	/* Read Data and Bit Flip Register 16 */
#define MC20_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00624c2u)	/* Read Data and Bit Flip Register 17 */
#define MC20_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00624c4u)	/* Read Data and Bit Flip Register 18 */
#define MC20_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00624c6u)	/* Read Data and Bit Flip Register 19 */
#define MC20_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00624a4u)	/* Read Data and Bit Flip Register 2 */
#define MC20_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00624c8u)	/* Read Data and Bit Flip Register 20 */
#define MC20_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00624cau)	/* Read Data and Bit Flip Register 21 */
#define MC20_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00624ccu)	/* Read Data and Bit Flip Register 22 */
#define MC20_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00624ceu)	/* Read Data and Bit Flip Register 23 */
#define MC20_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00624d0u)	/* Read Data and Bit Flip Register 24 */
#define MC20_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00624d2u)	/* Read Data and Bit Flip Register 25 */
#define MC20_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00624d4u)	/* Read Data and Bit Flip Register 26 */
#define MC20_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00624d6u)	/* Read Data and Bit Flip Register 27 */
#define MC20_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00624d8u)	/* Read Data and Bit Flip Register 28 */
#define MC20_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00624dau)	/* Read Data and Bit Flip Register 29 */
#define MC20_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00624a6u)	/* Read Data and Bit Flip Register 3 */
#define MC20_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00624dcu)	/* Read Data and Bit Flip Register 30 */
#define MC20_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00624deu)	/* Read Data and Bit Flip Register 31 */
#define MC20_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00624e0u)	/* Read Data and Bit Flip Register 32 */
#define MC20_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00624e2u)	/* Read Data and Bit Flip Register 33 */
#define MC20_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00624e4u)	/* Read Data and Bit Flip Register 34 */
#define MC20_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00624e6u)	/* Read Data and Bit Flip Register 35 */
#define MC20_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00624e8u)	/* Read Data and Bit Flip Register 36 */
#define MC20_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00624eau)	/* Read Data and Bit Flip Register 37 */
#define MC20_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00624ecu)	/* Read Data and Bit Flip Register 38 */
#define MC20_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00624eeu)	/* Read Data and Bit Flip Register 39 */
#define MC20_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00624a8u)	/* Read Data and Bit Flip Register 4 */
#define MC20_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00624aau)	/* Read Data and Bit Flip Register 5 */
#define MC20_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00624acu)	/* Read Data and Bit Flip Register 6 */
#define MC20_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00624aeu)	/* Read Data and Bit Flip Register 7 */
#define MC20_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00624b0u)	/* Read Data and Bit Flip Register 8 */
#define MC20_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00624b2u)	/* Read Data and Bit Flip Register 9 */
#define MC21_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00625a0u)	/* Read Data and Bit Flip Register 0 */
#define MC21_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00625a2u)	/* Read Data and Bit Flip Register 1 */
#define MC21_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00625b4u)	/* Read Data and Bit Flip Register 10 */
#define MC21_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00625b6u)	/* Read Data and Bit Flip Register 11 */
#define MC21_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00625b8u)	/* Read Data and Bit Flip Register 12 */
#define MC21_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00625bau)	/* Read Data and Bit Flip Register 13 */
#define MC21_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00625bcu)	/* Read Data and Bit Flip Register 14 */
#define MC21_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00625beu)	/* Read Data and Bit Flip Register 15 */
#define MC21_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00625c0u)	/* Read Data and Bit Flip Register 16 */
#define MC21_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00625c2u)	/* Read Data and Bit Flip Register 17 */
#define MC21_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00625c4u)	/* Read Data and Bit Flip Register 18 */
#define MC21_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00625c6u)	/* Read Data and Bit Flip Register 19 */
#define MC21_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00625a4u)	/* Read Data and Bit Flip Register 2 */
#define MC21_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00625c8u)	/* Read Data and Bit Flip Register 20 */
#define MC21_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00625cau)	/* Read Data and Bit Flip Register 21 */
#define MC21_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00625ccu)	/* Read Data and Bit Flip Register 22 */
#define MC21_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00625ceu)	/* Read Data and Bit Flip Register 23 */
#define MC21_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00625d0u)	/* Read Data and Bit Flip Register 24 */
#define MC21_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00625d2u)	/* Read Data and Bit Flip Register 25 */
#define MC21_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00625d4u)	/* Read Data and Bit Flip Register 26 */
#define MC21_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00625d6u)	/* Read Data and Bit Flip Register 27 */
#define MC21_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00625d8u)	/* Read Data and Bit Flip Register 28 */
#define MC21_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00625dau)	/* Read Data and Bit Flip Register 29 */
#define MC21_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00625a6u)	/* Read Data and Bit Flip Register 3 */
#define MC21_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00625dcu)	/* Read Data and Bit Flip Register 30 */
#define MC21_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00625deu)	/* Read Data and Bit Flip Register 31 */
#define MC21_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00625e0u)	/* Read Data and Bit Flip Register 32 */
#define MC21_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00625e2u)	/* Read Data and Bit Flip Register 33 */
#define MC21_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00625e4u)	/* Read Data and Bit Flip Register 34 */
#define MC21_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00625e6u)	/* Read Data and Bit Flip Register 35 */
#define MC21_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00625e8u)	/* Read Data and Bit Flip Register 36 */
#define MC21_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00625eau)	/* Read Data and Bit Flip Register 37 */
#define MC21_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00625ecu)	/* Read Data and Bit Flip Register 38 */
#define MC21_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00625eeu)	/* Read Data and Bit Flip Register 39 */
#define MC21_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00625a8u)	/* Read Data and Bit Flip Register 4 */
#define MC21_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00625aau)	/* Read Data and Bit Flip Register 5 */
#define MC21_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00625acu)	/* Read Data and Bit Flip Register 6 */
#define MC21_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00625aeu)	/* Read Data and Bit Flip Register 7 */
#define MC21_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00625b0u)	/* Read Data and Bit Flip Register 8 */
#define MC21_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00625b2u)	/* Read Data and Bit Flip Register 9 */
#define MC22_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00626a0u)	/* Read Data and Bit Flip Register 0 */
#define MC22_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00626a2u)	/* Read Data and Bit Flip Register 1 */
#define MC22_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00626b4u)	/* Read Data and Bit Flip Register 10 */
#define MC22_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00626b6u)	/* Read Data and Bit Flip Register 11 */
#define MC22_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00626b8u)	/* Read Data and Bit Flip Register 12 */
#define MC22_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00626bau)	/* Read Data and Bit Flip Register 13 */
#define MC22_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00626bcu)	/* Read Data and Bit Flip Register 14 */
#define MC22_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00626beu)	/* Read Data and Bit Flip Register 15 */
#define MC22_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00626c0u)	/* Read Data and Bit Flip Register 16 */
#define MC22_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00626c2u)	/* Read Data and Bit Flip Register 17 */
#define MC22_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00626c4u)	/* Read Data and Bit Flip Register 18 */
#define MC22_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00626c6u)	/* Read Data and Bit Flip Register 19 */
#define MC22_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00626a4u)	/* Read Data and Bit Flip Register 2 */
#define MC22_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00626c8u)	/* Read Data and Bit Flip Register 20 */
#define MC22_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00626cau)	/* Read Data and Bit Flip Register 21 */
#define MC22_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00626ccu)	/* Read Data and Bit Flip Register 22 */
#define MC22_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00626ceu)	/* Read Data and Bit Flip Register 23 */
#define MC22_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00626d0u)	/* Read Data and Bit Flip Register 24 */
#define MC22_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00626d2u)	/* Read Data and Bit Flip Register 25 */
#define MC22_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00626d4u)	/* Read Data and Bit Flip Register 26 */
#define MC22_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00626d6u)	/* Read Data and Bit Flip Register 27 */
#define MC22_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00626d8u)	/* Read Data and Bit Flip Register 28 */
#define MC22_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00626dau)	/* Read Data and Bit Flip Register 29 */
#define MC22_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00626a6u)	/* Read Data and Bit Flip Register 3 */
#define MC22_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00626dcu)	/* Read Data and Bit Flip Register 30 */
#define MC22_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00626deu)	/* Read Data and Bit Flip Register 31 */
#define MC22_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00626e0u)	/* Read Data and Bit Flip Register 32 */
#define MC22_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00626e2u)	/* Read Data and Bit Flip Register 33 */
#define MC22_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00626e4u)	/* Read Data and Bit Flip Register 34 */
#define MC22_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00626e6u)	/* Read Data and Bit Flip Register 35 */
#define MC22_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00626e8u)	/* Read Data and Bit Flip Register 36 */
#define MC22_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00626eau)	/* Read Data and Bit Flip Register 37 */
#define MC22_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00626ecu)	/* Read Data and Bit Flip Register 38 */
#define MC22_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00626eeu)	/* Read Data and Bit Flip Register 39 */
#define MC22_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00626a8u)	/* Read Data and Bit Flip Register 4 */
#define MC22_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00626aau)	/* Read Data and Bit Flip Register 5 */
#define MC22_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00626acu)	/* Read Data and Bit Flip Register 6 */
#define MC22_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00626aeu)	/* Read Data and Bit Flip Register 7 */
#define MC22_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00626b0u)	/* Read Data and Bit Flip Register 8 */
#define MC22_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00626b2u)	/* Read Data and Bit Flip Register 9 */
#define MC23_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00627a0u)	/* Read Data and Bit Flip Register 0 */
#define MC23_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00627a2u)	/* Read Data and Bit Flip Register 1 */
#define MC23_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00627b4u)	/* Read Data and Bit Flip Register 10 */
#define MC23_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00627b6u)	/* Read Data and Bit Flip Register 11 */
#define MC23_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00627b8u)	/* Read Data and Bit Flip Register 12 */
#define MC23_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00627bau)	/* Read Data and Bit Flip Register 13 */
#define MC23_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00627bcu)	/* Read Data and Bit Flip Register 14 */
#define MC23_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00627beu)	/* Read Data and Bit Flip Register 15 */
#define MC23_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00627c0u)	/* Read Data and Bit Flip Register 16 */
#define MC23_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00627c2u)	/* Read Data and Bit Flip Register 17 */
#define MC23_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00627c4u)	/* Read Data and Bit Flip Register 18 */
#define MC23_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00627c6u)	/* Read Data and Bit Flip Register 19 */
#define MC23_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00627a4u)	/* Read Data and Bit Flip Register 2 */
#define MC23_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00627c8u)	/* Read Data and Bit Flip Register 20 */
#define MC23_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00627cau)	/* Read Data and Bit Flip Register 21 */
#define MC23_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00627ccu)	/* Read Data and Bit Flip Register 22 */
#define MC23_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00627ceu)	/* Read Data and Bit Flip Register 23 */
#define MC23_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00627d0u)	/* Read Data and Bit Flip Register 24 */
#define MC23_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00627d2u)	/* Read Data and Bit Flip Register 25 */
#define MC23_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00627d4u)	/* Read Data and Bit Flip Register 26 */
#define MC23_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00627d6u)	/* Read Data and Bit Flip Register 27 */
#define MC23_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00627d8u)	/* Read Data and Bit Flip Register 28 */
#define MC23_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00627dau)	/* Read Data and Bit Flip Register 29 */
#define MC23_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00627a6u)	/* Read Data and Bit Flip Register 3 */
#define MC23_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00627dcu)	/* Read Data and Bit Flip Register 30 */
#define MC23_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00627deu)	/* Read Data and Bit Flip Register 31 */
#define MC23_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00627e0u)	/* Read Data and Bit Flip Register 32 */
#define MC23_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00627e2u)	/* Read Data and Bit Flip Register 33 */
#define MC23_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00627e4u)	/* Read Data and Bit Flip Register 34 */
#define MC23_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00627e6u)	/* Read Data and Bit Flip Register 35 */
#define MC23_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00627e8u)	/* Read Data and Bit Flip Register 36 */
#define MC23_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00627eau)	/* Read Data and Bit Flip Register 37 */
#define MC23_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00627ecu)	/* Read Data and Bit Flip Register 38 */
#define MC23_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00627eeu)	/* Read Data and Bit Flip Register 39 */
#define MC23_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00627a8u)	/* Read Data and Bit Flip Register 4 */
#define MC23_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00627aau)	/* Read Data and Bit Flip Register 5 */
#define MC23_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00627acu)	/* Read Data and Bit Flip Register 6 */
#define MC23_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00627aeu)	/* Read Data and Bit Flip Register 7 */
#define MC23_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00627b0u)	/* Read Data and Bit Flip Register 8 */
#define MC23_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00627b2u)	/* Read Data and Bit Flip Register 9 */
#define MC24_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00628a0u)	/* Read Data and Bit Flip Register 0 */
#define MC24_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00628a2u)	/* Read Data and Bit Flip Register 1 */
#define MC24_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00628b4u)	/* Read Data and Bit Flip Register 10 */
#define MC24_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00628b6u)	/* Read Data and Bit Flip Register 11 */
#define MC24_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00628b8u)	/* Read Data and Bit Flip Register 12 */
#define MC24_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00628bau)	/* Read Data and Bit Flip Register 13 */
#define MC24_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00628bcu)	/* Read Data and Bit Flip Register 14 */
#define MC24_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00628beu)	/* Read Data and Bit Flip Register 15 */
#define MC24_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00628c0u)	/* Read Data and Bit Flip Register 16 */
#define MC24_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00628c2u)	/* Read Data and Bit Flip Register 17 */
#define MC24_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00628c4u)	/* Read Data and Bit Flip Register 18 */
#define MC24_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00628c6u)	/* Read Data and Bit Flip Register 19 */
#define MC24_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00628a4u)	/* Read Data and Bit Flip Register 2 */
#define MC24_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00628c8u)	/* Read Data and Bit Flip Register 20 */
#define MC24_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00628cau)	/* Read Data and Bit Flip Register 21 */
#define MC24_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00628ccu)	/* Read Data and Bit Flip Register 22 */
#define MC24_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00628ceu)	/* Read Data and Bit Flip Register 23 */
#define MC24_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00628d0u)	/* Read Data and Bit Flip Register 24 */
#define MC24_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00628d2u)	/* Read Data and Bit Flip Register 25 */
#define MC24_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00628d4u)	/* Read Data and Bit Flip Register 26 */
#define MC24_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00628d6u)	/* Read Data and Bit Flip Register 27 */
#define MC24_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00628d8u)	/* Read Data and Bit Flip Register 28 */
#define MC24_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00628dau)	/* Read Data and Bit Flip Register 29 */
#define MC24_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00628a6u)	/* Read Data and Bit Flip Register 3 */
#define MC24_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00628dcu)	/* Read Data and Bit Flip Register 30 */
#define MC24_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00628deu)	/* Read Data and Bit Flip Register 31 */
#define MC24_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00628e0u)	/* Read Data and Bit Flip Register 32 */
#define MC24_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00628e2u)	/* Read Data and Bit Flip Register 33 */
#define MC24_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00628e4u)	/* Read Data and Bit Flip Register 34 */
#define MC24_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00628e6u)	/* Read Data and Bit Flip Register 35 */
#define MC24_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00628e8u)	/* Read Data and Bit Flip Register 36 */
#define MC24_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00628eau)	/* Read Data and Bit Flip Register 37 */
#define MC24_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00628ecu)	/* Read Data and Bit Flip Register 38 */
#define MC24_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00628eeu)	/* Read Data and Bit Flip Register 39 */
#define MC24_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00628a8u)	/* Read Data and Bit Flip Register 4 */
#define MC24_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00628aau)	/* Read Data and Bit Flip Register 5 */
#define MC24_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00628acu)	/* Read Data and Bit Flip Register 6 */
#define MC24_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00628aeu)	/* Read Data and Bit Flip Register 7 */
#define MC24_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00628b0u)	/* Read Data and Bit Flip Register 8 */
#define MC24_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00628b2u)	/* Read Data and Bit Flip Register 9 */
#define MC25_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00629a0u)	/* Read Data and Bit Flip Register 0 */
#define MC25_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00629a2u)	/* Read Data and Bit Flip Register 1 */
#define MC25_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00629b4u)	/* Read Data and Bit Flip Register 10 */
#define MC25_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00629b6u)	/* Read Data and Bit Flip Register 11 */
#define MC25_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00629b8u)	/* Read Data and Bit Flip Register 12 */
#define MC25_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00629bau)	/* Read Data and Bit Flip Register 13 */
#define MC25_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00629bcu)	/* Read Data and Bit Flip Register 14 */
#define MC25_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00629beu)	/* Read Data and Bit Flip Register 15 */
#define MC25_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00629c0u)	/* Read Data and Bit Flip Register 16 */
#define MC25_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00629c2u)	/* Read Data and Bit Flip Register 17 */
#define MC25_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00629c4u)	/* Read Data and Bit Flip Register 18 */
#define MC25_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00629c6u)	/* Read Data and Bit Flip Register 19 */
#define MC25_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00629a4u)	/* Read Data and Bit Flip Register 2 */
#define MC25_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00629c8u)	/* Read Data and Bit Flip Register 20 */
#define MC25_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00629cau)	/* Read Data and Bit Flip Register 21 */
#define MC25_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00629ccu)	/* Read Data and Bit Flip Register 22 */
#define MC25_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00629ceu)	/* Read Data and Bit Flip Register 23 */
#define MC25_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00629d0u)	/* Read Data and Bit Flip Register 24 */
#define MC25_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00629d2u)	/* Read Data and Bit Flip Register 25 */
#define MC25_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00629d4u)	/* Read Data and Bit Flip Register 26 */
#define MC25_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00629d6u)	/* Read Data and Bit Flip Register 27 */
#define MC25_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00629d8u)	/* Read Data and Bit Flip Register 28 */
#define MC25_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00629dau)	/* Read Data and Bit Flip Register 29 */
#define MC25_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00629a6u)	/* Read Data and Bit Flip Register 3 */
#define MC25_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00629dcu)	/* Read Data and Bit Flip Register 30 */
#define MC25_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00629deu)	/* Read Data and Bit Flip Register 31 */
#define MC25_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00629e0u)	/* Read Data and Bit Flip Register 32 */
#define MC25_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00629e2u)	/* Read Data and Bit Flip Register 33 */
#define MC25_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00629e4u)	/* Read Data and Bit Flip Register 34 */
#define MC25_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00629e6u)	/* Read Data and Bit Flip Register 35 */
#define MC25_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00629e8u)	/* Read Data and Bit Flip Register 36 */
#define MC25_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00629eau)	/* Read Data and Bit Flip Register 37 */
#define MC25_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00629ecu)	/* Read Data and Bit Flip Register 38 */
#define MC25_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00629eeu)	/* Read Data and Bit Flip Register 39 */
#define MC25_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00629a8u)	/* Read Data and Bit Flip Register 4 */
#define MC25_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00629aau)	/* Read Data and Bit Flip Register 5 */
#define MC25_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00629acu)	/* Read Data and Bit Flip Register 6 */
#define MC25_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00629aeu)	/* Read Data and Bit Flip Register 7 */
#define MC25_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00629b0u)	/* Read Data and Bit Flip Register 8 */
#define MC25_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00629b2u)	/* Read Data and Bit Flip Register 9 */
#define MC26_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0062aa0u)	/* Read Data and Bit Flip Register 0 */
#define MC26_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0062aa2u)	/* Read Data and Bit Flip Register 1 */
#define MC26_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0062ab4u)	/* Read Data and Bit Flip Register 10 */
#define MC26_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0062ab6u)	/* Read Data and Bit Flip Register 11 */
#define MC26_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0062ab8u)	/* Read Data and Bit Flip Register 12 */
#define MC26_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0062abau)	/* Read Data and Bit Flip Register 13 */
#define MC26_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0062abcu)	/* Read Data and Bit Flip Register 14 */
#define MC26_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0062abeu)	/* Read Data and Bit Flip Register 15 */
#define MC26_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0062ac0u)	/* Read Data and Bit Flip Register 16 */
