svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC26_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0062ac2u)	/* Read Data and Bit Flip Register 17 */
#define MC26_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0062ac4u)	/* Read Data and Bit Flip Register 18 */
#define MC26_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0062ac6u)	/* Read Data and Bit Flip Register 19 */
#define MC26_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0062aa4u)	/* Read Data and Bit Flip Register 2 */
#define MC26_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0062ac8u)	/* Read Data and Bit Flip Register 20 */
#define MC26_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0062acau)	/* Read Data and Bit Flip Register 21 */
#define MC26_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0062accu)	/* Read Data and Bit Flip Register 22 */
#define MC26_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0062aceu)	/* Read Data and Bit Flip Register 23 */
#define MC26_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0062ad0u)	/* Read Data and Bit Flip Register 24 */
#define MC26_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0062ad2u)	/* Read Data and Bit Flip Register 25 */
#define MC26_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0062ad4u)	/* Read Data and Bit Flip Register 26 */
#define MC26_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0062ad6u)	/* Read Data and Bit Flip Register 27 */
#define MC26_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0062ad8u)	/* Read Data and Bit Flip Register 28 */
#define MC26_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0062adau)	/* Read Data and Bit Flip Register 29 */
#define MC26_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0062aa6u)	/* Read Data and Bit Flip Register 3 */
#define MC26_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0062adcu)	/* Read Data and Bit Flip Register 30 */
#define MC26_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0062adeu)	/* Read Data and Bit Flip Register 31 */
#define MC26_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0062ae0u)	/* Read Data and Bit Flip Register 32 */
#define MC26_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0062ae2u)	/* Read Data and Bit Flip Register 33 */
#define MC26_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0062ae4u)	/* Read Data and Bit Flip Register 34 */
#define MC26_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0062ae6u)	/* Read Data and Bit Flip Register 35 */
#define MC26_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0062ae8u)	/* Read Data and Bit Flip Register 36 */
#define MC26_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0062aeau)	/* Read Data and Bit Flip Register 37 */
#define MC26_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0062aecu)	/* Read Data and Bit Flip Register 38 */
#define MC26_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0062aeeu)	/* Read Data and Bit Flip Register 39 */
#define MC26_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0062aa8u)	/* Read Data and Bit Flip Register 4 */
#define MC26_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0062aaau)	/* Read Data and Bit Flip Register 5 */
#define MC26_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0062aacu)	/* Read Data and Bit Flip Register 6 */
#define MC26_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0062aaeu)	/* Read Data and Bit Flip Register 7 */
#define MC26_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0062ab0u)	/* Read Data and Bit Flip Register 8 */
#define MC26_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0062ab2u)	/* Read Data and Bit Flip Register 9 */
#define MC27_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0062ba0u)	/* Read Data and Bit Flip Register 0 */
#define MC27_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0062ba2u)	/* Read Data and Bit Flip Register 1 */
#define MC27_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0062bb4u)	/* Read Data and Bit Flip Register 10 */
#define MC27_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0062bb6u)	/* Read Data and Bit Flip Register 11 */
#define MC27_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0062bb8u)	/* Read Data and Bit Flip Register 12 */
#define MC27_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0062bbau)	/* Read Data and Bit Flip Register 13 */
#define MC27_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0062bbcu)	/* Read Data and Bit Flip Register 14 */
#define MC27_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0062bbeu)	/* Read Data and Bit Flip Register 15 */
#define MC27_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0062bc0u)	/* Read Data and Bit Flip Register 16 */
#define MC27_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0062bc2u)	/* Read Data and Bit Flip Register 17 */
#define MC27_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0062bc4u)	/* Read Data and Bit Flip Register 18 */
#define MC27_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0062bc6u)	/* Read Data and Bit Flip Register 19 */
#define MC27_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0062ba4u)	/* Read Data and Bit Flip Register 2 */
#define MC27_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0062bc8u)	/* Read Data and Bit Flip Register 20 */
#define MC27_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0062bcau)	/* Read Data and Bit Flip Register 21 */
#define MC27_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0062bccu)	/* Read Data and Bit Flip Register 22 */
#define MC27_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0062bceu)	/* Read Data and Bit Flip Register 23 */
#define MC27_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0062bd0u)	/* Read Data and Bit Flip Register 24 */
#define MC27_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0062bd2u)	/* Read Data and Bit Flip Register 25 */
#define MC27_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0062bd4u)	/* Read Data and Bit Flip Register 26 */
#define MC27_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0062bd6u)	/* Read Data and Bit Flip Register 27 */
#define MC27_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0062bd8u)	/* Read Data and Bit Flip Register 28 */
#define MC27_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0062bdau)	/* Read Data and Bit Flip Register 29 */
#define MC27_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0062ba6u)	/* Read Data and Bit Flip Register 3 */
#define MC27_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0062bdcu)	/* Read Data and Bit Flip Register 30 */
#define MC27_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0062bdeu)	/* Read Data and Bit Flip Register 31 */
#define MC27_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0062be0u)	/* Read Data and Bit Flip Register 32 */
#define MC27_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0062be2u)	/* Read Data and Bit Flip Register 33 */
#define MC27_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0062be4u)	/* Read Data and Bit Flip Register 34 */
#define MC27_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0062be6u)	/* Read Data and Bit Flip Register 35 */
#define MC27_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0062be8u)	/* Read Data and Bit Flip Register 36 */
#define MC27_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0062beau)	/* Read Data and Bit Flip Register 37 */
#define MC27_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0062becu)	/* Read Data and Bit Flip Register 38 */
#define MC27_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0062beeu)	/* Read Data and Bit Flip Register 39 */
#define MC27_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0062ba8u)	/* Read Data and Bit Flip Register 4 */
#define MC27_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0062baau)	/* Read Data and Bit Flip Register 5 */
#define MC27_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0062bacu)	/* Read Data and Bit Flip Register 6 */
#define MC27_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0062baeu)	/* Read Data and Bit Flip Register 7 */
#define MC27_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0062bb0u)	/* Read Data and Bit Flip Register 8 */
#define MC27_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0062bb2u)	/* Read Data and Bit Flip Register 9 */
#define MC28_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0062ca0u)	/* Read Data and Bit Flip Register 0 */
#define MC28_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0062ca2u)	/* Read Data and Bit Flip Register 1 */
#define MC28_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0062cb4u)	/* Read Data and Bit Flip Register 10 */
#define MC28_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0062cb6u)	/* Read Data and Bit Flip Register 11 */
#define MC28_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0062cb8u)	/* Read Data and Bit Flip Register 12 */
#define MC28_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0062cbau)	/* Read Data and Bit Flip Register 13 */
#define MC28_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0062cbcu)	/* Read Data and Bit Flip Register 14 */
#define MC28_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0062cbeu)	/* Read Data and Bit Flip Register 15 */
#define MC28_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0062cc0u)	/* Read Data and Bit Flip Register 16 */
#define MC28_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0062cc2u)	/* Read Data and Bit Flip Register 17 */
#define MC28_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0062cc4u)	/* Read Data and Bit Flip Register 18 */
#define MC28_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0062cc6u)	/* Read Data and Bit Flip Register 19 */
#define MC28_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0062ca4u)	/* Read Data and Bit Flip Register 2 */
#define MC28_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0062cc8u)	/* Read Data and Bit Flip Register 20 */
#define MC28_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0062ccau)	/* Read Data and Bit Flip Register 21 */
#define MC28_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0062cccu)	/* Read Data and Bit Flip Register 22 */
#define MC28_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0062cceu)	/* Read Data and Bit Flip Register 23 */
#define MC28_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0062cd0u)	/* Read Data and Bit Flip Register 24 */
#define MC28_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0062cd2u)	/* Read Data and Bit Flip Register 25 */
#define MC28_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0062cd4u)	/* Read Data and Bit Flip Register 26 */
#define MC28_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0062cd6u)	/* Read Data and Bit Flip Register 27 */
#define MC28_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0062cd8u)	/* Read Data and Bit Flip Register 28 */
#define MC28_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0062cdau)	/* Read Data and Bit Flip Register 29 */
#define MC28_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0062ca6u)	/* Read Data and Bit Flip Register 3 */
#define MC28_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0062cdcu)	/* Read Data and Bit Flip Register 30 */
#define MC28_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0062cdeu)	/* Read Data and Bit Flip Register 31 */
#define MC28_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0062ce0u)	/* Read Data and Bit Flip Register 32 */
#define MC28_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0062ce2u)	/* Read Data and Bit Flip Register 33 */
#define MC28_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0062ce4u)	/* Read Data and Bit Flip Register 34 */
#define MC28_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0062ce6u)	/* Read Data and Bit Flip Register 35 */
#define MC28_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0062ce8u)	/* Read Data and Bit Flip Register 36 */
#define MC28_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0062ceau)	/* Read Data and Bit Flip Register 37 */
#define MC28_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0062cecu)	/* Read Data and Bit Flip Register 38 */
#define MC28_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0062ceeu)	/* Read Data and Bit Flip Register 39 */
#define MC28_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0062ca8u)	/* Read Data and Bit Flip Register 4 */
#define MC28_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0062caau)	/* Read Data and Bit Flip Register 5 */
#define MC28_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0062cacu)	/* Read Data and Bit Flip Register 6 */
#define MC28_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0062caeu)	/* Read Data and Bit Flip Register 7 */
#define MC28_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0062cb0u)	/* Read Data and Bit Flip Register 8 */
#define MC28_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0062cb2u)	/* Read Data and Bit Flip Register 9 */
#define MC29_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0062da0u)	/* Read Data and Bit Flip Register 0 */
#define MC29_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0062da2u)	/* Read Data and Bit Flip Register 1 */
#define MC29_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0062db4u)	/* Read Data and Bit Flip Register 10 */
#define MC29_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0062db6u)	/* Read Data and Bit Flip Register 11 */
#define MC29_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0062db8u)	/* Read Data and Bit Flip Register 12 */
#define MC29_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0062dbau)	/* Read Data and Bit Flip Register 13 */
#define MC29_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0062dbcu)	/* Read Data and Bit Flip Register 14 */
#define MC29_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0062dbeu)	/* Read Data and Bit Flip Register 15 */
#define MC29_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0062dc0u)	/* Read Data and Bit Flip Register 16 */
#define MC29_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0062dc2u)	/* Read Data and Bit Flip Register 17 */
#define MC29_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0062dc4u)	/* Read Data and Bit Flip Register 18 */
#define MC29_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0062dc6u)	/* Read Data and Bit Flip Register 19 */
#define MC29_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0062da4u)	/* Read Data and Bit Flip Register 2 */
#define MC29_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0062dc8u)	/* Read Data and Bit Flip Register 20 */
#define MC29_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0062dcau)	/* Read Data and Bit Flip Register 21 */
#define MC29_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0062dccu)	/* Read Data and Bit Flip Register 22 */
#define MC29_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0062dceu)	/* Read Data and Bit Flip Register 23 */
#define MC29_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0062dd0u)	/* Read Data and Bit Flip Register 24 */
#define MC29_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0062dd2u)	/* Read Data and Bit Flip Register 25 */
#define MC29_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0062dd4u)	/* Read Data and Bit Flip Register 26 */
#define MC29_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0062dd6u)	/* Read Data and Bit Flip Register 27 */
#define MC29_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0062dd8u)	/* Read Data and Bit Flip Register 28 */
#define MC29_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0062ddau)	/* Read Data and Bit Flip Register 29 */
#define MC29_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0062da6u)	/* Read Data and Bit Flip Register 3 */
#define MC29_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0062ddcu)	/* Read Data and Bit Flip Register 30 */
#define MC29_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0062ddeu)	/* Read Data and Bit Flip Register 31 */
#define MC29_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0062de0u)	/* Read Data and Bit Flip Register 32 */
#define MC29_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0062de2u)	/* Read Data and Bit Flip Register 33 */
#define MC29_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0062de4u)	/* Read Data and Bit Flip Register 34 */
#define MC29_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0062de6u)	/* Read Data and Bit Flip Register 35 */
#define MC29_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0062de8u)	/* Read Data and Bit Flip Register 36 */
#define MC29_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0062deau)	/* Read Data and Bit Flip Register 37 */
#define MC29_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0062decu)	/* Read Data and Bit Flip Register 38 */
#define MC29_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0062deeu)	/* Read Data and Bit Flip Register 39 */
#define MC29_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0062da8u)	/* Read Data and Bit Flip Register 4 */
#define MC29_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0062daau)	/* Read Data and Bit Flip Register 5 */
#define MC29_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0062dacu)	/* Read Data and Bit Flip Register 6 */
#define MC29_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0062daeu)	/* Read Data and Bit Flip Register 7 */
#define MC29_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0062db0u)	/* Read Data and Bit Flip Register 8 */
#define MC29_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0062db2u)	/* Read Data and Bit Flip Register 9 */
#define MC2_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00612a0u)	/* Read Data and Bit Flip Register 0 */
#define MC2_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00612a2u)	/* Read Data and Bit Flip Register 1 */
#define MC2_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00612b4u)	/* Read Data and Bit Flip Register 10 */
#define MC2_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00612b6u)	/* Read Data and Bit Flip Register 11 */
#define MC2_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00612b8u)	/* Read Data and Bit Flip Register 12 */
#define MC2_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00612bau)	/* Read Data and Bit Flip Register 13 */
#define MC2_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00612bcu)	/* Read Data and Bit Flip Register 14 */
#define MC2_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00612beu)	/* Read Data and Bit Flip Register 15 */
#define MC2_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00612c0u)	/* Read Data and Bit Flip Register 16 */
#define MC2_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00612c2u)	/* Read Data and Bit Flip Register 17 */
#define MC2_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00612c4u)	/* Read Data and Bit Flip Register 18 */
#define MC2_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00612c6u)	/* Read Data and Bit Flip Register 19 */
#define MC2_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00612a4u)	/* Read Data and Bit Flip Register 2 */
#define MC2_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00612c8u)	/* Read Data and Bit Flip Register 20 */
#define MC2_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00612cau)	/* Read Data and Bit Flip Register 21 */
#define MC2_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00612ccu)	/* Read Data and Bit Flip Register 22 */
#define MC2_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00612ceu)	/* Read Data and Bit Flip Register 23 */
#define MC2_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00612d0u)	/* Read Data and Bit Flip Register 24 */
#define MC2_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00612d2u)	/* Read Data and Bit Flip Register 25 */
#define MC2_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00612d4u)	/* Read Data and Bit Flip Register 26 */
#define MC2_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00612d6u)	/* Read Data and Bit Flip Register 27 */
#define MC2_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00612d8u)	/* Read Data and Bit Flip Register 28 */
#define MC2_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00612dau)	/* Read Data and Bit Flip Register 29 */
#define MC2_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00612a6u)	/* Read Data and Bit Flip Register 3 */
#define MC2_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00612dcu)	/* Read Data and Bit Flip Register 30 */
#define MC2_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00612deu)	/* Read Data and Bit Flip Register 31 */
#define MC2_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00612e0u)	/* Read Data and Bit Flip Register 32 */
#define MC2_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00612e2u)	/* Read Data and Bit Flip Register 33 */
#define MC2_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00612e4u)	/* Read Data and Bit Flip Register 34 */
#define MC2_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00612e6u)	/* Read Data and Bit Flip Register 35 */
#define MC2_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00612e8u)	/* Read Data and Bit Flip Register 36 */
#define MC2_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00612eau)	/* Read Data and Bit Flip Register 37 */
#define MC2_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00612ecu)	/* Read Data and Bit Flip Register 38 */
#define MC2_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00612eeu)	/* Read Data and Bit Flip Register 39 */
#define MC2_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00612a8u)	/* Read Data and Bit Flip Register 4 */
#define MC2_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00612aau)	/* Read Data and Bit Flip Register 5 */
#define MC2_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00612acu)	/* Read Data and Bit Flip Register 6 */
#define MC2_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00612aeu)	/* Read Data and Bit Flip Register 7 */
#define MC2_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00612b0u)	/* Read Data and Bit Flip Register 8 */
#define MC2_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00612b2u)	/* Read Data and Bit Flip Register 9 */
#define MC30_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0062ea0u)	/* Read Data and Bit Flip Register 0 */
#define MC30_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0062ea2u)	/* Read Data and Bit Flip Register 1 */
#define MC30_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0062eb4u)	/* Read Data and Bit Flip Register 10 */
#define MC30_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0062eb6u)	/* Read Data and Bit Flip Register 11 */
#define MC30_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0062eb8u)	/* Read Data and Bit Flip Register 12 */
#define MC30_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0062ebau)	/* Read Data and Bit Flip Register 13 */
#define MC30_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0062ebcu)	/* Read Data and Bit Flip Register 14 */
#define MC30_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0062ebeu)	/* Read Data and Bit Flip Register 15 */
#define MC30_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0062ec0u)	/* Read Data and Bit Flip Register 16 */
#define MC30_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0062ec2u)	/* Read Data and Bit Flip Register 17 */
#define MC30_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0062ec4u)	/* Read Data and Bit Flip Register 18 */
#define MC30_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0062ec6u)	/* Read Data and Bit Flip Register 19 */
#define MC30_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0062ea4u)	/* Read Data and Bit Flip Register 2 */
#define MC30_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0062ec8u)	/* Read Data and Bit Flip Register 20 */
#define MC30_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0062ecau)	/* Read Data and Bit Flip Register 21 */
#define MC30_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0062eccu)	/* Read Data and Bit Flip Register 22 */
#define MC30_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0062eceu)	/* Read Data and Bit Flip Register 23 */
#define MC30_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0062ed0u)	/* Read Data and Bit Flip Register 24 */
#define MC30_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0062ed2u)	/* Read Data and Bit Flip Register 25 */
#define MC30_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0062ed4u)	/* Read Data and Bit Flip Register 26 */
#define MC30_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0062ed6u)	/* Read Data and Bit Flip Register 27 */
#define MC30_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0062ed8u)	/* Read Data and Bit Flip Register 28 */
#define MC30_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0062edau)	/* Read Data and Bit Flip Register 29 */
#define MC30_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0062ea6u)	/* Read Data and Bit Flip Register 3 */
#define MC30_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0062edcu)	/* Read Data and Bit Flip Register 30 */
#define MC30_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0062edeu)	/* Read Data and Bit Flip Register 31 */
#define MC30_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0062ee0u)	/* Read Data and Bit Flip Register 32 */
#define MC30_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0062ee2u)	/* Read Data and Bit Flip Register 33 */
#define MC30_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0062ee4u)	/* Read Data and Bit Flip Register 34 */
#define MC30_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0062ee6u)	/* Read Data and Bit Flip Register 35 */
#define MC30_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0062ee8u)	/* Read Data and Bit Flip Register 36 */
#define MC30_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0062eeau)	/* Read Data and Bit Flip Register 37 */
#define MC30_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0062eecu)	/* Read Data and Bit Flip Register 38 */
#define MC30_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0062eeeu)	/* Read Data and Bit Flip Register 39 */
#define MC30_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0062ea8u)	/* Read Data and Bit Flip Register 4 */
#define MC30_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0062eaau)	/* Read Data and Bit Flip Register 5 */
#define MC30_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0062eacu)	/* Read Data and Bit Flip Register 6 */
#define MC30_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0062eaeu)	/* Read Data and Bit Flip Register 7 */
#define MC30_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0062eb0u)	/* Read Data and Bit Flip Register 8 */
#define MC30_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0062eb2u)	/* Read Data and Bit Flip Register 9 */
#define MC31_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0062fa0u)	/* Read Data and Bit Flip Register 0 */
#define MC31_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0062fa2u)	/* Read Data and Bit Flip Register 1 */
#define MC31_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0062fb4u)	/* Read Data and Bit Flip Register 10 */
#define MC31_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0062fb6u)	/* Read Data and Bit Flip Register 11 */
#define MC31_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0062fb8u)	/* Read Data and Bit Flip Register 12 */
#define MC31_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0062fbau)	/* Read Data and Bit Flip Register 13 */
#define MC31_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0062fbcu)	/* Read Data and Bit Flip Register 14 */
#define MC31_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0062fbeu)	/* Read Data and Bit Flip Register 15 */
#define MC31_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0062fc0u)	/* Read Data and Bit Flip Register 16 */
#define MC31_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0062fc2u)	/* Read Data and Bit Flip Register 17 */
#define MC31_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0062fc4u)	/* Read Data and Bit Flip Register 18 */
#define MC31_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0062fc6u)	/* Read Data and Bit Flip Register 19 */
#define MC31_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0062fa4u)	/* Read Data and Bit Flip Register 2 */
