svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC31_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0062fc8u)	/* Read Data and Bit Flip Register 20 */
#define MC31_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0062fcau)	/* Read Data and Bit Flip Register 21 */
#define MC31_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0062fccu)	/* Read Data and Bit Flip Register 22 */
#define MC31_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0062fceu)	/* Read Data and Bit Flip Register 23 */
#define MC31_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0062fd0u)	/* Read Data and Bit Flip Register 24 */
#define MC31_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0062fd2u)	/* Read Data and Bit Flip Register 25 */
#define MC31_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0062fd4u)	/* Read Data and Bit Flip Register 26 */
#define MC31_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0062fd6u)	/* Read Data and Bit Flip Register 27 */
#define MC31_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0062fd8u)	/* Read Data and Bit Flip Register 28 */
#define MC31_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0062fdau)	/* Read Data and Bit Flip Register 29 */
#define MC31_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0062fa6u)	/* Read Data and Bit Flip Register 3 */
#define MC31_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0062fdcu)	/* Read Data and Bit Flip Register 30 */
#define MC31_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0062fdeu)	/* Read Data and Bit Flip Register 31 */
#define MC31_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0062fe0u)	/* Read Data and Bit Flip Register 32 */
#define MC31_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0062fe2u)	/* Read Data and Bit Flip Register 33 */
#define MC31_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0062fe4u)	/* Read Data and Bit Flip Register 34 */
#define MC31_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0062fe6u)	/* Read Data and Bit Flip Register 35 */
#define MC31_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0062fe8u)	/* Read Data and Bit Flip Register 36 */
#define MC31_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0062feau)	/* Read Data and Bit Flip Register 37 */
#define MC31_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0062fecu)	/* Read Data and Bit Flip Register 38 */
#define MC31_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0062feeu)	/* Read Data and Bit Flip Register 39 */
#define MC31_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0062fa8u)	/* Read Data and Bit Flip Register 4 */
#define MC31_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0062faau)	/* Read Data and Bit Flip Register 5 */
#define MC31_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0062facu)	/* Read Data and Bit Flip Register 6 */
#define MC31_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0062faeu)	/* Read Data and Bit Flip Register 7 */
#define MC31_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0062fb0u)	/* Read Data and Bit Flip Register 8 */
#define MC31_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0062fb2u)	/* Read Data and Bit Flip Register 9 */
#define MC32_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00630a0u)	/* Read Data and Bit Flip Register 0 */
#define MC32_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00630a2u)	/* Read Data and Bit Flip Register 1 */
#define MC32_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00630b4u)	/* Read Data and Bit Flip Register 10 */
#define MC32_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00630b6u)	/* Read Data and Bit Flip Register 11 */
#define MC32_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00630b8u)	/* Read Data and Bit Flip Register 12 */
#define MC32_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00630bau)	/* Read Data and Bit Flip Register 13 */
#define MC32_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00630bcu)	/* Read Data and Bit Flip Register 14 */
#define MC32_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00630beu)	/* Read Data and Bit Flip Register 15 */
#define MC32_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00630c0u)	/* Read Data and Bit Flip Register 16 */
#define MC32_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00630c2u)	/* Read Data and Bit Flip Register 17 */
#define MC32_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00630c4u)	/* Read Data and Bit Flip Register 18 */
#define MC32_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00630c6u)	/* Read Data and Bit Flip Register 19 */
#define MC32_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00630a4u)	/* Read Data and Bit Flip Register 2 */
#define MC32_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00630c8u)	/* Read Data and Bit Flip Register 20 */
#define MC32_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00630cau)	/* Read Data and Bit Flip Register 21 */
#define MC32_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00630ccu)	/* Read Data and Bit Flip Register 22 */
#define MC32_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00630ceu)	/* Read Data and Bit Flip Register 23 */
#define MC32_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00630d0u)	/* Read Data and Bit Flip Register 24 */
#define MC32_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00630d2u)	/* Read Data and Bit Flip Register 25 */
#define MC32_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00630d4u)	/* Read Data and Bit Flip Register 26 */
#define MC32_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00630d6u)	/* Read Data and Bit Flip Register 27 */
#define MC32_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00630d8u)	/* Read Data and Bit Flip Register 28 */
#define MC32_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00630dau)	/* Read Data and Bit Flip Register 29 */
#define MC32_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00630a6u)	/* Read Data and Bit Flip Register 3 */
#define MC32_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00630dcu)	/* Read Data and Bit Flip Register 30 */
#define MC32_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00630deu)	/* Read Data and Bit Flip Register 31 */
#define MC32_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00630e0u)	/* Read Data and Bit Flip Register 32 */
#define MC32_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00630e2u)	/* Read Data and Bit Flip Register 33 */
#define MC32_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00630e4u)	/* Read Data and Bit Flip Register 34 */
#define MC32_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00630e6u)	/* Read Data and Bit Flip Register 35 */
#define MC32_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00630e8u)	/* Read Data and Bit Flip Register 36 */
#define MC32_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00630eau)	/* Read Data and Bit Flip Register 37 */
#define MC32_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00630ecu)	/* Read Data and Bit Flip Register 38 */
#define MC32_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00630eeu)	/* Read Data and Bit Flip Register 39 */
#define MC32_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00630a8u)	/* Read Data and Bit Flip Register 4 */
#define MC32_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00630aau)	/* Read Data and Bit Flip Register 5 */
#define MC32_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00630acu)	/* Read Data and Bit Flip Register 6 */
#define MC32_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00630aeu)	/* Read Data and Bit Flip Register 7 */
#define MC32_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00630b0u)	/* Read Data and Bit Flip Register 8 */
#define MC32_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00630b2u)	/* Read Data and Bit Flip Register 9 */
#define MC33_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00631a0u)	/* Read Data and Bit Flip Register 0 */
#define MC33_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00631a2u)	/* Read Data and Bit Flip Register 1 */
#define MC33_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00631b4u)	/* Read Data and Bit Flip Register 10 */
#define MC33_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00631b6u)	/* Read Data and Bit Flip Register 11 */
#define MC33_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00631b8u)	/* Read Data and Bit Flip Register 12 */
#define MC33_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00631bau)	/* Read Data and Bit Flip Register 13 */
#define MC33_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00631bcu)	/* Read Data and Bit Flip Register 14 */
#define MC33_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00631beu)	/* Read Data and Bit Flip Register 15 */
#define MC33_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00631c0u)	/* Read Data and Bit Flip Register 16 */
#define MC33_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00631c2u)	/* Read Data and Bit Flip Register 17 */
#define MC33_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00631c4u)	/* Read Data and Bit Flip Register 18 */
#define MC33_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00631c6u)	/* Read Data and Bit Flip Register 19 */
#define MC33_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00631a4u)	/* Read Data and Bit Flip Register 2 */
#define MC33_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00631c8u)	/* Read Data and Bit Flip Register 20 */
#define MC33_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00631cau)	/* Read Data and Bit Flip Register 21 */
#define MC33_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00631ccu)	/* Read Data and Bit Flip Register 22 */
#define MC33_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00631ceu)	/* Read Data and Bit Flip Register 23 */
#define MC33_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00631d0u)	/* Read Data and Bit Flip Register 24 */
#define MC33_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00631d2u)	/* Read Data and Bit Flip Register 25 */
#define MC33_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00631d4u)	/* Read Data and Bit Flip Register 26 */
#define MC33_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00631d6u)	/* Read Data and Bit Flip Register 27 */
#define MC33_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00631d8u)	/* Read Data and Bit Flip Register 28 */
#define MC33_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00631dau)	/* Read Data and Bit Flip Register 29 */
#define MC33_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00631a6u)	/* Read Data and Bit Flip Register 3 */
#define MC33_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00631dcu)	/* Read Data and Bit Flip Register 30 */
#define MC33_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00631deu)	/* Read Data and Bit Flip Register 31 */
#define MC33_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00631e0u)	/* Read Data and Bit Flip Register 32 */
#define MC33_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00631e2u)	/* Read Data and Bit Flip Register 33 */
#define MC33_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00631e4u)	/* Read Data and Bit Flip Register 34 */
#define MC33_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00631e6u)	/* Read Data and Bit Flip Register 35 */
#define MC33_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00631e8u)	/* Read Data and Bit Flip Register 36 */
#define MC33_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00631eau)	/* Read Data and Bit Flip Register 37 */
#define MC33_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00631ecu)	/* Read Data and Bit Flip Register 38 */
#define MC33_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00631eeu)	/* Read Data and Bit Flip Register 39 */
#define MC33_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00631a8u)	/* Read Data and Bit Flip Register 4 */
#define MC33_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00631aau)	/* Read Data and Bit Flip Register 5 */
#define MC33_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00631acu)	/* Read Data and Bit Flip Register 6 */
#define MC33_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00631aeu)	/* Read Data and Bit Flip Register 7 */
#define MC33_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00631b0u)	/* Read Data and Bit Flip Register 8 */
#define MC33_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00631b2u)	/* Read Data and Bit Flip Register 9 */
#define MC34_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00632a0u)	/* Read Data and Bit Flip Register 0 */
#define MC34_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00632a2u)	/* Read Data and Bit Flip Register 1 */
#define MC34_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00632b4u)	/* Read Data and Bit Flip Register 10 */
#define MC34_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00632b6u)	/* Read Data and Bit Flip Register 11 */
#define MC34_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00632b8u)	/* Read Data and Bit Flip Register 12 */
#define MC34_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00632bau)	/* Read Data and Bit Flip Register 13 */
#define MC34_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00632bcu)	/* Read Data and Bit Flip Register 14 */
#define MC34_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00632beu)	/* Read Data and Bit Flip Register 15 */
#define MC34_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00632c0u)	/* Read Data and Bit Flip Register 16 */
#define MC34_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00632c2u)	/* Read Data and Bit Flip Register 17 */
#define MC34_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00632c4u)	/* Read Data and Bit Flip Register 18 */
#define MC34_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00632c6u)	/* Read Data and Bit Flip Register 19 */
#define MC34_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00632a4u)	/* Read Data and Bit Flip Register 2 */
#define MC34_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00632c8u)	/* Read Data and Bit Flip Register 20 */
#define MC34_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00632cau)	/* Read Data and Bit Flip Register 21 */
#define MC34_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00632ccu)	/* Read Data and Bit Flip Register 22 */
#define MC34_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00632ceu)	/* Read Data and Bit Flip Register 23 */
#define MC34_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00632d0u)	/* Read Data and Bit Flip Register 24 */
#define MC34_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00632d2u)	/* Read Data and Bit Flip Register 25 */
#define MC34_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00632d4u)	/* Read Data and Bit Flip Register 26 */
#define MC34_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00632d6u)	/* Read Data and Bit Flip Register 27 */
#define MC34_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00632d8u)	/* Read Data and Bit Flip Register 28 */
#define MC34_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00632dau)	/* Read Data and Bit Flip Register 29 */
#define MC34_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00632a6u)	/* Read Data and Bit Flip Register 3 */
#define MC34_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00632dcu)	/* Read Data and Bit Flip Register 30 */
#define MC34_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00632deu)	/* Read Data and Bit Flip Register 31 */
#define MC34_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00632e0u)	/* Read Data and Bit Flip Register 32 */
#define MC34_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00632e2u)	/* Read Data and Bit Flip Register 33 */
#define MC34_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00632e4u)	/* Read Data and Bit Flip Register 34 */
#define MC34_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00632e6u)	/* Read Data and Bit Flip Register 35 */
#define MC34_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00632e8u)	/* Read Data and Bit Flip Register 36 */
#define MC34_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00632eau)	/* Read Data and Bit Flip Register 37 */
#define MC34_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00632ecu)	/* Read Data and Bit Flip Register 38 */
#define MC34_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00632eeu)	/* Read Data and Bit Flip Register 39 */
#define MC34_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00632a8u)	/* Read Data and Bit Flip Register 4 */
#define MC34_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00632aau)	/* Read Data and Bit Flip Register 5 */
#define MC34_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00632acu)	/* Read Data and Bit Flip Register 6 */
#define MC34_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00632aeu)	/* Read Data and Bit Flip Register 7 */
#define MC34_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00632b0u)	/* Read Data and Bit Flip Register 8 */
#define MC34_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00632b2u)	/* Read Data and Bit Flip Register 9 */
#define MC35_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00633a0u)	/* Read Data and Bit Flip Register 0 */
#define MC35_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00633a2u)	/* Read Data and Bit Flip Register 1 */
#define MC35_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00633b4u)	/* Read Data and Bit Flip Register 10 */
#define MC35_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00633b6u)	/* Read Data and Bit Flip Register 11 */
#define MC35_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00633b8u)	/* Read Data and Bit Flip Register 12 */
#define MC35_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00633bau)	/* Read Data and Bit Flip Register 13 */
#define MC35_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00633bcu)	/* Read Data and Bit Flip Register 14 */
#define MC35_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00633beu)	/* Read Data and Bit Flip Register 15 */
#define MC35_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00633c0u)	/* Read Data and Bit Flip Register 16 */
#define MC35_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00633c2u)	/* Read Data and Bit Flip Register 17 */
#define MC35_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00633c4u)	/* Read Data and Bit Flip Register 18 */
#define MC35_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00633c6u)	/* Read Data and Bit Flip Register 19 */
#define MC35_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00633a4u)	/* Read Data and Bit Flip Register 2 */
#define MC35_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00633c8u)	/* Read Data and Bit Flip Register 20 */
#define MC35_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00633cau)	/* Read Data and Bit Flip Register 21 */
#define MC35_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00633ccu)	/* Read Data and Bit Flip Register 22 */
#define MC35_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00633ceu)	/* Read Data and Bit Flip Register 23 */
#define MC35_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00633d0u)	/* Read Data and Bit Flip Register 24 */
#define MC35_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00633d2u)	/* Read Data and Bit Flip Register 25 */
#define MC35_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00633d4u)	/* Read Data and Bit Flip Register 26 */
#define MC35_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00633d6u)	/* Read Data and Bit Flip Register 27 */
#define MC35_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00633d8u)	/* Read Data and Bit Flip Register 28 */
#define MC35_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00633dau)	/* Read Data and Bit Flip Register 29 */
#define MC35_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00633a6u)	/* Read Data and Bit Flip Register 3 */
#define MC35_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00633dcu)	/* Read Data and Bit Flip Register 30 */
#define MC35_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00633deu)	/* Read Data and Bit Flip Register 31 */
#define MC35_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00633e0u)	/* Read Data and Bit Flip Register 32 */
#define MC35_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00633e2u)	/* Read Data and Bit Flip Register 33 */
#define MC35_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00633e4u)	/* Read Data and Bit Flip Register 34 */
#define MC35_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00633e6u)	/* Read Data and Bit Flip Register 35 */
#define MC35_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00633e8u)	/* Read Data and Bit Flip Register 36 */
#define MC35_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00633eau)	/* Read Data and Bit Flip Register 37 */
#define MC35_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00633ecu)	/* Read Data and Bit Flip Register 38 */
#define MC35_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00633eeu)	/* Read Data and Bit Flip Register 39 */
#define MC35_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00633a8u)	/* Read Data and Bit Flip Register 4 */
#define MC35_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00633aau)	/* Read Data and Bit Flip Register 5 */
#define MC35_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00633acu)	/* Read Data and Bit Flip Register 6 */
#define MC35_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00633aeu)	/* Read Data and Bit Flip Register 7 */
#define MC35_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00633b0u)	/* Read Data and Bit Flip Register 8 */
#define MC35_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00633b2u)	/* Read Data and Bit Flip Register 9 */
#define MC36_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00634a0u)	/* Read Data and Bit Flip Register 0 */
#define MC36_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00634a2u)	/* Read Data and Bit Flip Register 1 */
#define MC36_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00634b4u)	/* Read Data and Bit Flip Register 10 */
#define MC36_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00634b6u)	/* Read Data and Bit Flip Register 11 */
#define MC36_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00634b8u)	/* Read Data and Bit Flip Register 12 */
#define MC36_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00634bau)	/* Read Data and Bit Flip Register 13 */
#define MC36_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00634bcu)	/* Read Data and Bit Flip Register 14 */
#define MC36_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00634beu)	/* Read Data and Bit Flip Register 15 */
#define MC36_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00634c0u)	/* Read Data and Bit Flip Register 16 */
#define MC36_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00634c2u)	/* Read Data and Bit Flip Register 17 */
#define MC36_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00634c4u)	/* Read Data and Bit Flip Register 18 */
#define MC36_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00634c6u)	/* Read Data and Bit Flip Register 19 */
#define MC36_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00634a4u)	/* Read Data and Bit Flip Register 2 */
#define MC36_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00634c8u)	/* Read Data and Bit Flip Register 20 */
#define MC36_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00634cau)	/* Read Data and Bit Flip Register 21 */
#define MC36_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00634ccu)	/* Read Data and Bit Flip Register 22 */
#define MC36_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00634ceu)	/* Read Data and Bit Flip Register 23 */
#define MC36_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00634d0u)	/* Read Data and Bit Flip Register 24 */
#define MC36_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00634d2u)	/* Read Data and Bit Flip Register 25 */
#define MC36_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00634d4u)	/* Read Data and Bit Flip Register 26 */
#define MC36_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00634d6u)	/* Read Data and Bit Flip Register 27 */
#define MC36_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00634d8u)	/* Read Data and Bit Flip Register 28 */
#define MC36_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00634dau)	/* Read Data and Bit Flip Register 29 */
#define MC36_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00634a6u)	/* Read Data and Bit Flip Register 3 */
#define MC36_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00634dcu)	/* Read Data and Bit Flip Register 30 */
#define MC36_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00634deu)	/* Read Data and Bit Flip Register 31 */
#define MC36_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00634e0u)	/* Read Data and Bit Flip Register 32 */
#define MC36_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00634e2u)	/* Read Data and Bit Flip Register 33 */
#define MC36_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00634e4u)	/* Read Data and Bit Flip Register 34 */
#define MC36_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00634e6u)	/* Read Data and Bit Flip Register 35 */
#define MC36_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00634e8u)	/* Read Data and Bit Flip Register 36 */
#define MC36_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00634eau)	/* Read Data and Bit Flip Register 37 */
#define MC36_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00634ecu)	/* Read Data and Bit Flip Register 38 */
#define MC36_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00634eeu)	/* Read Data and Bit Flip Register 39 */
#define MC36_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00634a8u)	/* Read Data and Bit Flip Register 4 */
#define MC36_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00634aau)	/* Read Data and Bit Flip Register 5 */
#define MC36_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00634acu)	/* Read Data and Bit Flip Register 6 */
#define MC36_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00634aeu)	/* Read Data and Bit Flip Register 7 */
#define MC36_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00634b0u)	/* Read Data and Bit Flip Register 8 */
#define MC36_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00634b2u)	/* Read Data and Bit Flip Register 9 */
#define MC37_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00635a0u)	/* Read Data and Bit Flip Register 0 */
#define MC37_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00635a2u)	/* Read Data and Bit Flip Register 1 */
#define MC37_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00635b4u)	/* Read Data and Bit Flip Register 10 */
#define MC37_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00635b6u)	/* Read Data and Bit Flip Register 11 */
#define MC37_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00635b8u)	/* Read Data and Bit Flip Register 12 */
#define MC37_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00635bau)	/* Read Data and Bit Flip Register 13 */
#define MC37_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00635bcu)	/* Read Data and Bit Flip Register 14 */
#define MC37_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00635beu)	/* Read Data and Bit Flip Register 15 */
#define MC37_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00635c0u)	/* Read Data and Bit Flip Register 16 */
#define MC37_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00635c2u)	/* Read Data and Bit Flip Register 17 */
#define MC37_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00635c4u)	/* Read Data and Bit Flip Register 18 */
#define MC37_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00635c6u)	/* Read Data and Bit Flip Register 19 */
#define MC37_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00635a4u)	/* Read Data and Bit Flip Register 2 */
#define MC37_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00635c8u)	/* Read Data and Bit Flip Register 20 */
#define MC37_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00635cau)	/* Read Data and Bit Flip Register 21 */
#define MC37_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00635ccu)	/* Read Data and Bit Flip Register 22 */
