svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC37_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00635ceu)	/* Read Data and Bit Flip Register 23 */
#define MC37_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00635d0u)	/* Read Data and Bit Flip Register 24 */
#define MC37_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00635d2u)	/* Read Data and Bit Flip Register 25 */
#define MC37_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00635d4u)	/* Read Data and Bit Flip Register 26 */
#define MC37_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00635d6u)	/* Read Data and Bit Flip Register 27 */
#define MC37_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00635d8u)	/* Read Data and Bit Flip Register 28 */
#define MC37_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00635dau)	/* Read Data and Bit Flip Register 29 */
#define MC37_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00635a6u)	/* Read Data and Bit Flip Register 3 */
#define MC37_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00635dcu)	/* Read Data and Bit Flip Register 30 */
#define MC37_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00635deu)	/* Read Data and Bit Flip Register 31 */
#define MC37_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00635e0u)	/* Read Data and Bit Flip Register 32 */
#define MC37_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00635e2u)	/* Read Data and Bit Flip Register 33 */
#define MC37_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00635e4u)	/* Read Data and Bit Flip Register 34 */
#define MC37_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00635e6u)	/* Read Data and Bit Flip Register 35 */
#define MC37_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00635e8u)	/* Read Data and Bit Flip Register 36 */
#define MC37_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00635eau)	/* Read Data and Bit Flip Register 37 */
#define MC37_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00635ecu)	/* Read Data and Bit Flip Register 38 */
#define MC37_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00635eeu)	/* Read Data and Bit Flip Register 39 */
#define MC37_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00635a8u)	/* Read Data and Bit Flip Register 4 */
#define MC37_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00635aau)	/* Read Data and Bit Flip Register 5 */
#define MC37_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00635acu)	/* Read Data and Bit Flip Register 6 */
#define MC37_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00635aeu)	/* Read Data and Bit Flip Register 7 */
#define MC37_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00635b0u)	/* Read Data and Bit Flip Register 8 */
#define MC37_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00635b2u)	/* Read Data and Bit Flip Register 9 */
#define MC38_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00636a0u)	/* Read Data and Bit Flip Register 0 */
#define MC38_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00636a2u)	/* Read Data and Bit Flip Register 1 */
#define MC38_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00636b4u)	/* Read Data and Bit Flip Register 10 */
#define MC38_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00636b6u)	/* Read Data and Bit Flip Register 11 */
#define MC38_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00636b8u)	/* Read Data and Bit Flip Register 12 */
#define MC38_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00636bau)	/* Read Data and Bit Flip Register 13 */
#define MC38_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00636bcu)	/* Read Data and Bit Flip Register 14 */
#define MC38_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00636beu)	/* Read Data and Bit Flip Register 15 */
#define MC38_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00636c0u)	/* Read Data and Bit Flip Register 16 */
#define MC38_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00636c2u)	/* Read Data and Bit Flip Register 17 */
#define MC38_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00636c4u)	/* Read Data and Bit Flip Register 18 */
#define MC38_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00636c6u)	/* Read Data and Bit Flip Register 19 */
#define MC38_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00636a4u)	/* Read Data and Bit Flip Register 2 */
#define MC38_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00636c8u)	/* Read Data and Bit Flip Register 20 */
#define MC38_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00636cau)	/* Read Data and Bit Flip Register 21 */
#define MC38_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00636ccu)	/* Read Data and Bit Flip Register 22 */
#define MC38_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00636ceu)	/* Read Data and Bit Flip Register 23 */
#define MC38_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00636d0u)	/* Read Data and Bit Flip Register 24 */
#define MC38_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00636d2u)	/* Read Data and Bit Flip Register 25 */
#define MC38_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00636d4u)	/* Read Data and Bit Flip Register 26 */
#define MC38_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00636d6u)	/* Read Data and Bit Flip Register 27 */
#define MC38_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00636d8u)	/* Read Data and Bit Flip Register 28 */
#define MC38_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00636dau)	/* Read Data and Bit Flip Register 29 */
#define MC38_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00636a6u)	/* Read Data and Bit Flip Register 3 */
#define MC38_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00636dcu)	/* Read Data and Bit Flip Register 30 */
#define MC38_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00636deu)	/* Read Data and Bit Flip Register 31 */
#define MC38_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00636e0u)	/* Read Data and Bit Flip Register 32 */
#define MC38_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00636e2u)	/* Read Data and Bit Flip Register 33 */
#define MC38_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00636e4u)	/* Read Data and Bit Flip Register 34 */
#define MC38_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00636e6u)	/* Read Data and Bit Flip Register 35 */
#define MC38_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00636e8u)	/* Read Data and Bit Flip Register 36 */
#define MC38_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00636eau)	/* Read Data and Bit Flip Register 37 */
#define MC38_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00636ecu)	/* Read Data and Bit Flip Register 38 */
#define MC38_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00636eeu)	/* Read Data and Bit Flip Register 39 */
#define MC38_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00636a8u)	/* Read Data and Bit Flip Register 4 */
#define MC38_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00636aau)	/* Read Data and Bit Flip Register 5 */
#define MC38_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00636acu)	/* Read Data and Bit Flip Register 6 */
#define MC38_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00636aeu)	/* Read Data and Bit Flip Register 7 */
#define MC38_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00636b0u)	/* Read Data and Bit Flip Register 8 */
#define MC38_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00636b2u)	/* Read Data and Bit Flip Register 9 */
#define MC39_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00637a0u)	/* Read Data and Bit Flip Register 0 */
#define MC39_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00637a2u)	/* Read Data and Bit Flip Register 1 */
#define MC39_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00637b4u)	/* Read Data and Bit Flip Register 10 */
#define MC39_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00637b6u)	/* Read Data and Bit Flip Register 11 */
#define MC39_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00637b8u)	/* Read Data and Bit Flip Register 12 */
#define MC39_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00637bau)	/* Read Data and Bit Flip Register 13 */
#define MC39_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00637bcu)	/* Read Data and Bit Flip Register 14 */
#define MC39_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00637beu)	/* Read Data and Bit Flip Register 15 */
#define MC39_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00637c0u)	/* Read Data and Bit Flip Register 16 */
#define MC39_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00637c2u)	/* Read Data and Bit Flip Register 17 */
#define MC39_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00637c4u)	/* Read Data and Bit Flip Register 18 */
#define MC39_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00637c6u)	/* Read Data and Bit Flip Register 19 */
#define MC39_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00637a4u)	/* Read Data and Bit Flip Register 2 */
#define MC39_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00637c8u)	/* Read Data and Bit Flip Register 20 */
#define MC39_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00637cau)	/* Read Data and Bit Flip Register 21 */
#define MC39_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00637ccu)	/* Read Data and Bit Flip Register 22 */
#define MC39_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00637ceu)	/* Read Data and Bit Flip Register 23 */
#define MC39_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00637d0u)	/* Read Data and Bit Flip Register 24 */
#define MC39_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00637d2u)	/* Read Data and Bit Flip Register 25 */
#define MC39_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00637d4u)	/* Read Data and Bit Flip Register 26 */
#define MC39_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00637d6u)	/* Read Data and Bit Flip Register 27 */
#define MC39_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00637d8u)	/* Read Data and Bit Flip Register 28 */
#define MC39_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00637dau)	/* Read Data and Bit Flip Register 29 */
#define MC39_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00637a6u)	/* Read Data and Bit Flip Register 3 */
#define MC39_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00637dcu)	/* Read Data and Bit Flip Register 30 */
#define MC39_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00637deu)	/* Read Data and Bit Flip Register 31 */
#define MC39_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00637e0u)	/* Read Data and Bit Flip Register 32 */
#define MC39_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00637e2u)	/* Read Data and Bit Flip Register 33 */
#define MC39_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00637e4u)	/* Read Data and Bit Flip Register 34 */
#define MC39_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00637e6u)	/* Read Data and Bit Flip Register 35 */
#define MC39_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00637e8u)	/* Read Data and Bit Flip Register 36 */
#define MC39_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00637eau)	/* Read Data and Bit Flip Register 37 */
#define MC39_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00637ecu)	/* Read Data and Bit Flip Register 38 */
#define MC39_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00637eeu)	/* Read Data and Bit Flip Register 39 */
#define MC39_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00637a8u)	/* Read Data and Bit Flip Register 4 */
#define MC39_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00637aau)	/* Read Data and Bit Flip Register 5 */
#define MC39_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00637acu)	/* Read Data and Bit Flip Register 6 */
#define MC39_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00637aeu)	/* Read Data and Bit Flip Register 7 */
#define MC39_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00637b0u)	/* Read Data and Bit Flip Register 8 */
#define MC39_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00637b2u)	/* Read Data and Bit Flip Register 9 */
#define MC3_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00613a0u)	/* Read Data and Bit Flip Register 0 */
#define MC3_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00613a2u)	/* Read Data and Bit Flip Register 1 */
#define MC3_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00613b4u)	/* Read Data and Bit Flip Register 10 */
#define MC3_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00613b6u)	/* Read Data and Bit Flip Register 11 */
#define MC3_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00613b8u)	/* Read Data and Bit Flip Register 12 */
#define MC3_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00613bau)	/* Read Data and Bit Flip Register 13 */
#define MC3_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00613bcu)	/* Read Data and Bit Flip Register 14 */
#define MC3_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00613beu)	/* Read Data and Bit Flip Register 15 */
#define MC3_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00613c0u)	/* Read Data and Bit Flip Register 16 */
#define MC3_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00613c2u)	/* Read Data and Bit Flip Register 17 */
#define MC3_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00613c4u)	/* Read Data and Bit Flip Register 18 */
#define MC3_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00613c6u)	/* Read Data and Bit Flip Register 19 */
#define MC3_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00613a4u)	/* Read Data and Bit Flip Register 2 */
#define MC3_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00613c8u)	/* Read Data and Bit Flip Register 20 */
#define MC3_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00613cau)	/* Read Data and Bit Flip Register 21 */
#define MC3_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00613ccu)	/* Read Data and Bit Flip Register 22 */
#define MC3_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00613ceu)	/* Read Data and Bit Flip Register 23 */
#define MC3_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00613d0u)	/* Read Data and Bit Flip Register 24 */
#define MC3_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00613d2u)	/* Read Data and Bit Flip Register 25 */
#define MC3_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00613d4u)	/* Read Data and Bit Flip Register 26 */
#define MC3_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00613d6u)	/* Read Data and Bit Flip Register 27 */
#define MC3_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00613d8u)	/* Read Data and Bit Flip Register 28 */
#define MC3_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00613dau)	/* Read Data and Bit Flip Register 29 */
#define MC3_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00613a6u)	/* Read Data and Bit Flip Register 3 */
#define MC3_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00613dcu)	/* Read Data and Bit Flip Register 30 */
#define MC3_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00613deu)	/* Read Data and Bit Flip Register 31 */
#define MC3_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00613e0u)	/* Read Data and Bit Flip Register 32 */
#define MC3_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00613e2u)	/* Read Data and Bit Flip Register 33 */
#define MC3_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00613e4u)	/* Read Data and Bit Flip Register 34 */
#define MC3_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00613e6u)	/* Read Data and Bit Flip Register 35 */
#define MC3_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00613e8u)	/* Read Data and Bit Flip Register 36 */
#define MC3_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00613eau)	/* Read Data and Bit Flip Register 37 */
#define MC3_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00613ecu)	/* Read Data and Bit Flip Register 38 */
#define MC3_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00613eeu)	/* Read Data and Bit Flip Register 39 */
#define MC3_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00613a8u)	/* Read Data and Bit Flip Register 4 */
#define MC3_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00613aau)	/* Read Data and Bit Flip Register 5 */
#define MC3_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00613acu)	/* Read Data and Bit Flip Register 6 */
#define MC3_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00613aeu)	/* Read Data and Bit Flip Register 7 */
#define MC3_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00613b0u)	/* Read Data and Bit Flip Register 8 */
#define MC3_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00613b2u)	/* Read Data and Bit Flip Register 9 */
#define MC40_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00638a0u)	/* Read Data and Bit Flip Register 0 */
#define MC40_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00638a2u)	/* Read Data and Bit Flip Register 1 */
#define MC40_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00638b4u)	/* Read Data and Bit Flip Register 10 */
#define MC40_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00638b6u)	/* Read Data and Bit Flip Register 11 */
#define MC40_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00638b8u)	/* Read Data and Bit Flip Register 12 */
#define MC40_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00638bau)	/* Read Data and Bit Flip Register 13 */
#define MC40_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00638bcu)	/* Read Data and Bit Flip Register 14 */
#define MC40_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00638beu)	/* Read Data and Bit Flip Register 15 */
#define MC40_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00638c0u)	/* Read Data and Bit Flip Register 16 */
#define MC40_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00638c2u)	/* Read Data and Bit Flip Register 17 */
#define MC40_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00638c4u)	/* Read Data and Bit Flip Register 18 */
#define MC40_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00638c6u)	/* Read Data and Bit Flip Register 19 */
#define MC40_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00638a4u)	/* Read Data and Bit Flip Register 2 */
#define MC40_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00638c8u)	/* Read Data and Bit Flip Register 20 */
#define MC40_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00638cau)	/* Read Data and Bit Flip Register 21 */
#define MC40_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00638ccu)	/* Read Data and Bit Flip Register 22 */
#define MC40_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00638ceu)	/* Read Data and Bit Flip Register 23 */
#define MC40_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00638d0u)	/* Read Data and Bit Flip Register 24 */
#define MC40_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00638d2u)	/* Read Data and Bit Flip Register 25 */
#define MC40_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00638d4u)	/* Read Data and Bit Flip Register 26 */
#define MC40_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00638d6u)	/* Read Data and Bit Flip Register 27 */
#define MC40_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00638d8u)	/* Read Data and Bit Flip Register 28 */
#define MC40_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00638dau)	/* Read Data and Bit Flip Register 29 */
#define MC40_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00638a6u)	/* Read Data and Bit Flip Register 3 */
#define MC40_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00638dcu)	/* Read Data and Bit Flip Register 30 */
#define MC40_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00638deu)	/* Read Data and Bit Flip Register 31 */
#define MC40_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00638e0u)	/* Read Data and Bit Flip Register 32 */
#define MC40_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00638e2u)	/* Read Data and Bit Flip Register 33 */
#define MC40_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00638e4u)	/* Read Data and Bit Flip Register 34 */
#define MC40_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00638e6u)	/* Read Data and Bit Flip Register 35 */
#define MC40_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00638e8u)	/* Read Data and Bit Flip Register 36 */
#define MC40_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00638eau)	/* Read Data and Bit Flip Register 37 */
#define MC40_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00638ecu)	/* Read Data and Bit Flip Register 38 */
#define MC40_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00638eeu)	/* Read Data and Bit Flip Register 39 */
#define MC40_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00638a8u)	/* Read Data and Bit Flip Register 4 */
#define MC40_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00638aau)	/* Read Data and Bit Flip Register 5 */
#define MC40_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00638acu)	/* Read Data and Bit Flip Register 6 */
#define MC40_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00638aeu)	/* Read Data and Bit Flip Register 7 */
#define MC40_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00638b0u)	/* Read Data and Bit Flip Register 8 */
#define MC40_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00638b2u)	/* Read Data and Bit Flip Register 9 */
#define MC41_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00639a0u)	/* Read Data and Bit Flip Register 0 */
#define MC41_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00639a2u)	/* Read Data and Bit Flip Register 1 */
#define MC41_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00639b4u)	/* Read Data and Bit Flip Register 10 */
#define MC41_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00639b6u)	/* Read Data and Bit Flip Register 11 */
#define MC41_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00639b8u)	/* Read Data and Bit Flip Register 12 */
#define MC41_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00639bau)	/* Read Data and Bit Flip Register 13 */
#define MC41_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00639bcu)	/* Read Data and Bit Flip Register 14 */
#define MC41_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00639beu)	/* Read Data and Bit Flip Register 15 */
#define MC41_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00639c0u)	/* Read Data and Bit Flip Register 16 */
#define MC41_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00639c2u)	/* Read Data and Bit Flip Register 17 */
#define MC41_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00639c4u)	/* Read Data and Bit Flip Register 18 */
#define MC41_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00639c6u)	/* Read Data and Bit Flip Register 19 */
#define MC41_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00639a4u)	/* Read Data and Bit Flip Register 2 */
#define MC41_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00639c8u)	/* Read Data and Bit Flip Register 20 */
#define MC41_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00639cau)	/* Read Data and Bit Flip Register 21 */
#define MC41_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00639ccu)	/* Read Data and Bit Flip Register 22 */
#define MC41_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00639ceu)	/* Read Data and Bit Flip Register 23 */
#define MC41_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00639d0u)	/* Read Data and Bit Flip Register 24 */
#define MC41_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00639d2u)	/* Read Data and Bit Flip Register 25 */
#define MC41_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00639d4u)	/* Read Data and Bit Flip Register 26 */
#define MC41_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00639d6u)	/* Read Data and Bit Flip Register 27 */
#define MC41_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00639d8u)	/* Read Data and Bit Flip Register 28 */
#define MC41_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00639dau)	/* Read Data and Bit Flip Register 29 */
#define MC41_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00639a6u)	/* Read Data and Bit Flip Register 3 */
#define MC41_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00639dcu)	/* Read Data and Bit Flip Register 30 */
#define MC41_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00639deu)	/* Read Data and Bit Flip Register 31 */
#define MC41_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00639e0u)	/* Read Data and Bit Flip Register 32 */
#define MC41_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00639e2u)	/* Read Data and Bit Flip Register 33 */
#define MC41_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00639e4u)	/* Read Data and Bit Flip Register 34 */
#define MC41_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00639e6u)	/* Read Data and Bit Flip Register 35 */
#define MC41_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00639e8u)	/* Read Data and Bit Flip Register 36 */
#define MC41_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00639eau)	/* Read Data and Bit Flip Register 37 */
#define MC41_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00639ecu)	/* Read Data and Bit Flip Register 38 */
#define MC41_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00639eeu)	/* Read Data and Bit Flip Register 39 */
#define MC41_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00639a8u)	/* Read Data and Bit Flip Register 4 */
#define MC41_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00639aau)	/* Read Data and Bit Flip Register 5 */
#define MC41_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00639acu)	/* Read Data and Bit Flip Register 6 */
#define MC41_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00639aeu)	/* Read Data and Bit Flip Register 7 */
#define MC41_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00639b0u)	/* Read Data and Bit Flip Register 8 */
#define MC41_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00639b2u)	/* Read Data and Bit Flip Register 9 */
#define MC42_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0063aa0u)	/* Read Data and Bit Flip Register 0 */
#define MC42_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0063aa2u)	/* Read Data and Bit Flip Register 1 */
#define MC42_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0063ab4u)	/* Read Data and Bit Flip Register 10 */
#define MC42_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0063ab6u)	/* Read Data and Bit Flip Register 11 */
#define MC42_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0063ab8u)	/* Read Data and Bit Flip Register 12 */
#define MC42_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0063abau)	/* Read Data and Bit Flip Register 13 */
#define MC42_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0063abcu)	/* Read Data and Bit Flip Register 14 */
#define MC42_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0063abeu)	/* Read Data and Bit Flip Register 15 */
#define MC42_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0063ac0u)	/* Read Data and Bit Flip Register 16 */
#define MC42_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0063ac2u)	/* Read Data and Bit Flip Register 17 */
#define MC42_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0063ac4u)	/* Read Data and Bit Flip Register 18 */
#define MC42_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0063ac6u)	/* Read Data and Bit Flip Register 19 */
#define MC42_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0063aa4u)	/* Read Data and Bit Flip Register 2 */
#define MC42_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0063ac8u)	/* Read Data and Bit Flip Register 20 */
#define MC42_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0063acau)	/* Read Data and Bit Flip Register 21 */
#define MC42_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0063accu)	/* Read Data and Bit Flip Register 22 */
#define MC42_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0063aceu)	/* Read Data and Bit Flip Register 23 */
#define MC42_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0063ad0u)	/* Read Data and Bit Flip Register 24 */
#define MC42_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0063ad2u)	/* Read Data and Bit Flip Register 25 */
#define MC42_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0063ad4u)	/* Read Data and Bit Flip Register 26 */
