svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC42_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0063ad6u)	/* Read Data and Bit Flip Register 27 */
#define MC42_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0063ad8u)	/* Read Data and Bit Flip Register 28 */
#define MC42_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0063adau)	/* Read Data and Bit Flip Register 29 */
#define MC42_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0063aa6u)	/* Read Data and Bit Flip Register 3 */
#define MC42_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0063adcu)	/* Read Data and Bit Flip Register 30 */
#define MC42_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0063adeu)	/* Read Data and Bit Flip Register 31 */
#define MC42_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0063ae0u)	/* Read Data and Bit Flip Register 32 */
#define MC42_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0063ae2u)	/* Read Data and Bit Flip Register 33 */
#define MC42_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0063ae4u)	/* Read Data and Bit Flip Register 34 */
#define MC42_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0063ae6u)	/* Read Data and Bit Flip Register 35 */
#define MC42_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0063ae8u)	/* Read Data and Bit Flip Register 36 */
#define MC42_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0063aeau)	/* Read Data and Bit Flip Register 37 */
#define MC42_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0063aecu)	/* Read Data and Bit Flip Register 38 */
#define MC42_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0063aeeu)	/* Read Data and Bit Flip Register 39 */
#define MC42_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0063aa8u)	/* Read Data and Bit Flip Register 4 */
#define MC42_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0063aaau)	/* Read Data and Bit Flip Register 5 */
#define MC42_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0063aacu)	/* Read Data and Bit Flip Register 6 */
#define MC42_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0063aaeu)	/* Read Data and Bit Flip Register 7 */
#define MC42_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0063ab0u)	/* Read Data and Bit Flip Register 8 */
#define MC42_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0063ab2u)	/* Read Data and Bit Flip Register 9 */
#define MC43_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0063ba0u)	/* Read Data and Bit Flip Register 0 */
#define MC43_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0063ba2u)	/* Read Data and Bit Flip Register 1 */
#define MC43_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0063bb4u)	/* Read Data and Bit Flip Register 10 */
#define MC43_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0063bb6u)	/* Read Data and Bit Flip Register 11 */
#define MC43_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0063bb8u)	/* Read Data and Bit Flip Register 12 */
#define MC43_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0063bbau)	/* Read Data and Bit Flip Register 13 */
#define MC43_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0063bbcu)	/* Read Data and Bit Flip Register 14 */
#define MC43_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0063bbeu)	/* Read Data and Bit Flip Register 15 */
#define MC43_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0063bc0u)	/* Read Data and Bit Flip Register 16 */
#define MC43_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0063bc2u)	/* Read Data and Bit Flip Register 17 */
#define MC43_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0063bc4u)	/* Read Data and Bit Flip Register 18 */
#define MC43_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0063bc6u)	/* Read Data and Bit Flip Register 19 */
#define MC43_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0063ba4u)	/* Read Data and Bit Flip Register 2 */
#define MC43_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0063bc8u)	/* Read Data and Bit Flip Register 20 */
#define MC43_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0063bcau)	/* Read Data and Bit Flip Register 21 */
#define MC43_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0063bccu)	/* Read Data and Bit Flip Register 22 */
#define MC43_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0063bceu)	/* Read Data and Bit Flip Register 23 */
#define MC43_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0063bd0u)	/* Read Data and Bit Flip Register 24 */
#define MC43_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0063bd2u)	/* Read Data and Bit Flip Register 25 */
#define MC43_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0063bd4u)	/* Read Data and Bit Flip Register 26 */
#define MC43_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0063bd6u)	/* Read Data and Bit Flip Register 27 */
#define MC43_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0063bd8u)	/* Read Data and Bit Flip Register 28 */
#define MC43_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0063bdau)	/* Read Data and Bit Flip Register 29 */
#define MC43_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0063ba6u)	/* Read Data and Bit Flip Register 3 */
#define MC43_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0063bdcu)	/* Read Data and Bit Flip Register 30 */
#define MC43_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0063bdeu)	/* Read Data and Bit Flip Register 31 */
#define MC43_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0063be0u)	/* Read Data and Bit Flip Register 32 */
#define MC43_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0063be2u)	/* Read Data and Bit Flip Register 33 */
#define MC43_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0063be4u)	/* Read Data and Bit Flip Register 34 */
#define MC43_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0063be6u)	/* Read Data and Bit Flip Register 35 */
#define MC43_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0063be8u)	/* Read Data and Bit Flip Register 36 */
#define MC43_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0063beau)	/* Read Data and Bit Flip Register 37 */
#define MC43_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0063becu)	/* Read Data and Bit Flip Register 38 */
#define MC43_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0063beeu)	/* Read Data and Bit Flip Register 39 */
#define MC43_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0063ba8u)	/* Read Data and Bit Flip Register 4 */
#define MC43_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0063baau)	/* Read Data and Bit Flip Register 5 */
#define MC43_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0063bacu)	/* Read Data and Bit Flip Register 6 */
#define MC43_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0063baeu)	/* Read Data and Bit Flip Register 7 */
#define MC43_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0063bb0u)	/* Read Data and Bit Flip Register 8 */
#define MC43_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0063bb2u)	/* Read Data and Bit Flip Register 9 */
#define MC44_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0063ca0u)	/* Read Data and Bit Flip Register 0 */
#define MC44_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0063ca2u)	/* Read Data and Bit Flip Register 1 */
#define MC44_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0063cb4u)	/* Read Data and Bit Flip Register 10 */
#define MC44_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0063cb6u)	/* Read Data and Bit Flip Register 11 */
#define MC44_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0063cb8u)	/* Read Data and Bit Flip Register 12 */
#define MC44_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0063cbau)	/* Read Data and Bit Flip Register 13 */
#define MC44_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0063cbcu)	/* Read Data and Bit Flip Register 14 */
#define MC44_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0063cbeu)	/* Read Data and Bit Flip Register 15 */
#define MC44_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0063cc0u)	/* Read Data and Bit Flip Register 16 */
#define MC44_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0063cc2u)	/* Read Data and Bit Flip Register 17 */
#define MC44_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0063cc4u)	/* Read Data and Bit Flip Register 18 */
#define MC44_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0063cc6u)	/* Read Data and Bit Flip Register 19 */
#define MC44_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0063ca4u)	/* Read Data and Bit Flip Register 2 */
#define MC44_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0063cc8u)	/* Read Data and Bit Flip Register 20 */
#define MC44_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0063ccau)	/* Read Data and Bit Flip Register 21 */
#define MC44_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0063cccu)	/* Read Data and Bit Flip Register 22 */
#define MC44_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0063cceu)	/* Read Data and Bit Flip Register 23 */
#define MC44_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0063cd0u)	/* Read Data and Bit Flip Register 24 */
#define MC44_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0063cd2u)	/* Read Data and Bit Flip Register 25 */
#define MC44_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0063cd4u)	/* Read Data and Bit Flip Register 26 */
#define MC44_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0063cd6u)	/* Read Data and Bit Flip Register 27 */
#define MC44_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0063cd8u)	/* Read Data and Bit Flip Register 28 */
#define MC44_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0063cdau)	/* Read Data and Bit Flip Register 29 */
#define MC44_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0063ca6u)	/* Read Data and Bit Flip Register 3 */
#define MC44_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0063cdcu)	/* Read Data and Bit Flip Register 30 */
#define MC44_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0063cdeu)	/* Read Data and Bit Flip Register 31 */
#define MC44_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0063ce0u)	/* Read Data and Bit Flip Register 32 */
#define MC44_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0063ce2u)	/* Read Data and Bit Flip Register 33 */
#define MC44_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0063ce4u)	/* Read Data and Bit Flip Register 34 */
#define MC44_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0063ce6u)	/* Read Data and Bit Flip Register 35 */
#define MC44_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0063ce8u)	/* Read Data and Bit Flip Register 36 */
#define MC44_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0063ceau)	/* Read Data and Bit Flip Register 37 */
#define MC44_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0063cecu)	/* Read Data and Bit Flip Register 38 */
#define MC44_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0063ceeu)	/* Read Data and Bit Flip Register 39 */
#define MC44_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0063ca8u)	/* Read Data and Bit Flip Register 4 */
#define MC44_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0063caau)	/* Read Data and Bit Flip Register 5 */
#define MC44_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0063cacu)	/* Read Data and Bit Flip Register 6 */
#define MC44_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0063caeu)	/* Read Data and Bit Flip Register 7 */
#define MC44_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0063cb0u)	/* Read Data and Bit Flip Register 8 */
#define MC44_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0063cb2u)	/* Read Data and Bit Flip Register 9 */
#define MC45_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0063da0u)	/* Read Data and Bit Flip Register 0 */
#define MC45_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0063da2u)	/* Read Data and Bit Flip Register 1 */
#define MC45_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0063db4u)	/* Read Data and Bit Flip Register 10 */
#define MC45_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0063db6u)	/* Read Data and Bit Flip Register 11 */
#define MC45_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0063db8u)	/* Read Data and Bit Flip Register 12 */
#define MC45_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0063dbau)	/* Read Data and Bit Flip Register 13 */
#define MC45_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0063dbcu)	/* Read Data and Bit Flip Register 14 */
#define MC45_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0063dbeu)	/* Read Data and Bit Flip Register 15 */
#define MC45_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0063dc0u)	/* Read Data and Bit Flip Register 16 */
#define MC45_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0063dc2u)	/* Read Data and Bit Flip Register 17 */
#define MC45_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0063dc4u)	/* Read Data and Bit Flip Register 18 */
#define MC45_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0063dc6u)	/* Read Data and Bit Flip Register 19 */
#define MC45_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0063da4u)	/* Read Data and Bit Flip Register 2 */
#define MC45_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0063dc8u)	/* Read Data and Bit Flip Register 20 */
#define MC45_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0063dcau)	/* Read Data and Bit Flip Register 21 */
#define MC45_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0063dccu)	/* Read Data and Bit Flip Register 22 */
#define MC45_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0063dceu)	/* Read Data and Bit Flip Register 23 */
#define MC45_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0063dd0u)	/* Read Data and Bit Flip Register 24 */
#define MC45_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0063dd2u)	/* Read Data and Bit Flip Register 25 */
#define MC45_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0063dd4u)	/* Read Data and Bit Flip Register 26 */
#define MC45_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0063dd6u)	/* Read Data and Bit Flip Register 27 */
#define MC45_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0063dd8u)	/* Read Data and Bit Flip Register 28 */
#define MC45_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0063ddau)	/* Read Data and Bit Flip Register 29 */
#define MC45_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0063da6u)	/* Read Data and Bit Flip Register 3 */
#define MC45_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0063ddcu)	/* Read Data and Bit Flip Register 30 */
#define MC45_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0063ddeu)	/* Read Data and Bit Flip Register 31 */
#define MC45_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0063de0u)	/* Read Data and Bit Flip Register 32 */
#define MC45_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0063de2u)	/* Read Data and Bit Flip Register 33 */
#define MC45_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0063de4u)	/* Read Data and Bit Flip Register 34 */
#define MC45_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0063de6u)	/* Read Data and Bit Flip Register 35 */
#define MC45_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0063de8u)	/* Read Data and Bit Flip Register 36 */
#define MC45_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0063deau)	/* Read Data and Bit Flip Register 37 */
#define MC45_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0063decu)	/* Read Data and Bit Flip Register 38 */
#define MC45_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0063deeu)	/* Read Data and Bit Flip Register 39 */
#define MC45_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0063da8u)	/* Read Data and Bit Flip Register 4 */
#define MC45_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0063daau)	/* Read Data and Bit Flip Register 5 */
#define MC45_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0063dacu)	/* Read Data and Bit Flip Register 6 */
#define MC45_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0063daeu)	/* Read Data and Bit Flip Register 7 */
#define MC45_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0063db0u)	/* Read Data and Bit Flip Register 8 */
#define MC45_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0063db2u)	/* Read Data and Bit Flip Register 9 */
#define MC46_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0063ea0u)	/* Read Data and Bit Flip Register 0 */
#define MC46_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0063ea2u)	/* Read Data and Bit Flip Register 1 */
#define MC46_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0063eb4u)	/* Read Data and Bit Flip Register 10 */
#define MC46_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0063eb6u)	/* Read Data and Bit Flip Register 11 */
#define MC46_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0063eb8u)	/* Read Data and Bit Flip Register 12 */
#define MC46_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0063ebau)	/* Read Data and Bit Flip Register 13 */
#define MC46_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0063ebcu)	/* Read Data and Bit Flip Register 14 */
#define MC46_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0063ebeu)	/* Read Data and Bit Flip Register 15 */
#define MC46_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0063ec0u)	/* Read Data and Bit Flip Register 16 */
#define MC46_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0063ec2u)	/* Read Data and Bit Flip Register 17 */
#define MC46_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0063ec4u)	/* Read Data and Bit Flip Register 18 */
#define MC46_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0063ec6u)	/* Read Data and Bit Flip Register 19 */
#define MC46_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0063ea4u)	/* Read Data and Bit Flip Register 2 */
#define MC46_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0063ec8u)	/* Read Data and Bit Flip Register 20 */
#define MC46_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0063ecau)	/* Read Data and Bit Flip Register 21 */
#define MC46_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0063eccu)	/* Read Data and Bit Flip Register 22 */
#define MC46_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0063eceu)	/* Read Data and Bit Flip Register 23 */
#define MC46_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0063ed0u)	/* Read Data and Bit Flip Register 24 */
#define MC46_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0063ed2u)	/* Read Data and Bit Flip Register 25 */
#define MC46_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0063ed4u)	/* Read Data and Bit Flip Register 26 */
#define MC46_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0063ed6u)	/* Read Data and Bit Flip Register 27 */
#define MC46_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0063ed8u)	/* Read Data and Bit Flip Register 28 */
#define MC46_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0063edau)	/* Read Data and Bit Flip Register 29 */
#define MC46_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0063ea6u)	/* Read Data and Bit Flip Register 3 */
#define MC46_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0063edcu)	/* Read Data and Bit Flip Register 30 */
#define MC46_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0063edeu)	/* Read Data and Bit Flip Register 31 */
#define MC46_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0063ee0u)	/* Read Data and Bit Flip Register 32 */
#define MC46_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0063ee2u)	/* Read Data and Bit Flip Register 33 */
#define MC46_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0063ee4u)	/* Read Data and Bit Flip Register 34 */
#define MC46_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0063ee6u)	/* Read Data and Bit Flip Register 35 */
#define MC46_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0063ee8u)	/* Read Data and Bit Flip Register 36 */
#define MC46_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0063eeau)	/* Read Data and Bit Flip Register 37 */
#define MC46_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0063eecu)	/* Read Data and Bit Flip Register 38 */
#define MC46_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0063eeeu)	/* Read Data and Bit Flip Register 39 */
#define MC46_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0063ea8u)	/* Read Data and Bit Flip Register 4 */
#define MC46_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0063eaau)	/* Read Data and Bit Flip Register 5 */
#define MC46_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0063eacu)	/* Read Data and Bit Flip Register 6 */
#define MC46_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0063eaeu)	/* Read Data and Bit Flip Register 7 */
#define MC46_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0063eb0u)	/* Read Data and Bit Flip Register 8 */
#define MC46_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0063eb2u)	/* Read Data and Bit Flip Register 9 */
#define MC47_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0063fa0u)	/* Read Data and Bit Flip Register 0 */
#define MC47_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0063fa2u)	/* Read Data and Bit Flip Register 1 */
#define MC47_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0063fb4u)	/* Read Data and Bit Flip Register 10 */
#define MC47_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0063fb6u)	/* Read Data and Bit Flip Register 11 */
#define MC47_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0063fb8u)	/* Read Data and Bit Flip Register 12 */
#define MC47_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0063fbau)	/* Read Data and Bit Flip Register 13 */
#define MC47_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0063fbcu)	/* Read Data and Bit Flip Register 14 */
#define MC47_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0063fbeu)	/* Read Data and Bit Flip Register 15 */
#define MC47_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0063fc0u)	/* Read Data and Bit Flip Register 16 */
#define MC47_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0063fc2u)	/* Read Data and Bit Flip Register 17 */
#define MC47_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0063fc4u)	/* Read Data and Bit Flip Register 18 */
#define MC47_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0063fc6u)	/* Read Data and Bit Flip Register 19 */
#define MC47_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0063fa4u)	/* Read Data and Bit Flip Register 2 */
#define MC47_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0063fc8u)	/* Read Data and Bit Flip Register 20 */
#define MC47_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0063fcau)	/* Read Data and Bit Flip Register 21 */
#define MC47_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0063fccu)	/* Read Data and Bit Flip Register 22 */
#define MC47_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0063fceu)	/* Read Data and Bit Flip Register 23 */
#define MC47_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0063fd0u)	/* Read Data and Bit Flip Register 24 */
#define MC47_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0063fd2u)	/* Read Data and Bit Flip Register 25 */
#define MC47_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0063fd4u)	/* Read Data and Bit Flip Register 26 */
#define MC47_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0063fd6u)	/* Read Data and Bit Flip Register 27 */
#define MC47_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0063fd8u)	/* Read Data and Bit Flip Register 28 */
#define MC47_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0063fdau)	/* Read Data and Bit Flip Register 29 */
#define MC47_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0063fa6u)	/* Read Data and Bit Flip Register 3 */
#define MC47_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0063fdcu)	/* Read Data and Bit Flip Register 30 */
#define MC47_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0063fdeu)	/* Read Data and Bit Flip Register 31 */
#define MC47_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0063fe0u)	/* Read Data and Bit Flip Register 32 */
#define MC47_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0063fe2u)	/* Read Data and Bit Flip Register 33 */
#define MC47_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0063fe4u)	/* Read Data and Bit Flip Register 34 */
#define MC47_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0063fe6u)	/* Read Data and Bit Flip Register 35 */
#define MC47_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0063fe8u)	/* Read Data and Bit Flip Register 36 */
#define MC47_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0063feau)	/* Read Data and Bit Flip Register 37 */
#define MC47_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0063fecu)	/* Read Data and Bit Flip Register 38 */
#define MC47_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0063feeu)	/* Read Data and Bit Flip Register 39 */
#define MC47_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0063fa8u)	/* Read Data and Bit Flip Register 4 */
#define MC47_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0063faau)	/* Read Data and Bit Flip Register 5 */
#define MC47_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0063facu)	/* Read Data and Bit Flip Register 6 */
#define MC47_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0063faeu)	/* Read Data and Bit Flip Register 7 */
#define MC47_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0063fb0u)	/* Read Data and Bit Flip Register 8 */
#define MC47_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0063fb2u)	/* Read Data and Bit Flip Register 9 */
#define MC48_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00640a0u)	/* Read Data and Bit Flip Register 0 */
#define MC48_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00640a2u)	/* Read Data and Bit Flip Register 1 */
#define MC48_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00640b4u)	/* Read Data and Bit Flip Register 10 */
#define MC48_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00640b6u)	/* Read Data and Bit Flip Register 11 */
#define MC48_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00640b8u)	/* Read Data and Bit Flip Register 12 */
#define MC48_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00640bau)	/* Read Data and Bit Flip Register 13 */
#define MC48_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00640bcu)	/* Read Data and Bit Flip Register 14 */
#define MC48_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00640beu)	/* Read Data and Bit Flip Register 15 */
#define MC48_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00640c0u)	/* Read Data and Bit Flip Register 16 */
#define MC48_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00640c2u)	/* Read Data and Bit Flip Register 17 */
#define MC48_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00640c4u)	/* Read Data and Bit Flip Register 18 */
#define MC48_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00640c6u)	/* Read Data and Bit Flip Register 19 */
#define MC48_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00640a4u)	/* Read Data and Bit Flip Register 2 */
#define MC48_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00640c8u)	/* Read Data and Bit Flip Register 20 */
#define MC48_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00640cau)	/* Read Data and Bit Flip Register 21 */
#define MC48_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00640ccu)	/* Read Data and Bit Flip Register 22 */
#define MC48_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00640ceu)	/* Read Data and Bit Flip Register 23 */
#define MC48_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00640d0u)	/* Read Data and Bit Flip Register 24 */
#define MC48_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00640d2u)	/* Read Data and Bit Flip Register 25 */
#define MC48_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00640d4u)	/* Read Data and Bit Flip Register 26 */
#define MC48_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00640d6u)	/* Read Data and Bit Flip Register 27 */
#define MC48_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00640d8u)	/* Read Data and Bit Flip Register 28 */
#define MC48_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00640dau)	/* Read Data and Bit Flip Register 29 */
