svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC48_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00640a6u)	/* Read Data and Bit Flip Register 3 */
#define MC48_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00640dcu)	/* Read Data and Bit Flip Register 30 */
#define MC48_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00640deu)	/* Read Data and Bit Flip Register 31 */
#define MC48_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00640e0u)	/* Read Data and Bit Flip Register 32 */
#define MC48_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00640e2u)	/* Read Data and Bit Flip Register 33 */
#define MC48_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00640e4u)	/* Read Data and Bit Flip Register 34 */
#define MC48_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00640e6u)	/* Read Data and Bit Flip Register 35 */
#define MC48_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00640e8u)	/* Read Data and Bit Flip Register 36 */
#define MC48_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00640eau)	/* Read Data and Bit Flip Register 37 */
#define MC48_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00640ecu)	/* Read Data and Bit Flip Register 38 */
#define MC48_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00640eeu)	/* Read Data and Bit Flip Register 39 */
#define MC48_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00640a8u)	/* Read Data and Bit Flip Register 4 */
#define MC48_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00640aau)	/* Read Data and Bit Flip Register 5 */
#define MC48_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00640acu)	/* Read Data and Bit Flip Register 6 */
#define MC48_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00640aeu)	/* Read Data and Bit Flip Register 7 */
#define MC48_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00640b0u)	/* Read Data and Bit Flip Register 8 */
#define MC48_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00640b2u)	/* Read Data and Bit Flip Register 9 */
#define MC49_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00641a0u)	/* Read Data and Bit Flip Register 0 */
#define MC49_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00641a2u)	/* Read Data and Bit Flip Register 1 */
#define MC49_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00641b4u)	/* Read Data and Bit Flip Register 10 */
#define MC49_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00641b6u)	/* Read Data and Bit Flip Register 11 */
#define MC49_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00641b8u)	/* Read Data and Bit Flip Register 12 */
#define MC49_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00641bau)	/* Read Data and Bit Flip Register 13 */
#define MC49_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00641bcu)	/* Read Data and Bit Flip Register 14 */
#define MC49_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00641beu)	/* Read Data and Bit Flip Register 15 */
#define MC49_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00641c0u)	/* Read Data and Bit Flip Register 16 */
#define MC49_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00641c2u)	/* Read Data and Bit Flip Register 17 */
#define MC49_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00641c4u)	/* Read Data and Bit Flip Register 18 */
#define MC49_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00641c6u)	/* Read Data and Bit Flip Register 19 */
#define MC49_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00641a4u)	/* Read Data and Bit Flip Register 2 */
#define MC49_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00641c8u)	/* Read Data and Bit Flip Register 20 */
#define MC49_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00641cau)	/* Read Data and Bit Flip Register 21 */
#define MC49_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00641ccu)	/* Read Data and Bit Flip Register 22 */
#define MC49_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00641ceu)	/* Read Data and Bit Flip Register 23 */
#define MC49_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00641d0u)	/* Read Data and Bit Flip Register 24 */
#define MC49_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00641d2u)	/* Read Data and Bit Flip Register 25 */
#define MC49_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00641d4u)	/* Read Data and Bit Flip Register 26 */
#define MC49_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00641d6u)	/* Read Data and Bit Flip Register 27 */
#define MC49_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00641d8u)	/* Read Data and Bit Flip Register 28 */
#define MC49_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00641dau)	/* Read Data and Bit Flip Register 29 */
#define MC49_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00641a6u)	/* Read Data and Bit Flip Register 3 */
#define MC49_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00641dcu)	/* Read Data and Bit Flip Register 30 */
#define MC49_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00641deu)	/* Read Data and Bit Flip Register 31 */
#define MC49_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00641e0u)	/* Read Data and Bit Flip Register 32 */
#define MC49_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00641e2u)	/* Read Data and Bit Flip Register 33 */
#define MC49_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00641e4u)	/* Read Data and Bit Flip Register 34 */
#define MC49_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00641e6u)	/* Read Data and Bit Flip Register 35 */
#define MC49_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00641e8u)	/* Read Data and Bit Flip Register 36 */
#define MC49_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00641eau)	/* Read Data and Bit Flip Register 37 */
#define MC49_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00641ecu)	/* Read Data and Bit Flip Register 38 */
#define MC49_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00641eeu)	/* Read Data and Bit Flip Register 39 */
#define MC49_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00641a8u)	/* Read Data and Bit Flip Register 4 */
#define MC49_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00641aau)	/* Read Data and Bit Flip Register 5 */
#define MC49_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00641acu)	/* Read Data and Bit Flip Register 6 */
#define MC49_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00641aeu)	/* Read Data and Bit Flip Register 7 */
#define MC49_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00641b0u)	/* Read Data and Bit Flip Register 8 */
#define MC49_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00641b2u)	/* Read Data and Bit Flip Register 9 */
#define MC4_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00614a0u)	/* Read Data and Bit Flip Register 0 */
#define MC4_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00614a2u)	/* Read Data and Bit Flip Register 1 */
#define MC4_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00614b4u)	/* Read Data and Bit Flip Register 10 */
#define MC4_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00614b6u)	/* Read Data and Bit Flip Register 11 */
#define MC4_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00614b8u)	/* Read Data and Bit Flip Register 12 */
#define MC4_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00614bau)	/* Read Data and Bit Flip Register 13 */
#define MC4_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00614bcu)	/* Read Data and Bit Flip Register 14 */
#define MC4_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00614beu)	/* Read Data and Bit Flip Register 15 */
#define MC4_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00614c0u)	/* Read Data and Bit Flip Register 16 */
#define MC4_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00614c2u)	/* Read Data and Bit Flip Register 17 */
#define MC4_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00614c4u)	/* Read Data and Bit Flip Register 18 */
#define MC4_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00614c6u)	/* Read Data and Bit Flip Register 19 */
#define MC4_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00614a4u)	/* Read Data and Bit Flip Register 2 */
#define MC4_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00614c8u)	/* Read Data and Bit Flip Register 20 */
#define MC4_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00614cau)	/* Read Data and Bit Flip Register 21 */
#define MC4_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00614ccu)	/* Read Data and Bit Flip Register 22 */
#define MC4_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00614ceu)	/* Read Data and Bit Flip Register 23 */
#define MC4_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00614d0u)	/* Read Data and Bit Flip Register 24 */
#define MC4_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00614d2u)	/* Read Data and Bit Flip Register 25 */
#define MC4_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00614d4u)	/* Read Data and Bit Flip Register 26 */
#define MC4_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00614d6u)	/* Read Data and Bit Flip Register 27 */
#define MC4_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00614d8u)	/* Read Data and Bit Flip Register 28 */
#define MC4_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00614dau)	/* Read Data and Bit Flip Register 29 */
#define MC4_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00614a6u)	/* Read Data and Bit Flip Register 3 */
#define MC4_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00614dcu)	/* Read Data and Bit Flip Register 30 */
#define MC4_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00614deu)	/* Read Data and Bit Flip Register 31 */
#define MC4_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00614e0u)	/* Read Data and Bit Flip Register 32 */
#define MC4_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00614e2u)	/* Read Data and Bit Flip Register 33 */
#define MC4_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00614e4u)	/* Read Data and Bit Flip Register 34 */
#define MC4_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00614e6u)	/* Read Data and Bit Flip Register 35 */
#define MC4_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00614e8u)	/* Read Data and Bit Flip Register 36 */
#define MC4_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00614eau)	/* Read Data and Bit Flip Register 37 */
#define MC4_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00614ecu)	/* Read Data and Bit Flip Register 38 */
#define MC4_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00614eeu)	/* Read Data and Bit Flip Register 39 */
#define MC4_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00614a8u)	/* Read Data and Bit Flip Register 4 */
#define MC4_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00614aau)	/* Read Data and Bit Flip Register 5 */
#define MC4_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00614acu)	/* Read Data and Bit Flip Register 6 */
#define MC4_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00614aeu)	/* Read Data and Bit Flip Register 7 */
#define MC4_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00614b0u)	/* Read Data and Bit Flip Register 8 */
#define MC4_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00614b2u)	/* Read Data and Bit Flip Register 9 */
#define MC50_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00642a0u)	/* Read Data and Bit Flip Register 0 */
#define MC50_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00642a2u)	/* Read Data and Bit Flip Register 1 */
#define MC50_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00642b4u)	/* Read Data and Bit Flip Register 10 */
#define MC50_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00642b6u)	/* Read Data and Bit Flip Register 11 */
#define MC50_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00642b8u)	/* Read Data and Bit Flip Register 12 */
#define MC50_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00642bau)	/* Read Data and Bit Flip Register 13 */
#define MC50_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00642bcu)	/* Read Data and Bit Flip Register 14 */
#define MC50_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00642beu)	/* Read Data and Bit Flip Register 15 */
#define MC50_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00642c0u)	/* Read Data and Bit Flip Register 16 */
#define MC50_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00642c2u)	/* Read Data and Bit Flip Register 17 */
#define MC50_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00642c4u)	/* Read Data and Bit Flip Register 18 */
#define MC50_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00642c6u)	/* Read Data and Bit Flip Register 19 */
#define MC50_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00642a4u)	/* Read Data and Bit Flip Register 2 */
#define MC50_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00642c8u)	/* Read Data and Bit Flip Register 20 */
#define MC50_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00642cau)	/* Read Data and Bit Flip Register 21 */
#define MC50_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00642ccu)	/* Read Data and Bit Flip Register 22 */
#define MC50_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00642ceu)	/* Read Data and Bit Flip Register 23 */
#define MC50_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00642d0u)	/* Read Data and Bit Flip Register 24 */
#define MC50_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00642d2u)	/* Read Data and Bit Flip Register 25 */
#define MC50_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00642d4u)	/* Read Data and Bit Flip Register 26 */
#define MC50_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00642d6u)	/* Read Data and Bit Flip Register 27 */
#define MC50_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00642d8u)	/* Read Data and Bit Flip Register 28 */
#define MC50_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00642dau)	/* Read Data and Bit Flip Register 29 */
#define MC50_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00642a6u)	/* Read Data and Bit Flip Register 3 */
#define MC50_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00642dcu)	/* Read Data and Bit Flip Register 30 */
#define MC50_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00642deu)	/* Read Data and Bit Flip Register 31 */
#define MC50_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00642e0u)	/* Read Data and Bit Flip Register 32 */
#define MC50_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00642e2u)	/* Read Data and Bit Flip Register 33 */
#define MC50_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00642e4u)	/* Read Data and Bit Flip Register 34 */
#define MC50_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00642e6u)	/* Read Data and Bit Flip Register 35 */
#define MC50_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00642e8u)	/* Read Data and Bit Flip Register 36 */
#define MC50_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00642eau)	/* Read Data and Bit Flip Register 37 */
#define MC50_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00642ecu)	/* Read Data and Bit Flip Register 38 */
#define MC50_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00642eeu)	/* Read Data and Bit Flip Register 39 */
#define MC50_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00642a8u)	/* Read Data and Bit Flip Register 4 */
#define MC50_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00642aau)	/* Read Data and Bit Flip Register 5 */
#define MC50_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00642acu)	/* Read Data and Bit Flip Register 6 */
#define MC50_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00642aeu)	/* Read Data and Bit Flip Register 7 */
#define MC50_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00642b0u)	/* Read Data and Bit Flip Register 8 */
#define MC50_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00642b2u)	/* Read Data and Bit Flip Register 9 */
#define MC51_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00643a0u)	/* Read Data and Bit Flip Register 0 */
#define MC51_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00643a2u)	/* Read Data and Bit Flip Register 1 */
#define MC51_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00643b4u)	/* Read Data and Bit Flip Register 10 */
#define MC51_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00643b6u)	/* Read Data and Bit Flip Register 11 */
#define MC51_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00643b8u)	/* Read Data and Bit Flip Register 12 */
#define MC51_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00643bau)	/* Read Data and Bit Flip Register 13 */
#define MC51_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00643bcu)	/* Read Data and Bit Flip Register 14 */
#define MC51_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00643beu)	/* Read Data and Bit Flip Register 15 */
#define MC51_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00643c0u)	/* Read Data and Bit Flip Register 16 */
#define MC51_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00643c2u)	/* Read Data and Bit Flip Register 17 */
#define MC51_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00643c4u)	/* Read Data and Bit Flip Register 18 */
#define MC51_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00643c6u)	/* Read Data and Bit Flip Register 19 */
#define MC51_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00643a4u)	/* Read Data and Bit Flip Register 2 */
#define MC51_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00643c8u)	/* Read Data and Bit Flip Register 20 */
#define MC51_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00643cau)	/* Read Data and Bit Flip Register 21 */
#define MC51_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00643ccu)	/* Read Data and Bit Flip Register 22 */
#define MC51_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00643ceu)	/* Read Data and Bit Flip Register 23 */
#define MC51_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00643d0u)	/* Read Data and Bit Flip Register 24 */
#define MC51_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00643d2u)	/* Read Data and Bit Flip Register 25 */
#define MC51_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00643d4u)	/* Read Data and Bit Flip Register 26 */
#define MC51_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00643d6u)	/* Read Data and Bit Flip Register 27 */
#define MC51_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00643d8u)	/* Read Data and Bit Flip Register 28 */
#define MC51_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00643dau)	/* Read Data and Bit Flip Register 29 */
#define MC51_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00643a6u)	/* Read Data and Bit Flip Register 3 */
#define MC51_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00643dcu)	/* Read Data and Bit Flip Register 30 */
#define MC51_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00643deu)	/* Read Data and Bit Flip Register 31 */
#define MC51_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00643e0u)	/* Read Data and Bit Flip Register 32 */
#define MC51_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00643e2u)	/* Read Data and Bit Flip Register 33 */
#define MC51_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00643e4u)	/* Read Data and Bit Flip Register 34 */
#define MC51_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00643e6u)	/* Read Data and Bit Flip Register 35 */
#define MC51_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00643e8u)	/* Read Data and Bit Flip Register 36 */
#define MC51_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00643eau)	/* Read Data and Bit Flip Register 37 */
#define MC51_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00643ecu)	/* Read Data and Bit Flip Register 38 */
#define MC51_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00643eeu)	/* Read Data and Bit Flip Register 39 */
#define MC51_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00643a8u)	/* Read Data and Bit Flip Register 4 */
#define MC51_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00643aau)	/* Read Data and Bit Flip Register 5 */
#define MC51_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00643acu)	/* Read Data and Bit Flip Register 6 */
#define MC51_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00643aeu)	/* Read Data and Bit Flip Register 7 */
#define MC51_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00643b0u)	/* Read Data and Bit Flip Register 8 */
#define MC51_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00643b2u)	/* Read Data and Bit Flip Register 9 */
#define MC52_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00644a0u)	/* Read Data and Bit Flip Register 0 */
#define MC52_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00644a2u)	/* Read Data and Bit Flip Register 1 */
#define MC52_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00644b4u)	/* Read Data and Bit Flip Register 10 */
#define MC52_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00644b6u)	/* Read Data and Bit Flip Register 11 */
#define MC52_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00644b8u)	/* Read Data and Bit Flip Register 12 */
#define MC52_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00644bau)	/* Read Data and Bit Flip Register 13 */
#define MC52_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00644bcu)	/* Read Data and Bit Flip Register 14 */
#define MC52_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00644beu)	/* Read Data and Bit Flip Register 15 */
#define MC52_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00644c0u)	/* Read Data and Bit Flip Register 16 */
#define MC52_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00644c2u)	/* Read Data and Bit Flip Register 17 */
#define MC52_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00644c4u)	/* Read Data and Bit Flip Register 18 */
#define MC52_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00644c6u)	/* Read Data and Bit Flip Register 19 */
#define MC52_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00644a4u)	/* Read Data and Bit Flip Register 2 */
#define MC52_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00644c8u)	/* Read Data and Bit Flip Register 20 */
#define MC52_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00644cau)	/* Read Data and Bit Flip Register 21 */
#define MC52_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00644ccu)	/* Read Data and Bit Flip Register 22 */
#define MC52_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00644ceu)	/* Read Data and Bit Flip Register 23 */
#define MC52_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00644d0u)	/* Read Data and Bit Flip Register 24 */
#define MC52_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00644d2u)	/* Read Data and Bit Flip Register 25 */
#define MC52_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00644d4u)	/* Read Data and Bit Flip Register 26 */
#define MC52_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00644d6u)	/* Read Data and Bit Flip Register 27 */
#define MC52_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00644d8u)	/* Read Data and Bit Flip Register 28 */
#define MC52_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00644dau)	/* Read Data and Bit Flip Register 29 */
#define MC52_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00644a6u)	/* Read Data and Bit Flip Register 3 */
#define MC52_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00644dcu)	/* Read Data and Bit Flip Register 30 */
#define MC52_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00644deu)	/* Read Data and Bit Flip Register 31 */
#define MC52_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00644e0u)	/* Read Data and Bit Flip Register 32 */
#define MC52_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00644e2u)	/* Read Data and Bit Flip Register 33 */
#define MC52_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00644e4u)	/* Read Data and Bit Flip Register 34 */
#define MC52_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00644e6u)	/* Read Data and Bit Flip Register 35 */
#define MC52_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00644e8u)	/* Read Data and Bit Flip Register 36 */
#define MC52_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00644eau)	/* Read Data and Bit Flip Register 37 */
#define MC52_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00644ecu)	/* Read Data and Bit Flip Register 38 */
#define MC52_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00644eeu)	/* Read Data and Bit Flip Register 39 */
#define MC52_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00644a8u)	/* Read Data and Bit Flip Register 4 */
#define MC52_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00644aau)	/* Read Data and Bit Flip Register 5 */
#define MC52_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00644acu)	/* Read Data and Bit Flip Register 6 */
#define MC52_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00644aeu)	/* Read Data and Bit Flip Register 7 */
#define MC52_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00644b0u)	/* Read Data and Bit Flip Register 8 */
#define MC52_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00644b2u)	/* Read Data and Bit Flip Register 9 */
#define MC53_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00645a0u)	/* Read Data and Bit Flip Register 0 */
#define MC53_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00645a2u)	/* Read Data and Bit Flip Register 1 */
#define MC53_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00645b4u)	/* Read Data and Bit Flip Register 10 */
#define MC53_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00645b6u)	/* Read Data and Bit Flip Register 11 */
#define MC53_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00645b8u)	/* Read Data and Bit Flip Register 12 */
#define MC53_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00645bau)	/* Read Data and Bit Flip Register 13 */
#define MC53_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00645bcu)	/* Read Data and Bit Flip Register 14 */
#define MC53_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00645beu)	/* Read Data and Bit Flip Register 15 */
#define MC53_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00645c0u)	/* Read Data and Bit Flip Register 16 */
#define MC53_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00645c2u)	/* Read Data and Bit Flip Register 17 */
#define MC53_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00645c4u)	/* Read Data and Bit Flip Register 18 */
#define MC53_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00645c6u)	/* Read Data and Bit Flip Register 19 */
#define MC53_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00645a4u)	/* Read Data and Bit Flip Register 2 */
#define MC53_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00645c8u)	/* Read Data and Bit Flip Register 20 */
#define MC53_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00645cau)	/* Read Data and Bit Flip Register 21 */
#define MC53_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00645ccu)	/* Read Data and Bit Flip Register 22 */
#define MC53_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00645ceu)	/* Read Data and Bit Flip Register 23 */
#define MC53_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00645d0u)	/* Read Data and Bit Flip Register 24 */
#define MC53_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00645d2u)	/* Read Data and Bit Flip Register 25 */
#define MC53_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00645d4u)	/* Read Data and Bit Flip Register 26 */
#define MC53_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00645d6u)	/* Read Data and Bit Flip Register 27 */
#define MC53_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00645d8u)	/* Read Data and Bit Flip Register 28 */
#define MC53_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00645dau)	/* Read Data and Bit Flip Register 29 */
#define MC53_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00645a6u)	/* Read Data and Bit Flip Register 3 */
#define MC53_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00645dcu)	/* Read Data and Bit Flip Register 30 */
#define MC53_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00645deu)	/* Read Data and Bit Flip Register 31 */
#define MC53_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00645e0u)	/* Read Data and Bit Flip Register 32 */
