svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC53_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00645e2u)	/* Read Data and Bit Flip Register 33 */
#define MC53_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00645e4u)	/* Read Data and Bit Flip Register 34 */
#define MC53_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00645e6u)	/* Read Data and Bit Flip Register 35 */
#define MC53_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00645e8u)	/* Read Data and Bit Flip Register 36 */
#define MC53_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00645eau)	/* Read Data and Bit Flip Register 37 */
#define MC53_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00645ecu)	/* Read Data and Bit Flip Register 38 */
#define MC53_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00645eeu)	/* Read Data and Bit Flip Register 39 */
#define MC53_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00645a8u)	/* Read Data and Bit Flip Register 4 */
#define MC53_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00645aau)	/* Read Data and Bit Flip Register 5 */
#define MC53_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00645acu)	/* Read Data and Bit Flip Register 6 */
#define MC53_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00645aeu)	/* Read Data and Bit Flip Register 7 */
#define MC53_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00645b0u)	/* Read Data and Bit Flip Register 8 */
#define MC53_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00645b2u)	/* Read Data and Bit Flip Register 9 */
#define MC54_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00646a0u)	/* Read Data and Bit Flip Register 0 */
#define MC54_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00646a2u)	/* Read Data and Bit Flip Register 1 */
#define MC54_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00646b4u)	/* Read Data and Bit Flip Register 10 */
#define MC54_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00646b6u)	/* Read Data and Bit Flip Register 11 */
#define MC54_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00646b8u)	/* Read Data and Bit Flip Register 12 */
#define MC54_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00646bau)	/* Read Data and Bit Flip Register 13 */
#define MC54_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00646bcu)	/* Read Data and Bit Flip Register 14 */
#define MC54_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00646beu)	/* Read Data and Bit Flip Register 15 */
#define MC54_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00646c0u)	/* Read Data and Bit Flip Register 16 */
#define MC54_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00646c2u)	/* Read Data and Bit Flip Register 17 */
#define MC54_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00646c4u)	/* Read Data and Bit Flip Register 18 */
#define MC54_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00646c6u)	/* Read Data and Bit Flip Register 19 */
#define MC54_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00646a4u)	/* Read Data and Bit Flip Register 2 */
#define MC54_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00646c8u)	/* Read Data and Bit Flip Register 20 */
#define MC54_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00646cau)	/* Read Data and Bit Flip Register 21 */
#define MC54_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00646ccu)	/* Read Data and Bit Flip Register 22 */
#define MC54_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00646ceu)	/* Read Data and Bit Flip Register 23 */
#define MC54_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00646d0u)	/* Read Data and Bit Flip Register 24 */
#define MC54_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00646d2u)	/* Read Data and Bit Flip Register 25 */
#define MC54_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00646d4u)	/* Read Data and Bit Flip Register 26 */
#define MC54_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00646d6u)	/* Read Data and Bit Flip Register 27 */
#define MC54_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00646d8u)	/* Read Data and Bit Flip Register 28 */
#define MC54_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00646dau)	/* Read Data and Bit Flip Register 29 */
#define MC54_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00646a6u)	/* Read Data and Bit Flip Register 3 */
#define MC54_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00646dcu)	/* Read Data and Bit Flip Register 30 */
#define MC54_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00646deu)	/* Read Data and Bit Flip Register 31 */
#define MC54_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00646e0u)	/* Read Data and Bit Flip Register 32 */
#define MC54_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00646e2u)	/* Read Data and Bit Flip Register 33 */
#define MC54_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00646e4u)	/* Read Data and Bit Flip Register 34 */
#define MC54_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00646e6u)	/* Read Data and Bit Flip Register 35 */
#define MC54_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00646e8u)	/* Read Data and Bit Flip Register 36 */
#define MC54_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00646eau)	/* Read Data and Bit Flip Register 37 */
#define MC54_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00646ecu)	/* Read Data and Bit Flip Register 38 */
#define MC54_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00646eeu)	/* Read Data and Bit Flip Register 39 */
#define MC54_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00646a8u)	/* Read Data and Bit Flip Register 4 */
#define MC54_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00646aau)	/* Read Data and Bit Flip Register 5 */
#define MC54_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00646acu)	/* Read Data and Bit Flip Register 6 */
#define MC54_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00646aeu)	/* Read Data and Bit Flip Register 7 */
#define MC54_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00646b0u)	/* Read Data and Bit Flip Register 8 */
#define MC54_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00646b2u)	/* Read Data and Bit Flip Register 9 */
#define MC55_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00647a0u)	/* Read Data and Bit Flip Register 0 */
#define MC55_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00647a2u)	/* Read Data and Bit Flip Register 1 */
#define MC55_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00647b4u)	/* Read Data and Bit Flip Register 10 */
#define MC55_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00647b6u)	/* Read Data and Bit Flip Register 11 */
#define MC55_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00647b8u)	/* Read Data and Bit Flip Register 12 */
#define MC55_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00647bau)	/* Read Data and Bit Flip Register 13 */
#define MC55_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00647bcu)	/* Read Data and Bit Flip Register 14 */
#define MC55_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00647beu)	/* Read Data and Bit Flip Register 15 */
#define MC55_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00647c0u)	/* Read Data and Bit Flip Register 16 */
#define MC55_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00647c2u)	/* Read Data and Bit Flip Register 17 */
#define MC55_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00647c4u)	/* Read Data and Bit Flip Register 18 */
#define MC55_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00647c6u)	/* Read Data and Bit Flip Register 19 */
#define MC55_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00647a4u)	/* Read Data and Bit Flip Register 2 */
#define MC55_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00647c8u)	/* Read Data and Bit Flip Register 20 */
#define MC55_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00647cau)	/* Read Data and Bit Flip Register 21 */
#define MC55_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00647ccu)	/* Read Data and Bit Flip Register 22 */
#define MC55_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00647ceu)	/* Read Data and Bit Flip Register 23 */
#define MC55_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00647d0u)	/* Read Data and Bit Flip Register 24 */
#define MC55_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00647d2u)	/* Read Data and Bit Flip Register 25 */
#define MC55_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00647d4u)	/* Read Data and Bit Flip Register 26 */
#define MC55_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00647d6u)	/* Read Data and Bit Flip Register 27 */
#define MC55_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00647d8u)	/* Read Data and Bit Flip Register 28 */
#define MC55_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00647dau)	/* Read Data and Bit Flip Register 29 */
#define MC55_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00647a6u)	/* Read Data and Bit Flip Register 3 */
#define MC55_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00647dcu)	/* Read Data and Bit Flip Register 30 */
#define MC55_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00647deu)	/* Read Data and Bit Flip Register 31 */
#define MC55_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00647e0u)	/* Read Data and Bit Flip Register 32 */
#define MC55_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00647e2u)	/* Read Data and Bit Flip Register 33 */
#define MC55_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00647e4u)	/* Read Data and Bit Flip Register 34 */
#define MC55_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00647e6u)	/* Read Data and Bit Flip Register 35 */
#define MC55_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00647e8u)	/* Read Data and Bit Flip Register 36 */
#define MC55_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00647eau)	/* Read Data and Bit Flip Register 37 */
#define MC55_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00647ecu)	/* Read Data and Bit Flip Register 38 */
#define MC55_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00647eeu)	/* Read Data and Bit Flip Register 39 */
#define MC55_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00647a8u)	/* Read Data and Bit Flip Register 4 */
#define MC55_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00647aau)	/* Read Data and Bit Flip Register 5 */
#define MC55_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00647acu)	/* Read Data and Bit Flip Register 6 */
#define MC55_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00647aeu)	/* Read Data and Bit Flip Register 7 */
#define MC55_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00647b0u)	/* Read Data and Bit Flip Register 8 */
#define MC55_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00647b2u)	/* Read Data and Bit Flip Register 9 */
#define MC56_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00648a0u)	/* Read Data and Bit Flip Register 0 */
#define MC56_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00648a2u)	/* Read Data and Bit Flip Register 1 */
#define MC56_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00648b4u)	/* Read Data and Bit Flip Register 10 */
#define MC56_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00648b6u)	/* Read Data and Bit Flip Register 11 */
#define MC56_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00648b8u)	/* Read Data and Bit Flip Register 12 */
#define MC56_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00648bau)	/* Read Data and Bit Flip Register 13 */
#define MC56_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00648bcu)	/* Read Data and Bit Flip Register 14 */
#define MC56_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00648beu)	/* Read Data and Bit Flip Register 15 */
#define MC56_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00648c0u)	/* Read Data and Bit Flip Register 16 */
#define MC56_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00648c2u)	/* Read Data and Bit Flip Register 17 */
#define MC56_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00648c4u)	/* Read Data and Bit Flip Register 18 */
#define MC56_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00648c6u)	/* Read Data and Bit Flip Register 19 */
#define MC56_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00648a4u)	/* Read Data and Bit Flip Register 2 */
#define MC56_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00648c8u)	/* Read Data and Bit Flip Register 20 */
#define MC56_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00648cau)	/* Read Data and Bit Flip Register 21 */
#define MC56_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00648ccu)	/* Read Data and Bit Flip Register 22 */
#define MC56_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00648ceu)	/* Read Data and Bit Flip Register 23 */
#define MC56_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00648d0u)	/* Read Data and Bit Flip Register 24 */
#define MC56_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00648d2u)	/* Read Data and Bit Flip Register 25 */
#define MC56_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00648d4u)	/* Read Data and Bit Flip Register 26 */
#define MC56_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00648d6u)	/* Read Data and Bit Flip Register 27 */
#define MC56_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00648d8u)	/* Read Data and Bit Flip Register 28 */
#define MC56_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00648dau)	/* Read Data and Bit Flip Register 29 */
#define MC56_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00648a6u)	/* Read Data and Bit Flip Register 3 */
#define MC56_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00648dcu)	/* Read Data and Bit Flip Register 30 */
#define MC56_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00648deu)	/* Read Data and Bit Flip Register 31 */
#define MC56_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00648e0u)	/* Read Data and Bit Flip Register 32 */
#define MC56_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00648e2u)	/* Read Data and Bit Flip Register 33 */
#define MC56_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00648e4u)	/* Read Data and Bit Flip Register 34 */
#define MC56_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00648e6u)	/* Read Data and Bit Flip Register 35 */
#define MC56_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00648e8u)	/* Read Data and Bit Flip Register 36 */
#define MC56_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00648eau)	/* Read Data and Bit Flip Register 37 */
#define MC56_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00648ecu)	/* Read Data and Bit Flip Register 38 */
#define MC56_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00648eeu)	/* Read Data and Bit Flip Register 39 */
#define MC56_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00648a8u)	/* Read Data and Bit Flip Register 4 */
#define MC56_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00648aau)	/* Read Data and Bit Flip Register 5 */
#define MC56_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00648acu)	/* Read Data and Bit Flip Register 6 */
#define MC56_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00648aeu)	/* Read Data and Bit Flip Register 7 */
#define MC56_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00648b0u)	/* Read Data and Bit Flip Register 8 */
#define MC56_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00648b2u)	/* Read Data and Bit Flip Register 9 */
#define MC57_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00649a0u)	/* Read Data and Bit Flip Register 0 */
#define MC57_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00649a2u)	/* Read Data and Bit Flip Register 1 */
#define MC57_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00649b4u)	/* Read Data and Bit Flip Register 10 */
#define MC57_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00649b6u)	/* Read Data and Bit Flip Register 11 */
#define MC57_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00649b8u)	/* Read Data and Bit Flip Register 12 */
#define MC57_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00649bau)	/* Read Data and Bit Flip Register 13 */
#define MC57_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00649bcu)	/* Read Data and Bit Flip Register 14 */
#define MC57_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00649beu)	/* Read Data and Bit Flip Register 15 */
#define MC57_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00649c0u)	/* Read Data and Bit Flip Register 16 */
#define MC57_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00649c2u)	/* Read Data and Bit Flip Register 17 */
#define MC57_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00649c4u)	/* Read Data and Bit Flip Register 18 */
#define MC57_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00649c6u)	/* Read Data and Bit Flip Register 19 */
#define MC57_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00649a4u)	/* Read Data and Bit Flip Register 2 */
#define MC57_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00649c8u)	/* Read Data and Bit Flip Register 20 */
#define MC57_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00649cau)	/* Read Data and Bit Flip Register 21 */
#define MC57_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00649ccu)	/* Read Data and Bit Flip Register 22 */
#define MC57_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00649ceu)	/* Read Data and Bit Flip Register 23 */
#define MC57_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00649d0u)	/* Read Data and Bit Flip Register 24 */
#define MC57_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00649d2u)	/* Read Data and Bit Flip Register 25 */
#define MC57_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00649d4u)	/* Read Data and Bit Flip Register 26 */
#define MC57_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00649d6u)	/* Read Data and Bit Flip Register 27 */
#define MC57_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00649d8u)	/* Read Data and Bit Flip Register 28 */
#define MC57_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00649dau)	/* Read Data and Bit Flip Register 29 */
#define MC57_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00649a6u)	/* Read Data and Bit Flip Register 3 */
#define MC57_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00649dcu)	/* Read Data and Bit Flip Register 30 */
#define MC57_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00649deu)	/* Read Data and Bit Flip Register 31 */
#define MC57_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00649e0u)	/* Read Data and Bit Flip Register 32 */
#define MC57_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00649e2u)	/* Read Data and Bit Flip Register 33 */
#define MC57_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00649e4u)	/* Read Data and Bit Flip Register 34 */
#define MC57_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00649e6u)	/* Read Data and Bit Flip Register 35 */
#define MC57_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00649e8u)	/* Read Data and Bit Flip Register 36 */
#define MC57_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00649eau)	/* Read Data and Bit Flip Register 37 */
#define MC57_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00649ecu)	/* Read Data and Bit Flip Register 38 */
#define MC57_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00649eeu)	/* Read Data and Bit Flip Register 39 */
#define MC57_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00649a8u)	/* Read Data and Bit Flip Register 4 */
#define MC57_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00649aau)	/* Read Data and Bit Flip Register 5 */
#define MC57_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00649acu)	/* Read Data and Bit Flip Register 6 */
#define MC57_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00649aeu)	/* Read Data and Bit Flip Register 7 */
#define MC57_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00649b0u)	/* Read Data and Bit Flip Register 8 */
#define MC57_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00649b2u)	/* Read Data and Bit Flip Register 9 */
#define MC58_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0064aa0u)	/* Read Data and Bit Flip Register 0 */
#define MC58_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0064aa2u)	/* Read Data and Bit Flip Register 1 */
#define MC58_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0064ab4u)	/* Read Data and Bit Flip Register 10 */
#define MC58_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0064ab6u)	/* Read Data and Bit Flip Register 11 */
#define MC58_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0064ab8u)	/* Read Data and Bit Flip Register 12 */
#define MC58_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0064abau)	/* Read Data and Bit Flip Register 13 */
#define MC58_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0064abcu)	/* Read Data and Bit Flip Register 14 */
#define MC58_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0064abeu)	/* Read Data and Bit Flip Register 15 */
#define MC58_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0064ac0u)	/* Read Data and Bit Flip Register 16 */
#define MC58_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0064ac2u)	/* Read Data and Bit Flip Register 17 */
#define MC58_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0064ac4u)	/* Read Data and Bit Flip Register 18 */
#define MC58_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0064ac6u)	/* Read Data and Bit Flip Register 19 */
#define MC58_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0064aa4u)	/* Read Data and Bit Flip Register 2 */
#define MC58_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0064ac8u)	/* Read Data and Bit Flip Register 20 */
#define MC58_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0064acau)	/* Read Data and Bit Flip Register 21 */
#define MC58_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0064accu)	/* Read Data and Bit Flip Register 22 */
#define MC58_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0064aceu)	/* Read Data and Bit Flip Register 23 */
#define MC58_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0064ad0u)	/* Read Data and Bit Flip Register 24 */
#define MC58_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0064ad2u)	/* Read Data and Bit Flip Register 25 */
#define MC58_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0064ad4u)	/* Read Data and Bit Flip Register 26 */
#define MC58_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0064ad6u)	/* Read Data and Bit Flip Register 27 */
#define MC58_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0064ad8u)	/* Read Data and Bit Flip Register 28 */
#define MC58_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0064adau)	/* Read Data and Bit Flip Register 29 */
#define MC58_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0064aa6u)	/* Read Data and Bit Flip Register 3 */
#define MC58_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0064adcu)	/* Read Data and Bit Flip Register 30 */
#define MC58_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0064adeu)	/* Read Data and Bit Flip Register 31 */
#define MC58_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0064ae0u)	/* Read Data and Bit Flip Register 32 */
#define MC58_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0064ae2u)	/* Read Data and Bit Flip Register 33 */
#define MC58_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0064ae4u)	/* Read Data and Bit Flip Register 34 */
#define MC58_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0064ae6u)	/* Read Data and Bit Flip Register 35 */
#define MC58_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0064ae8u)	/* Read Data and Bit Flip Register 36 */
#define MC58_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0064aeau)	/* Read Data and Bit Flip Register 37 */
#define MC58_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0064aecu)	/* Read Data and Bit Flip Register 38 */
#define MC58_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0064aeeu)	/* Read Data and Bit Flip Register 39 */
#define MC58_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0064aa8u)	/* Read Data and Bit Flip Register 4 */
#define MC58_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0064aaau)	/* Read Data and Bit Flip Register 5 */
#define MC58_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0064aacu)	/* Read Data and Bit Flip Register 6 */
#define MC58_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0064aaeu)	/* Read Data and Bit Flip Register 7 */
#define MC58_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0064ab0u)	/* Read Data and Bit Flip Register 8 */
#define MC58_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0064ab2u)	/* Read Data and Bit Flip Register 9 */
#define MC59_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0064ba0u)	/* Read Data and Bit Flip Register 0 */
#define MC59_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0064ba2u)	/* Read Data and Bit Flip Register 1 */
#define MC59_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0064bb4u)	/* Read Data and Bit Flip Register 10 */
#define MC59_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0064bb6u)	/* Read Data and Bit Flip Register 11 */
#define MC59_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0064bb8u)	/* Read Data and Bit Flip Register 12 */
#define MC59_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0064bbau)	/* Read Data and Bit Flip Register 13 */
#define MC59_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0064bbcu)	/* Read Data and Bit Flip Register 14 */
#define MC59_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0064bbeu)	/* Read Data and Bit Flip Register 15 */
#define MC59_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0064bc0u)	/* Read Data and Bit Flip Register 16 */
#define MC59_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0064bc2u)	/* Read Data and Bit Flip Register 17 */
#define MC59_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0064bc4u)	/* Read Data and Bit Flip Register 18 */
#define MC59_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0064bc6u)	/* Read Data and Bit Flip Register 19 */
#define MC59_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0064ba4u)	/* Read Data and Bit Flip Register 2 */
#define MC59_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0064bc8u)	/* Read Data and Bit Flip Register 20 */
#define MC59_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0064bcau)	/* Read Data and Bit Flip Register 21 */
#define MC59_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0064bccu)	/* Read Data and Bit Flip Register 22 */
#define MC59_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0064bceu)	/* Read Data and Bit Flip Register 23 */
#define MC59_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0064bd0u)	/* Read Data and Bit Flip Register 24 */
#define MC59_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0064bd2u)	/* Read Data and Bit Flip Register 25 */
#define MC59_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0064bd4u)	/* Read Data and Bit Flip Register 26 */
#define MC59_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0064bd6u)	/* Read Data and Bit Flip Register 27 */
#define MC59_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0064bd8u)	/* Read Data and Bit Flip Register 28 */
#define MC59_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0064bdau)	/* Read Data and Bit Flip Register 29 */
#define MC59_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0064ba6u)	/* Read Data and Bit Flip Register 3 */
#define MC59_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0064bdcu)	/* Read Data and Bit Flip Register 30 */
#define MC59_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0064bdeu)	/* Read Data and Bit Flip Register 31 */
#define MC59_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0064be0u)	/* Read Data and Bit Flip Register 32 */
#define MC59_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0064be2u)	/* Read Data and Bit Flip Register 33 */
#define MC59_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0064be4u)	/* Read Data and Bit Flip Register 34 */
#define MC59_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0064be6u)	/* Read Data and Bit Flip Register 35 */
