svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC59_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0064be8u)	/* Read Data and Bit Flip Register 36 */
#define MC59_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0064beau)	/* Read Data and Bit Flip Register 37 */
#define MC59_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0064becu)	/* Read Data and Bit Flip Register 38 */
#define MC59_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0064beeu)	/* Read Data and Bit Flip Register 39 */
#define MC59_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0064ba8u)	/* Read Data and Bit Flip Register 4 */
#define MC59_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0064baau)	/* Read Data and Bit Flip Register 5 */
#define MC59_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0064bacu)	/* Read Data and Bit Flip Register 6 */
#define MC59_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0064baeu)	/* Read Data and Bit Flip Register 7 */
#define MC59_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0064bb0u)	/* Read Data and Bit Flip Register 8 */
#define MC59_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0064bb2u)	/* Read Data and Bit Flip Register 9 */
#define MC5_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00615a0u)	/* Read Data and Bit Flip Register 0 */
#define MC5_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00615a2u)	/* Read Data and Bit Flip Register 1 */
#define MC5_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00615b4u)	/* Read Data and Bit Flip Register 10 */
#define MC5_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00615b6u)	/* Read Data and Bit Flip Register 11 */
#define MC5_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00615b8u)	/* Read Data and Bit Flip Register 12 */
#define MC5_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00615bau)	/* Read Data and Bit Flip Register 13 */
#define MC5_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00615bcu)	/* Read Data and Bit Flip Register 14 */
#define MC5_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00615beu)	/* Read Data and Bit Flip Register 15 */
#define MC5_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00615c0u)	/* Read Data and Bit Flip Register 16 */
#define MC5_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00615c2u)	/* Read Data and Bit Flip Register 17 */
#define MC5_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00615c4u)	/* Read Data and Bit Flip Register 18 */
#define MC5_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00615c6u)	/* Read Data and Bit Flip Register 19 */
#define MC5_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00615a4u)	/* Read Data and Bit Flip Register 2 */
#define MC5_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00615c8u)	/* Read Data and Bit Flip Register 20 */
#define MC5_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00615cau)	/* Read Data and Bit Flip Register 21 */
#define MC5_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00615ccu)	/* Read Data and Bit Flip Register 22 */
#define MC5_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00615ceu)	/* Read Data and Bit Flip Register 23 */
#define MC5_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00615d0u)	/* Read Data and Bit Flip Register 24 */
#define MC5_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00615d2u)	/* Read Data and Bit Flip Register 25 */
#define MC5_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00615d4u)	/* Read Data and Bit Flip Register 26 */
#define MC5_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00615d6u)	/* Read Data and Bit Flip Register 27 */
#define MC5_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00615d8u)	/* Read Data and Bit Flip Register 28 */
#define MC5_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00615dau)	/* Read Data and Bit Flip Register 29 */
#define MC5_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00615a6u)	/* Read Data and Bit Flip Register 3 */
#define MC5_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00615dcu)	/* Read Data and Bit Flip Register 30 */
#define MC5_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00615deu)	/* Read Data and Bit Flip Register 31 */
#define MC5_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00615e0u)	/* Read Data and Bit Flip Register 32 */
#define MC5_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00615e2u)	/* Read Data and Bit Flip Register 33 */
#define MC5_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00615e4u)	/* Read Data and Bit Flip Register 34 */
#define MC5_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00615e6u)	/* Read Data and Bit Flip Register 35 */
#define MC5_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00615e8u)	/* Read Data and Bit Flip Register 36 */
#define MC5_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00615eau)	/* Read Data and Bit Flip Register 37 */
#define MC5_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00615ecu)	/* Read Data and Bit Flip Register 38 */
#define MC5_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00615eeu)	/* Read Data and Bit Flip Register 39 */
#define MC5_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00615a8u)	/* Read Data and Bit Flip Register 4 */
#define MC5_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00615aau)	/* Read Data and Bit Flip Register 5 */
#define MC5_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00615acu)	/* Read Data and Bit Flip Register 6 */
#define MC5_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00615aeu)	/* Read Data and Bit Flip Register 7 */
#define MC5_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00615b0u)	/* Read Data and Bit Flip Register 8 */
#define MC5_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00615b2u)	/* Read Data and Bit Flip Register 9 */
#define MC60_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0064ca0u)	/* Read Data and Bit Flip Register 0 */
#define MC60_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0064ca2u)	/* Read Data and Bit Flip Register 1 */
#define MC60_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0064cb4u)	/* Read Data and Bit Flip Register 10 */
#define MC60_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0064cb6u)	/* Read Data and Bit Flip Register 11 */
#define MC60_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0064cb8u)	/* Read Data and Bit Flip Register 12 */
#define MC60_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0064cbau)	/* Read Data and Bit Flip Register 13 */
#define MC60_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0064cbcu)	/* Read Data and Bit Flip Register 14 */
#define MC60_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0064cbeu)	/* Read Data and Bit Flip Register 15 */
#define MC60_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0064cc0u)	/* Read Data and Bit Flip Register 16 */
#define MC60_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0064cc2u)	/* Read Data and Bit Flip Register 17 */
#define MC60_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0064cc4u)	/* Read Data and Bit Flip Register 18 */
#define MC60_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0064cc6u)	/* Read Data and Bit Flip Register 19 */
#define MC60_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0064ca4u)	/* Read Data and Bit Flip Register 2 */
#define MC60_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0064cc8u)	/* Read Data and Bit Flip Register 20 */
#define MC60_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0064ccau)	/* Read Data and Bit Flip Register 21 */
#define MC60_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0064cccu)	/* Read Data and Bit Flip Register 22 */
#define MC60_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0064cceu)	/* Read Data and Bit Flip Register 23 */
#define MC60_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0064cd0u)	/* Read Data and Bit Flip Register 24 */
#define MC60_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0064cd2u)	/* Read Data and Bit Flip Register 25 */
#define MC60_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0064cd4u)	/* Read Data and Bit Flip Register 26 */
#define MC60_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0064cd6u)	/* Read Data and Bit Flip Register 27 */
#define MC60_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0064cd8u)	/* Read Data and Bit Flip Register 28 */
#define MC60_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0064cdau)	/* Read Data and Bit Flip Register 29 */
#define MC60_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0064ca6u)	/* Read Data and Bit Flip Register 3 */
#define MC60_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0064cdcu)	/* Read Data and Bit Flip Register 30 */
#define MC60_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0064cdeu)	/* Read Data and Bit Flip Register 31 */
#define MC60_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0064ce0u)	/* Read Data and Bit Flip Register 32 */
#define MC60_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0064ce2u)	/* Read Data and Bit Flip Register 33 */
#define MC60_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0064ce4u)	/* Read Data and Bit Flip Register 34 */
#define MC60_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0064ce6u)	/* Read Data and Bit Flip Register 35 */
#define MC60_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0064ce8u)	/* Read Data and Bit Flip Register 36 */
#define MC60_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0064ceau)	/* Read Data and Bit Flip Register 37 */
#define MC60_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0064cecu)	/* Read Data and Bit Flip Register 38 */
#define MC60_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0064ceeu)	/* Read Data and Bit Flip Register 39 */
#define MC60_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0064ca8u)	/* Read Data and Bit Flip Register 4 */
#define MC60_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0064caau)	/* Read Data and Bit Flip Register 5 */
#define MC60_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0064cacu)	/* Read Data and Bit Flip Register 6 */
#define MC60_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0064caeu)	/* Read Data and Bit Flip Register 7 */
#define MC60_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0064cb0u)	/* Read Data and Bit Flip Register 8 */
#define MC60_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0064cb2u)	/* Read Data and Bit Flip Register 9 */
#define MC61_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0064da0u)	/* Read Data and Bit Flip Register 0 */
#define MC61_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0064da2u)	/* Read Data and Bit Flip Register 1 */
#define MC61_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0064db4u)	/* Read Data and Bit Flip Register 10 */
#define MC61_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0064db6u)	/* Read Data and Bit Flip Register 11 */
#define MC61_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0064db8u)	/* Read Data and Bit Flip Register 12 */
#define MC61_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0064dbau)	/* Read Data and Bit Flip Register 13 */
#define MC61_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0064dbcu)	/* Read Data and Bit Flip Register 14 */
#define MC61_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0064dbeu)	/* Read Data and Bit Flip Register 15 */
#define MC61_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0064dc0u)	/* Read Data and Bit Flip Register 16 */
#define MC61_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0064dc2u)	/* Read Data and Bit Flip Register 17 */
#define MC61_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0064dc4u)	/* Read Data and Bit Flip Register 18 */
#define MC61_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0064dc6u)	/* Read Data and Bit Flip Register 19 */
#define MC61_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0064da4u)	/* Read Data and Bit Flip Register 2 */
#define MC61_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0064dc8u)	/* Read Data and Bit Flip Register 20 */
#define MC61_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0064dcau)	/* Read Data and Bit Flip Register 21 */
#define MC61_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0064dccu)	/* Read Data and Bit Flip Register 22 */
#define MC61_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0064dceu)	/* Read Data and Bit Flip Register 23 */
#define MC61_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0064dd0u)	/* Read Data and Bit Flip Register 24 */
#define MC61_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0064dd2u)	/* Read Data and Bit Flip Register 25 */
#define MC61_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0064dd4u)	/* Read Data and Bit Flip Register 26 */
#define MC61_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0064dd6u)	/* Read Data and Bit Flip Register 27 */
#define MC61_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0064dd8u)	/* Read Data and Bit Flip Register 28 */
#define MC61_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0064ddau)	/* Read Data and Bit Flip Register 29 */
#define MC61_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0064da6u)	/* Read Data and Bit Flip Register 3 */
#define MC61_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0064ddcu)	/* Read Data and Bit Flip Register 30 */
#define MC61_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0064ddeu)	/* Read Data and Bit Flip Register 31 */
#define MC61_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0064de0u)	/* Read Data and Bit Flip Register 32 */
#define MC61_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0064de2u)	/* Read Data and Bit Flip Register 33 */
#define MC61_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0064de4u)	/* Read Data and Bit Flip Register 34 */
#define MC61_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0064de6u)	/* Read Data and Bit Flip Register 35 */
#define MC61_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0064de8u)	/* Read Data and Bit Flip Register 36 */
#define MC61_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0064deau)	/* Read Data and Bit Flip Register 37 */
#define MC61_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0064decu)	/* Read Data and Bit Flip Register 38 */
#define MC61_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0064deeu)	/* Read Data and Bit Flip Register 39 */
#define MC61_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0064da8u)	/* Read Data and Bit Flip Register 4 */
#define MC61_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0064daau)	/* Read Data and Bit Flip Register 5 */
#define MC61_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0064dacu)	/* Read Data and Bit Flip Register 6 */
#define MC61_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0064daeu)	/* Read Data and Bit Flip Register 7 */
#define MC61_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0064db0u)	/* Read Data and Bit Flip Register 8 */
#define MC61_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0064db2u)	/* Read Data and Bit Flip Register 9 */
#define MC62_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0064ea0u)	/* Read Data and Bit Flip Register 0 */
#define MC62_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0064ea2u)	/* Read Data and Bit Flip Register 1 */
#define MC62_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0064eb4u)	/* Read Data and Bit Flip Register 10 */
#define MC62_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0064eb6u)	/* Read Data and Bit Flip Register 11 */
#define MC62_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0064eb8u)	/* Read Data and Bit Flip Register 12 */
#define MC62_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0064ebau)	/* Read Data and Bit Flip Register 13 */
#define MC62_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0064ebcu)	/* Read Data and Bit Flip Register 14 */
#define MC62_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0064ebeu)	/* Read Data and Bit Flip Register 15 */
#define MC62_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0064ec0u)	/* Read Data and Bit Flip Register 16 */
#define MC62_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0064ec2u)	/* Read Data and Bit Flip Register 17 */
#define MC62_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0064ec4u)	/* Read Data and Bit Flip Register 18 */
#define MC62_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0064ec6u)	/* Read Data and Bit Flip Register 19 */
#define MC62_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0064ea4u)	/* Read Data and Bit Flip Register 2 */
#define MC62_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0064ec8u)	/* Read Data and Bit Flip Register 20 */
#define MC62_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0064ecau)	/* Read Data and Bit Flip Register 21 */
#define MC62_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0064eccu)	/* Read Data and Bit Flip Register 22 */
#define MC62_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0064eceu)	/* Read Data and Bit Flip Register 23 */
#define MC62_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0064ed0u)	/* Read Data and Bit Flip Register 24 */
#define MC62_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0064ed2u)	/* Read Data and Bit Flip Register 25 */
#define MC62_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0064ed4u)	/* Read Data and Bit Flip Register 26 */
#define MC62_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0064ed6u)	/* Read Data and Bit Flip Register 27 */
#define MC62_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0064ed8u)	/* Read Data and Bit Flip Register 28 */
#define MC62_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0064edau)	/* Read Data and Bit Flip Register 29 */
#define MC62_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0064ea6u)	/* Read Data and Bit Flip Register 3 */
#define MC62_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0064edcu)	/* Read Data and Bit Flip Register 30 */
#define MC62_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0064edeu)	/* Read Data and Bit Flip Register 31 */
#define MC62_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0064ee0u)	/* Read Data and Bit Flip Register 32 */
#define MC62_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0064ee2u)	/* Read Data and Bit Flip Register 33 */
#define MC62_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0064ee4u)	/* Read Data and Bit Flip Register 34 */
#define MC62_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0064ee6u)	/* Read Data and Bit Flip Register 35 */
#define MC62_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0064ee8u)	/* Read Data and Bit Flip Register 36 */
#define MC62_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0064eeau)	/* Read Data and Bit Flip Register 37 */
#define MC62_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0064eecu)	/* Read Data and Bit Flip Register 38 */
#define MC62_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0064eeeu)	/* Read Data and Bit Flip Register 39 */
#define MC62_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0064ea8u)	/* Read Data and Bit Flip Register 4 */
#define MC62_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0064eaau)	/* Read Data and Bit Flip Register 5 */
#define MC62_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0064eacu)	/* Read Data and Bit Flip Register 6 */
#define MC62_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0064eaeu)	/* Read Data and Bit Flip Register 7 */
#define MC62_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0064eb0u)	/* Read Data and Bit Flip Register 8 */
#define MC62_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0064eb2u)	/* Read Data and Bit Flip Register 9 */
#define MC63_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0064fa0u)	/* Read Data and Bit Flip Register 0 */
#define MC63_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0064fa2u)	/* Read Data and Bit Flip Register 1 */
#define MC63_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0064fb4u)	/* Read Data and Bit Flip Register 10 */
#define MC63_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0064fb6u)	/* Read Data and Bit Flip Register 11 */
#define MC63_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0064fb8u)	/* Read Data and Bit Flip Register 12 */
#define MC63_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0064fbau)	/* Read Data and Bit Flip Register 13 */
#define MC63_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0064fbcu)	/* Read Data and Bit Flip Register 14 */
#define MC63_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0064fbeu)	/* Read Data and Bit Flip Register 15 */
#define MC63_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0064fc0u)	/* Read Data and Bit Flip Register 16 */
#define MC63_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0064fc2u)	/* Read Data and Bit Flip Register 17 */
#define MC63_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0064fc4u)	/* Read Data and Bit Flip Register 18 */
#define MC63_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0064fc6u)	/* Read Data and Bit Flip Register 19 */
#define MC63_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0064fa4u)	/* Read Data and Bit Flip Register 2 */
#define MC63_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0064fc8u)	/* Read Data and Bit Flip Register 20 */
#define MC63_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0064fcau)	/* Read Data and Bit Flip Register 21 */
#define MC63_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0064fccu)	/* Read Data and Bit Flip Register 22 */
#define MC63_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0064fceu)	/* Read Data and Bit Flip Register 23 */
#define MC63_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0064fd0u)	/* Read Data and Bit Flip Register 24 */
#define MC63_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0064fd2u)	/* Read Data and Bit Flip Register 25 */
#define MC63_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0064fd4u)	/* Read Data and Bit Flip Register 26 */
#define MC63_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0064fd6u)	/* Read Data and Bit Flip Register 27 */
#define MC63_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0064fd8u)	/* Read Data and Bit Flip Register 28 */
#define MC63_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0064fdau)	/* Read Data and Bit Flip Register 29 */
#define MC63_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0064fa6u)	/* Read Data and Bit Flip Register 3 */
#define MC63_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0064fdcu)	/* Read Data and Bit Flip Register 30 */
#define MC63_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0064fdeu)	/* Read Data and Bit Flip Register 31 */
#define MC63_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0064fe0u)	/* Read Data and Bit Flip Register 32 */
#define MC63_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0064fe2u)	/* Read Data and Bit Flip Register 33 */
#define MC63_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0064fe4u)	/* Read Data and Bit Flip Register 34 */
#define MC63_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0064fe6u)	/* Read Data and Bit Flip Register 35 */
#define MC63_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0064fe8u)	/* Read Data and Bit Flip Register 36 */
#define MC63_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0064feau)	/* Read Data and Bit Flip Register 37 */
#define MC63_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0064fecu)	/* Read Data and Bit Flip Register 38 */
#define MC63_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0064feeu)	/* Read Data and Bit Flip Register 39 */
#define MC63_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0064fa8u)	/* Read Data and Bit Flip Register 4 */
#define MC63_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0064faau)	/* Read Data and Bit Flip Register 5 */
#define MC63_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0064facu)	/* Read Data and Bit Flip Register 6 */
#define MC63_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0064faeu)	/* Read Data and Bit Flip Register 7 */
#define MC63_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0064fb0u)	/* Read Data and Bit Flip Register 8 */
#define MC63_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0064fb2u)	/* Read Data and Bit Flip Register 9 */
#define MC64_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00650a0u)	/* Read Data and Bit Flip Register 0 */
#define MC64_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00650a2u)	/* Read Data and Bit Flip Register 1 */
#define MC64_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00650b4u)	/* Read Data and Bit Flip Register 10 */
#define MC64_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00650b6u)	/* Read Data and Bit Flip Register 11 */
#define MC64_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00650b8u)	/* Read Data and Bit Flip Register 12 */
#define MC64_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00650bau)	/* Read Data and Bit Flip Register 13 */
#define MC64_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00650bcu)	/* Read Data and Bit Flip Register 14 */
#define MC64_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00650beu)	/* Read Data and Bit Flip Register 15 */
#define MC64_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00650c0u)	/* Read Data and Bit Flip Register 16 */
#define MC64_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00650c2u)	/* Read Data and Bit Flip Register 17 */
#define MC64_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00650c4u)	/* Read Data and Bit Flip Register 18 */
#define MC64_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00650c6u)	/* Read Data and Bit Flip Register 19 */
#define MC64_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00650a4u)	/* Read Data and Bit Flip Register 2 */
#define MC64_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00650c8u)	/* Read Data and Bit Flip Register 20 */
#define MC64_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00650cau)	/* Read Data and Bit Flip Register 21 */
#define MC64_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00650ccu)	/* Read Data and Bit Flip Register 22 */
#define MC64_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00650ceu)	/* Read Data and Bit Flip Register 23 */
#define MC64_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00650d0u)	/* Read Data and Bit Flip Register 24 */
#define MC64_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00650d2u)	/* Read Data and Bit Flip Register 25 */
#define MC64_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00650d4u)	/* Read Data and Bit Flip Register 26 */
#define MC64_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00650d6u)	/* Read Data and Bit Flip Register 27 */
#define MC64_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00650d8u)	/* Read Data and Bit Flip Register 28 */
#define MC64_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00650dau)	/* Read Data and Bit Flip Register 29 */
#define MC64_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00650a6u)	/* Read Data and Bit Flip Register 3 */
#define MC64_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00650dcu)	/* Read Data and Bit Flip Register 30 */
#define MC64_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00650deu)	/* Read Data and Bit Flip Register 31 */
#define MC64_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00650e0u)	/* Read Data and Bit Flip Register 32 */
#define MC64_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00650e2u)	/* Read Data and Bit Flip Register 33 */
#define MC64_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00650e4u)	/* Read Data and Bit Flip Register 34 */
#define MC64_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00650e6u)	/* Read Data and Bit Flip Register 35 */
#define MC64_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00650e8u)	/* Read Data and Bit Flip Register 36 */
#define MC64_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00650eau)	/* Read Data and Bit Flip Register 37 */
#define MC64_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00650ecu)	/* Read Data and Bit Flip Register 38 */
#define MC64_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00650eeu)	/* Read Data and Bit Flip Register 39 */
