svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC64_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00650a8u)	/* Read Data and Bit Flip Register 4 */
#define MC64_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00650aau)	/* Read Data and Bit Flip Register 5 */
#define MC64_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00650acu)	/* Read Data and Bit Flip Register 6 */
#define MC64_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00650aeu)	/* Read Data and Bit Flip Register 7 */
#define MC64_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00650b0u)	/* Read Data and Bit Flip Register 8 */
#define MC64_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00650b2u)	/* Read Data and Bit Flip Register 9 */
#define MC65_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00651a0u)	/* Read Data and Bit Flip Register 0 */
#define MC65_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00651a2u)	/* Read Data and Bit Flip Register 1 */
#define MC65_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00651b4u)	/* Read Data and Bit Flip Register 10 */
#define MC65_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00651b6u)	/* Read Data and Bit Flip Register 11 */
#define MC65_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00651b8u)	/* Read Data and Bit Flip Register 12 */
#define MC65_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00651bau)	/* Read Data and Bit Flip Register 13 */
#define MC65_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00651bcu)	/* Read Data and Bit Flip Register 14 */
#define MC65_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00651beu)	/* Read Data and Bit Flip Register 15 */
#define MC65_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00651c0u)	/* Read Data and Bit Flip Register 16 */
#define MC65_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00651c2u)	/* Read Data and Bit Flip Register 17 */
#define MC65_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00651c4u)	/* Read Data and Bit Flip Register 18 */
#define MC65_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00651c6u)	/* Read Data and Bit Flip Register 19 */
#define MC65_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00651a4u)	/* Read Data and Bit Flip Register 2 */
#define MC65_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00651c8u)	/* Read Data and Bit Flip Register 20 */
#define MC65_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00651cau)	/* Read Data and Bit Flip Register 21 */
#define MC65_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00651ccu)	/* Read Data and Bit Flip Register 22 */
#define MC65_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00651ceu)	/* Read Data and Bit Flip Register 23 */
#define MC65_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00651d0u)	/* Read Data and Bit Flip Register 24 */
#define MC65_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00651d2u)	/* Read Data and Bit Flip Register 25 */
#define MC65_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00651d4u)	/* Read Data and Bit Flip Register 26 */
#define MC65_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00651d6u)	/* Read Data and Bit Flip Register 27 */
#define MC65_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00651d8u)	/* Read Data and Bit Flip Register 28 */
#define MC65_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00651dau)	/* Read Data and Bit Flip Register 29 */
#define MC65_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00651a6u)	/* Read Data and Bit Flip Register 3 */
#define MC65_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00651dcu)	/* Read Data and Bit Flip Register 30 */
#define MC65_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00651deu)	/* Read Data and Bit Flip Register 31 */
#define MC65_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00651e0u)	/* Read Data and Bit Flip Register 32 */
#define MC65_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00651e2u)	/* Read Data and Bit Flip Register 33 */
#define MC65_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00651e4u)	/* Read Data and Bit Flip Register 34 */
#define MC65_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00651e6u)	/* Read Data and Bit Flip Register 35 */
#define MC65_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00651e8u)	/* Read Data and Bit Flip Register 36 */
#define MC65_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00651eau)	/* Read Data and Bit Flip Register 37 */
#define MC65_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00651ecu)	/* Read Data and Bit Flip Register 38 */
#define MC65_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00651eeu)	/* Read Data and Bit Flip Register 39 */
#define MC65_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00651a8u)	/* Read Data and Bit Flip Register 4 */
#define MC65_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00651aau)	/* Read Data and Bit Flip Register 5 */
#define MC65_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00651acu)	/* Read Data and Bit Flip Register 6 */
#define MC65_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00651aeu)	/* Read Data and Bit Flip Register 7 */
#define MC65_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00651b0u)	/* Read Data and Bit Flip Register 8 */
#define MC65_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00651b2u)	/* Read Data and Bit Flip Register 9 */
#define MC66_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00652a0u)	/* Read Data and Bit Flip Register 0 */
#define MC66_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00652a2u)	/* Read Data and Bit Flip Register 1 */
#define MC66_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00652b4u)	/* Read Data and Bit Flip Register 10 */
#define MC66_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00652b6u)	/* Read Data and Bit Flip Register 11 */
#define MC66_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00652b8u)	/* Read Data and Bit Flip Register 12 */
#define MC66_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00652bau)	/* Read Data and Bit Flip Register 13 */
#define MC66_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00652bcu)	/* Read Data and Bit Flip Register 14 */
#define MC66_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00652beu)	/* Read Data and Bit Flip Register 15 */
#define MC66_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00652c0u)	/* Read Data and Bit Flip Register 16 */
#define MC66_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00652c2u)	/* Read Data and Bit Flip Register 17 */
#define MC66_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00652c4u)	/* Read Data and Bit Flip Register 18 */
#define MC66_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00652c6u)	/* Read Data and Bit Flip Register 19 */
#define MC66_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00652a4u)	/* Read Data and Bit Flip Register 2 */
#define MC66_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00652c8u)	/* Read Data and Bit Flip Register 20 */
#define MC66_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00652cau)	/* Read Data and Bit Flip Register 21 */
#define MC66_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00652ccu)	/* Read Data and Bit Flip Register 22 */
#define MC66_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00652ceu)	/* Read Data and Bit Flip Register 23 */
#define MC66_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00652d0u)	/* Read Data and Bit Flip Register 24 */
#define MC66_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00652d2u)	/* Read Data and Bit Flip Register 25 */
#define MC66_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00652d4u)	/* Read Data and Bit Flip Register 26 */
#define MC66_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00652d6u)	/* Read Data and Bit Flip Register 27 */
#define MC66_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00652d8u)	/* Read Data and Bit Flip Register 28 */
#define MC66_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00652dau)	/* Read Data and Bit Flip Register 29 */
#define MC66_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00652a6u)	/* Read Data and Bit Flip Register 3 */
#define MC66_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00652dcu)	/* Read Data and Bit Flip Register 30 */
#define MC66_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00652deu)	/* Read Data and Bit Flip Register 31 */
#define MC66_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00652e0u)	/* Read Data and Bit Flip Register 32 */
#define MC66_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00652e2u)	/* Read Data and Bit Flip Register 33 */
#define MC66_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00652e4u)	/* Read Data and Bit Flip Register 34 */
#define MC66_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00652e6u)	/* Read Data and Bit Flip Register 35 */
#define MC66_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00652e8u)	/* Read Data and Bit Flip Register 36 */
#define MC66_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00652eau)	/* Read Data and Bit Flip Register 37 */
#define MC66_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00652ecu)	/* Read Data and Bit Flip Register 38 */
#define MC66_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00652eeu)	/* Read Data and Bit Flip Register 39 */
#define MC66_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00652a8u)	/* Read Data and Bit Flip Register 4 */
#define MC66_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00652aau)	/* Read Data and Bit Flip Register 5 */
#define MC66_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00652acu)	/* Read Data and Bit Flip Register 6 */
#define MC66_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00652aeu)	/* Read Data and Bit Flip Register 7 */
#define MC66_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00652b0u)	/* Read Data and Bit Flip Register 8 */
#define MC66_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00652b2u)	/* Read Data and Bit Flip Register 9 */
#define MC67_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00653a0u)	/* Read Data and Bit Flip Register 0 */
#define MC67_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00653a2u)	/* Read Data and Bit Flip Register 1 */
#define MC67_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00653b4u)	/* Read Data and Bit Flip Register 10 */
#define MC67_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00653b6u)	/* Read Data and Bit Flip Register 11 */
#define MC67_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00653b8u)	/* Read Data and Bit Flip Register 12 */
#define MC67_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00653bau)	/* Read Data and Bit Flip Register 13 */
#define MC67_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00653bcu)	/* Read Data and Bit Flip Register 14 */
#define MC67_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00653beu)	/* Read Data and Bit Flip Register 15 */
#define MC67_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00653c0u)	/* Read Data and Bit Flip Register 16 */
#define MC67_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00653c2u)	/* Read Data and Bit Flip Register 17 */
#define MC67_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00653c4u)	/* Read Data and Bit Flip Register 18 */
#define MC67_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00653c6u)	/* Read Data and Bit Flip Register 19 */
#define MC67_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00653a4u)	/* Read Data and Bit Flip Register 2 */
#define MC67_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00653c8u)	/* Read Data and Bit Flip Register 20 */
#define MC67_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00653cau)	/* Read Data and Bit Flip Register 21 */
#define MC67_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00653ccu)	/* Read Data and Bit Flip Register 22 */
#define MC67_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00653ceu)	/* Read Data and Bit Flip Register 23 */
#define MC67_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00653d0u)	/* Read Data and Bit Flip Register 24 */
#define MC67_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00653d2u)	/* Read Data and Bit Flip Register 25 */
#define MC67_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00653d4u)	/* Read Data and Bit Flip Register 26 */
#define MC67_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00653d6u)	/* Read Data and Bit Flip Register 27 */
#define MC67_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00653d8u)	/* Read Data and Bit Flip Register 28 */
#define MC67_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00653dau)	/* Read Data and Bit Flip Register 29 */
#define MC67_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00653a6u)	/* Read Data and Bit Flip Register 3 */
#define MC67_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00653dcu)	/* Read Data and Bit Flip Register 30 */
#define MC67_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00653deu)	/* Read Data and Bit Flip Register 31 */
#define MC67_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00653e0u)	/* Read Data and Bit Flip Register 32 */
#define MC67_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00653e2u)	/* Read Data and Bit Flip Register 33 */
#define MC67_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00653e4u)	/* Read Data and Bit Flip Register 34 */
#define MC67_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00653e6u)	/* Read Data and Bit Flip Register 35 */
#define MC67_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00653e8u)	/* Read Data and Bit Flip Register 36 */
#define MC67_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00653eau)	/* Read Data and Bit Flip Register 37 */
#define MC67_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00653ecu)	/* Read Data and Bit Flip Register 38 */
#define MC67_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00653eeu)	/* Read Data and Bit Flip Register 39 */
#define MC67_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00653a8u)	/* Read Data and Bit Flip Register 4 */
#define MC67_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00653aau)	/* Read Data and Bit Flip Register 5 */
#define MC67_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00653acu)	/* Read Data and Bit Flip Register 6 */
#define MC67_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00653aeu)	/* Read Data and Bit Flip Register 7 */
#define MC67_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00653b0u)	/* Read Data and Bit Flip Register 8 */
#define MC67_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00653b2u)	/* Read Data and Bit Flip Register 9 */
#define MC68_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00654a0u)	/* Read Data and Bit Flip Register 0 */
#define MC68_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00654a2u)	/* Read Data and Bit Flip Register 1 */
#define MC68_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00654b4u)	/* Read Data and Bit Flip Register 10 */
#define MC68_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00654b6u)	/* Read Data and Bit Flip Register 11 */
#define MC68_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00654b8u)	/* Read Data and Bit Flip Register 12 */
#define MC68_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00654bau)	/* Read Data and Bit Flip Register 13 */
#define MC68_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00654bcu)	/* Read Data and Bit Flip Register 14 */
#define MC68_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00654beu)	/* Read Data and Bit Flip Register 15 */
#define MC68_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00654c0u)	/* Read Data and Bit Flip Register 16 */
#define MC68_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00654c2u)	/* Read Data and Bit Flip Register 17 */
#define MC68_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00654c4u)	/* Read Data and Bit Flip Register 18 */
#define MC68_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00654c6u)	/* Read Data and Bit Flip Register 19 */
#define MC68_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00654a4u)	/* Read Data and Bit Flip Register 2 */
#define MC68_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00654c8u)	/* Read Data and Bit Flip Register 20 */
#define MC68_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00654cau)	/* Read Data and Bit Flip Register 21 */
#define MC68_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00654ccu)	/* Read Data and Bit Flip Register 22 */
#define MC68_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00654ceu)	/* Read Data and Bit Flip Register 23 */
#define MC68_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00654d0u)	/* Read Data and Bit Flip Register 24 */
#define MC68_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00654d2u)	/* Read Data and Bit Flip Register 25 */
#define MC68_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00654d4u)	/* Read Data and Bit Flip Register 26 */
#define MC68_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00654d6u)	/* Read Data and Bit Flip Register 27 */
#define MC68_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00654d8u)	/* Read Data and Bit Flip Register 28 */
#define MC68_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00654dau)	/* Read Data and Bit Flip Register 29 */
#define MC68_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00654a6u)	/* Read Data and Bit Flip Register 3 */
#define MC68_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00654dcu)	/* Read Data and Bit Flip Register 30 */
#define MC68_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00654deu)	/* Read Data and Bit Flip Register 31 */
#define MC68_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00654e0u)	/* Read Data and Bit Flip Register 32 */
#define MC68_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00654e2u)	/* Read Data and Bit Flip Register 33 */
#define MC68_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00654e4u)	/* Read Data and Bit Flip Register 34 */
#define MC68_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00654e6u)	/* Read Data and Bit Flip Register 35 */
#define MC68_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00654e8u)	/* Read Data and Bit Flip Register 36 */
#define MC68_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00654eau)	/* Read Data and Bit Flip Register 37 */
#define MC68_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00654ecu)	/* Read Data and Bit Flip Register 38 */
#define MC68_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00654eeu)	/* Read Data and Bit Flip Register 39 */
#define MC68_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00654a8u)	/* Read Data and Bit Flip Register 4 */
#define MC68_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00654aau)	/* Read Data and Bit Flip Register 5 */
#define MC68_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00654acu)	/* Read Data and Bit Flip Register 6 */
#define MC68_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00654aeu)	/* Read Data and Bit Flip Register 7 */
#define MC68_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00654b0u)	/* Read Data and Bit Flip Register 8 */
#define MC68_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00654b2u)	/* Read Data and Bit Flip Register 9 */
#define MC69_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00655a0u)	/* Read Data and Bit Flip Register 0 */
#define MC69_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00655a2u)	/* Read Data and Bit Flip Register 1 */
#define MC69_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00655b4u)	/* Read Data and Bit Flip Register 10 */
#define MC69_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00655b6u)	/* Read Data and Bit Flip Register 11 */
#define MC69_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00655b8u)	/* Read Data and Bit Flip Register 12 */
#define MC69_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00655bau)	/* Read Data and Bit Flip Register 13 */
#define MC69_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00655bcu)	/* Read Data and Bit Flip Register 14 */
#define MC69_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00655beu)	/* Read Data and Bit Flip Register 15 */
#define MC69_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00655c0u)	/* Read Data and Bit Flip Register 16 */
#define MC69_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00655c2u)	/* Read Data and Bit Flip Register 17 */
#define MC69_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00655c4u)	/* Read Data and Bit Flip Register 18 */
#define MC69_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00655c6u)	/* Read Data and Bit Flip Register 19 */
#define MC69_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00655a4u)	/* Read Data and Bit Flip Register 2 */
#define MC69_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00655c8u)	/* Read Data and Bit Flip Register 20 */
#define MC69_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00655cau)	/* Read Data and Bit Flip Register 21 */
#define MC69_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00655ccu)	/* Read Data and Bit Flip Register 22 */
#define MC69_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00655ceu)	/* Read Data and Bit Flip Register 23 */
#define MC69_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00655d0u)	/* Read Data and Bit Flip Register 24 */
#define MC69_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00655d2u)	/* Read Data and Bit Flip Register 25 */
#define MC69_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00655d4u)	/* Read Data and Bit Flip Register 26 */
#define MC69_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00655d6u)	/* Read Data and Bit Flip Register 27 */
#define MC69_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00655d8u)	/* Read Data and Bit Flip Register 28 */
#define MC69_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00655dau)	/* Read Data and Bit Flip Register 29 */
#define MC69_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00655a6u)	/* Read Data and Bit Flip Register 3 */
#define MC69_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00655dcu)	/* Read Data and Bit Flip Register 30 */
#define MC69_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00655deu)	/* Read Data and Bit Flip Register 31 */
#define MC69_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00655e0u)	/* Read Data and Bit Flip Register 32 */
#define MC69_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00655e2u)	/* Read Data and Bit Flip Register 33 */
#define MC69_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00655e4u)	/* Read Data and Bit Flip Register 34 */
#define MC69_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00655e6u)	/* Read Data and Bit Flip Register 35 */
#define MC69_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00655e8u)	/* Read Data and Bit Flip Register 36 */
#define MC69_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00655eau)	/* Read Data and Bit Flip Register 37 */
#define MC69_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00655ecu)	/* Read Data and Bit Flip Register 38 */
#define MC69_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00655eeu)	/* Read Data and Bit Flip Register 39 */
#define MC69_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00655a8u)	/* Read Data and Bit Flip Register 4 */
#define MC69_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00655aau)	/* Read Data and Bit Flip Register 5 */
#define MC69_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00655acu)	/* Read Data and Bit Flip Register 6 */
#define MC69_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00655aeu)	/* Read Data and Bit Flip Register 7 */
#define MC69_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00655b0u)	/* Read Data and Bit Flip Register 8 */
#define MC69_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00655b2u)	/* Read Data and Bit Flip Register 9 */
#define MC6_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00616a0u)	/* Read Data and Bit Flip Register 0 */
#define MC6_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00616a2u)	/* Read Data and Bit Flip Register 1 */
#define MC6_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00616b4u)	/* Read Data and Bit Flip Register 10 */
#define MC6_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00616b6u)	/* Read Data and Bit Flip Register 11 */
#define MC6_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00616b8u)	/* Read Data and Bit Flip Register 12 */
#define MC6_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00616bau)	/* Read Data and Bit Flip Register 13 */
#define MC6_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00616bcu)	/* Read Data and Bit Flip Register 14 */
#define MC6_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00616beu)	/* Read Data and Bit Flip Register 15 */
#define MC6_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00616c0u)	/* Read Data and Bit Flip Register 16 */
#define MC6_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00616c2u)	/* Read Data and Bit Flip Register 17 */
#define MC6_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00616c4u)	/* Read Data and Bit Flip Register 18 */
#define MC6_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00616c6u)	/* Read Data and Bit Flip Register 19 */
#define MC6_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00616a4u)	/* Read Data and Bit Flip Register 2 */
#define MC6_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00616c8u)	/* Read Data and Bit Flip Register 20 */
#define MC6_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00616cau)	/* Read Data and Bit Flip Register 21 */
#define MC6_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00616ccu)	/* Read Data and Bit Flip Register 22 */
#define MC6_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00616ceu)	/* Read Data and Bit Flip Register 23 */
#define MC6_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00616d0u)	/* Read Data and Bit Flip Register 24 */
#define MC6_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00616d2u)	/* Read Data and Bit Flip Register 25 */
#define MC6_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00616d4u)	/* Read Data and Bit Flip Register 26 */
#define MC6_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00616d6u)	/* Read Data and Bit Flip Register 27 */
#define MC6_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00616d8u)	/* Read Data and Bit Flip Register 28 */
#define MC6_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00616dau)	/* Read Data and Bit Flip Register 29 */
#define MC6_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00616a6u)	/* Read Data and Bit Flip Register 3 */
#define MC6_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00616dcu)	/* Read Data and Bit Flip Register 30 */
#define MC6_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00616deu)	/* Read Data and Bit Flip Register 31 */
#define MC6_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00616e0u)	/* Read Data and Bit Flip Register 32 */
#define MC6_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00616e2u)	/* Read Data and Bit Flip Register 33 */
#define MC6_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00616e4u)	/* Read Data and Bit Flip Register 34 */
#define MC6_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00616e6u)	/* Read Data and Bit Flip Register 35 */
#define MC6_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00616e8u)	/* Read Data and Bit Flip Register 36 */
#define MC6_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00616eau)	/* Read Data and Bit Flip Register 37 */
#define MC6_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00616ecu)	/* Read Data and Bit Flip Register 38 */
#define MC6_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00616eeu)	/* Read Data and Bit Flip Register 39 */
#define MC6_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00616a8u)	/* Read Data and Bit Flip Register 4 */
#define MC6_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00616aau)	/* Read Data and Bit Flip Register 5 */
#define MC6_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00616acu)	/* Read Data and Bit Flip Register 6 */
#define MC6_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00616aeu)	/* Read Data and Bit Flip Register 7 */
