svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC6_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00616b0u)	/* Read Data and Bit Flip Register 8 */
#define MC6_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00616b2u)	/* Read Data and Bit Flip Register 9 */
#define MC70_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00656a0u)	/* Read Data and Bit Flip Register 0 */
#define MC70_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00656a2u)	/* Read Data and Bit Flip Register 1 */
#define MC70_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00656b4u)	/* Read Data and Bit Flip Register 10 */
#define MC70_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00656b6u)	/* Read Data and Bit Flip Register 11 */
#define MC70_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00656b8u)	/* Read Data and Bit Flip Register 12 */
#define MC70_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00656bau)	/* Read Data and Bit Flip Register 13 */
#define MC70_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00656bcu)	/* Read Data and Bit Flip Register 14 */
#define MC70_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00656beu)	/* Read Data and Bit Flip Register 15 */
#define MC70_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00656c0u)	/* Read Data and Bit Flip Register 16 */
#define MC70_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00656c2u)	/* Read Data and Bit Flip Register 17 */
#define MC70_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00656c4u)	/* Read Data and Bit Flip Register 18 */
#define MC70_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00656c6u)	/* Read Data and Bit Flip Register 19 */
#define MC70_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00656a4u)	/* Read Data and Bit Flip Register 2 */
#define MC70_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00656c8u)	/* Read Data and Bit Flip Register 20 */
#define MC70_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00656cau)	/* Read Data and Bit Flip Register 21 */
#define MC70_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00656ccu)	/* Read Data and Bit Flip Register 22 */
#define MC70_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00656ceu)	/* Read Data and Bit Flip Register 23 */
#define MC70_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00656d0u)	/* Read Data and Bit Flip Register 24 */
#define MC70_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00656d2u)	/* Read Data and Bit Flip Register 25 */
#define MC70_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00656d4u)	/* Read Data and Bit Flip Register 26 */
#define MC70_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00656d6u)	/* Read Data and Bit Flip Register 27 */
#define MC70_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00656d8u)	/* Read Data and Bit Flip Register 28 */
#define MC70_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00656dau)	/* Read Data and Bit Flip Register 29 */
#define MC70_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00656a6u)	/* Read Data and Bit Flip Register 3 */
#define MC70_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00656dcu)	/* Read Data and Bit Flip Register 30 */
#define MC70_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00656deu)	/* Read Data and Bit Flip Register 31 */
#define MC70_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00656e0u)	/* Read Data and Bit Flip Register 32 */
#define MC70_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00656e2u)	/* Read Data and Bit Flip Register 33 */
#define MC70_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00656e4u)	/* Read Data and Bit Flip Register 34 */
#define MC70_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00656e6u)	/* Read Data and Bit Flip Register 35 */
#define MC70_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00656e8u)	/* Read Data and Bit Flip Register 36 */
#define MC70_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00656eau)	/* Read Data and Bit Flip Register 37 */
#define MC70_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00656ecu)	/* Read Data and Bit Flip Register 38 */
#define MC70_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00656eeu)	/* Read Data and Bit Flip Register 39 */
#define MC70_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00656a8u)	/* Read Data and Bit Flip Register 4 */
#define MC70_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00656aau)	/* Read Data and Bit Flip Register 5 */
#define MC70_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00656acu)	/* Read Data and Bit Flip Register 6 */
#define MC70_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00656aeu)	/* Read Data and Bit Flip Register 7 */
#define MC70_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00656b0u)	/* Read Data and Bit Flip Register 8 */
#define MC70_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00656b2u)	/* Read Data and Bit Flip Register 9 */
#define MC71_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00657a0u)	/* Read Data and Bit Flip Register 0 */
#define MC71_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00657a2u)	/* Read Data and Bit Flip Register 1 */
#define MC71_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00657b4u)	/* Read Data and Bit Flip Register 10 */
#define MC71_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00657b6u)	/* Read Data and Bit Flip Register 11 */
#define MC71_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00657b8u)	/* Read Data and Bit Flip Register 12 */
#define MC71_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00657bau)	/* Read Data and Bit Flip Register 13 */
#define MC71_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00657bcu)	/* Read Data and Bit Flip Register 14 */
#define MC71_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00657beu)	/* Read Data and Bit Flip Register 15 */
#define MC71_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00657c0u)	/* Read Data and Bit Flip Register 16 */
#define MC71_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00657c2u)	/* Read Data and Bit Flip Register 17 */
#define MC71_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00657c4u)	/* Read Data and Bit Flip Register 18 */
#define MC71_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00657c6u)	/* Read Data and Bit Flip Register 19 */
#define MC71_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00657a4u)	/* Read Data and Bit Flip Register 2 */
#define MC71_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00657c8u)	/* Read Data and Bit Flip Register 20 */
#define MC71_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00657cau)	/* Read Data and Bit Flip Register 21 */
#define MC71_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00657ccu)	/* Read Data and Bit Flip Register 22 */
#define MC71_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00657ceu)	/* Read Data and Bit Flip Register 23 */
#define MC71_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00657d0u)	/* Read Data and Bit Flip Register 24 */
#define MC71_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00657d2u)	/* Read Data and Bit Flip Register 25 */
#define MC71_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00657d4u)	/* Read Data and Bit Flip Register 26 */
#define MC71_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00657d6u)	/* Read Data and Bit Flip Register 27 */
#define MC71_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00657d8u)	/* Read Data and Bit Flip Register 28 */
#define MC71_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00657dau)	/* Read Data and Bit Flip Register 29 */
#define MC71_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00657a6u)	/* Read Data and Bit Flip Register 3 */
#define MC71_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00657dcu)	/* Read Data and Bit Flip Register 30 */
#define MC71_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00657deu)	/* Read Data and Bit Flip Register 31 */
#define MC71_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00657e0u)	/* Read Data and Bit Flip Register 32 */
#define MC71_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00657e2u)	/* Read Data and Bit Flip Register 33 */
#define MC71_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00657e4u)	/* Read Data and Bit Flip Register 34 */
#define MC71_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00657e6u)	/* Read Data and Bit Flip Register 35 */
#define MC71_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00657e8u)	/* Read Data and Bit Flip Register 36 */
#define MC71_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00657eau)	/* Read Data and Bit Flip Register 37 */
#define MC71_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00657ecu)	/* Read Data and Bit Flip Register 38 */
#define MC71_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00657eeu)	/* Read Data and Bit Flip Register 39 */
#define MC71_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00657a8u)	/* Read Data and Bit Flip Register 4 */
#define MC71_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00657aau)	/* Read Data and Bit Flip Register 5 */
#define MC71_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00657acu)	/* Read Data and Bit Flip Register 6 */
#define MC71_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00657aeu)	/* Read Data and Bit Flip Register 7 */
#define MC71_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00657b0u)	/* Read Data and Bit Flip Register 8 */
#define MC71_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00657b2u)	/* Read Data and Bit Flip Register 9 */
#define MC72_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00658a0u)	/* Read Data and Bit Flip Register 0 */
#define MC72_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00658a2u)	/* Read Data and Bit Flip Register 1 */
#define MC72_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00658b4u)	/* Read Data and Bit Flip Register 10 */
#define MC72_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00658b6u)	/* Read Data and Bit Flip Register 11 */
#define MC72_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00658b8u)	/* Read Data and Bit Flip Register 12 */
#define MC72_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00658bau)	/* Read Data and Bit Flip Register 13 */
#define MC72_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00658bcu)	/* Read Data and Bit Flip Register 14 */
#define MC72_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00658beu)	/* Read Data and Bit Flip Register 15 */
#define MC72_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00658c0u)	/* Read Data and Bit Flip Register 16 */
#define MC72_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00658c2u)	/* Read Data and Bit Flip Register 17 */
#define MC72_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00658c4u)	/* Read Data and Bit Flip Register 18 */
#define MC72_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00658c6u)	/* Read Data and Bit Flip Register 19 */
#define MC72_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00658a4u)	/* Read Data and Bit Flip Register 2 */
#define MC72_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00658c8u)	/* Read Data and Bit Flip Register 20 */
#define MC72_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00658cau)	/* Read Data and Bit Flip Register 21 */
#define MC72_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00658ccu)	/* Read Data and Bit Flip Register 22 */
#define MC72_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00658ceu)	/* Read Data and Bit Flip Register 23 */
#define MC72_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00658d0u)	/* Read Data and Bit Flip Register 24 */
#define MC72_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00658d2u)	/* Read Data and Bit Flip Register 25 */
#define MC72_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00658d4u)	/* Read Data and Bit Flip Register 26 */
#define MC72_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00658d6u)	/* Read Data and Bit Flip Register 27 */
#define MC72_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00658d8u)	/* Read Data and Bit Flip Register 28 */
#define MC72_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00658dau)	/* Read Data and Bit Flip Register 29 */
#define MC72_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00658a6u)	/* Read Data and Bit Flip Register 3 */
#define MC72_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00658dcu)	/* Read Data and Bit Flip Register 30 */
#define MC72_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00658deu)	/* Read Data and Bit Flip Register 31 */
#define MC72_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00658e0u)	/* Read Data and Bit Flip Register 32 */
#define MC72_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00658e2u)	/* Read Data and Bit Flip Register 33 */
#define MC72_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00658e4u)	/* Read Data and Bit Flip Register 34 */
#define MC72_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00658e6u)	/* Read Data and Bit Flip Register 35 */
#define MC72_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00658e8u)	/* Read Data and Bit Flip Register 36 */
#define MC72_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00658eau)	/* Read Data and Bit Flip Register 37 */
#define MC72_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00658ecu)	/* Read Data and Bit Flip Register 38 */
#define MC72_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00658eeu)	/* Read Data and Bit Flip Register 39 */
#define MC72_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00658a8u)	/* Read Data and Bit Flip Register 4 */
#define MC72_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00658aau)	/* Read Data and Bit Flip Register 5 */
#define MC72_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00658acu)	/* Read Data and Bit Flip Register 6 */
#define MC72_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00658aeu)	/* Read Data and Bit Flip Register 7 */
#define MC72_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00658b0u)	/* Read Data and Bit Flip Register 8 */
#define MC72_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00658b2u)	/* Read Data and Bit Flip Register 9 */
#define MC73_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00659a0u)	/* Read Data and Bit Flip Register 0 */
#define MC73_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00659a2u)	/* Read Data and Bit Flip Register 1 */
#define MC73_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00659b4u)	/* Read Data and Bit Flip Register 10 */
#define MC73_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00659b6u)	/* Read Data and Bit Flip Register 11 */
#define MC73_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00659b8u)	/* Read Data and Bit Flip Register 12 */
#define MC73_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00659bau)	/* Read Data and Bit Flip Register 13 */
#define MC73_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00659bcu)	/* Read Data and Bit Flip Register 14 */
#define MC73_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00659beu)	/* Read Data and Bit Flip Register 15 */
#define MC73_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00659c0u)	/* Read Data and Bit Flip Register 16 */
#define MC73_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00659c2u)	/* Read Data and Bit Flip Register 17 */
#define MC73_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00659c4u)	/* Read Data and Bit Flip Register 18 */
#define MC73_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00659c6u)	/* Read Data and Bit Flip Register 19 */
#define MC73_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00659a4u)	/* Read Data and Bit Flip Register 2 */
#define MC73_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00659c8u)	/* Read Data and Bit Flip Register 20 */
#define MC73_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00659cau)	/* Read Data and Bit Flip Register 21 */
#define MC73_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00659ccu)	/* Read Data and Bit Flip Register 22 */
#define MC73_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00659ceu)	/* Read Data and Bit Flip Register 23 */
#define MC73_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00659d0u)	/* Read Data and Bit Flip Register 24 */
#define MC73_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00659d2u)	/* Read Data and Bit Flip Register 25 */
#define MC73_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00659d4u)	/* Read Data and Bit Flip Register 26 */
#define MC73_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00659d6u)	/* Read Data and Bit Flip Register 27 */
#define MC73_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00659d8u)	/* Read Data and Bit Flip Register 28 */
#define MC73_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00659dau)	/* Read Data and Bit Flip Register 29 */
#define MC73_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00659a6u)	/* Read Data and Bit Flip Register 3 */
#define MC73_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00659dcu)	/* Read Data and Bit Flip Register 30 */
#define MC73_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00659deu)	/* Read Data and Bit Flip Register 31 */
#define MC73_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00659e0u)	/* Read Data and Bit Flip Register 32 */
#define MC73_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00659e2u)	/* Read Data and Bit Flip Register 33 */
#define MC73_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00659e4u)	/* Read Data and Bit Flip Register 34 */
#define MC73_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00659e6u)	/* Read Data and Bit Flip Register 35 */
#define MC73_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00659e8u)	/* Read Data and Bit Flip Register 36 */
#define MC73_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00659eau)	/* Read Data and Bit Flip Register 37 */
#define MC73_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00659ecu)	/* Read Data and Bit Flip Register 38 */
#define MC73_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00659eeu)	/* Read Data and Bit Flip Register 39 */
#define MC73_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00659a8u)	/* Read Data and Bit Flip Register 4 */
#define MC73_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00659aau)	/* Read Data and Bit Flip Register 5 */
#define MC73_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00659acu)	/* Read Data and Bit Flip Register 6 */
#define MC73_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00659aeu)	/* Read Data and Bit Flip Register 7 */
#define MC73_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00659b0u)	/* Read Data and Bit Flip Register 8 */
#define MC73_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00659b2u)	/* Read Data and Bit Flip Register 9 */
#define MC74_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0065aa0u)	/* Read Data and Bit Flip Register 0 */
#define MC74_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0065aa2u)	/* Read Data and Bit Flip Register 1 */
#define MC74_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0065ab4u)	/* Read Data and Bit Flip Register 10 */
#define MC74_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0065ab6u)	/* Read Data and Bit Flip Register 11 */
#define MC74_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0065ab8u)	/* Read Data and Bit Flip Register 12 */
#define MC74_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0065abau)	/* Read Data and Bit Flip Register 13 */
#define MC74_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0065abcu)	/* Read Data and Bit Flip Register 14 */
#define MC74_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0065abeu)	/* Read Data and Bit Flip Register 15 */
#define MC74_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0065ac0u)	/* Read Data and Bit Flip Register 16 */
#define MC74_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0065ac2u)	/* Read Data and Bit Flip Register 17 */
#define MC74_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0065ac4u)	/* Read Data and Bit Flip Register 18 */
#define MC74_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0065ac6u)	/* Read Data and Bit Flip Register 19 */
#define MC74_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0065aa4u)	/* Read Data and Bit Flip Register 2 */
#define MC74_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0065ac8u)	/* Read Data and Bit Flip Register 20 */
#define MC74_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0065acau)	/* Read Data and Bit Flip Register 21 */
#define MC74_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0065accu)	/* Read Data and Bit Flip Register 22 */
#define MC74_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0065aceu)	/* Read Data and Bit Flip Register 23 */
#define MC74_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0065ad0u)	/* Read Data and Bit Flip Register 24 */
#define MC74_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0065ad2u)	/* Read Data and Bit Flip Register 25 */
#define MC74_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0065ad4u)	/* Read Data and Bit Flip Register 26 */
#define MC74_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0065ad6u)	/* Read Data and Bit Flip Register 27 */
#define MC74_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0065ad8u)	/* Read Data and Bit Flip Register 28 */
#define MC74_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0065adau)	/* Read Data and Bit Flip Register 29 */
#define MC74_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0065aa6u)	/* Read Data and Bit Flip Register 3 */
#define MC74_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0065adcu)	/* Read Data and Bit Flip Register 30 */
#define MC74_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0065adeu)	/* Read Data and Bit Flip Register 31 */
#define MC74_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0065ae0u)	/* Read Data and Bit Flip Register 32 */
#define MC74_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0065ae2u)	/* Read Data and Bit Flip Register 33 */
#define MC74_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0065ae4u)	/* Read Data and Bit Flip Register 34 */
#define MC74_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0065ae6u)	/* Read Data and Bit Flip Register 35 */
#define MC74_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0065ae8u)	/* Read Data and Bit Flip Register 36 */
#define MC74_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0065aeau)	/* Read Data and Bit Flip Register 37 */
#define MC74_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0065aecu)	/* Read Data and Bit Flip Register 38 */
#define MC74_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0065aeeu)	/* Read Data and Bit Flip Register 39 */
#define MC74_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0065aa8u)	/* Read Data and Bit Flip Register 4 */
#define MC74_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0065aaau)	/* Read Data and Bit Flip Register 5 */
#define MC74_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0065aacu)	/* Read Data and Bit Flip Register 6 */
#define MC74_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0065aaeu)	/* Read Data and Bit Flip Register 7 */
#define MC74_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0065ab0u)	/* Read Data and Bit Flip Register 8 */
#define MC74_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0065ab2u)	/* Read Data and Bit Flip Register 9 */
#define MC75_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0065ba0u)	/* Read Data and Bit Flip Register 0 */
#define MC75_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0065ba2u)	/* Read Data and Bit Flip Register 1 */
#define MC75_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0065bb4u)	/* Read Data and Bit Flip Register 10 */
#define MC75_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0065bb6u)	/* Read Data and Bit Flip Register 11 */
#define MC75_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0065bb8u)	/* Read Data and Bit Flip Register 12 */
#define MC75_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0065bbau)	/* Read Data and Bit Flip Register 13 */
#define MC75_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0065bbcu)	/* Read Data and Bit Flip Register 14 */
#define MC75_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0065bbeu)	/* Read Data and Bit Flip Register 15 */
#define MC75_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0065bc0u)	/* Read Data and Bit Flip Register 16 */
#define MC75_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0065bc2u)	/* Read Data and Bit Flip Register 17 */
#define MC75_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0065bc4u)	/* Read Data and Bit Flip Register 18 */
#define MC75_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0065bc6u)	/* Read Data and Bit Flip Register 19 */
#define MC75_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0065ba4u)	/* Read Data and Bit Flip Register 2 */
#define MC75_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0065bc8u)	/* Read Data and Bit Flip Register 20 */
#define MC75_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0065bcau)	/* Read Data and Bit Flip Register 21 */
#define MC75_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0065bccu)	/* Read Data and Bit Flip Register 22 */
#define MC75_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0065bceu)	/* Read Data and Bit Flip Register 23 */
#define MC75_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0065bd0u)	/* Read Data and Bit Flip Register 24 */
#define MC75_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0065bd2u)	/* Read Data and Bit Flip Register 25 */
#define MC75_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0065bd4u)	/* Read Data and Bit Flip Register 26 */
#define MC75_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0065bd6u)	/* Read Data and Bit Flip Register 27 */
#define MC75_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0065bd8u)	/* Read Data and Bit Flip Register 28 */
#define MC75_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0065bdau)	/* Read Data and Bit Flip Register 29 */
#define MC75_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0065ba6u)	/* Read Data and Bit Flip Register 3 */
#define MC75_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0065bdcu)	/* Read Data and Bit Flip Register 30 */
#define MC75_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0065bdeu)	/* Read Data and Bit Flip Register 31 */
#define MC75_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0065be0u)	/* Read Data and Bit Flip Register 32 */
#define MC75_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0065be2u)	/* Read Data and Bit Flip Register 33 */
#define MC75_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0065be4u)	/* Read Data and Bit Flip Register 34 */
#define MC75_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0065be6u)	/* Read Data and Bit Flip Register 35 */
#define MC75_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0065be8u)	/* Read Data and Bit Flip Register 36 */
#define MC75_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0065beau)	/* Read Data and Bit Flip Register 37 */
#define MC75_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0065becu)	/* Read Data and Bit Flip Register 38 */
#define MC75_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0065beeu)	/* Read Data and Bit Flip Register 39 */
#define MC75_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0065ba8u)	/* Read Data and Bit Flip Register 4 */
#define MC75_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0065baau)	/* Read Data and Bit Flip Register 5 */
#define MC75_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0065bacu)	/* Read Data and Bit Flip Register 6 */
#define MC75_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0065baeu)	/* Read Data and Bit Flip Register 7 */
#define MC75_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0065bb0u)	/* Read Data and Bit Flip Register 8 */
#define MC75_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0065bb2u)	/* Read Data and Bit Flip Register 9 */
#define MC76_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0065ca0u)	/* Read Data and Bit Flip Register 0 */
