svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC76_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0065ca2u)	/* Read Data and Bit Flip Register 1 */
#define MC76_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0065cb4u)	/* Read Data and Bit Flip Register 10 */
#define MC76_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0065cb6u)	/* Read Data and Bit Flip Register 11 */
#define MC76_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0065cb8u)	/* Read Data and Bit Flip Register 12 */
#define MC76_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0065cbau)	/* Read Data and Bit Flip Register 13 */
#define MC76_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0065cbcu)	/* Read Data and Bit Flip Register 14 */
#define MC76_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0065cbeu)	/* Read Data and Bit Flip Register 15 */
#define MC76_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0065cc0u)	/* Read Data and Bit Flip Register 16 */
#define MC76_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0065cc2u)	/* Read Data and Bit Flip Register 17 */
#define MC76_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0065cc4u)	/* Read Data and Bit Flip Register 18 */
#define MC76_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0065cc6u)	/* Read Data and Bit Flip Register 19 */
#define MC76_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0065ca4u)	/* Read Data and Bit Flip Register 2 */
#define MC76_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0065cc8u)	/* Read Data and Bit Flip Register 20 */
#define MC76_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0065ccau)	/* Read Data and Bit Flip Register 21 */
#define MC76_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0065cccu)	/* Read Data and Bit Flip Register 22 */
#define MC76_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0065cceu)	/* Read Data and Bit Flip Register 23 */
#define MC76_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0065cd0u)	/* Read Data and Bit Flip Register 24 */
#define MC76_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0065cd2u)	/* Read Data and Bit Flip Register 25 */
#define MC76_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0065cd4u)	/* Read Data and Bit Flip Register 26 */
#define MC76_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0065cd6u)	/* Read Data and Bit Flip Register 27 */
#define MC76_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0065cd8u)	/* Read Data and Bit Flip Register 28 */
#define MC76_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0065cdau)	/* Read Data and Bit Flip Register 29 */
#define MC76_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0065ca6u)	/* Read Data and Bit Flip Register 3 */
#define MC76_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0065cdcu)	/* Read Data and Bit Flip Register 30 */
#define MC76_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0065cdeu)	/* Read Data and Bit Flip Register 31 */
#define MC76_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0065ce0u)	/* Read Data and Bit Flip Register 32 */
#define MC76_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0065ce2u)	/* Read Data and Bit Flip Register 33 */
#define MC76_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0065ce4u)	/* Read Data and Bit Flip Register 34 */
#define MC76_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0065ce6u)	/* Read Data and Bit Flip Register 35 */
#define MC76_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0065ce8u)	/* Read Data and Bit Flip Register 36 */
#define MC76_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0065ceau)	/* Read Data and Bit Flip Register 37 */
#define MC76_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0065cecu)	/* Read Data and Bit Flip Register 38 */
#define MC76_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0065ceeu)	/* Read Data and Bit Flip Register 39 */
#define MC76_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0065ca8u)	/* Read Data and Bit Flip Register 4 */
#define MC76_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0065caau)	/* Read Data and Bit Flip Register 5 */
#define MC76_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0065cacu)	/* Read Data and Bit Flip Register 6 */
#define MC76_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0065caeu)	/* Read Data and Bit Flip Register 7 */
#define MC76_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0065cb0u)	/* Read Data and Bit Flip Register 8 */
#define MC76_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0065cb2u)	/* Read Data and Bit Flip Register 9 */
#define MC77_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0065da0u)	/* Read Data and Bit Flip Register 0 */
#define MC77_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0065da2u)	/* Read Data and Bit Flip Register 1 */
#define MC77_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0065db4u)	/* Read Data and Bit Flip Register 10 */
#define MC77_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0065db6u)	/* Read Data and Bit Flip Register 11 */
#define MC77_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0065db8u)	/* Read Data and Bit Flip Register 12 */
#define MC77_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0065dbau)	/* Read Data and Bit Flip Register 13 */
#define MC77_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0065dbcu)	/* Read Data and Bit Flip Register 14 */
#define MC77_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0065dbeu)	/* Read Data and Bit Flip Register 15 */
#define MC77_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0065dc0u)	/* Read Data and Bit Flip Register 16 */
#define MC77_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0065dc2u)	/* Read Data and Bit Flip Register 17 */
#define MC77_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0065dc4u)	/* Read Data and Bit Flip Register 18 */
#define MC77_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0065dc6u)	/* Read Data and Bit Flip Register 19 */
#define MC77_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0065da4u)	/* Read Data and Bit Flip Register 2 */
#define MC77_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0065dc8u)	/* Read Data and Bit Flip Register 20 */
#define MC77_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0065dcau)	/* Read Data and Bit Flip Register 21 */
#define MC77_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0065dccu)	/* Read Data and Bit Flip Register 22 */
#define MC77_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0065dceu)	/* Read Data and Bit Flip Register 23 */
#define MC77_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0065dd0u)	/* Read Data and Bit Flip Register 24 */
#define MC77_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0065dd2u)	/* Read Data and Bit Flip Register 25 */
#define MC77_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0065dd4u)	/* Read Data and Bit Flip Register 26 */
#define MC77_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0065dd6u)	/* Read Data and Bit Flip Register 27 */
#define MC77_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0065dd8u)	/* Read Data and Bit Flip Register 28 */
#define MC77_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0065ddau)	/* Read Data and Bit Flip Register 29 */
#define MC77_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0065da6u)	/* Read Data and Bit Flip Register 3 */
#define MC77_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0065ddcu)	/* Read Data and Bit Flip Register 30 */
#define MC77_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0065ddeu)	/* Read Data and Bit Flip Register 31 */
#define MC77_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0065de0u)	/* Read Data and Bit Flip Register 32 */
#define MC77_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0065de2u)	/* Read Data and Bit Flip Register 33 */
#define MC77_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0065de4u)	/* Read Data and Bit Flip Register 34 */
#define MC77_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0065de6u)	/* Read Data and Bit Flip Register 35 */
#define MC77_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0065de8u)	/* Read Data and Bit Flip Register 36 */
#define MC77_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0065deau)	/* Read Data and Bit Flip Register 37 */
#define MC77_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0065decu)	/* Read Data and Bit Flip Register 38 */
#define MC77_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0065deeu)	/* Read Data and Bit Flip Register 39 */
#define MC77_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0065da8u)	/* Read Data and Bit Flip Register 4 */
#define MC77_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0065daau)	/* Read Data and Bit Flip Register 5 */
#define MC77_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0065dacu)	/* Read Data and Bit Flip Register 6 */
#define MC77_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0065daeu)	/* Read Data and Bit Flip Register 7 */
#define MC77_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0065db0u)	/* Read Data and Bit Flip Register 8 */
#define MC77_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0065db2u)	/* Read Data and Bit Flip Register 9 */
#define MC78_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0065ea0u)	/* Read Data and Bit Flip Register 0 */
#define MC78_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0065ea2u)	/* Read Data and Bit Flip Register 1 */
#define MC78_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0065eb4u)	/* Read Data and Bit Flip Register 10 */
#define MC78_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0065eb6u)	/* Read Data and Bit Flip Register 11 */
#define MC78_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0065eb8u)	/* Read Data and Bit Flip Register 12 */
#define MC78_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0065ebau)	/* Read Data and Bit Flip Register 13 */
#define MC78_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0065ebcu)	/* Read Data and Bit Flip Register 14 */
#define MC78_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0065ebeu)	/* Read Data and Bit Flip Register 15 */
#define MC78_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0065ec0u)	/* Read Data and Bit Flip Register 16 */
#define MC78_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0065ec2u)	/* Read Data and Bit Flip Register 17 */
#define MC78_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0065ec4u)	/* Read Data and Bit Flip Register 18 */
#define MC78_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0065ec6u)	/* Read Data and Bit Flip Register 19 */
#define MC78_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0065ea4u)	/* Read Data and Bit Flip Register 2 */
#define MC78_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0065ec8u)	/* Read Data and Bit Flip Register 20 */
#define MC78_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0065ecau)	/* Read Data and Bit Flip Register 21 */
#define MC78_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0065eccu)	/* Read Data and Bit Flip Register 22 */
#define MC78_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0065eceu)	/* Read Data and Bit Flip Register 23 */
#define MC78_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0065ed0u)	/* Read Data and Bit Flip Register 24 */
#define MC78_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0065ed2u)	/* Read Data and Bit Flip Register 25 */
#define MC78_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0065ed4u)	/* Read Data and Bit Flip Register 26 */
#define MC78_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0065ed6u)	/* Read Data and Bit Flip Register 27 */
#define MC78_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0065ed8u)	/* Read Data and Bit Flip Register 28 */
#define MC78_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0065edau)	/* Read Data and Bit Flip Register 29 */
#define MC78_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0065ea6u)	/* Read Data and Bit Flip Register 3 */
#define MC78_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0065edcu)	/* Read Data and Bit Flip Register 30 */
#define MC78_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0065edeu)	/* Read Data and Bit Flip Register 31 */
#define MC78_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0065ee0u)	/* Read Data and Bit Flip Register 32 */
#define MC78_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0065ee2u)	/* Read Data and Bit Flip Register 33 */
#define MC78_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0065ee4u)	/* Read Data and Bit Flip Register 34 */
#define MC78_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0065ee6u)	/* Read Data and Bit Flip Register 35 */
#define MC78_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0065ee8u)	/* Read Data and Bit Flip Register 36 */
#define MC78_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0065eeau)	/* Read Data and Bit Flip Register 37 */
#define MC78_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0065eecu)	/* Read Data and Bit Flip Register 38 */
#define MC78_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0065eeeu)	/* Read Data and Bit Flip Register 39 */
#define MC78_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0065ea8u)	/* Read Data and Bit Flip Register 4 */
#define MC78_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0065eaau)	/* Read Data and Bit Flip Register 5 */
#define MC78_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0065eacu)	/* Read Data and Bit Flip Register 6 */
#define MC78_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0065eaeu)	/* Read Data and Bit Flip Register 7 */
#define MC78_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0065eb0u)	/* Read Data and Bit Flip Register 8 */
#define MC78_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0065eb2u)	/* Read Data and Bit Flip Register 9 */
#define MC79_RDBFL0	(*( MC0_RDBFL0_type *) 0xf0065fa0u)	/* Read Data and Bit Flip Register 0 */
#define MC79_RDBFL1	(*( MC0_RDBFL0_type *) 0xf0065fa2u)	/* Read Data and Bit Flip Register 1 */
#define MC79_RDBFL10	(*( MC0_RDBFL0_type *) 0xf0065fb4u)	/* Read Data and Bit Flip Register 10 */
#define MC79_RDBFL11	(*( MC0_RDBFL0_type *) 0xf0065fb6u)	/* Read Data and Bit Flip Register 11 */
#define MC79_RDBFL12	(*( MC0_RDBFL0_type *) 0xf0065fb8u)	/* Read Data and Bit Flip Register 12 */
#define MC79_RDBFL13	(*( MC0_RDBFL0_type *) 0xf0065fbau)	/* Read Data and Bit Flip Register 13 */
#define MC79_RDBFL14	(*( MC0_RDBFL0_type *) 0xf0065fbcu)	/* Read Data and Bit Flip Register 14 */
#define MC79_RDBFL15	(*( MC0_RDBFL0_type *) 0xf0065fbeu)	/* Read Data and Bit Flip Register 15 */
#define MC79_RDBFL16	(*( MC0_RDBFL0_type *) 0xf0065fc0u)	/* Read Data and Bit Flip Register 16 */
#define MC79_RDBFL17	(*( MC0_RDBFL0_type *) 0xf0065fc2u)	/* Read Data and Bit Flip Register 17 */
#define MC79_RDBFL18	(*( MC0_RDBFL0_type *) 0xf0065fc4u)	/* Read Data and Bit Flip Register 18 */
#define MC79_RDBFL19	(*( MC0_RDBFL0_type *) 0xf0065fc6u)	/* Read Data and Bit Flip Register 19 */
#define MC79_RDBFL2	(*( MC0_RDBFL0_type *) 0xf0065fa4u)	/* Read Data and Bit Flip Register 2 */
#define MC79_RDBFL20	(*( MC0_RDBFL0_type *) 0xf0065fc8u)	/* Read Data and Bit Flip Register 20 */
#define MC79_RDBFL21	(*( MC0_RDBFL0_type *) 0xf0065fcau)	/* Read Data and Bit Flip Register 21 */
#define MC79_RDBFL22	(*( MC0_RDBFL0_type *) 0xf0065fccu)	/* Read Data and Bit Flip Register 22 */
#define MC79_RDBFL23	(*( MC0_RDBFL0_type *) 0xf0065fceu)	/* Read Data and Bit Flip Register 23 */
#define MC79_RDBFL24	(*( MC0_RDBFL0_type *) 0xf0065fd0u)	/* Read Data and Bit Flip Register 24 */
#define MC79_RDBFL25	(*( MC0_RDBFL0_type *) 0xf0065fd2u)	/* Read Data and Bit Flip Register 25 */
#define MC79_RDBFL26	(*( MC0_RDBFL0_type *) 0xf0065fd4u)	/* Read Data and Bit Flip Register 26 */
#define MC79_RDBFL27	(*( MC0_RDBFL0_type *) 0xf0065fd6u)	/* Read Data and Bit Flip Register 27 */
#define MC79_RDBFL28	(*( MC0_RDBFL0_type *) 0xf0065fd8u)	/* Read Data and Bit Flip Register 28 */
#define MC79_RDBFL29	(*( MC0_RDBFL0_type *) 0xf0065fdau)	/* Read Data and Bit Flip Register 29 */
#define MC79_RDBFL3	(*( MC0_RDBFL0_type *) 0xf0065fa6u)	/* Read Data and Bit Flip Register 3 */
#define MC79_RDBFL30	(*( MC0_RDBFL0_type *) 0xf0065fdcu)	/* Read Data and Bit Flip Register 30 */
#define MC79_RDBFL31	(*( MC0_RDBFL0_type *) 0xf0065fdeu)	/* Read Data and Bit Flip Register 31 */
#define MC79_RDBFL32	(*( MC0_RDBFL0_type *) 0xf0065fe0u)	/* Read Data and Bit Flip Register 32 */
#define MC79_RDBFL33	(*( MC0_RDBFL0_type *) 0xf0065fe2u)	/* Read Data and Bit Flip Register 33 */
#define MC79_RDBFL34	(*( MC0_RDBFL0_type *) 0xf0065fe4u)	/* Read Data and Bit Flip Register 34 */
#define MC79_RDBFL35	(*( MC0_RDBFL0_type *) 0xf0065fe6u)	/* Read Data and Bit Flip Register 35 */
#define MC79_RDBFL36	(*( MC0_RDBFL0_type *) 0xf0065fe8u)	/* Read Data and Bit Flip Register 36 */
#define MC79_RDBFL37	(*( MC0_RDBFL0_type *) 0xf0065feau)	/* Read Data and Bit Flip Register 37 */
#define MC79_RDBFL38	(*( MC0_RDBFL0_type *) 0xf0065fecu)	/* Read Data and Bit Flip Register 38 */
#define MC79_RDBFL39	(*( MC0_RDBFL0_type *) 0xf0065feeu)	/* Read Data and Bit Flip Register 39 */
#define MC79_RDBFL4	(*( MC0_RDBFL0_type *) 0xf0065fa8u)	/* Read Data and Bit Flip Register 4 */
#define MC79_RDBFL5	(*( MC0_RDBFL0_type *) 0xf0065faau)	/* Read Data and Bit Flip Register 5 */
#define MC79_RDBFL6	(*( MC0_RDBFL0_type *) 0xf0065facu)	/* Read Data and Bit Flip Register 6 */
#define MC79_RDBFL7	(*( MC0_RDBFL0_type *) 0xf0065faeu)	/* Read Data and Bit Flip Register 7 */
#define MC79_RDBFL8	(*( MC0_RDBFL0_type *) 0xf0065fb0u)	/* Read Data and Bit Flip Register 8 */
#define MC79_RDBFL9	(*( MC0_RDBFL0_type *) 0xf0065fb2u)	/* Read Data and Bit Flip Register 9 */
#define MC7_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00617a0u)	/* Read Data and Bit Flip Register 0 */
#define MC7_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00617a2u)	/* Read Data and Bit Flip Register 1 */
#define MC7_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00617b4u)	/* Read Data and Bit Flip Register 10 */
#define MC7_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00617b6u)	/* Read Data and Bit Flip Register 11 */
#define MC7_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00617b8u)	/* Read Data and Bit Flip Register 12 */
#define MC7_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00617bau)	/* Read Data and Bit Flip Register 13 */
#define MC7_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00617bcu)	/* Read Data and Bit Flip Register 14 */
#define MC7_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00617beu)	/* Read Data and Bit Flip Register 15 */
#define MC7_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00617c0u)	/* Read Data and Bit Flip Register 16 */
#define MC7_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00617c2u)	/* Read Data and Bit Flip Register 17 */
#define MC7_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00617c4u)	/* Read Data and Bit Flip Register 18 */
#define MC7_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00617c6u)	/* Read Data and Bit Flip Register 19 */
#define MC7_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00617a4u)	/* Read Data and Bit Flip Register 2 */
#define MC7_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00617c8u)	/* Read Data and Bit Flip Register 20 */
#define MC7_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00617cau)	/* Read Data and Bit Flip Register 21 */
#define MC7_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00617ccu)	/* Read Data and Bit Flip Register 22 */
#define MC7_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00617ceu)	/* Read Data and Bit Flip Register 23 */
#define MC7_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00617d0u)	/* Read Data and Bit Flip Register 24 */
#define MC7_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00617d2u)	/* Read Data and Bit Flip Register 25 */
#define MC7_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00617d4u)	/* Read Data and Bit Flip Register 26 */
#define MC7_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00617d6u)	/* Read Data and Bit Flip Register 27 */
#define MC7_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00617d8u)	/* Read Data and Bit Flip Register 28 */
#define MC7_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00617dau)	/* Read Data and Bit Flip Register 29 */
#define MC7_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00617a6u)	/* Read Data and Bit Flip Register 3 */
#define MC7_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00617dcu)	/* Read Data and Bit Flip Register 30 */
#define MC7_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00617deu)	/* Read Data and Bit Flip Register 31 */
#define MC7_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00617e0u)	/* Read Data and Bit Flip Register 32 */
#define MC7_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00617e2u)	/* Read Data and Bit Flip Register 33 */
#define MC7_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00617e4u)	/* Read Data and Bit Flip Register 34 */
#define MC7_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00617e6u)	/* Read Data and Bit Flip Register 35 */
#define MC7_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00617e8u)	/* Read Data and Bit Flip Register 36 */
#define MC7_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00617eau)	/* Read Data and Bit Flip Register 37 */
#define MC7_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00617ecu)	/* Read Data and Bit Flip Register 38 */
#define MC7_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00617eeu)	/* Read Data and Bit Flip Register 39 */
#define MC7_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00617a8u)	/* Read Data and Bit Flip Register 4 */
#define MC7_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00617aau)	/* Read Data and Bit Flip Register 5 */
#define MC7_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00617acu)	/* Read Data and Bit Flip Register 6 */
#define MC7_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00617aeu)	/* Read Data and Bit Flip Register 7 */
#define MC7_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00617b0u)	/* Read Data and Bit Flip Register 8 */
#define MC7_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00617b2u)	/* Read Data and Bit Flip Register 9 */
#define MC80_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00660a0u)	/* Read Data and Bit Flip Register 0 */
#define MC80_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00660a2u)	/* Read Data and Bit Flip Register 1 */
#define MC80_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00660b4u)	/* Read Data and Bit Flip Register 10 */
#define MC80_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00660b6u)	/* Read Data and Bit Flip Register 11 */
#define MC80_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00660b8u)	/* Read Data and Bit Flip Register 12 */
#define MC80_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00660bau)	/* Read Data and Bit Flip Register 13 */
#define MC80_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00660bcu)	/* Read Data and Bit Flip Register 14 */
#define MC80_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00660beu)	/* Read Data and Bit Flip Register 15 */
#define MC80_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00660c0u)	/* Read Data and Bit Flip Register 16 */
#define MC80_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00660c2u)	/* Read Data and Bit Flip Register 17 */
#define MC80_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00660c4u)	/* Read Data and Bit Flip Register 18 */
#define MC80_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00660c6u)	/* Read Data and Bit Flip Register 19 */
#define MC80_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00660a4u)	/* Read Data and Bit Flip Register 2 */
#define MC80_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00660c8u)	/* Read Data and Bit Flip Register 20 */
#define MC80_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00660cau)	/* Read Data and Bit Flip Register 21 */
#define MC80_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00660ccu)	/* Read Data and Bit Flip Register 22 */
#define MC80_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00660ceu)	/* Read Data and Bit Flip Register 23 */
#define MC80_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00660d0u)	/* Read Data and Bit Flip Register 24 */
#define MC80_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00660d2u)	/* Read Data and Bit Flip Register 25 */
#define MC80_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00660d4u)	/* Read Data and Bit Flip Register 26 */
#define MC80_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00660d6u)	/* Read Data and Bit Flip Register 27 */
#define MC80_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00660d8u)	/* Read Data and Bit Flip Register 28 */
#define MC80_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00660dau)	/* Read Data and Bit Flip Register 29 */
#define MC80_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00660a6u)	/* Read Data and Bit Flip Register 3 */
#define MC80_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00660dcu)	/* Read Data and Bit Flip Register 30 */
#define MC80_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00660deu)	/* Read Data and Bit Flip Register 31 */
#define MC80_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00660e0u)	/* Read Data and Bit Flip Register 32 */
#define MC80_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00660e2u)	/* Read Data and Bit Flip Register 33 */
#define MC80_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00660e4u)	/* Read Data and Bit Flip Register 34 */
#define MC80_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00660e6u)	/* Read Data and Bit Flip Register 35 */
#define MC80_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00660e8u)	/* Read Data and Bit Flip Register 36 */
#define MC80_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00660eau)	/* Read Data and Bit Flip Register 37 */
#define MC80_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00660ecu)	/* Read Data and Bit Flip Register 38 */
#define MC80_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00660eeu)	/* Read Data and Bit Flip Register 39 */
#define MC80_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00660a8u)	/* Read Data and Bit Flip Register 4 */
#define MC80_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00660aau)	/* Read Data and Bit Flip Register 5 */
#define MC80_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00660acu)	/* Read Data and Bit Flip Register 6 */
#define MC80_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00660aeu)	/* Read Data and Bit Flip Register 7 */
#define MC80_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00660b0u)	/* Read Data and Bit Flip Register 8 */
#define MC80_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00660b2u)	/* Read Data and Bit Flip Register 9 */
#define MC81_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00661a0u)	/* Read Data and Bit Flip Register 0 */
#define MC81_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00661a2u)	/* Read Data and Bit Flip Register 1 */
#define MC81_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00661b4u)	/* Read Data and Bit Flip Register 10 */
#define MC81_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00661b6u)	/* Read Data and Bit Flip Register 11 */
#define MC81_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00661b8u)	/* Read Data and Bit Flip Register 12 */
