svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC81_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00661bau)	/* Read Data and Bit Flip Register 13 */
#define MC81_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00661bcu)	/* Read Data and Bit Flip Register 14 */
#define MC81_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00661beu)	/* Read Data and Bit Flip Register 15 */
#define MC81_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00661c0u)	/* Read Data and Bit Flip Register 16 */
#define MC81_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00661c2u)	/* Read Data and Bit Flip Register 17 */
#define MC81_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00661c4u)	/* Read Data and Bit Flip Register 18 */
#define MC81_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00661c6u)	/* Read Data and Bit Flip Register 19 */
#define MC81_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00661a4u)	/* Read Data and Bit Flip Register 2 */
#define MC81_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00661c8u)	/* Read Data and Bit Flip Register 20 */
#define MC81_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00661cau)	/* Read Data and Bit Flip Register 21 */
#define MC81_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00661ccu)	/* Read Data and Bit Flip Register 22 */
#define MC81_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00661ceu)	/* Read Data and Bit Flip Register 23 */
#define MC81_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00661d0u)	/* Read Data and Bit Flip Register 24 */
#define MC81_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00661d2u)	/* Read Data and Bit Flip Register 25 */
#define MC81_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00661d4u)	/* Read Data and Bit Flip Register 26 */
#define MC81_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00661d6u)	/* Read Data and Bit Flip Register 27 */
#define MC81_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00661d8u)	/* Read Data and Bit Flip Register 28 */
#define MC81_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00661dau)	/* Read Data and Bit Flip Register 29 */
#define MC81_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00661a6u)	/* Read Data and Bit Flip Register 3 */
#define MC81_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00661dcu)	/* Read Data and Bit Flip Register 30 */
#define MC81_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00661deu)	/* Read Data and Bit Flip Register 31 */
#define MC81_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00661e0u)	/* Read Data and Bit Flip Register 32 */
#define MC81_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00661e2u)	/* Read Data and Bit Flip Register 33 */
#define MC81_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00661e4u)	/* Read Data and Bit Flip Register 34 */
#define MC81_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00661e6u)	/* Read Data and Bit Flip Register 35 */
#define MC81_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00661e8u)	/* Read Data and Bit Flip Register 36 */
#define MC81_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00661eau)	/* Read Data and Bit Flip Register 37 */
#define MC81_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00661ecu)	/* Read Data and Bit Flip Register 38 */
#define MC81_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00661eeu)	/* Read Data and Bit Flip Register 39 */
#define MC81_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00661a8u)	/* Read Data and Bit Flip Register 4 */
#define MC81_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00661aau)	/* Read Data and Bit Flip Register 5 */
#define MC81_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00661acu)	/* Read Data and Bit Flip Register 6 */
#define MC81_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00661aeu)	/* Read Data and Bit Flip Register 7 */
#define MC81_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00661b0u)	/* Read Data and Bit Flip Register 8 */
#define MC81_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00661b2u)	/* Read Data and Bit Flip Register 9 */
#define MC82_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00662a0u)	/* Read Data and Bit Flip Register 0 */
#define MC82_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00662a2u)	/* Read Data and Bit Flip Register 1 */
#define MC82_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00662b4u)	/* Read Data and Bit Flip Register 10 */
#define MC82_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00662b6u)	/* Read Data and Bit Flip Register 11 */
#define MC82_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00662b8u)	/* Read Data and Bit Flip Register 12 */
#define MC82_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00662bau)	/* Read Data and Bit Flip Register 13 */
#define MC82_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00662bcu)	/* Read Data and Bit Flip Register 14 */
#define MC82_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00662beu)	/* Read Data and Bit Flip Register 15 */
#define MC82_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00662c0u)	/* Read Data and Bit Flip Register 16 */
#define MC82_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00662c2u)	/* Read Data and Bit Flip Register 17 */
#define MC82_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00662c4u)	/* Read Data and Bit Flip Register 18 */
#define MC82_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00662c6u)	/* Read Data and Bit Flip Register 19 */
#define MC82_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00662a4u)	/* Read Data and Bit Flip Register 2 */
#define MC82_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00662c8u)	/* Read Data and Bit Flip Register 20 */
#define MC82_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00662cau)	/* Read Data and Bit Flip Register 21 */
#define MC82_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00662ccu)	/* Read Data and Bit Flip Register 22 */
#define MC82_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00662ceu)	/* Read Data and Bit Flip Register 23 */
#define MC82_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00662d0u)	/* Read Data and Bit Flip Register 24 */
#define MC82_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00662d2u)	/* Read Data and Bit Flip Register 25 */
#define MC82_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00662d4u)	/* Read Data and Bit Flip Register 26 */
#define MC82_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00662d6u)	/* Read Data and Bit Flip Register 27 */
#define MC82_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00662d8u)	/* Read Data and Bit Flip Register 28 */
#define MC82_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00662dau)	/* Read Data and Bit Flip Register 29 */
#define MC82_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00662a6u)	/* Read Data and Bit Flip Register 3 */
#define MC82_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00662dcu)	/* Read Data and Bit Flip Register 30 */
#define MC82_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00662deu)	/* Read Data and Bit Flip Register 31 */
#define MC82_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00662e0u)	/* Read Data and Bit Flip Register 32 */
#define MC82_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00662e2u)	/* Read Data and Bit Flip Register 33 */
#define MC82_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00662e4u)	/* Read Data and Bit Flip Register 34 */
#define MC82_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00662e6u)	/* Read Data and Bit Flip Register 35 */
#define MC82_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00662e8u)	/* Read Data and Bit Flip Register 36 */
#define MC82_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00662eau)	/* Read Data and Bit Flip Register 37 */
#define MC82_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00662ecu)	/* Read Data and Bit Flip Register 38 */
#define MC82_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00662eeu)	/* Read Data and Bit Flip Register 39 */
#define MC82_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00662a8u)	/* Read Data and Bit Flip Register 4 */
#define MC82_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00662aau)	/* Read Data and Bit Flip Register 5 */
#define MC82_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00662acu)	/* Read Data and Bit Flip Register 6 */
#define MC82_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00662aeu)	/* Read Data and Bit Flip Register 7 */
#define MC82_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00662b0u)	/* Read Data and Bit Flip Register 8 */
#define MC82_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00662b2u)	/* Read Data and Bit Flip Register 9 */
#define MC83_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00663a0u)	/* Read Data and Bit Flip Register 0 */
#define MC83_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00663a2u)	/* Read Data and Bit Flip Register 1 */
#define MC83_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00663b4u)	/* Read Data and Bit Flip Register 10 */
#define MC83_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00663b6u)	/* Read Data and Bit Flip Register 11 */
#define MC83_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00663b8u)	/* Read Data and Bit Flip Register 12 */
#define MC83_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00663bau)	/* Read Data and Bit Flip Register 13 */
#define MC83_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00663bcu)	/* Read Data and Bit Flip Register 14 */
#define MC83_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00663beu)	/* Read Data and Bit Flip Register 15 */
#define MC83_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00663c0u)	/* Read Data and Bit Flip Register 16 */
#define MC83_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00663c2u)	/* Read Data and Bit Flip Register 17 */
#define MC83_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00663c4u)	/* Read Data and Bit Flip Register 18 */
#define MC83_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00663c6u)	/* Read Data and Bit Flip Register 19 */
#define MC83_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00663a4u)	/* Read Data and Bit Flip Register 2 */
#define MC83_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00663c8u)	/* Read Data and Bit Flip Register 20 */
#define MC83_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00663cau)	/* Read Data and Bit Flip Register 21 */
#define MC83_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00663ccu)	/* Read Data and Bit Flip Register 22 */
#define MC83_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00663ceu)	/* Read Data and Bit Flip Register 23 */
#define MC83_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00663d0u)	/* Read Data and Bit Flip Register 24 */
#define MC83_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00663d2u)	/* Read Data and Bit Flip Register 25 */
#define MC83_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00663d4u)	/* Read Data and Bit Flip Register 26 */
#define MC83_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00663d6u)	/* Read Data and Bit Flip Register 27 */
#define MC83_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00663d8u)	/* Read Data and Bit Flip Register 28 */
#define MC83_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00663dau)	/* Read Data and Bit Flip Register 29 */
#define MC83_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00663a6u)	/* Read Data and Bit Flip Register 3 */
#define MC83_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00663dcu)	/* Read Data and Bit Flip Register 30 */
#define MC83_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00663deu)	/* Read Data and Bit Flip Register 31 */
#define MC83_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00663e0u)	/* Read Data and Bit Flip Register 32 */
#define MC83_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00663e2u)	/* Read Data and Bit Flip Register 33 */
#define MC83_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00663e4u)	/* Read Data and Bit Flip Register 34 */
#define MC83_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00663e6u)	/* Read Data and Bit Flip Register 35 */
#define MC83_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00663e8u)	/* Read Data and Bit Flip Register 36 */
#define MC83_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00663eau)	/* Read Data and Bit Flip Register 37 */
#define MC83_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00663ecu)	/* Read Data and Bit Flip Register 38 */
#define MC83_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00663eeu)	/* Read Data and Bit Flip Register 39 */
#define MC83_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00663a8u)	/* Read Data and Bit Flip Register 4 */
#define MC83_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00663aau)	/* Read Data and Bit Flip Register 5 */
#define MC83_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00663acu)	/* Read Data and Bit Flip Register 6 */
#define MC83_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00663aeu)	/* Read Data and Bit Flip Register 7 */
#define MC83_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00663b0u)	/* Read Data and Bit Flip Register 8 */
#define MC83_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00663b2u)	/* Read Data and Bit Flip Register 9 */
#define MC84_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00664a0u)	/* Read Data and Bit Flip Register 0 */
#define MC84_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00664a2u)	/* Read Data and Bit Flip Register 1 */
#define MC84_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00664b4u)	/* Read Data and Bit Flip Register 10 */
#define MC84_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00664b6u)	/* Read Data and Bit Flip Register 11 */
#define MC84_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00664b8u)	/* Read Data and Bit Flip Register 12 */
#define MC84_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00664bau)	/* Read Data and Bit Flip Register 13 */
#define MC84_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00664bcu)	/* Read Data and Bit Flip Register 14 */
#define MC84_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00664beu)	/* Read Data and Bit Flip Register 15 */
#define MC84_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00664c0u)	/* Read Data and Bit Flip Register 16 */
#define MC84_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00664c2u)	/* Read Data and Bit Flip Register 17 */
#define MC84_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00664c4u)	/* Read Data and Bit Flip Register 18 */
#define MC84_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00664c6u)	/* Read Data and Bit Flip Register 19 */
#define MC84_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00664a4u)	/* Read Data and Bit Flip Register 2 */
#define MC84_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00664c8u)	/* Read Data and Bit Flip Register 20 */
#define MC84_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00664cau)	/* Read Data and Bit Flip Register 21 */
#define MC84_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00664ccu)	/* Read Data and Bit Flip Register 22 */
#define MC84_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00664ceu)	/* Read Data and Bit Flip Register 23 */
#define MC84_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00664d0u)	/* Read Data and Bit Flip Register 24 */
#define MC84_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00664d2u)	/* Read Data and Bit Flip Register 25 */
#define MC84_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00664d4u)	/* Read Data and Bit Flip Register 26 */
#define MC84_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00664d6u)	/* Read Data and Bit Flip Register 27 */
#define MC84_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00664d8u)	/* Read Data and Bit Flip Register 28 */
#define MC84_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00664dau)	/* Read Data and Bit Flip Register 29 */
#define MC84_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00664a6u)	/* Read Data and Bit Flip Register 3 */
#define MC84_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00664dcu)	/* Read Data and Bit Flip Register 30 */
#define MC84_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00664deu)	/* Read Data and Bit Flip Register 31 */
#define MC84_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00664e0u)	/* Read Data and Bit Flip Register 32 */
#define MC84_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00664e2u)	/* Read Data and Bit Flip Register 33 */
#define MC84_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00664e4u)	/* Read Data and Bit Flip Register 34 */
#define MC84_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00664e6u)	/* Read Data and Bit Flip Register 35 */
#define MC84_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00664e8u)	/* Read Data and Bit Flip Register 36 */
#define MC84_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00664eau)	/* Read Data and Bit Flip Register 37 */
#define MC84_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00664ecu)	/* Read Data and Bit Flip Register 38 */
#define MC84_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00664eeu)	/* Read Data and Bit Flip Register 39 */
#define MC84_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00664a8u)	/* Read Data and Bit Flip Register 4 */
#define MC84_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00664aau)	/* Read Data and Bit Flip Register 5 */
#define MC84_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00664acu)	/* Read Data and Bit Flip Register 6 */
#define MC84_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00664aeu)	/* Read Data and Bit Flip Register 7 */
#define MC84_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00664b0u)	/* Read Data and Bit Flip Register 8 */
#define MC84_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00664b2u)	/* Read Data and Bit Flip Register 9 */
#define MC85_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00665a0u)	/* Read Data and Bit Flip Register 0 */
#define MC85_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00665a2u)	/* Read Data and Bit Flip Register 1 */
#define MC85_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00665b4u)	/* Read Data and Bit Flip Register 10 */
#define MC85_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00665b6u)	/* Read Data and Bit Flip Register 11 */
#define MC85_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00665b8u)	/* Read Data and Bit Flip Register 12 */
#define MC85_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00665bau)	/* Read Data and Bit Flip Register 13 */
#define MC85_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00665bcu)	/* Read Data and Bit Flip Register 14 */
#define MC85_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00665beu)	/* Read Data and Bit Flip Register 15 */
#define MC85_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00665c0u)	/* Read Data and Bit Flip Register 16 */
#define MC85_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00665c2u)	/* Read Data and Bit Flip Register 17 */
#define MC85_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00665c4u)	/* Read Data and Bit Flip Register 18 */
#define MC85_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00665c6u)	/* Read Data and Bit Flip Register 19 */
#define MC85_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00665a4u)	/* Read Data and Bit Flip Register 2 */
#define MC85_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00665c8u)	/* Read Data and Bit Flip Register 20 */
#define MC85_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00665cau)	/* Read Data and Bit Flip Register 21 */
#define MC85_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00665ccu)	/* Read Data and Bit Flip Register 22 */
#define MC85_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00665ceu)	/* Read Data and Bit Flip Register 23 */
#define MC85_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00665d0u)	/* Read Data and Bit Flip Register 24 */
#define MC85_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00665d2u)	/* Read Data and Bit Flip Register 25 */
#define MC85_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00665d4u)	/* Read Data and Bit Flip Register 26 */
#define MC85_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00665d6u)	/* Read Data and Bit Flip Register 27 */
#define MC85_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00665d8u)	/* Read Data and Bit Flip Register 28 */
#define MC85_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00665dau)	/* Read Data and Bit Flip Register 29 */
#define MC85_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00665a6u)	/* Read Data and Bit Flip Register 3 */
#define MC85_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00665dcu)	/* Read Data and Bit Flip Register 30 */
#define MC85_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00665deu)	/* Read Data and Bit Flip Register 31 */
#define MC85_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00665e0u)	/* Read Data and Bit Flip Register 32 */
#define MC85_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00665e2u)	/* Read Data and Bit Flip Register 33 */
#define MC85_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00665e4u)	/* Read Data and Bit Flip Register 34 */
#define MC85_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00665e6u)	/* Read Data and Bit Flip Register 35 */
#define MC85_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00665e8u)	/* Read Data and Bit Flip Register 36 */
#define MC85_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00665eau)	/* Read Data and Bit Flip Register 37 */
#define MC85_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00665ecu)	/* Read Data and Bit Flip Register 38 */
#define MC85_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00665eeu)	/* Read Data and Bit Flip Register 39 */
#define MC85_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00665a8u)	/* Read Data and Bit Flip Register 4 */
#define MC85_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00665aau)	/* Read Data and Bit Flip Register 5 */
#define MC85_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00665acu)	/* Read Data and Bit Flip Register 6 */
#define MC85_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00665aeu)	/* Read Data and Bit Flip Register 7 */
#define MC85_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00665b0u)	/* Read Data and Bit Flip Register 8 */
#define MC85_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00665b2u)	/* Read Data and Bit Flip Register 9 */
#define MC86_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00666a0u)	/* Read Data and Bit Flip Register 0 */
#define MC86_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00666a2u)	/* Read Data and Bit Flip Register 1 */
#define MC86_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00666b4u)	/* Read Data and Bit Flip Register 10 */
#define MC86_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00666b6u)	/* Read Data and Bit Flip Register 11 */
#define MC86_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00666b8u)	/* Read Data and Bit Flip Register 12 */
#define MC86_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00666bau)	/* Read Data and Bit Flip Register 13 */
#define MC86_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00666bcu)	/* Read Data and Bit Flip Register 14 */
#define MC86_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00666beu)	/* Read Data and Bit Flip Register 15 */
#define MC86_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00666c0u)	/* Read Data and Bit Flip Register 16 */
#define MC86_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00666c2u)	/* Read Data and Bit Flip Register 17 */
#define MC86_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00666c4u)	/* Read Data and Bit Flip Register 18 */
#define MC86_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00666c6u)	/* Read Data and Bit Flip Register 19 */
#define MC86_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00666a4u)	/* Read Data and Bit Flip Register 2 */
#define MC86_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00666c8u)	/* Read Data and Bit Flip Register 20 */
#define MC86_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00666cau)	/* Read Data and Bit Flip Register 21 */
#define MC86_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00666ccu)	/* Read Data and Bit Flip Register 22 */
#define MC86_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00666ceu)	/* Read Data and Bit Flip Register 23 */
#define MC86_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00666d0u)	/* Read Data and Bit Flip Register 24 */
#define MC86_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00666d2u)	/* Read Data and Bit Flip Register 25 */
#define MC86_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00666d4u)	/* Read Data and Bit Flip Register 26 */
#define MC86_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00666d6u)	/* Read Data and Bit Flip Register 27 */
#define MC86_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00666d8u)	/* Read Data and Bit Flip Register 28 */
#define MC86_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00666dau)	/* Read Data and Bit Flip Register 29 */
#define MC86_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00666a6u)	/* Read Data and Bit Flip Register 3 */
#define MC86_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00666dcu)	/* Read Data and Bit Flip Register 30 */
#define MC86_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00666deu)	/* Read Data and Bit Flip Register 31 */
#define MC86_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00666e0u)	/* Read Data and Bit Flip Register 32 */
#define MC86_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00666e2u)	/* Read Data and Bit Flip Register 33 */
#define MC86_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00666e4u)	/* Read Data and Bit Flip Register 34 */
#define MC86_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00666e6u)	/* Read Data and Bit Flip Register 35 */
#define MC86_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00666e8u)	/* Read Data and Bit Flip Register 36 */
#define MC86_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00666eau)	/* Read Data and Bit Flip Register 37 */
#define MC86_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00666ecu)	/* Read Data and Bit Flip Register 38 */
#define MC86_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00666eeu)	/* Read Data and Bit Flip Register 39 */
#define MC86_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00666a8u)	/* Read Data and Bit Flip Register 4 */
#define MC86_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00666aau)	/* Read Data and Bit Flip Register 5 */
#define MC86_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00666acu)	/* Read Data and Bit Flip Register 6 */
#define MC86_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00666aeu)	/* Read Data and Bit Flip Register 7 */
#define MC86_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00666b0u)	/* Read Data and Bit Flip Register 8 */
#define MC86_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00666b2u)	/* Read Data and Bit Flip Register 9 */
#define MC87_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00667a0u)	/* Read Data and Bit Flip Register 0 */
#define MC87_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00667a2u)	/* Read Data and Bit Flip Register 1 */
#define MC87_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00667b4u)	/* Read Data and Bit Flip Register 10 */
#define MC87_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00667b6u)	/* Read Data and Bit Flip Register 11 */
#define MC87_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00667b8u)	/* Read Data and Bit Flip Register 12 */
#define MC87_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00667bau)	/* Read Data and Bit Flip Register 13 */
#define MC87_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00667bcu)	/* Read Data and Bit Flip Register 14 */
#define MC87_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00667beu)	/* Read Data and Bit Flip Register 15 */
