svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MC87_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00667c0u)	/* Read Data and Bit Flip Register 16 */
#define MC87_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00667c2u)	/* Read Data and Bit Flip Register 17 */
#define MC87_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00667c4u)	/* Read Data and Bit Flip Register 18 */
#define MC87_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00667c6u)	/* Read Data and Bit Flip Register 19 */
#define MC87_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00667a4u)	/* Read Data and Bit Flip Register 2 */
#define MC87_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00667c8u)	/* Read Data and Bit Flip Register 20 */
#define MC87_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00667cau)	/* Read Data and Bit Flip Register 21 */
#define MC87_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00667ccu)	/* Read Data and Bit Flip Register 22 */
#define MC87_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00667ceu)	/* Read Data and Bit Flip Register 23 */
#define MC87_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00667d0u)	/* Read Data and Bit Flip Register 24 */
#define MC87_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00667d2u)	/* Read Data and Bit Flip Register 25 */
#define MC87_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00667d4u)	/* Read Data and Bit Flip Register 26 */
#define MC87_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00667d6u)	/* Read Data and Bit Flip Register 27 */
#define MC87_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00667d8u)	/* Read Data and Bit Flip Register 28 */
#define MC87_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00667dau)	/* Read Data and Bit Flip Register 29 */
#define MC87_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00667a6u)	/* Read Data and Bit Flip Register 3 */
#define MC87_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00667dcu)	/* Read Data and Bit Flip Register 30 */
#define MC87_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00667deu)	/* Read Data and Bit Flip Register 31 */
#define MC87_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00667e0u)	/* Read Data and Bit Flip Register 32 */
#define MC87_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00667e2u)	/* Read Data and Bit Flip Register 33 */
#define MC87_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00667e4u)	/* Read Data and Bit Flip Register 34 */
#define MC87_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00667e6u)	/* Read Data and Bit Flip Register 35 */
#define MC87_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00667e8u)	/* Read Data and Bit Flip Register 36 */
#define MC87_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00667eau)	/* Read Data and Bit Flip Register 37 */
#define MC87_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00667ecu)	/* Read Data and Bit Flip Register 38 */
#define MC87_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00667eeu)	/* Read Data and Bit Flip Register 39 */
#define MC87_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00667a8u)	/* Read Data and Bit Flip Register 4 */
#define MC87_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00667aau)	/* Read Data and Bit Flip Register 5 */
#define MC87_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00667acu)	/* Read Data and Bit Flip Register 6 */
#define MC87_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00667aeu)	/* Read Data and Bit Flip Register 7 */
#define MC87_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00667b0u)	/* Read Data and Bit Flip Register 8 */
#define MC87_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00667b2u)	/* Read Data and Bit Flip Register 9 */
#define MC8_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00618a0u)	/* Read Data and Bit Flip Register 0 */
#define MC8_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00618a2u)	/* Read Data and Bit Flip Register 1 */
#define MC8_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00618b4u)	/* Read Data and Bit Flip Register 10 */
#define MC8_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00618b6u)	/* Read Data and Bit Flip Register 11 */
#define MC8_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00618b8u)	/* Read Data and Bit Flip Register 12 */
#define MC8_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00618bau)	/* Read Data and Bit Flip Register 13 */
#define MC8_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00618bcu)	/* Read Data and Bit Flip Register 14 */
#define MC8_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00618beu)	/* Read Data and Bit Flip Register 15 */
#define MC8_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00618c0u)	/* Read Data and Bit Flip Register 16 */
#define MC8_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00618c2u)	/* Read Data and Bit Flip Register 17 */
#define MC8_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00618c4u)	/* Read Data and Bit Flip Register 18 */
#define MC8_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00618c6u)	/* Read Data and Bit Flip Register 19 */
#define MC8_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00618a4u)	/* Read Data and Bit Flip Register 2 */
#define MC8_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00618c8u)	/* Read Data and Bit Flip Register 20 */
#define MC8_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00618cau)	/* Read Data and Bit Flip Register 21 */
#define MC8_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00618ccu)	/* Read Data and Bit Flip Register 22 */
#define MC8_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00618ceu)	/* Read Data and Bit Flip Register 23 */
#define MC8_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00618d0u)	/* Read Data and Bit Flip Register 24 */
#define MC8_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00618d2u)	/* Read Data and Bit Flip Register 25 */
#define MC8_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00618d4u)	/* Read Data and Bit Flip Register 26 */
#define MC8_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00618d6u)	/* Read Data and Bit Flip Register 27 */
#define MC8_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00618d8u)	/* Read Data and Bit Flip Register 28 */
#define MC8_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00618dau)	/* Read Data and Bit Flip Register 29 */
#define MC8_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00618a6u)	/* Read Data and Bit Flip Register 3 */
#define MC8_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00618dcu)	/* Read Data and Bit Flip Register 30 */
#define MC8_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00618deu)	/* Read Data and Bit Flip Register 31 */
#define MC8_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00618e0u)	/* Read Data and Bit Flip Register 32 */
#define MC8_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00618e2u)	/* Read Data and Bit Flip Register 33 */
#define MC8_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00618e4u)	/* Read Data and Bit Flip Register 34 */
#define MC8_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00618e6u)	/* Read Data and Bit Flip Register 35 */
#define MC8_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00618e8u)	/* Read Data and Bit Flip Register 36 */
#define MC8_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00618eau)	/* Read Data and Bit Flip Register 37 */
#define MC8_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00618ecu)	/* Read Data and Bit Flip Register 38 */
#define MC8_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00618eeu)	/* Read Data and Bit Flip Register 39 */
#define MC8_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00618a8u)	/* Read Data and Bit Flip Register 4 */
#define MC8_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00618aau)	/* Read Data and Bit Flip Register 5 */
#define MC8_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00618acu)	/* Read Data and Bit Flip Register 6 */
#define MC8_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00618aeu)	/* Read Data and Bit Flip Register 7 */
#define MC8_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00618b0u)	/* Read Data and Bit Flip Register 8 */
#define MC8_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00618b2u)	/* Read Data and Bit Flip Register 9 */
#define MC9_RDBFL0	(*( MC0_RDBFL0_type *) 0xf00619a0u)	/* Read Data and Bit Flip Register 0 */
#define MC9_RDBFL1	(*( MC0_RDBFL0_type *) 0xf00619a2u)	/* Read Data and Bit Flip Register 1 */
#define MC9_RDBFL10	(*( MC0_RDBFL0_type *) 0xf00619b4u)	/* Read Data and Bit Flip Register 10 */
#define MC9_RDBFL11	(*( MC0_RDBFL0_type *) 0xf00619b6u)	/* Read Data and Bit Flip Register 11 */
#define MC9_RDBFL12	(*( MC0_RDBFL0_type *) 0xf00619b8u)	/* Read Data and Bit Flip Register 12 */
#define MC9_RDBFL13	(*( MC0_RDBFL0_type *) 0xf00619bau)	/* Read Data and Bit Flip Register 13 */
#define MC9_RDBFL14	(*( MC0_RDBFL0_type *) 0xf00619bcu)	/* Read Data and Bit Flip Register 14 */
#define MC9_RDBFL15	(*( MC0_RDBFL0_type *) 0xf00619beu)	/* Read Data and Bit Flip Register 15 */
#define MC9_RDBFL16	(*( MC0_RDBFL0_type *) 0xf00619c0u)	/* Read Data and Bit Flip Register 16 */
#define MC9_RDBFL17	(*( MC0_RDBFL0_type *) 0xf00619c2u)	/* Read Data and Bit Flip Register 17 */
#define MC9_RDBFL18	(*( MC0_RDBFL0_type *) 0xf00619c4u)	/* Read Data and Bit Flip Register 18 */
#define MC9_RDBFL19	(*( MC0_RDBFL0_type *) 0xf00619c6u)	/* Read Data and Bit Flip Register 19 */
#define MC9_RDBFL2	(*( MC0_RDBFL0_type *) 0xf00619a4u)	/* Read Data and Bit Flip Register 2 */
#define MC9_RDBFL20	(*( MC0_RDBFL0_type *) 0xf00619c8u)	/* Read Data and Bit Flip Register 20 */
#define MC9_RDBFL21	(*( MC0_RDBFL0_type *) 0xf00619cau)	/* Read Data and Bit Flip Register 21 */
#define MC9_RDBFL22	(*( MC0_RDBFL0_type *) 0xf00619ccu)	/* Read Data and Bit Flip Register 22 */
#define MC9_RDBFL23	(*( MC0_RDBFL0_type *) 0xf00619ceu)	/* Read Data and Bit Flip Register 23 */
#define MC9_RDBFL24	(*( MC0_RDBFL0_type *) 0xf00619d0u)	/* Read Data and Bit Flip Register 24 */
#define MC9_RDBFL25	(*( MC0_RDBFL0_type *) 0xf00619d2u)	/* Read Data and Bit Flip Register 25 */
#define MC9_RDBFL26	(*( MC0_RDBFL0_type *) 0xf00619d4u)	/* Read Data and Bit Flip Register 26 */
#define MC9_RDBFL27	(*( MC0_RDBFL0_type *) 0xf00619d6u)	/* Read Data and Bit Flip Register 27 */
#define MC9_RDBFL28	(*( MC0_RDBFL0_type *) 0xf00619d8u)	/* Read Data and Bit Flip Register 28 */
#define MC9_RDBFL29	(*( MC0_RDBFL0_type *) 0xf00619dau)	/* Read Data and Bit Flip Register 29 */
#define MC9_RDBFL3	(*( MC0_RDBFL0_type *) 0xf00619a6u)	/* Read Data and Bit Flip Register 3 */
#define MC9_RDBFL30	(*( MC0_RDBFL0_type *) 0xf00619dcu)	/* Read Data and Bit Flip Register 30 */
#define MC9_RDBFL31	(*( MC0_RDBFL0_type *) 0xf00619deu)	/* Read Data and Bit Flip Register 31 */
#define MC9_RDBFL32	(*( MC0_RDBFL0_type *) 0xf00619e0u)	/* Read Data and Bit Flip Register 32 */
#define MC9_RDBFL33	(*( MC0_RDBFL0_type *) 0xf00619e2u)	/* Read Data and Bit Flip Register 33 */
#define MC9_RDBFL34	(*( MC0_RDBFL0_type *) 0xf00619e4u)	/* Read Data and Bit Flip Register 34 */
#define MC9_RDBFL35	(*( MC0_RDBFL0_type *) 0xf00619e6u)	/* Read Data and Bit Flip Register 35 */
#define MC9_RDBFL36	(*( MC0_RDBFL0_type *) 0xf00619e8u)	/* Read Data and Bit Flip Register 36 */
#define MC9_RDBFL37	(*( MC0_RDBFL0_type *) 0xf00619eau)	/* Read Data and Bit Flip Register 37 */
#define MC9_RDBFL38	(*( MC0_RDBFL0_type *) 0xf00619ecu)	/* Read Data and Bit Flip Register 38 */
#define MC9_RDBFL39	(*( MC0_RDBFL0_type *) 0xf00619eeu)	/* Read Data and Bit Flip Register 39 */
#define MC9_RDBFL4	(*( MC0_RDBFL0_type *) 0xf00619a8u)	/* Read Data and Bit Flip Register 4 */
#define MC9_RDBFL5	(*( MC0_RDBFL0_type *) 0xf00619aau)	/* Read Data and Bit Flip Register 5 */
#define MC9_RDBFL6	(*( MC0_RDBFL0_type *) 0xf00619acu)	/* Read Data and Bit Flip Register 6 */
#define MC9_RDBFL7	(*( MC0_RDBFL0_type *) 0xf00619aeu)	/* Read Data and Bit Flip Register 7 */
#define MC9_RDBFL8	(*( MC0_RDBFL0_type *) 0xf00619b0u)	/* Read Data and Bit Flip Register 8 */
#define MC9_RDBFL9	(*( MC0_RDBFL0_type *) 0xf00619b2u)	/* Read Data and Bit Flip Register 9 */

