svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int REV_ID         : 16;	/* Revision Identifier */
	} B;
	short S;
	unsigned short US;

} MC0_REVID_type;
#define MC0_REVID	(*( MC0_REVID_type *) 0xf006100cu)	/* Revision ID Register */
#define MC10_REVID	(*( MC0_REVID_type *) 0xf0061a0cu)	/* Revision ID Register */
#define MC11_REVID	(*( MC0_REVID_type *) 0xf0061b0cu)	/* Revision ID Register */
#define MC12_REVID	(*( MC0_REVID_type *) 0xf0061c0cu)	/* Revision ID Register */
#define MC13_REVID	(*( MC0_REVID_type *) 0xf0061d0cu)	/* Revision ID Register */
#define MC14_REVID	(*( MC0_REVID_type *) 0xf0061e0cu)	/* Revision ID Register */
#define MC15_REVID	(*( MC0_REVID_type *) 0xf0061f0cu)	/* Revision ID Register */
#define MC16_REVID	(*( MC0_REVID_type *) 0xf006200cu)	/* Revision ID Register */
#define MC17_REVID	(*( MC0_REVID_type *) 0xf006210cu)	/* Revision ID Register */
#define MC18_REVID	(*( MC0_REVID_type *) 0xf006220cu)	/* Revision ID Register */
#define MC19_REVID	(*( MC0_REVID_type *) 0xf006230cu)	/* Revision ID Register */
#define MC1_REVID	(*( MC0_REVID_type *) 0xf006110cu)	/* Revision ID Register */
#define MC20_REVID	(*( MC0_REVID_type *) 0xf006240cu)	/* Revision ID Register */
#define MC21_REVID	(*( MC0_REVID_type *) 0xf006250cu)	/* Revision ID Register */
#define MC22_REVID	(*( MC0_REVID_type *) 0xf006260cu)	/* Revision ID Register */
#define MC23_REVID	(*( MC0_REVID_type *) 0xf006270cu)	/* Revision ID Register */
#define MC24_REVID	(*( MC0_REVID_type *) 0xf006280cu)	/* Revision ID Register */
#define MC25_REVID	(*( MC0_REVID_type *) 0xf006290cu)	/* Revision ID Register */
#define MC26_REVID	(*( MC0_REVID_type *) 0xf0062a0cu)	/* Revision ID Register */
#define MC27_REVID	(*( MC0_REVID_type *) 0xf0062b0cu)	/* Revision ID Register */
#define MC28_REVID	(*( MC0_REVID_type *) 0xf0062c0cu)	/* Revision ID Register */
#define MC29_REVID	(*( MC0_REVID_type *) 0xf0062d0cu)	/* Revision ID Register */
#define MC2_REVID	(*( MC0_REVID_type *) 0xf006120cu)	/* Revision ID Register */
#define MC30_REVID	(*( MC0_REVID_type *) 0xf0062e0cu)	/* Revision ID Register */
#define MC31_REVID	(*( MC0_REVID_type *) 0xf0062f0cu)	/* Revision ID Register */
#define MC32_REVID	(*( MC0_REVID_type *) 0xf006300cu)	/* Revision ID Register */
#define MC33_REVID	(*( MC0_REVID_type *) 0xf006310cu)	/* Revision ID Register */
#define MC34_REVID	(*( MC0_REVID_type *) 0xf006320cu)	/* Revision ID Register */
#define MC35_REVID	(*( MC0_REVID_type *) 0xf006330cu)	/* Revision ID Register */
#define MC36_REVID	(*( MC0_REVID_type *) 0xf006340cu)	/* Revision ID Register */
#define MC37_REVID	(*( MC0_REVID_type *) 0xf006350cu)	/* Revision ID Register */
#define MC38_REVID	(*( MC0_REVID_type *) 0xf006360cu)	/* Revision ID Register */
#define MC39_REVID	(*( MC0_REVID_type *) 0xf006370cu)	/* Revision ID Register */
#define MC3_REVID	(*( MC0_REVID_type *) 0xf006130cu)	/* Revision ID Register */
#define MC40_REVID	(*( MC0_REVID_type *) 0xf006380cu)	/* Revision ID Register */
#define MC41_REVID	(*( MC0_REVID_type *) 0xf006390cu)	/* Revision ID Register */
#define MC42_REVID	(*( MC0_REVID_type *) 0xf0063a0cu)	/* Revision ID Register */
#define MC43_REVID	(*( MC0_REVID_type *) 0xf0063b0cu)	/* Revision ID Register */
#define MC44_REVID	(*( MC0_REVID_type *) 0xf0063c0cu)	/* Revision ID Register */
#define MC45_REVID	(*( MC0_REVID_type *) 0xf0063d0cu)	/* Revision ID Register */
#define MC46_REVID	(*( MC0_REVID_type *) 0xf0063e0cu)	/* Revision ID Register */
#define MC47_REVID	(*( MC0_REVID_type *) 0xf0063f0cu)	/* Revision ID Register */
#define MC48_REVID	(*( MC0_REVID_type *) 0xf006400cu)	/* Revision ID Register */
#define MC49_REVID	(*( MC0_REVID_type *) 0xf006410cu)	/* Revision ID Register */
#define MC4_REVID	(*( MC0_REVID_type *) 0xf006140cu)	/* Revision ID Register */
#define MC50_REVID	(*( MC0_REVID_type *) 0xf006420cu)	/* Revision ID Register */
#define MC51_REVID	(*( MC0_REVID_type *) 0xf006430cu)	/* Revision ID Register */
#define MC52_REVID	(*( MC0_REVID_type *) 0xf006440cu)	/* Revision ID Register */
#define MC53_REVID	(*( MC0_REVID_type *) 0xf006450cu)	/* Revision ID Register */
#define MC54_REVID	(*( MC0_REVID_type *) 0xf006460cu)	/* Revision ID Register */
#define MC55_REVID	(*( MC0_REVID_type *) 0xf006470cu)	/* Revision ID Register */
#define MC56_REVID	(*( MC0_REVID_type *) 0xf006480cu)	/* Revision ID Register */
#define MC57_REVID	(*( MC0_REVID_type *) 0xf006490cu)	/* Revision ID Register */
#define MC58_REVID	(*( MC0_REVID_type *) 0xf0064a0cu)	/* Revision ID Register */
#define MC59_REVID	(*( MC0_REVID_type *) 0xf0064b0cu)	/* Revision ID Register */
#define MC5_REVID	(*( MC0_REVID_type *) 0xf006150cu)	/* Revision ID Register */
#define MC60_REVID	(*( MC0_REVID_type *) 0xf0064c0cu)	/* Revision ID Register */
#define MC61_REVID	(*( MC0_REVID_type *) 0xf0064d0cu)	/* Revision ID Register */
#define MC62_REVID	(*( MC0_REVID_type *) 0xf0064e0cu)	/* Revision ID Register */
#define MC63_REVID	(*( MC0_REVID_type *) 0xf0064f0cu)	/* Revision ID Register */
#define MC64_REVID	(*( MC0_REVID_type *) 0xf006500cu)	/* Revision ID Register */
#define MC65_REVID	(*( MC0_REVID_type *) 0xf006510cu)	/* Revision ID Register */
#define MC66_REVID	(*( MC0_REVID_type *) 0xf006520cu)	/* Revision ID Register */
#define MC67_REVID	(*( MC0_REVID_type *) 0xf006530cu)	/* Revision ID Register */
#define MC68_REVID	(*( MC0_REVID_type *) 0xf006540cu)	/* Revision ID Register */
#define MC69_REVID	(*( MC0_REVID_type *) 0xf006550cu)	/* Revision ID Register */
#define MC6_REVID	(*( MC0_REVID_type *) 0xf006160cu)	/* Revision ID Register */
#define MC70_REVID	(*( MC0_REVID_type *) 0xf006560cu)	/* Revision ID Register */
#define MC71_REVID	(*( MC0_REVID_type *) 0xf006570cu)	/* Revision ID Register */
#define MC72_REVID	(*( MC0_REVID_type *) 0xf006580cu)	/* Revision ID Register */
#define MC73_REVID	(*( MC0_REVID_type *) 0xf006590cu)	/* Revision ID Register */
#define MC74_REVID	(*( MC0_REVID_type *) 0xf0065a0cu)	/* Revision ID Register */
#define MC75_REVID	(*( MC0_REVID_type *) 0xf0065b0cu)	/* Revision ID Register */
#define MC76_REVID	(*( MC0_REVID_type *) 0xf0065c0cu)	/* Revision ID Register */
#define MC77_REVID	(*( MC0_REVID_type *) 0xf0065d0cu)	/* Revision ID Register */
#define MC78_REVID	(*( MC0_REVID_type *) 0xf0065e0cu)	/* Revision ID Register */
#define MC79_REVID	(*( MC0_REVID_type *) 0xf0065f0cu)	/* Revision ID Register */
#define MC7_REVID	(*( MC0_REVID_type *) 0xf006170cu)	/* Revision ID Register */
#define MC80_REVID	(*( MC0_REVID_type *) 0xf006600cu)	/* Revision ID Register */
#define MC81_REVID	(*( MC0_REVID_type *) 0xf006610cu)	/* Revision ID Register */
#define MC82_REVID	(*( MC0_REVID_type *) 0xf006620cu)	/* Revision ID Register */
#define MC83_REVID	(*( MC0_REVID_type *) 0xf006630cu)	/* Revision ID Register */
#define MC84_REVID	(*( MC0_REVID_type *) 0xf006640cu)	/* Revision ID Register */
#define MC85_REVID	(*( MC0_REVID_type *) 0xf006650cu)	/* Revision ID Register */
#define MC86_REVID	(*( MC0_REVID_type *) 0xf006660cu)	/* Revision ID Register */
#define MC87_REVID	(*( MC0_REVID_type *) 0xf006670cu)	/* Revision ID Register */
#define MC8_REVID	(*( MC0_REVID_type *) 0xf006180cu)	/* Revision ID Register */
#define MC9_REVID	(*( MC0_REVID_type *) 0xf006190cu)	/* Revision ID Register */

