svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} MTU_ACCEN0_type;
#define MTU_ACCEN0	(*( MTU_ACCEN0_type *) 0xf00600fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Res            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} MTU_ACCEN1_type;
#define MTU_ACCEN1	(*( MTU_ACCEN1_type *) 0xf00600f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} MTU_ID_type;
#define MTU_ID	(*( MTU_ID_type *) 0xf0060008u)	/* Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MEM0AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM1AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM2AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM3AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM4AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM5AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM6AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM7AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM8AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM9AIU        : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM10AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM11AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM12AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM13AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM14AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM15AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM16AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM17AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM18AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM19AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM20AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM21AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM22AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM23AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM24AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM25AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM26AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM27AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM28AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM29AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM30AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM31AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
	} B;
	int I;
	unsigned int U;

} MTU_MEMSTAT0_type;
#define MTU_MEMSTAT0	(*( MTU_MEMSTAT0_type *) 0xf0060038u)	/* Memory Autoinitialize Status Register 0 */

