svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MEM32AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM33AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM34AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM35AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM36AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM37AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM38AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM39AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM40AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM41AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM42AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM43AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM44AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM45AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM46AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM47AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM48AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM49AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM50AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM51AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM52AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM53AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM54AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM55AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM56AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM57AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM58AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM59AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM60AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM61AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM62AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM63AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
	} B;
	int I;
	unsigned int U;

} MTU_MEMSTAT1_type;
#define MTU_MEMSTAT1	(*( MTU_MEMSTAT1_type *) 0xf006003cu)	/* Memory Autoinitialize Status Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int MEM64AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM65AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM66AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM67AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM68AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM69AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM70AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM71AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM72AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM73AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM74AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM75AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM76AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM77AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM78AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM79AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM80AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM81AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM82AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM83AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM84AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM85AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM86AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int MEM87AIU       : 1;	/* Memory x MBIST AutoInitialize Underway */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} MTU_MEMSTAT2_type;
#define MTU_MEMSTAT2	(*( MTU_MEMSTAT2_type *) 0xf0060040u)	/* Memory Autoinitialize Status Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int CPU2DSEN       : 1;	/* CPU2 DSPR MBIST Controller Memory Enable */
		unsigned int CPU2DCEN       : 1;	/* CPU2 DCACHE MBIST Controller Memory Enable */
		unsigned int CPU2DTEN       : 1;	/* CPU2 DTAG MBIST Controller Memory Enable */
		unsigned int CPU2PSEN       : 1;	/* CPU2 PSPR MBIST Controller Memory Enable */
		unsigned int CPU2PCEN       : 1;	/* CPU2 PCACHE MBIST Controller Memory Enable */
		unsigned int CPU2PTEN       : 1;	/* CPU2 PTAG MBIST Controller Memory Enable */
		unsigned int CPU1DSEN       : 1;	/* CPU1 DSPR MBIST Controller Memory Enable */
		unsigned int CPU1DCEN       : 1;	/* CPU1 DCACHE MBIST Controller Memory Enable */
		unsigned int CPU1DTEN       : 1;	/* CPU1 DTAG MBIST Controller Memory Enable */
		unsigned int CPU1PSEN       : 1;	/* CPU1 PSPR MBIST Controller Memory Enable */
		unsigned int CPU1PCEN       : 1;	/* CPU1 PCACHE MBIST Controller Memory Enable */
		unsigned int CPU1PTEN       : 1;	/* CPU1 PTAG MBIST Controller Memory Enable */
		unsigned int Res            : 1;	/* Reserved */
		unsigned int Res_14         : 1;	/* Reserved */
		unsigned int CPU0DSEN       : 1;	/* CPU0 DSPR MBIST Controller Memory Enable */
		unsigned int CPU0PCEN       : 1;	/* CPU0 PCACHE MBIST Controller Memory Enable */
		unsigned int CPU0PSEN       : 1;	/* CPU0 PSPR MBIST Controller Memory Enable */
		unsigned int CPU0PTEN       : 1;	/* CPU0 PTAG MBIST Controller Memory Enable */
		unsigned int Res_19         : 4;	/* Reserved */
		unsigned int ETHEN          : 1;	/* ETHERMAC MBIST Controller Memory Enable */
		unsigned int HSMCEN         : 1;	/* HSM CACHE MBIST Controller Memory Enable */
		unsigned int HSMTEN         : 1;	/* HSM TAG MBIST Controller Memory Enable */
		unsigned int HSMREN         : 1;	/* HSM RAM MBIST Controller Memory Enable */
		unsigned int FSI0EN         : 1;	/* FSI0 MBIST Controller Memory Enable */
		unsigned int Res_25         : 1;	/* Reserved */
		unsigned int GTMFEN         : 1;	/* GTM FIFO0 MBIST Controller Memory Enable */
		unsigned int GTMM0EN        : 1;	/* GTM MCS0 MBIST Controller Memory Enable */
		unsigned int GTMM1EN        : 1;	/* GTM RAM1 MBIST Controller Memory Enable */
		unsigned int GTM1AEN        : 1;	/* GTM RAM1A MBIST Controller Memory Enable */
	} B;
	int I;
	unsigned int U;

} MTU_MEMTEST0_type;
#define MTU_MEMTEST0	(*( MTU_MEMTEST0_type *) 0xf0060010u)	/* Memory MBIST Enable Register 0 */

