svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int GTM1BEN        : 1;	/* GTM RAM1B Controller Memory Enable */
		unsigned int GTM2EN         : 1;	/* GTM RAM2 Controller Memory Enable */
		unsigned int PSI5EN         : 1;	/* PSI5 Controller Memory Enable */
		unsigned int BMUEN          : 1;	/* BMU Controller Memory Enable */
		unsigned int MCAN0EN        : 1;	/* GTM RAM1B Controller Memory Enable */
		unsigned int Res            : 1;	/* Reserved */
		unsigned int ERAY0OEN       : 1;	/* ERAY0 OBF Controller Memory Enable */
		unsigned int ERAY0TEN       : 1;	/* ERAY0 TBF Controller Memory Enable */
		unsigned int ERAY0MEN       : 1;	/* ERAY0 MBF Controller Memory Enable */
		unsigned int Res_10         : 3;	/* Reserved */
		unsigned int Res_11         : 1;	/* Reserved */
		unsigned int MCDSEN         : 1;	/* MCDS Controller Memory Enable (ED only) */
		unsigned int EMEML0EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML1EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML2EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML3EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML4EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML5EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML6EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML7EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML8EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML9EN       : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML10EN      : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML11EN      : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML12EN      : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML13EN      : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML14EN      : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int EMEML15EN      : 1;	/* EMEM Lower x MBIST Controller Memory Test Enable (ED only) */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} MTU_MEMTEST1_type;
#define MTU_MEMTEST1	(*( MTU_MEMTEST1_type *) 0xf0060014u)	/* Memory MBIST Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int Res            : 14;	/* Reserved */
		unsigned int CIF0EN         : 1;	/* CIF JPEG1_4 Memory Enable (ED only) */
		unsigned int DAMEN          : 1;	/* DAM Memory Enable */
		unsigned int CIF1EN         : 1;	/* CIF JPEG3 Memory Enable (ED only) */
		unsigned int CIF2EN         : 1;	/* CIF Memory2 Enable (ED only) */
		unsigned int Res_6          : 1;	/* Reserved */
		unsigned int Res_7          : 5;	/* Reserved */
		/* const */ unsigned int Res_8          : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} MTU_MEMTEST2_type;
#define MTU_MEMTEST2	(*( MTU_MEMTEST2_type *) 0xf0060018u)	/* Memory MBIST Enable Register 2 */


/* BUS */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} SBCU_ACCEN0_type;
#define SBCU_ACCEN0	(*( SBCU_ACCEN0_type *) 0xf00300fcu)	/* Access Enable Register 0 */
#define XBAR_ACCEN0	(*( SBCU_ACCEN0_type *) 0xf87004fcu)	/* Access Enable Register 0 */

