svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SBCU_ACCEN1_type;
#define SBCU_ACCEN1	(*( SBCU_ACCEN1_type *) 0xf00300f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int TOUT           : 16;	/* SBCU Bus Time-Out Value */
		unsigned int DBG            : 1;	/* SBCU Debug Trace Enable */
		unsigned int                : 7;
		unsigned int SPC            : 8;	/* Starvation Period Control */
	} B;
	int I;
	unsigned int U;

} SBCU_CON_type;
#define SBCU_CON	(*( SBCU_CON_type *) 0xf0030010u)	/* SBCU Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADR1           : 32;	/* Debug Trigger Address 1 */
	} B;
	int I;
	unsigned int U;

} SBCU_DBADR1_type;
#define SBCU_DBADR1	(*( SBCU_DBADR1_type *) 0xf0030038u)	/* SBCU Debug Address 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADR2           : 32;	/* Debug Trigger Address 2 */
	} B;
	int I;
	unsigned int U;

} SBCU_DBADR2_type;
#define SBCU_DBADR2	(*( SBCU_DBADR2_type *) 0xf003003cu)	/* SBCU Debug Address 2 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FPIADR         : 32;	/* FPIBus Address Status */
	} B;
	int I;
	unsigned int U;

} SBCU_DBADRT_type;
#define SBCU_DBADRT	(*( SBCU_DBADRT_type *) 0xf0030048u)	/* SBCU Debug Trapped Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OPC            : 4;	/* Opcode for Signal Status Debug Trigger */
		unsigned int SVM            : 1;	/* SVM Signal for Status Debug Trigger */
		unsigned int                : 3;
		unsigned int WR             : 1;	/* Write Signal for Status Debug Trigger */
		unsigned int                : 3;
		unsigned int RD             : 1;	/* Write Signal for Status Debug Trigger */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} SBCU_DBBOS_type;
#define SBCU_DBBOS	(*( SBCU_DBBOS_type *) 0xf0030040u)	/* SBCU Debug Bus Operation Signals Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FPIOPC         : 4;	/* FPIBus Opcode Status */
		/* const */ unsigned int FPISVM         : 1;	/* FPIBus Supervisor Mode Status */
		/* const */ unsigned int FPIACK         : 2;	/* FPIBus Acknowledge Status */
		/* const */ unsigned int FPIRDY         : 1;	/* FPIBus Ready Status */
		/* const */ unsigned int FPIWR          : 1;	/* FPIBus Write Indication Status */
		/* const */ unsigned int FPIRST         : 2;	/* FPIBus Reset Status */
		/* const */ unsigned int FPIOPS         : 1;	/* FPIBus OCDS Suspend Status */
		/* const */ unsigned int FPIRD          : 1;	/* FPIBus Read Indication Status */
		/* const */ unsigned int FPIABORT       : 1;	/* FPIBus Abort Status */
		/* const */ unsigned int FPITOUT        : 1;	/* FPIBus Time-out Status */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int FPITAG         : 6;	/* FPIBus Master TAG Status */
		/* const */ unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} SBCU_DBBOST_type;
#define SBCU_DBBOST	(*( SBCU_DBBOST_type *) 0xf003004cu)	/* SBCU Debug Trapped Bus Operation Signals Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EO             : 1;	/* Status of SBCU Debug Support Enable */
		/* const */ unsigned int OA             : 1;	/* Status of SBCU Breakpoint Logic */
		unsigned int                : 2;
		unsigned int RA             : 1;	/* Rearm SBCU Breakpoint Logic */
		unsigned int                : 7;
		unsigned int CONCOM0        : 1;	/* Grant and Address Trigger Relation */
		unsigned int CONCOM1        : 1;	/* Address 1 and Address 2 Trigger Relation */
		unsigned int CONCOM2        : 1;	/* Address and Signal Trigger Relation */
		unsigned int                : 1;
		unsigned int ONG            : 1;	/* Grant Trigger Enable */
		unsigned int                : 3;
		unsigned int ONA1           : 2;	/* Address 1 Trigger Control */
		unsigned int                : 2;
		unsigned int ONA2           : 2;	/* Address 2 Trigger Control */
		unsigned int                : 2;
		unsigned int ONBOS0         : 1;	/* Opcode Signal Status Trigger Condition */
		unsigned int ONBOS1         : 1;	/* Supervisor Mode Signal Trigger Condition */
		unsigned int ONBOS2         : 1;	/* Write Signal Trigger Condition */
		unsigned int ONBOS3         : 1;	/* Read Signal Trigger Condition */
	} B;
	int I;
	unsigned int U;

} SBCU_DBCNTL_type;
#define SBCU_DBCNTL	(*( SBCU_DBCNTL_type *) 0xf0030030u)	/* SBCU Debug Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FPIDATA        : 32;	/* FPIBus Data Status */
	} B;
	int I;
	unsigned int U;

} SBCU_DBDAT_type;
#define SBCU_DBDAT	(*( SBCU_DBDAT_type *) 0xf0030050u)	/* SBCU Debug Data Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SDMAH          : 1;	/* High-Priority SDMA FPIBus Master StatusIncluding SDMA transactions from SDMA channels with high priority and from Cerberus with high priority */
		unsigned int ONE            : 1;	/* Reserved */
		unsigned int ETH            : 1;	/* Ethernet FPIBus Master Status */
		unsigned int ONE_4          : 1;	/* Reserved */
		unsigned int DMA            : 1;	/* DMA FPIBus Master Status */
		unsigned int SDMAM          : 1;	/* Medium-Priority SDMA FPIBus Master StatusIncluding DMA transactions from DMA channels with medium priority */
		unsigned int ONE_7          : 2;	/* Reserved */
		unsigned int CPU0           : 1;	/* CPU0 FPIBus Master Status */
		unsigned int CPU1           : 1;	/* CPU1 FPIBus Master Status */
		unsigned int SFI            : 1;	/* SFI Bridge FPIBus Master Status */
		unsigned int ONE_11         : 1;	/* Reserved */
		unsigned int HSMRMI         : 1;	/* HSM Register FPIBus Master Interface Status */
		unsigned int HSMCMI         : 1;	/* HSM Cache FPIBus Master Interface Status */
		unsigned int ONE_14         : 1;	/* Reserved */
		unsigned int SDMAL          : 1;	/* Low-Priority SDMA FPIBus Master StatusIncluding DMA transactions from DMA channels with low priority, MLI and from Cerberus with low priority */
		unsigned int SDMACHNR       : 8;	/* SDMA-FPI Channel Grant Status */
		unsigned int DMACHNR        : 8;	/* DMA-FPI Channel Grant Status */
	} B;
	int I;
	unsigned int U;

} SBCU_DBGNTT_type;
