svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SBCU_DBGNTT	(*( SBCU_DBGNTT_type *) 0xf0030044u)	/* SBCU Debug Trapped Master Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SDMAH          : 1;	/* Cerberus Grant Trigger Enable, High PriorityIncluding SDMA transactions from SDMA channels with high priority and from Cerberus with high priority */
		unsigned int ONE            : 1;	/* Reserved */
		unsigned int ETH            : 1;	/* Ethernet Trigger Enable, High PriorityIncluding SDMA transactions from SDMA channels with high priority and from Cerberus with high priority */
		unsigned int ONE_4          : 1;	/* Reserved */
		unsigned int DMA            : 1;	/* DMA Grant Trigger Enable */
		unsigned int SDMAM          : 1;	/* SDMA Grant Trigger Enable, Medium PriorityIncluding SDMA transactions from SDMA channels with medium priority */
		unsigned int ONE_7          : 2;	/* Reserved */
		unsigned int CPU0           : 1;	/* CPU0 Grant Trigger Enable */
		unsigned int CPU1           : 1;	/* CPU1 Grant Trigger Enable */
		unsigned int SFI            : 1;	/* SFI Bridge Grant Trigger Enable */
		unsigned int ONE_11         : 1;	/* Reserved */
		unsigned int HSMRMI         : 1;	/* HSM Register Master Interface Grant Trigger Enable */
		unsigned int HSMCMI         : 1;	/* HSM Cache Master Interface Grant Trigger Enable */
		unsigned int ONE_14         : 1;	/* Reserved */
		unsigned int SDMAL          : 1;	/* DMA Grant Trigger Enable, Low PriorityIncluding SDMA transactions from SDMA channels with low priority, MLI and from Cerberus with low priority */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SBCU_DBGRNT_type;
#define SBCU_DBGRNT	(*( SBCU_DBGRNT_type *) 0xf0030034u)	/* SBCU Debug Grant Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPIADR         : 32;	/* Captured FPIBus Address */
	} B;
	int I;
	unsigned int U;

} SBCU_EADD_type;
#define SBCU_EADD	(*( SBCU_EADD_type *) 0xf0030024u)	/* SBCU Error Address Capture Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ERRCNT         : 14;	/* FPIBus Error Counter */
		unsigned int TOUT           : 1;	/* State of FPIBus Time-Out Signal */
		unsigned int RDY            : 1;	/* State of FPIBus Ready Signal */
		unsigned int ABT            : 1;	/* State of FPI Bus Abort Signal */
		unsigned int ACK            : 2;	/* State of FPIBus Acknowledge Signals */
		unsigned int SVM            : 1;	/* State of FPIBus Supervisor Mode Signal */
		unsigned int WRN            : 1;	/* State of FPIBus Write Signal */
		unsigned int RDN            : 1;	/* State of FPIBus Read Signal */
		unsigned int TAG            : 6;	/* FPIBus Master Tag Number Signals */
		unsigned int OPC            : 4;	/* FPIBus Operation Code Signals */
	} B;
	int I;
	unsigned int U;

} SBCU_ECON_type;
#define SBCU_ECON	(*( SBCU_ECON_type *) 0xf0030020u)	/* SBCU Error Control Capture Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPIDAT         : 32;	/* Captured FPIBus Data */
	} B;
	int I;
	unsigned int U;

} SBCU_EDAT_type;
#define SBCU_EDAT	(*( SBCU_EDAT_type *) 0xf0030028u)	/* SBCU Error Data Capture Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODNUMBER      : 8;	/* Module Number Value */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SBCU_ID_type;
#define SBCU_ID	(*( SBCU_ID_type *) 0xf0030008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CPU0           : 4;	/* Master 8 Priority */
		unsigned int CPU1           : 4;	/* Master 9 Priority */
		unsigned int SFI            : 4;	/* Master 10 Priority */
		/* const */ unsigned int ONES           : 4;	/* Reserved */
		unsigned int HSMRMI         : 4;	/* Master 12 Priority */
		unsigned int HSMCMI         : 4;	/* Master 13 Priority */
		/* const */ unsigned int ONES_7         : 4;	/* Reserved */
		unsigned int SDMAL          : 4;	/* Master 15 Priority */
	} B;
	int I;
	unsigned int U;

} SBCU_PRIOH_type;
#define SBCU_PRIOH	(*( SBCU_PRIOH_type *) 0xf0030014u)	/* Arbiter Priority Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SDMAH          : 4;	/* Master 0 Priority */
		/* const */ unsigned int ONES           : 4;	/* Reserved */
		unsigned int ETH            : 4;	/* Master 2 Priority */
		/* const */ unsigned int ONES_4         : 4;	/* Reserved */
		unsigned int DMA            : 4;	/* Master 4 Priority */
		unsigned int SDMAM          : 4;	/* Master 5 Priority */
		/* const */ unsigned int ONES_7         : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SBCU_PRIOL_type;
#define SBCU_PRIOL	(*( SBCU_PRIOL_type *) 0xf0030018u)	/* Arbiter Priority Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_ACCEN1_type;
#define XBAR_ACCEN1	(*( XBAR_ACCEN1_type *) 0xf87004f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PRERREN        : 1;	/* SRI Protocol Error Enable */
		unsigned int SCERREN        : 1;	/* SRI Starvation Error Enable */
		unsigned int SETPRINT       : 1;	/* Set SRI Protocol Interrupt */
		unsigned int SETSCINT       : 1;	/* Set SRI Starvation Interrupt */
		unsigned int INTACK         : 1;	/* Interrupt Acknowledge */
		unsigned int                : 15;
		unsigned int SPC            : 12;	/* Starvation Protection Counter Reload Value */
	} B;
	int I;
	unsigned int U;

} XBAR_ARBCON0_type;
#define XBAR_ARBCON0	(*( XBAR_ARBCON0_type *) 0xf8700044u)	/* Arbiter Control Register 0 */
#define XBAR_ARBCON1	(*( XBAR_ARBCON0_type *) 0xf8700084u)	/* Arbiter Control Register 1 */
#define XBAR_ARBCON2	(*( XBAR_ARBCON0_type *) 0xf87000c4u)	/* Arbiter Control Register 2 */
#define XBAR_ARBCON3	(*( XBAR_ARBCON0_type *) 0xf8700104u)	/* Arbiter Control Register 3 */
#define XBAR_ARBCON4	(*( XBAR_ARBCON0_type *) 0xf8700144u)	/* Arbiter Control Register 4 */
#define XBAR_ARBCON5	(*( XBAR_ARBCON0_type *) 0xf8700184u)	/* Arbiter Control Register 5 */
#define XBAR_ARBCON6	(*( XBAR_ARBCON0_type *) 0xf87001c4u)	/* Arbiter Control Register 6 */
#define XBAR_ARBCON7	(*( XBAR_ARBCON0_type *) 0xf8700204u)	/* Arbiter Control Register 7 */
#define XBAR_ARBCON8	(*( XBAR_ARBCON0_type *) 0xf8700244u)	/* Arbiter Control Register 8 */
#define XBAR_ARBCON9	(*( XBAR_ARBCON0_type *) 0xf8700284u)	/* Arbiter Control Register 9 */
#define XBAR_ARBCOND	(*( XBAR_ARBCON0_type *) 0xf8700004u)	/* Arbiter Control Register D */

