svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 19;	/* Debug Address Boundary */
		unsigned int                : 7;
		/* const */ unsigned int ONE            : 3;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD0_type;
#define XBAR_DBADD0	(*( XBAR_DBADD0_type *) 0xf870005cu)	/* Debug Address Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 27;
		unsigned int ADDRESS_27     : 2;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 2;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD1_type;
#define XBAR_DBADD1	(*( XBAR_DBADD1_type *) 0xf870009cu)	/* Debug Address Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 18;	/* Debug Address Boundary */
		unsigned int                : 9;
		/* const */ unsigned int ONE            : 2;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD2_type;
#define XBAR_DBADD2	(*( XBAR_DBADD2_type *) 0xf87000dcu)	/* Debug Address Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 19;	/* Debug Address Boundary */
		unsigned int                : 7;
		/* const */ unsigned int ONE            : 1;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_3          : 1;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD3_type;
#define XBAR_DBADD3	(*( XBAR_DBADD3_type *) 0xf870011cu)	/* Debug Address Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 18;	/* Debug Address Boundary */
		unsigned int                : 8;
		/* const */ unsigned int ONE            : 1;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_3          : 1;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD4_type;
#define XBAR_DBADD4	(*( XBAR_DBADD4_type *) 0xf870015cu)	/* Debug Address Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 25;	/* Debug Address Boundary */
		unsigned int                : 1;
		/* const */ unsigned int ONE            : 4;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD5_type;
#define XBAR_DBADD5	(*( XBAR_DBADD5_type *) 0xf870019cu)	/* Debug Address Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 29;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD6_type;
#define XBAR_DBADD6	(*( XBAR_DBADD6_type *) 0xf87001dcu)	/* Debug Address Register 6 */
#define XBAR_DBMADD6	(*( XBAR_DBADD6_type *) 0xf87001e0u)	/* Debug Mask Address Register 6 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 25;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 1;	/* Reserved */
		unsigned int ADDRESS_28     : 3;	/* Debug Address Boundary */
		/* const */ unsigned int ONE_4          : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD7_type;
#define XBAR_DBADD7	(*( XBAR_DBADD7_type *) 0xf870021cu)	/* Debug Address Register 7 */
#define XBAR_DBMADD7	(*( XBAR_DBADD7_type *) 0xf8700220u)	/* Debug Mask Address Register 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 19;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 1;	/* Reserved */
		unsigned int                : 7;
		unsigned int ADDRESS_29     : 1;	/* Debug Address Boundary */
		unsigned int                : 1;
		/* const */ unsigned int ONE_4          : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBADD8_type;
#define XBAR_DBADD8	(*( XBAR_DBADD8_type *) 0xf870025cu)	/* Debug Address Register 8 */
#define XBAR_DBADD9	(*( XBAR_DBADD8_type *) 0xf870029cu)	/* Debug Address Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 30;	/* Debug Address Boundary */
	} B;
	int I;
	unsigned int U;

} XBAR_DBADDD_type;
#define XBAR_DBADDD	(*( XBAR_DBADDD_type *) 0xf870001cu)	/* Debug Address Register D */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DBEN           : 1;	/* Status of OCDS Enable Signal */
		/* const */ unsigned int DBSAT          : 1;	/* Debug OCDS Trigger Status */
		unsigned int REARM          : 1;	/* Rearm Debug OCDS Trigger */
		unsigned int SETDBEVT       : 1;	/* Set Debug Event */
		unsigned int                : 12;
		unsigned int RDEN           : 1;	/* Read Trigger Enable */
		unsigned int WREN           : 1;	/* Write Trigger Enable */
		unsigned int SVMEN          : 1;	/* SVM Trigger Enable */
		unsigned int ADDEN          : 1;	/* Address Trigger Enable */
		unsigned int ERREN          : 1;	/* Error Trigger Enable */
		unsigned int                : 2;
		unsigned int MASEN          : 1;	/* Master Trigger Enable */
		unsigned int MASTER         : 6;	/* Master TAG ID Trigger Selector */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} XBAR_DBCON0_type;
#define XBAR_DBCON0	(*( XBAR_DBCON0_type *) 0xf8700058u)	/* Debug Control Register 0 */
#define XBAR_DBCON1	(*( XBAR_DBCON0_type *) 0xf8700098u)	/* Debug Control Register 1 */
#define XBAR_DBCON2	(*( XBAR_DBCON0_type *) 0xf87000d8u)	/* Debug Control Register 2 */
#define XBAR_DBCON3	(*( XBAR_DBCON0_type *) 0xf8700118u)	/* Debug Control Register 3 */
#define XBAR_DBCON4	(*( XBAR_DBCON0_type *) 0xf8700158u)	/* Debug Control Register 4 */
#define XBAR_DBCON5	(*( XBAR_DBCON0_type *) 0xf8700198u)	/* Debug Control Register 5 */
#define XBAR_DBCON6	(*( XBAR_DBCON0_type *) 0xf87001d8u)	/* Debug Control Register 6 */
#define XBAR_DBCON7	(*( XBAR_DBCON0_type *) 0xf8700218u)	/* Debug Control Register 7 */
#define XBAR_DBCON8	(*( XBAR_DBCON0_type *) 0xf8700258u)	/* Debug Control Register 8 */
#define XBAR_DBCON9	(*( XBAR_DBCON0_type *) 0xf8700298u)	/* Debug Control Register 9 */
#define XBAR_DBCOND	(*( XBAR_DBCON0_type *) 0xf8700018u)	/* Debug Control Register D */

