svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 19;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 2;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_3          : 3;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_4          : 3;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADD0_type;
#define XBAR_DBMADD0	(*( XBAR_DBMADD0_type *) 0xf8700060u)	/* Debug Mask Address Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 21;
		/* const */ unsigned int ONE            : 2;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_2          : 3;	/* Reserved */
		unsigned int ADDRESS_27     : 2;	/* Debug Address Boundary */
		/* const */ unsigned int ONE_4          : 2;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADD1_type;
#define XBAR_DBMADD1	(*( XBAR_DBMADD1_type *) 0xf87000a0u)	/* Debug Mask Address Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 18;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 12;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADD2_type;
#define XBAR_DBMADD2	(*( XBAR_DBMADD2_type *) 0xf87000e0u)	/* Debug Mask Address Register 2 */
#define XBAR_DBMADD4	(*( XBAR_DBMADD2_type *) 0xf8700160u)	/* Debug Mask Address Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 19;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 2;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_3          : 3;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_4          : 1;	/* Reserved */
		unsigned int                : 1;
		/* const */ unsigned int ONE_5          : 1;	/* Reserved */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADD3_type;
#define XBAR_DBMADD3	(*( XBAR_DBMADD3_type *) 0xf8700120u)	/* Debug Mask Address Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 25;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADD5_type;
#define XBAR_DBMADD5	(*( XBAR_DBMADD5_type *) 0xf87001a0u)	/* Debug Mask Address Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDRESS_2      : 19;	/* Debug Address Boundary */
		/* const */ unsigned int ONE            : 8;	/* Reserved */
		unsigned int ADDRESS_29     : 1;	/* Debug Address Boundary */
		/* const */ unsigned int ONE_4          : 2;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADD8_type;
#define XBAR_DBMADD8	(*( XBAR_DBMADD8_type *) 0xf8700260u)	/* Debug Mask Address Register 8 */
#define XBAR_DBMADD9	(*( XBAR_DBMADD8_type *) 0xf87002a0u)	/* Debug Mask Address Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRESS_0      : 32;	/* Debug Address Boundary */
	} B;
	int I;
	unsigned int U;

} XBAR_DBMADDD_type;
#define XBAR_DBMADDD	(*( XBAR_DBMADDD_type *) 0xf8700020u)	/* Debug Mask Address Register D */

typedef volatile union
{
	struct
	{ 
		unsigned int SCI0           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI1           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI2           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI3           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI4           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI5           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI6           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI7           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI8           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int SCI9           : 1;	/* SCI Debug Trigger Event Status */
		unsigned int                : 5;
		unsigned int SCID           : 1;	/* Default Slave Debug Trigger Event Status */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} XBAR_DBSAT_type;
#define XBAR_DBSAT	(*( XBAR_DBSAT_type *) 0xf870040cu)	/* Debug Trigger Event Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RD             : 1;	/* Read Indication Status */
		/* const */ unsigned int WR             : 1;	/* Write Indication Status */
		/* const */ unsigned int SVM            : 1;	/* Supervisor Mode Indication Status */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int OPC            : 4;	/* Operation Code */
		/* const */ unsigned int TR_ID          : 8;	/* Transaction ID */
		/* const */ unsigned int ADDR_ECC       : 8;	/* SRI Address Phase Error Detection Information */
		/* const */ unsigned int MCI_SBS        : 8;	/* MCI Sideband Signals [7:0] */
	} B;
	int I;
	unsigned int U;

} XBAR_ERR0_type;
#define XBAR_ERR0	(*( XBAR_ERR0_type *) 0xf8700054u)	/* Error/Debug Capture Register 0 */
#define XBAR_ERR1	(*( XBAR_ERR0_type *) 0xf8700094u)	/* Error/Debug Capture Register 1 */
#define XBAR_ERR2	(*( XBAR_ERR0_type *) 0xf87000d4u)	/* Error/Debug Capture Register 2 */
#define XBAR_ERR3	(*( XBAR_ERR0_type *) 0xf8700114u)	/* Error/Debug Capture Register 3 */
#define XBAR_ERR4	(*( XBAR_ERR0_type *) 0xf8700154u)	/* Error/Debug Capture Register 4 */
#define XBAR_ERR5	(*( XBAR_ERR0_type *) 0xf8700194u)	/* Error/Debug Capture Register 5 */
#define XBAR_ERR6	(*( XBAR_ERR0_type *) 0xf87001d4u)	/* Error/Debug Capture Register 6 */
#define XBAR_ERR7	(*( XBAR_ERR0_type *) 0xf8700214u)	/* Error/Debug Capture Register 7 */
#define XBAR_ERR8	(*( XBAR_ERR0_type *) 0xf8700254u)	/* Error/Debug Capture Register 8 */
#define XBAR_ERR9	(*( XBAR_ERR0_type *) 0xf8700294u)	/* Error/Debug Capture Register 9 */
#define XBAR_ERRD	(*( XBAR_ERR0_type *) 0xf8700014u)	/* Error/Debug Capture Register D */

