svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ADDR           : 32;	/* Transaction Address */
	} B;
	int I;
	unsigned int U;

} XBAR_ERRADDR0_type;
#define XBAR_ERRADDR0	(*( XBAR_ERRADDR0_type *) 0xf8700050u)	/* Error/Debug Address Capture Register 0 */
#define XBAR_ERRADDR1	(*( XBAR_ERRADDR0_type *) 0xf8700090u)	/* Error/Debug Address Capture Register 1 */
#define XBAR_ERRADDR3	(*( XBAR_ERRADDR0_type *) 0xf8700110u)	/* Error/Debug Address Capture Register 3 */
#define XBAR_ERRADDR4	(*( XBAR_ERRADDR0_type *) 0xf8700150u)	/* Error/Debug Address Capture Register 4 */
#define XBAR_ERRADDR5	(*( XBAR_ERRADDR0_type *) 0xf8700190u)	/* Error/Debug Address Capture Register 5 */
#define XBAR_ERRADDR6	(*( XBAR_ERRADDR0_type *) 0xf87001d0u)	/* Error/Debug Address Capture Register 6 */
#define XBAR_ERRADDR7	(*( XBAR_ERRADDR0_type *) 0xf8700210u)	/* Error/Debug Address Capture Register 7 */
#define XBAR_ERRADDR8	(*( XBAR_ERRADDR0_type *) 0xf8700250u)	/* Error/Debug Address Capture Register 8 */
#define XBAR_ERRADDR9	(*( XBAR_ERRADDR0_type *) 0xf8700290u)	/* Error/Debug Address Capture Register 9 */
#define XBAR_ERRADDRD	(*( XBAR_ERRADDR0_type *) 0xf8700010u)	/* Error/Debug Address Capture Register D */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int WFWD           : 1;	/* Wait for FPI Write Data */
		unsigned int FREQDISS       : 1;	/* Disable Fast Request Feature for SRI to FPI Transactions */
		unsigned int                : 1;
		unsigned int FREQDISF       : 1;	/* Disable Fast Request Feature for FPI to SRI Transactions */
		unsigned int                : 2;
		unsigned int NODELTR        : 1;	/* Control Signal for deferred transactions */
		unsigned int NORMW          : 1;	/* Control Signal for deferred transactions */
		unsigned int                : 1;
		unsigned int MAX_WS         : 4;	/* FPI-Bus Wait State Retry Ratio */
		unsigned int                : 4;
		unsigned int RETRY_CNT      : 4;	/* MIF_FPI Retry Idle Count */
		unsigned int NOPDIS         : 1;	/* NOP-Inclusion Disable */
		unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} XBAR_EXTCON5_type;
#define XBAR_EXTCON5	(*( XBAR_EXTCON5_type *) 0xf8700180u)	/* External Control Register 5 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} XBAR_ID_type;
#define XBAR_ID	(*( XBAR_ID_type *) 0xf8700408u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENSCI0         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI1         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI2         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI3         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI4         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI5         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI6         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI7         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI8         : 1;	/* Enable ID Error from SCIn */
		unsigned int ENSCI9         : 1;	/* Enable ID Error from SCIn */
		unsigned int                : 5;
		unsigned int ENSCID         : 1;	/* Enable ID Error from Default Slave */
		unsigned int ENMCI0         : 1;	/* Enable ID Error from MCI0 */
		unsigned int                : 2;
		unsigned int ENMCI3         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI4         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI5         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI6         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI7         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI8         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI9         : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI10        : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI11        : 1;	/* Enable ID Error from MCIn */
		unsigned int ENMCI12        : 1;	/* Enable ID Error from MCIn */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} XBAR_IDINTEN_type;
#define XBAR_IDINTEN	(*( XBAR_IDINTEN_type *) 0xf8700418u)	/* Transaction ID Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IDSCI0         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI1         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI2         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI3         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI4         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI5         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI6         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI7         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI8         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int IDSCI9         : 1;	/* Transaction ID Error from SCIn Status */
		unsigned int                : 5;
		unsigned int IDSCID         : 1;	/* Transaction ID Error from Default Slave Status */
		unsigned int IDMCI0         : 1;	/* Transaction ID Error from MCI0 Status */
		unsigned int                : 2;
		unsigned int IDMCI3         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI4         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI5         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI6         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI7         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI8         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI9         : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI10        : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI11        : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int IDMCI12        : 1;	/* Transaction ID Error from MCIn Status */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} XBAR_IDINTSAT_type;
