svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define XBAR_IDINTSAT	(*( XBAR_IDINTSAT_type *) 0xf8700414u)	/* Transaction ID Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SCSCI0         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI1         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI2         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI3         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI4         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI5         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI6         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI7         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI8         : 1;	/* Starvation Error from SCIn Status */
		unsigned int SCSCI9         : 1;	/* Starvation Error from SCIn Status */
		unsigned int                : 5;
		unsigned int SCSCID         : 1;	/* Starvation Error from Default Slave Status */
		unsigned int PRSCI0         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI1         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI2         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI3         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI4         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI5         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI6         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI7         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI8         : 1;	/* Protocol Error from SCIn Status */
		unsigned int PRSCI9         : 1;	/* Protocol Error from SCIn Status */
		unsigned int                : 5;
		unsigned int PRSCID         : 1;	/* Protocol Error from Default Slave Status */
	} B;
	int I;
	unsigned int U;

} XBAR_INTSAT_type;
#define XBAR_INTSAT	(*( XBAR_INTSAT_type *) 0xf8700410u)	/* Arbiter Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER8        : 4;	/* Master 8 Priority */
		unsigned int MASTER9        : 4;	/* Master 9 Priority */
		unsigned int MASTER10       : 4;	/* Master 10 Priority */
		unsigned int MASTER11       : 4;	/* Master 11 Priority */
		unsigned int MASTER12       : 4;	/* Master 12 Priority */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOH0_type;
#define XBAR_PRIOH0	(*( XBAR_PRIOH0_type *) 0xf8700048u)	/* Arbiter Priority Register 0 */
#define XBAR_PRIOH4	(*( XBAR_PRIOH0_type *) 0xf8700148u)	/* Arbiter Priority Register 4 */
#define XBAR_PRIOH6	(*( XBAR_PRIOH0_type *) 0xf87001c8u)	/* Arbiter Priority Register 6 */
#define XBAR_PRIOH7	(*( XBAR_PRIOH0_type *) 0xf8700208u)	/* Arbiter Priority Register 7 */
#define XBAR_PRIOH8	(*( XBAR_PRIOH0_type *) 0xf8700248u)	/* Arbiter Priority Register 8 */
#define XBAR_PRIOH9	(*( XBAR_PRIOH0_type *) 0xf8700288u)	/* Arbiter Priority Register 9 */
#define XBAR_PRIOHD	(*( XBAR_PRIOH0_type *) 0xf8700008u)	/* Arbiter Priority Register D */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER8        : 4;	/* Master 8 Priority */
		unsigned int                : 4;
		unsigned int MASTER10       : 4;	/* Master 10 Priority */
		unsigned int MASTER11       : 4;	/* Master 11 Priority */
		unsigned int MASTER12       : 4;	/* Master 12 Priority */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOH1_type;
#define XBAR_PRIOH1	(*( XBAR_PRIOH1_type *) 0xf8700088u)	/* Arbiter Priority Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER8        : 4;	/* Master 8 Priority */
		unsigned int MASTER9        : 4;	/* Master 9 Priority */
		unsigned int MASTER10       : 4;	/* Master 10 Priority */
		unsigned int                : 4;
		unsigned int MASTER12       : 4;	/* Master 12 Priority */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOH3_type;
#define XBAR_PRIOH3	(*( XBAR_PRIOH3_type *) 0xf8700108u)	/* Arbiter Priority Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER8        : 4;	/* Master 8 Priority */
		unsigned int MASTER9        : 4;	/* Master 9 Priority */
		unsigned int MASTER10       : 4;	/* Master 10 Priority */
		unsigned int MASTER11       : 4;	/* Master 11 Priority */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOH5_type;
#define XBAR_PRIOH5	(*( XBAR_PRIOH5_type *) 0xf8700188u)	/* Arbiter Priority Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER0        : 4;	/* Master 0 Priority */
		unsigned int                : 8;
		unsigned int MASTER3        : 4;	/* Master 3 Priority */
		unsigned int MASTER4        : 4;	/* Master 4 Priority */
		unsigned int MASTER5        : 4;	/* Master 5 Priority */
		unsigned int MASTER6        : 4;	/* Master 6 Priority */
		unsigned int MASTER7        : 4;	/* Master 7 Priority */
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOL0_type;
#define XBAR_PRIOL0	(*( XBAR_PRIOL0_type *) 0xf870004cu)	/* Arbiter Priority Register 0 */
#define XBAR_PRIOL1	(*( XBAR_PRIOL0_type *) 0xf870008cu)	/* Arbiter Priority Register 1 */
#define XBAR_PRIOL3	(*( XBAR_PRIOL0_type *) 0xf870010cu)	/* Arbiter Priority Register 3 */
#define XBAR_PRIOL4	(*( XBAR_PRIOL0_type *) 0xf870014cu)	/* Arbiter Priority Register 4 */
#define XBAR_PRIOL6	(*( XBAR_PRIOL0_type *) 0xf87001ccu)	/* Arbiter Priority Register 6 */
#define XBAR_PRIOLD	(*( XBAR_PRIOL0_type *) 0xf870000cu)	/* Arbiter Priority Register D */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int MASTER4        : 4;	/* Master 4 Priority */
		unsigned int                : 4;
		unsigned int MASTER6        : 4;	/* Master 6 Priority */
		unsigned int MASTER7        : 4;	/* Master 7 Priority */
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOL5_type;
#define XBAR_PRIOL5	(*( XBAR_PRIOL5_type *) 0xf870018cu)	/* Arbiter Priority Register 5 */

