svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MASTER0        : 4;	/* Master 0 Priority */
		unsigned int                : 8;
		unsigned int MASTER3        : 4;	/* Master 3 Priority */
		unsigned int                : 4;
		unsigned int MASTER5        : 4;	/* Master 5 Priority */
		unsigned int MASTER6        : 4;	/* Master 6 Priority */
		unsigned int MASTER7        : 4;	/* Master 7 Priority */
	} B;
	int I;
	unsigned int U;

} XBAR_PRIOL7_type;
#define XBAR_PRIOL7	(*( XBAR_PRIOL7_type *) 0xf870020cu)	/* Arbiter Priority Register 7 */
#define XBAR_PRIOL8	(*( XBAR_PRIOL7_type *) 0xf870024cu)	/* Arbiter Priority Register 8 */
#define XBAR_PRIOL9	(*( XBAR_PRIOL7_type *) 0xf870028cu)	/* Arbiter Priority Register 9 */


/* SCU */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} SCU_ACCEN0_type;
#define SCU_ACCEN0	(*( SCU_ACCEN0_type *) 0xf00363fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SCU_ACCEN1_type;
#define SCU_ACCEN1	(*( SCU_ACCEN1_type *) 0xf00363f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int STM0DIS        : 1;	/* STM0 Disable Reset */
		unsigned int STM1DIS        : 1;	/* STM1 Disable Reset */
		unsigned int STM2DIS        : 1;	/* STM2 Disable Reset */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} SCU_ARSTDIS_type;
#define SCU_ARSTDIS	(*( SCU_ARSTDIS_type *) 0xf003605cu)	/* Application Reset Disable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CPU0DIV        : 4;	/* CPU0 Divider Reload Value */
		unsigned int CPU0FDR        : 4;	/* CPU0 Fractional Divider Reload Value */
		unsigned int SRIDIV         : 4;	/* SRI Divider Reload Value */
		unsigned int SRIFDR         : 4;	/* SRI Fractional Divider Reload Value */
		unsigned int SPBDIV         : 4;	/* SPB Divider Reload Value */
		unsigned int FSI2DIV        : 4;	/* FSI2 Divider Reload Value */
		unsigned int FSIDIV         : 4;	/* FSI Divider Reload Value */
		/* const */ unsigned int CLKSEL         : 2;	/* Clock Selection */
		unsigned int UP             : 1;	/* Update Request */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_CCUCON0_type;
#define SCU_CCUCON0	(*( SCU_CCUCON0_type *) 0xf0036030u)	/* CCU Clock Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int MAXDIV         : 4;	/* Max Divider Reload Value */
		unsigned int ERAYDIV        : 4;	/* ERAY Divider Reload Value */
		unsigned int STMDIV         : 4;	/* STM Divider Reload Value */
		unsigned int GTMDIV         : 4;	/* GTM Divider Reload Value */
		unsigned int ETHDIV         : 4;	/* Ethernet Divider Reload Value */
		unsigned int                : 8;
		unsigned int INSEL          : 2;	/* Input Selection */
		unsigned int UP             : 1;	/* Update Request */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_CCUCON1_type;
#define SCU_CCUCON1	(*( SCU_CCUCON1_type *) 0xf0036034u)	/* CCU Clock Control Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int BBBDIV         : 4;	/* BBB Divider Reload Value */
		unsigned int REFCLKDIV      : 4;	/* Reference Clock for MCDS Divider Reload Value */
		unsigned int MCDSDIV        : 4;	/* MCDS Divider Reload Value */
		unsigned int                : 18;
		unsigned int UP             : 1;	/* Update Request */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_CCUCON2_type;
