svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SCU_CCUCON2	(*( SCU_CCUCON2_type *) 0xf0036040u)	/* CCU Clock Control Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CHREV          : 6;	/* Chip Revision Number */
		/* const */ unsigned int CHTEC          : 2;	/* Chip Family */
		unsigned int CHID           : 8;	/* Chip Identification Number */
		/* const */ unsigned int EEA            : 1;	/* Emulation Extension Available */
		unsigned int UCODE          : 7;	/* Code Version */
		unsigned int FSIZE          : 4;	/* Program Flash Size */
		unsigned int SP             : 2;	/* Speed */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} SCU_CHIPID_type;
#define SCU_CHIPID	(*( SCU_CHIPID_type *) 0xf0036140u)	/* Chip Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PWD            : 1;	/* Sensor Power Down */
		unsigned int START          : 1;	/* Sensor Measurement Start */
		unsigned int                : 2;
		unsigned int OFFSET         : 8;	/* Offset Calibration Value */
		unsigned int GAIN           : 6;	/* Gain Calibration Value */
		unsigned int REFTRIM        : 3;	/* Reference Trim Calibration Value */
		unsigned int BGTRIM         : 4;	/* Bandgap Trim Calibration Value */
		unsigned int                : 6;
		unsigned int LCK            : 1;	/* Lock */
	} B;
	int I;
	unsigned int U;

} SCU_DTSCON_type;
#define SCU_DTSCON	(*( SCU_DTSCON_type *) 0xf00360e4u)	/* Die Temperature Sensor Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LOWER          : 10;	/* Lower Limit */
		unsigned int                : 5;
		unsigned int LLU            : 1;	/* Lower Limit Underflow */
		unsigned int UPPER          : 10;	/* Upper Limit */
		unsigned int                : 4;
		unsigned int LCK            : 1;	/* Lock */
		/* const */ unsigned int UOF            : 1;	/* Upper Limit Underflow */
	} B;
	int I;
	unsigned int U;

} SCU_DTSLIM_type;
#define SCU_DTSLIM	(*( SCU_DTSLIM_type *) 0xf0036240u)	/* Die Temperature Sensor Limit Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESULT         : 10;	/* Result of the DTS Measurement */
		/* const */ unsigned int                : 4;
		/* const */ unsigned int RDY            : 1;	/* Sensor Ready Status */
		/* const */ unsigned int BUSY           : 1;	/* Sensor Busy Status */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_DTSSTAT_type;
#define SCU_DTSSTAT	(*( SCU_DTSSTAT_type *) 0xf00360e0u)	/* Die Temperature Sensor Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int EXIS0          : 3;	/* External Input Selection 0 */
		unsigned int                : 1;
		unsigned int FEN0           : 1;	/* Falling Edge Enable 0 */
		unsigned int REN0           : 1;	/* Rising Edge Enable 0 */
		unsigned int LDEN0          : 1;	/* Level Detection Enable 0 */
		unsigned int EIEN0          : 1;	/* External Input Enable 0 */
		unsigned int INP0           : 3;	/* Input Node Pointer */
		unsigned int                : 5;
		unsigned int EXIS1          : 3;	/* External Input Selection 1 */
		unsigned int                : 1;
		unsigned int FEN1           : 1;	/* Falling Edge Enable 1 */
		unsigned int REN1           : 1;	/* Rising Edge Enable 1 */
		unsigned int LDEN1          : 1;	/* Level Detection Enable 1 */
		unsigned int EIEN1          : 1;	/* External Input Enable 1 */
		unsigned int INP1           : 3;	/* Input Node Pointer */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} SCU_EICR0_type;
#define SCU_EICR0	(*( SCU_EICR0_type *) 0xf0036210u)	/* External Input Channel Register 0 */
#define SCU_EICR1	(*( SCU_EICR0_type *) 0xf0036214u)	/* External Input Channel Register 1 */
#define SCU_EICR2	(*( SCU_EICR0_type *) 0xf0036218u)	/* External Input Channel Register 2 */
#define SCU_EICR3	(*( SCU_EICR0_type *) 0xf003621cu)	/* External Input Channel Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int INTF0          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF1          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF2          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF3          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF4          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF5          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF6          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int INTF7          : 1;	/* External Event Flag of Channel x */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} SCU_EIFR_type;
#define SCU_EIFR	(*( SCU_EIFR_type *) 0xf0036220u)	/* External Input Flag Register */

typedef volatile union
{
	struct
	{ 
		unsigned int POL            : 1;	/* Input Polarity */
		unsigned int MODE           : 1;	/* Mode Selection */
		unsigned int ENON           : 1;	/* Enable ON */
		unsigned int PSEL           : 1;	/* PORT Select */
		unsigned int                : 12;
		/* const */ unsigned int EMSF           : 1;	/* Emergency Stop Flag */
		/* const */ unsigned int SEMSF          : 1;	/* SMU Emergency Stop Flag */
		unsigned int                : 6;
		unsigned int EMSFM          : 2;	/* Emergency Stop Flag Modification */
		unsigned int SEMSFM         : 2;	/* SMU Emergency Stop Flag Modification */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} SCU_EMSR_type;
#define SCU_EMSR	(*( SCU_EMSR_type *) 0xf00360fcu)	/* Emergency Stop Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int DFEN           : 1;	/* Digital Filter Enable */
		unsigned int                : 2;
		unsigned int EDCON          : 2;	/* Edge Detection Control */
		unsigned int                : 22;
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_ESRCFG0_type;
#define SCU_ESRCFG0	(*( SCU_ESRCFG0_type *) 0xf0036070u)	/* ESR0 Input Configuration Register */
#define SCU_ESRCFG1	(*( SCU_ESRCFG0_type *) 0xf0036074u)	/* ESR1 Input Configuration Register */

