svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ARI            : 1;	/* Application Reset Indicator */
		unsigned int ARC            : 1;	/* Application Reset Indicator Clear */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SCU_ESROCFG_type;
#define SCU_ESROCFG	(*( SCU_ESROCFG_type *) 0xf0036078u)	/* ESR Output Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int KP             : 4;	/* KP Value */
		unsigned int KI             : 4;	/* KI Value */
		unsigned int KD             : 4;	/* KD Value */
		unsigned int CTRL           : 4;	/* Reserved */
		unsigned int KPE            : 4;	/* KP Value */
		unsigned int KIE            : 4;	/* KI Value */
		unsigned int KDE            : 4;	/* KD Value */
		unsigned int EVR13OFF       : 1;	/* EVR13 Regulator Enable */
		unsigned int BPEVR13OFF     : 1;	/* Bit Protection EVR13OFF */
		unsigned int                : 1;
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVR13CON_type;
#define SCU_EVR13CON	(*( SCU_EVR13CON_type *) 0xf00360b8u)	/* EVR13 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int KP             : 4;	/* KP Value */
		unsigned int KI             : 4;	/* KI Value */
		unsigned int KD             : 4;	/* KD Value */
		unsigned int CTRL           : 4;	/* Reserved */
		unsigned int KPE            : 4;	/* KP Value */
		unsigned int KIE            : 4;	/* KI Value */
		unsigned int KDE            : 4;	/* KD Value */
		unsigned int EVR33OFF       : 1;	/* EVR33 Regulator Enable */
		unsigned int BPEVR33OFF     : 1;	/* Bit Protection EVR33OFF */
		unsigned int                : 1;
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVR33CON_type;
#define SCU_EVR33CON	(*( SCU_EVR33CON_type *) 0xf00360bcu)	/* EVR33 Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ADC13V         : 8;	/* ADC 13V Conversion Result */
		/* const */ unsigned int ADC33V         : 8;	/* ADC 33V Conversion Result */
		/* const */ unsigned int ADCSWDV        : 8;	/* ADC External Supply Conversion Result */
		/* const */ unsigned int                : 7;
		/* const */ unsigned int VAL            : 1;	/* Valid Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVRADCSTAT_type;
#define SCU_EVRADCSTAT	(*( SCU_EVRADCSTAT_type *) 0xf003619cu)	/* EVR ADC Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EVR13OVMOD     : 2;	/* 13V Regulator Over-voltage monitoring mode */
		unsigned int                : 2;
		unsigned int EVR13UVMOD     : 2;	/* 13V Regulator Under-voltage monitoring mode */
		unsigned int                : 2;
		unsigned int EVR33OVMOD     : 2;	/* 33V Regulator Over-voltage monitoring mode */
		unsigned int                : 2;
		unsigned int EVR33UVMOD     : 2;	/* 33V Regulator Under-voltage monitoring mode */
		unsigned int                : 2;
		unsigned int SWDOVMOD       : 2;	/* Supply monitor SWD Over-voltage monitoring mode */
		unsigned int                : 2;
		unsigned int SWDUVMOD       : 2;	/* Supply monitor SWD Under-voltage monitoring mode */
		unsigned int                : 8;
		unsigned int SLCK           : 1;	/* HSM Security Lock */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} SCU_EVRMONCTRL_type;
#define SCU_EVRMONCTRL	(*( SCU_EVRMONCTRL_type *) 0xf00361a8u)	/* EVR Monitor Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EVR13OVVAL     : 8;	/* 13V Regulator Over-voltage threshold */
		unsigned int EVR33OVVAL     : 8;	/* 33V Regulator Over-voltage threshold */
		unsigned int SWDOVVAL       : 8;	/* Supply monitor SWD Over-voltage threshold value */
		unsigned int                : 6;
		unsigned int SLCK           : 1;	/* HSM Security Lock */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVROVMON_type;
#define SCU_EVROVMON	(*( SCU_EVROVMON_type *) 0xf00361a4u)	/* EVR Over-voltage Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST13TRIM      : 8;	/* 13V Regulator Reset Trim Value */
		unsigned int RST33TRIM      : 8;	/* 33V Regulator Reset Trim Value */
		unsigned int RSTSWDTRIM     : 8;	/* 50V/33V External Supply Reset Trim Value */
		unsigned int RST13OFF       : 1;	/* Hard Reset EVR13 Enable */
		unsigned int BPRST13OFF     : 1;	/* Bit Protection RST13OFF */
		unsigned int RST33OFF       : 1;	/* Hard Reset EVR33 Enable */
		unsigned int BPRST33OFF     : 1;	/* Bit Protection RST33OFF */
		unsigned int RSTSWDOFF      : 1;	/* Hard Reset EVR Supply Monitor Enable */
		unsigned int BPRSTSWDOFF    : 1;	/* Bit Protection RSTSWDOFF */
		unsigned int SLCK           : 1;	/* HSM Security Lock */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVRRSTCON_type;
#define SCU_EVRRSTCON	(*( SCU_EVRRSTCON_type *) 0xf003606cu)	/* EVR Hard Reset Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SDFREQSPRD     : 16;	/* Frequency Spread Threshold freq_spread_thr_i */
		unsigned int SDFREQ         : 8;	/* Regulator Switching Frequency os_factor_i */
		unsigned int SDSTEP         : 4;	/* Droop Voltage Step sd_droop_step_i */
		unsigned int                : 2;
		unsigned int SDSAMPLE       : 1;	/* ADC Sampling Scheme sd_sample_time_i */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVRSDCTRL1_type;
#define SCU_EVRSDCTRL1	(*( SCU_EVRSDCTRL1_type *) 0xf00361b0u)	/* EVR13 SD Control Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EVR13          : 1;	/* EVR13 status */
		/* const */ unsigned int OV13           : 1;	/* EVR13 Regulator Over-voltage event flag */
		/* const */ unsigned int EVR33          : 1;	/* EVR33 status */
		/* const */ unsigned int OV33           : 1;	/* EVR33 Regulator Over-voltage event flag */
		/* const */ unsigned int OVSWD          : 1;	/* Supply Monitor SWD Over-voltage event flag */
		/* const */ unsigned int UV13           : 1;	/* EVR13 Regulator Under-voltage event flag */
		/* const */ unsigned int UV33           : 1;	/* EVR33 Regulator Under-voltage event flag */
		/* const */ unsigned int UVSWD          : 1;	/* Supply Monitor SWD Under-voltage event flag */
		/* const */ unsigned int EXTPASS13      : 1;	/* External Pass Device for EVR13 */
		/* const */ unsigned int EXTPASS33      : 1;	/* External Pass Device for EVR33 */
		/* const */ unsigned int BGPROK         : 1;	/* Primary Bandgap status */
		/* const */ unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} SCU_EVRSTAT_type;
#define SCU_EVRSTAT	(*( SCU_EVRSTAT_type *) 0xf00360b0u)	/* EVR Status Flag Register */

