svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EVR13UVVAL     : 8;	/* 13V Regulator Under-voltage threshold */
		unsigned int EVR33UVVAL     : 8;	/* 33V Regulator Under-voltage threshold */
		unsigned int SWDUVVAL       : 8;	/* Supply monitor SWD Under-voltage threshold value */
		unsigned int                : 6;
		unsigned int SLCK           : 1;	/* HSM Security Lock */
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_EVRUVMON_type;
#define SCU_EVRUVMON	(*( SCU_EVRUVMON_type *) 0xf00361a0u)	/* EVR Under-voltage Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* External Clock Enable for EXTCLK0 */
		unsigned int                : 1;
		unsigned int SEL0           : 4;	/* External Clock Select for EXTCLK0 */
		unsigned int                : 10;
		unsigned int EN1            : 1;	/* External Clock Enable for EXTCLK1 */
		unsigned int NSEL           : 1;	/* Negation Selection */
		unsigned int SEL1           : 4;	/* External Clock Select for EXTCLK1 */
		unsigned int                : 2;
		unsigned int DIV1           : 8;	/* External Clock Divider for EXTCLK1 */
	} B;
	int I;
	unsigned int U;

} SCU_EXTCON_type;
#define SCU_EXTCON	(*( SCU_EXTCON_type *) 0xf003603cu)	/* External Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 4;
		unsigned int DM             : 2;	/* Divider Mode */
		/* const */ unsigned int RESULT         : 10;	/* Result Value */
		unsigned int                : 5;
		unsigned int DISCLK         : 1;	/* Disable Clock */
	} B;
	int I;
	unsigned int U;

} SCU_FDR_type;
#define SCU_FDR	(*( SCU_FDR_type *) 0xf0036038u)	/* Fractional Divider Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FS0            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS1            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS2            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS3            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS4            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS5            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS6            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int FS7            : 1;	/* Set Flag INTFx for Channel x */
		unsigned int                : 8;
		unsigned int FC0            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC1            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC2            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC3            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC4            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC5            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC6            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int FC7            : 1;	/* Clear Flag INTFx for Channel x */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} SCU_FMR_type;
#define SCU_FMR	(*( SCU_FMR_type *) 0xf0036224u)	/* Flag Modification Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} SCU_ID_type;
#define SCU_ID	(*( SCU_ID_type *) 0xf0036008u)	/* Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IPEN00         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN01         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN02         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN03         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN04         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN05         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN06         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int IPEN07         : 1;	/* Flag Pattern Enable for Channel 0 */
		unsigned int                : 5;
		unsigned int GEEN0          : 1;	/* Generate Event Enable 0 */
		unsigned int IGP0           : 2;	/* Interrupt Gating Pattern 0 */
		unsigned int IPEN10         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN11         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN12         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN13         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN14         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN15         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN16         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int IPEN17         : 1;	/* Interrupt Pattern Enable for Channel 1 */
		unsigned int                : 5;
		unsigned int GEEN1          : 1;	/* Generate Event Enable 1 */
		unsigned int IGP1           : 2;	/* Interrupt Gating Pattern 1 */
	} B;
	int I;
	unsigned int U;

} SCU_IGCR0_type;
#define SCU_IGCR0	(*( SCU_IGCR0_type *) 0xf003622cu)	/* Flag Gating Register 0 */
#define SCU_IGCR1	(*( SCU_IGCR0_type *) 0xf0036230u)	/* Flag Gating Register 1 */
#define SCU_IGCR2	(*( SCU_IGCR0_type *) 0xf0036234u)	/* Flag Gating Register 2 */
#define SCU_IGCR3	(*( SCU_IGCR0_type *) 0xf0036238u)	/* Flag Gating Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int P0             : 1;	/* Input Bit x */
		/* const */ unsigned int P1             : 1;	/* Input Bit x */
		/* const */ unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SCU_IN_type;
#define SCU_IN	(*( SCU_IN_type *) 0xf00360acu)	/* ESR Input Register */

