svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int PC0            : 4;	/* Control for ESR Pin x */
		unsigned int                : 4;
		unsigned int PC1            : 4;	/* Control for ESR Pin x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_IOCR_type;
#define SCU_IOCR	(*( SCU_IOCR_type *) 0xf00360a0u)	/* Input/Output Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LBISTREQ       : 1;	/* LBIST Request */
		unsigned int LBISTREQP      : 1;	/* LBIST Request Protection Bit */
		unsigned int PATTERNS       : 14;	/* LBIST Pattern Number */
		unsigned int SEED           : 15;	/* LBIST Seed */
		unsigned int BODY           : 1;	/* BODY Application Mode */
	} B;
	int I;
	unsigned int U;

} SCU_LBISTCTRL0_type;
#define SCU_LBISTCTRL0	(*( SCU_LBISTCTRL0_type *) 0xf0036164u)	/* Logic BIST Control 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SIGNATURE      : 24;	/* LBIST Signature */
		unsigned int                : 3;
		/* const */ unsigned int LBISTDONE      : 1;	/* LBIST Execution Indicator */
		unsigned int LBISTFREQ      : 4;	/* LBIST Frequency Select */
	} B;
	int I;
	unsigned int U;

} SCU_LBISTCTRL1_type;
#define SCU_LBISTCTRL1	(*( SCU_LBISTCTRL1_type *) 0xf0036168u)	/* Logic BIST Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		/* const */ unsigned int LS             : 1;	/* Lockstep Mode Status */
		unsigned int                : 14;
		unsigned int LSEN           : 1;	/* Lockstep Enable */
	} B;
	int I;
	unsigned int U;

} SCU_LCLCON0_type;
#define SCU_LCLCON0	(*( SCU_LCLCON0_type *) 0xf0036134u)	/* LCL CPU0 Control Register */
#define SCU_LCLCON1	(*( SCU_LCLCON0_type *) 0xf0036138u)	/* LCL CPU1 Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DEPT           : 5;	/* Department Identification Number */
		/* const */ unsigned int MANUF          : 11;	/* Manufacturer Identification Number */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_MANID_type;
#define SCU_MANID	(*( SCU_MANID_type *) 0xf0036144u)	/* Manufacturer Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* ESRx Pin Set Bit x */
		unsigned int PS1            : 1;	/* ESRx Pin Set Bit x */
		unsigned int                : 14;
		unsigned int PCL0           : 1;	/* ESRx Pin Clear Bit x */
		unsigned int PCL1           : 1;	/* ESRx Pin Clear Bit x */
		unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} SCU_OMR_type;
#define SCU_OMR	(*( SCU_OMR_type *) 0xf00360a8u)	/* ESR Output Modification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		/* const */ unsigned int PLLLV          : 1;	/* Oscillator for PLL Valid Low Status Bit */
		unsigned int OSCRES         : 1;	/* Oscillator Watchdog Reset */
		unsigned int GAINSEL        : 2;	/* Oscillator Gain Selection */
		unsigned int MODE           : 2;	/* Oscillator Mode */
		unsigned int SHBY           : 1;	/* Shaper Bypass */
		/* const */ unsigned int PLLHV          : 1;	/* Oscillator for PLL Valid High Status Bit */
		unsigned int                : 1;
		/* const */ unsigned int X1D            : 1;	/* XTAL1 Data Value */
		unsigned int X1DEN          : 1;	/* XTAL1 Data Enable */
		unsigned int                : 4;
		unsigned int OSCVAL         : 5;	/* OSC Frequency Value */
		unsigned int                : 2;
		unsigned int APREN          : 1;	/* Amplitude Regulation Enable */
		unsigned int CAP0EN         : 1;	/* Capacitance 0 Enable */
		unsigned int CAP1EN         : 1;	/* Capacitance 1 Enable */
		unsigned int CAP2EN         : 1;	/* Capacitance 2 Enable */
		unsigned int CAP3EN         : 1;	/* Capacitance 3 Enable */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} SCU_OSCCON_type;
#define SCU_OSCCON	(*( SCU_OSCCON_type *) 0xf0036010u)	/* OSC Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int P0             : 1;	/* Output Bit x */
		unsigned int P1             : 1;	/* Output Bit x */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SCU_OUT_type;
#define SCU_OUT	(*( SCU_OUT_type *) 0xf00360a4u)	/* ESR Output Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CSEL0          : 1;	/* CPU Select x */
		unsigned int CSEL1          : 1;	/* CPU Select x */
		unsigned int CSEL2          : 1;	/* CPU Select x */
		unsigned int                : 5;
		unsigned int PEND0          : 1;	/* CPU Pending x */
		unsigned int PEND1          : 1;	/* CPU Pending x */
		unsigned int PEND2          : 1;	/* CPU Pending x */
		unsigned int                : 5;
		unsigned int OVSTRT         : 1;	/* Overlay Start */
		unsigned int OVSTP          : 1;	/* Overlay Stop */
		unsigned int DCINVAL        : 1;	/* Data Cache Invalidate */
		unsigned int                : 5;
		unsigned int OVCONF         : 1;	/* Overlay Configured */
		unsigned int POVCONF        : 1;	/* Write Protection for OVCONF */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} SCU_OVCCON_type;
#define SCU_OVCCON	(*( SCU_OVCCON_type *) 0xf00361e4u)	/* Overlay Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OVEN0          : 1;	/* Overlay Enable x */
		unsigned int OVEN1          : 1;	/* Overlay Enable x */
		unsigned int OVEN2          : 1;	/* Overlay Enable x */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} SCU_OVCENABLE_type;
#define SCU_OVCENABLE	(*( SCU_OVCENABLE_type *) 0xf00361e0u)	/* Overlay Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PDIS0          : 1;	/* Pad Disable for ESR Pin x */
		unsigned int PDIS1          : 1;	/* Pad Disable for ESR Pin x */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SCU_PDISC_type;
