svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SCU_PDISC	(*( SCU_PDISC_type *) 0xf003618cu)	/* Pad Disable Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PDR0           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR1           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR2           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR3           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR4           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR5           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR6           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int PDR7           : 1;	/* Pattern Detection Result of Channel y */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} SCU_PDRR_type;
#define SCU_PDRR	(*( SCU_PDRR_type *) 0xf0036228u)	/* Pattern Detection Result Register */

typedef volatile union
{
	struct
	{ 
		unsigned int VCOBYP         : 1;	/* VCO Bypass */
		unsigned int VCOPWD         : 1;	/* VCO Power Saving Mode */
		unsigned int MODEN          : 1;	/* Modulation Enable */
		unsigned int CEN            : 1;	/* Clipping Enable */
		unsigned int SETFINDIS      : 1;	/* Set Status Bit PLLSTATFINDIS */
		unsigned int CLRFINDIS      : 1;	/* Clear Status Bit PLLSTATFINDIS */
		unsigned int OSCDISCDIS     : 1;	/* Oscillator Disconnect Disable */
		unsigned int                : 2;
		unsigned int NDIV           : 7;	/* N-Divider Value */
		unsigned int PLLPWD         : 1;	/* PLL Power Saving Mode */
		unsigned int                : 1;
		unsigned int RESLD          : 1;	/* Restart VCO Lock Detection */
		unsigned int                : 5;
		unsigned int PDIV           : 4;	/* P-Divider Value */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} SCU_PLLCON0_type;
#define SCU_PLLCON0	(*( SCU_PLLCON0_type *) 0xf0036018u)	/* PLL Configuration 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int K2DIV          : 7;	/* K2-Divider Value */
		unsigned int                : 9;
		unsigned int K1DIV          : 7;	/* K1-Divider Value */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} SCU_PLLCON1_type;
#define SCU_PLLCON1	(*( SCU_PLLCON1_type *) 0xf003601cu)	/* PLL Configuration 1 Register */
#define SCU_PLLERAYCON1	(*( SCU_PLLCON1_type *) 0xf003602cu)	/* PLL_ERAY Configuration 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MODAMP         : 16;	/* Modulation Amplitude */
		unsigned int MODFREQ        : 16;	/* Modulation Frequency */
	} B;
	int I;
	unsigned int U;

} SCU_PLLCON2_type;
#define SCU_PLLCON2	(*( SCU_PLLCON2_type *) 0xf0036020u)	/* PLL Configuration 2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int VCOBYP         : 1;	/* VCO Bypass */
		unsigned int VCOPWD         : 1;	/* VCO Power Saving Mode */
		unsigned int                : 2;
		unsigned int SETFINDIS      : 1;	/* Set Status Bit PLLERAYSTATFINDIS */
		unsigned int CLRFINDIS      : 1;	/* Clear Status Bit PLLERAYSTATFINDIS */
		unsigned int OSCDISCDIS     : 1;	/* Oscillator Disconnect Disable */
		unsigned int                : 2;
		unsigned int NDIV           : 5;	/* N-Divider Value */
		unsigned int                : 2;
		unsigned int PLLPWD         : 1;	/* PLL Power Saving Mode */
		unsigned int                : 1;
		unsigned int RESLD          : 1;	/* Restart VCO Lock Detection */
		unsigned int                : 5;
		unsigned int PDIV           : 4;	/* P-Divider Value */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} SCU_PLLERAYCON0_type;
#define SCU_PLLERAYCON0	(*( SCU_PLLERAYCON0_type *) 0xf0036028u)	/* PLL_ERAY Configuration 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int VCOBYST        : 1;	/* VCO Bypass Status */
		/* const */ unsigned int PWDSTAT        : 1;	/* PLL_ERAY Power-saving Mode Status */
		/* const */ unsigned int VCOLOCK        : 1;	/* PLL VCO Lock Status */
		/* const */ unsigned int FINDIS         : 1;	/* Input Clock Disconnect Select Status */
		/* const */ unsigned int K1RDY          : 1;	/* K1 Divider Ready Status */
		/* const */ unsigned int K2RDY          : 1;	/* K2 Divider Ready Status */
		/* const */ unsigned int BY             : 1;	/* Bypass Mode Status */
		/* const */ unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

} SCU_PLLERAYSTAT_type;
#define SCU_PLLERAYSTAT	(*( SCU_PLLERAYSTAT_type *) 0xf0036024u)	/* PLL_ERAY Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int VCOBYST        : 1;	/* VCO Bypass Status */
		/* const */ unsigned int PWDSTAT        : 1;	/* PLL Power-saving Mode Status */
		/* const */ unsigned int VCOLOCK        : 1;	/* PLL VCO Lock Status */
		/* const */ unsigned int FINDIS         : 1;	/* Input Clock Disconnect Select Status */
		/* const */ unsigned int K1RDY          : 1;	/* K1 Divider Ready Status */
		/* const */ unsigned int K2RDY          : 1;	/* K2 Divider Ready Status */
		/* const */ unsigned int BY             : 1;	/* Bypass Mode Status */
		/* const */ unsigned int MODRUN         : 1;	/* Modulation Run */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} SCU_PLLSTAT_type;
#define SCU_PLLSTAT	(*( SCU_PLLSTAT_type *) 0xf0036014u)	/* PLL Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int REQSLP         : 2;	/* Idle Mode and Sleep Mode Request */
		unsigned int SMUSLP         : 1;	/* SMU CPU Idle Request */
		unsigned int RSTSLP         : 1;	/* Reset Controller CPU Idle Request */
		unsigned int                : 4;
		/* const */ unsigned int PMST           : 3;	/* Power management Status */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} SCU_PMCSR0_type;
