svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SCU_PMCSR0	(*( SCU_PMCSR0_type *) 0xf00360d4u)	/* Power Management Control and Status Register */
#define SCU_PMCSR1	(*( SCU_PMCSR0_type *) 0xf00360d8u)	/* Power Management Control and Status Register */
#define SCU_PMCSR2	(*( SCU_PMCSR0_type *) 0xf00360dcu)	/* Power Management Control and Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ESR0WKEN       : 1;	/* ESR0 Wake-up enable from Standby */
		unsigned int ESR1WKEN       : 1;	/* ESR1 Wake-up enable from Standby */
		unsigned int PINAWKEN       : 1;	/* Pin A Wake-up enable from Standby */
		unsigned int PINBWKEN       : 1;	/* Pin B Wake-up enable from Standby */
		unsigned int ESR0DFEN       : 1;	/* Digital Filter Enable */
		unsigned int ESR0EDCON      : 2;	/* Edge Detection Control */
		unsigned int ESR1DFEN       : 1;	/* Digital Filter Enable */
		unsigned int ESR1EDCON      : 2;	/* Edge Detection Control */
		unsigned int PINADFEN       : 1;	/* Digital Filter Enable */
		unsigned int PINAEDCON      : 2;	/* Edge Detection Control */
		unsigned int PINBDFEN       : 1;	/* Digital Filter Enable */
		unsigned int PINBEDCON      : 2;	/* Edge Detection Control */
		unsigned int                : 1;
		unsigned int STBYRAMSEL     : 2;	/* Standby RAM supply in Standby Mode */
		unsigned int                : 2;
		unsigned int TRISTEN        : 1;	/* Bit protection for Tristate request bit TRISTREQ */
		unsigned int TRISTREQ       : 1;	/* Tristate enable */
		unsigned int PORSTDF        : 1;	/* PORST Digital Filter enable */
		unsigned int PORSTWKP       : 1;	/* Standby - Wakeup transition on PORST edges */
		unsigned int DCDCSYNC       : 1;	/* DC-DC Synchronisation Enable */
		unsigned int                : 5;
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_PMSWCR0_type;
#define SCU_PMSWCR0	(*( SCU_PMSWCR0_type *) 0xf00360c8u)	/* Standby and Wake-up Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 8;
		unsigned int CPU0IDLE       : 1;	/* CPU0 IDLE request */
		unsigned int CPU1IDLE       : 1;	/* CPU1 IDLE request */
		unsigned int CPU2IDLE       : 1;	/* CPU2 IDLE request */
		unsigned int                : 13;
		unsigned int CPUSEL         : 3;	/* CPU selection for Sleep and Standby mode */
		unsigned int                : 4;
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_PMSWCR1_type;
#define SCU_PMSWCR1	(*( SCU_PMSWCR1_type *) 0xf00360e8u)	/* Standby and Wake-up Control Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SCRINT         : 8;	/* Data exchange from Standby Controller to SCU */
		/* const */ unsigned int BUSY           : 1;	/* SCR Arbiter Busy status flag */
		/* const */ unsigned int SCRECC         : 1;	/* SCR RAM ECC error / reset flag */
		/* const */ unsigned int SCRWDT         : 1;	/* SCR Watchdog Timer error / reset flag */
		/* const */ unsigned int SCRRST         : 1;	/* SCR Software reset flag */
		unsigned int                : 4;
		unsigned int TCINT          : 8;	/* Data exchange from SCU to Standby Controller */
		unsigned int TCINTREQ       : 1;	/* SW Interrupt request from SCU to Standby Controller */
		/* const */ unsigned int SMURST         : 1;	/* SMU Reset indication flag */
		/* const */ unsigned int RST            : 1;	/* Application or System Reset indication flag */
		unsigned int                : 4;
		/* const */ unsigned int LCK            : 1;	/* Lock Status */
	} B;
	int I;
	unsigned int U;

} SCU_PMSWCR2_type;
#define SCU_PMSWCR2	(*( SCU_PMSWCR2_type *) 0xf00360ecu)	/* Standby and Wake-up Control Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ESR0WKP        : 1;	/* ESR0 Wake-up flag */
		/* const */ unsigned int ESR0OVRUN      : 1;	/* ESR0 Overrun status flag */
		/* const */ unsigned int ESR1WKP        : 1;	/* ESR1 Wake-up flag */
		/* const */ unsigned int ESR1OVRUN      : 1;	/* ESR1 Overrun status flag */
		/* const */ unsigned int PINAWKP        : 1;	/* Pin A Wake-up flag */
		/* const */ unsigned int PINAOVRUN      : 1;	/* Pin A Overrun status flag */
		/* const */ unsigned int PINBWKP        : 1;	/* Pin B Wake-up flag */
		/* const */ unsigned int PINBOVRUN      : 1;	/* Pin B Overrun status flag */
		/* const */ unsigned int PORSTWKP       : 1;	/* Standby-Wakeup transition on PORST edges */
		/* const */ unsigned int PORSTDF        : 1;	/* PORST Digital Filter status */
		/* const */ unsigned int HWCFGEVR       : 3;	/* EVR Hardware Configuration */
		/* const */ unsigned int STBYRAM        : 2;	/* Standby RAM Supply status */
		/* const */ unsigned int TRIST          : 1;	/* Pad Tristate / Pull-up status */
		/* const */ unsigned int                : 3;
		/* const */ unsigned int SPARE0         : 5;	/* Spare bits */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} SCU_PMSWSTAT_type;
#define SCU_PMSWSTAT	(*( SCU_PMSWSTAT_type *) 0xf00360ccu)	/* Standby and Wake-up Status Flag Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ESR0WKPCLR     : 1;	/* ESR0 Wake-up indication flag clear */
		unsigned int ESR0OVRUNCLR   : 1;	/* ESR0 Overrun status indication flag clear */
		unsigned int ESR1WKPCLR     : 1;	/* ESR1 Wake-up indication flag clear */
		unsigned int ESR1OVRUNCLR   : 1;	/* ESR1 Overrun status indication flag clear */
		unsigned int PINAWKPCLR     : 1;	/* PINA Wake-up indication flag clear */
		unsigned int PINAOVRUNCLR   : 1;	/* PINA Overrun status indication flag clear */
		unsigned int PINBWKPCLR     : 1;	/* PINB Wake-up indication flag clear */
		unsigned int PINBOVRUNCLR   : 1;	/* PINB Overrun status indication flag clear */
		unsigned int                : 11;
		unsigned int SPARECLR       : 5;	/* SPARE flag clear */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} SCU_PMSWSTATCLR_type;
#define SCU_PMSWSTATCLR	(*( SCU_PMSWSTATCLR_type *) 0xf00360d0u)	/* Standby and Wake-up Status Clear Register */

