svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ESR0           : 2;	/* ESR0 Reset Request Trigger Reset Configuration */
		unsigned int ESR1           : 2;	/* ESR1 Reset Request Trigger Reset Configuration */
		unsigned int                : 2;
		unsigned int SMU            : 2;	/* SMU Reset Request Trigger Reset Configuration */
		unsigned int SW             : 2;	/* SW Reset Request Trigger Reset Configuration */
		unsigned int STM0           : 2;	/* STM0 Reset Request Trigger Reset Configuration */
		unsigned int STM1           : 2;	/* STM1 Reset Request Trigger Reset Configuration */
		unsigned int STM2           : 2;	/* STM2 Reset Request Trigger Reset Configuration */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_RSTCON_type;
#define SCU_RSTCON	(*( SCU_RSTCON_type *) 0xf0036058u)	/* Reset Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FRTO           : 1;	/* Force Reset Timeout */
		unsigned int CLRC           : 1;	/* Clear Cold Reset Status */
		unsigned int                : 8;
		/* const */ unsigned int FLSS           : 2;	/* Flash Safe State Reached */
		/* const */ unsigned int CSS            : 3;	/* CPU Safe State Reached */
		/* const */ unsigned int MCDSSS         : 1;	/* MCDS Safe State Reached */
		unsigned int USRINFO        : 16;	/* User Information */
	} B;
	int I;
	unsigned int U;

} SCU_RSTCON2_type;
#define SCU_RSTCON2	(*( SCU_RSTCON2_type *) 0xf0036064u)	/* Additional Reset Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ESR0           : 1;	/* Reset Request Trigger Reset Status for ESR0 */
		/* const */ unsigned int ESR1           : 1;	/* Reset Request Trigger Reset Status for ESR1 */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int SMU            : 1;	/* Reset Request Trigger Reset Status for SMU */
		/* const */ unsigned int SW             : 1;	/* Reset Request Trigger Reset Status for SW */
		/* const */ unsigned int STM0           : 1;	/* Reset Request Trigger Reset Status for STM0 */
		/* const */ unsigned int STM1           : 1;	/* Reset Request Trigger Reset Status for STM1 */
		/* const */ unsigned int STM2           : 1;	/* Reset Request Trigger Reset Status for STM2 */
		/* const */ unsigned int                : 8;
		/* const */ unsigned int PORST          : 1;	/* Reset Request Trigger Reset Status for PORST */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int CB0            : 1;	/* Reset Request Trigger Reset Status for Cerberus System Reset */
		/* const */ unsigned int CB1            : 1;	/* Reset Request Trigger Reset Status for Cerberus Debug Reset */
		/* const */ unsigned int CB3            : 1;	/* Reset Request Trigger Reset Status for Cerberus Application Reset */
		/* const */ unsigned int TP             : 1;	/* Reset Request Trigger Reset Status for Tuning Protection */
		/* const */ unsigned int TCU            : 1;	/* Reset Request Trigger Reset Status for TCU */
		/* const */ unsigned int EVR13          : 1;	/* Reset Request Trigger Reset Status for EVR13 */
		/* const */ unsigned int EVR33          : 1;	/* Reset Request Trigger Reset Status for EVR33 */
		/* const */ unsigned int SWD            : 1;	/* Reset Request Trigger Reset Status for Supply Watchdog SWD */
		/* const */ unsigned int HSMS           : 1;	/* Reset Request Trigger Reset Status for HSM System Reset HSM S */
		/* const */ unsigned int HSMA           : 1;	/* Reset Request Trigger Reset Status for HSM Application Reset HSM A */
		/* const */ unsigned int STBYR          : 1;	/* Reset Request Trigger Reset Status for Standby Regulator Watchdog STBYR */
		/* const */ unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} SCU_RSTSTAT_type;
#define SCU_RSTSTAT	(*( SCU_RSTSTAT_type *) 0xf0036050u)	/* Reset Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HWCFG          : 8;	/* Hardware Configuration Setting */
		unsigned int                : 5;
		unsigned int SFCBAE         : 1;	/* Set Flash Config Sector Access Enable */
		unsigned int CFCBAE         : 1;	/* Clear Flash Config Sector Access Enable */
		unsigned int STP            : 1;	/* Start-up Protection Setting */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_STCON_type;
#define SCU_STCON	(*( SCU_STCON_type *) 0xf00360c4u)	/* Start-up Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int HWCFG          : 8;	/* Hardware Configuration Setting */
		/* const */ unsigned int                : 7;
		/* const */ unsigned int MODE           : 1;	/* MODE */
		/* const */ unsigned int FCBAE          : 1;	/* Flash Config Sector Access Enable */
		/* const */ unsigned int LUDIS          : 1;	/* Latch Update Disable */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int TRSTL          : 1;	/* TRSTL Status */
		/* const */ unsigned int SPDEN          : 1;	/* Single Pin DAP Mode Enable */
		/* const */ unsigned int OTPOFF         : 1;	/* OTP Over-ruled */
		/* const */ unsigned int FSIOFF         : 1;	/* FSI Disabled */
		/* const */ unsigned int STPOVREQ       : 1;	/* Start-Up Protection Over-ruling Request */
		/* const */ unsigned int RAMINT         : 1;	/* RAM Content Security Integrity */
		/* const */ unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} SCU_STSTAT_type;
#define SCU_STSTAT	(*( SCU_STSTAT_type *) 0xf00360c0u)	/* Start-up Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SWBOOT         : 1;	/* Software Boot Configuration Selection */
		unsigned int SWRSTREQ       : 1;	/* Software Reset Request */
		unsigned int                : 6;
		unsigned int SWCFG          : 8;	/* Software Boot Configuration */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_SWRSTCON_type;
#define SCU_SWRSTCON	(*( SCU_SWRSTCON_type *) 0xf0036060u)	/* Software Reset Configuration Register */

