svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CCTRIG0        : 1;	/* Capture Compare Trigger x */
		unsigned int CCTRIG1        : 1;	/* Capture Compare Trigger x */
		unsigned int RAMINTM        : 2;	/* RAM Integrity Modify */
		unsigned int SETLUDIS       : 1;	/* Set Latch Update Disable */
		unsigned int                : 3;
		unsigned int DATM           : 1;	/* Disable Application Test Mode ATM */
		unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} SCU_SYSCON_type;
#define SCU_SYSCON	(*( SCU_SYSCON_type *) 0xf003607cu)	/* System Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ESR0T          : 1;	/* Clear Trap Request Flag ESR0T */
		unsigned int ESR1T          : 1;	/* Clear Trap Request Flag ESR1T */
		unsigned int                : 1;
		unsigned int SMUT           : 1;	/* Clear Trap Request Flag SMUT */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} SCU_TRAPCLR_type;
#define SCU_TRAPCLR	(*( SCU_TRAPCLR_type *) 0xf003612cu)	/* Trap Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ESR0T          : 1;	/* Disable Trap Request ESR0T */
		unsigned int ESR1T          : 1;	/* Disable Trap Request ESR1T */
		unsigned int                : 1;
		unsigned int SMUT           : 1;	/* Disable Trap Request SMUT */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} SCU_TRAPDIS_type;
#define SCU_TRAPDIS	(*( SCU_TRAPDIS_type *) 0xf0036130u)	/* Trap Disable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ESR0T          : 1;	/* Set Trap Request Flag ESR0T */
		unsigned int ESR1T          : 1;	/* Set Trap Request Flag ESR1T */
		unsigned int                : 1;
		unsigned int SMUT           : 1;	/* Set Trap Request Flag SMUT */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} SCU_TRAPSET_type;
#define SCU_TRAPSET	(*( SCU_TRAPSET_type *) 0xf0036128u)	/* Trap Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ESR0T          : 1;	/* ESR0 Trap Request Flag */
		/* const */ unsigned int ESR1T          : 1;	/* ESR1 Trap Request Flag */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int SMUT           : 1;	/* SMU Alarm Trap Request Flag */
		/* const */ unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} SCU_TRAPSTAT_type;
#define SCU_TRAPSTAT	(*( SCU_TRAPSTAT_type *) 0xf0036124u)	/* Trap Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENDINIT        : 1;	/* End-of-Initialization Control Bit */
		unsigned int LCK            : 1;	/* Lock Bit to Control Access to WDTxCON0 */
		unsigned int PW             : 14;	/* User-Definable Password Field for Access to WDTxCON0 */
		unsigned int REL            : 16;	/* Reload Value for the WDT also Time Check Value */
	} B;
	int I;
	unsigned int U;

} SCU_WDTCPU0CON0_type;
#define SCU_WDTCPU0CON0	(*( SCU_WDTCPU0CON0_type *) 0xf0036100u)	/* CPU0 WDT Control Register 0 */
#define SCU_WDTCPU1CON0	(*( SCU_WDTCPU0CON0_type *) 0xf003610cu)	/* CPU1 WDT Control Register 0 */
#define SCU_WDTCPU2CON0	(*( SCU_WDTCPU0CON0_type *) 0xf0036118u)	/* CPU2 WDT Control Register 0 */
#define SCU_WDTSCON0	(*( SCU_WDTCPU0CON0_type *) 0xf00360f0u)	/* Safety WDT Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int IR0            : 1;	/* Input Frequency Request Control */
		unsigned int DR             : 1;	/* Disable Request Control Bit */
		unsigned int                : 1;
		unsigned int IR1            : 1;	/* Input Frequency Request Control */
		unsigned int UR             : 1;	/* Unlock Restriction Request Control Bit */
		unsigned int PAR            : 1;	/* Password Auto-sequence Request Bit */
		unsigned int TCR            : 1;	/* Counter Check Request Bit */
		/* const */ unsigned int TCTR           : 7;	/* Timer Check Tolerance Request */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SCU_WDTCPU0CON1_type;
#define SCU_WDTCPU0CON1	(*( SCU_WDTCPU0CON1_type *) 0xf0036104u)	/* CPU0 WDT Control Register 1 */
#define SCU_WDTCPU1CON1	(*( SCU_WDTCPU0CON1_type *) 0xf0036110u)	/* CPU1 WDT Control Register 1 */
#define SCU_WDTCPU2CON1	(*( SCU_WDTCPU0CON1_type *) 0xf003611cu)	/* CPU2 WDT Control Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int AE             : 1;	/* Watchdog Access Error Status Flag */
		/* const */ unsigned int OE             : 1;	/* Watchdog Overflow Error Status Flag */
		/* const */ unsigned int IS0            : 1;	/* Watchdog Input Clock Status */
		/* const */ unsigned int DS             : 1;	/* Watchdog Enable/Disable Status Flag */
		/* const */ unsigned int TO             : 1;	/* Watchdog Time-Out Mode Flag */
		/* const */ unsigned int IS1            : 1;	/* Watchdog Input Clock Status */
		/* const */ unsigned int US             : 1;	/* SMU Unlock Restriction Status Flag */
		/* const */ unsigned int PAS            : 1;	/* Password Auto-sequence Status Flag */
		/* const */ unsigned int TCS            : 1;	/* Timer Check Status Flag */
		/* const */ unsigned int TCT            : 7;	/* Timer Check Tolerance */
		/* const */ unsigned int TIM            : 16;	/* Timer Value */
	} B;
	int I;
	unsigned int U;

} SCU_WDTCPU0SR_type;
#define SCU_WDTCPU0SR	(*( SCU_WDTCPU0SR_type *) 0xf0036108u)	/* CPU0 WDT Status Register */
#define SCU_WDTCPU1SR	(*( SCU_WDTCPU0SR_type *) 0xf0036114u)	/* CPU1 WDT Status Register */
#define SCU_WDTCPU2SR	(*( SCU_WDTCPU0SR_type *) 0xf0036120u)	/* CPU2 WDT Status Register */
#define SCU_WDTSSR	(*( SCU_WDTCPU0SR_type *) 0xf00360f8u)	/* Safety WDT Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLRIRF         : 1;	/* Clear Internal Reset Flag */
		unsigned int                : 1;
		unsigned int IR0            : 1;	/* Input Frequency Request Control */
		unsigned int DR             : 1;	/* Disable Request Control Bit */
		unsigned int                : 1;
		unsigned int IR1            : 1;	/* Input Frequency Request Control */
		unsigned int UR             : 1;	/* Unlock Restriction Request Control Bit */
		unsigned int PAR            : 1;	/* Password Auto-sequence Request Bit */
		unsigned int TCR            : 1;	/* Counter Check Request Bit */
		/* const */ unsigned int TCTR           : 7;	/* Timer Check Tolerance Request */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

