svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} SCU_WDTSCON1_type;
#define SCU_WDTSCON1	(*( SCU_WDTSCON1_type *) 0xf00360f4u)	/* Safety WDT Control Register 1 */


/* MultiCAN */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} CAN_ACCEN0_type;
#define CAN_ACCEN0	(*( CAN_ACCEN0_type *) 0xf00180fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CAN_ACCEN1_type;
#define CAN_ACCEN1	(*( CAN_ACCEN1_type *) 0xf00180f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int AWDV           : 8;	/* Application Watchdog Value */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CAN_AWDR_type;
#define CAN_AWDR	(*( CAN_AWDR_type *) 0xf00182a4u)	/* Application Watchdog Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CAN_CLC_type;
#define CAN_CLC	(*( CAN_CLC_type *) 0xf0018000u)	/* CAN Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CYCTM          : 16;	/* Cycle Time */
		/* const */ unsigned int BCC            : 6;	/* Basic Cycle Count */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int CSM            : 6;	/* Column of System Matrix */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} CAN_CYCTMR_type;
#define CAN_CYCTMR	(*( CAN_CYCTMR_type *) 0xf0018294u)	/* Cycle Time Register */

typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 4;
		unsigned int DM             : 2;	/* Divider Mode */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CAN_FDR_type;
#define CAN_FDR	(*( CAN_FDR_type *) 0xf001800cu)	/* CAN Fractional Divider Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 9;
		/* const */ unsigned int GMFR           : 7;	/* Global Mark Fraction */
		/* const */ unsigned int GM             : 16;	/* Global Mark */
	} B;
	int I;
	unsigned int U;

} CAN_GMR_type;
#define CAN_GMR	(*( CAN_GMR_type *) 0xf001829cu)	/* Global Mark Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} CAN_ID_type;
#define CAN_ID	(*( CAN_ID_type *) 0xf0018008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CAN_KRST0_type;
#define CAN_KRST0	(*( CAN_KRST0_type *) 0xf00180f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CAN_KRST1_type;
#define CAN_KRST1	(*( CAN_KRST1_type *) 0xf00180f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CAN_KRSTCLR_type;
#define CAN_KRSTCLR	(*( CAN_KRSTCLR_type *) 0xf00180ecu)	/* Kernel Reset Status Clear Register */

