svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 9;
		/* const */ unsigned int LGMFR          : 7;	/* Last Global Mark Fraction */
		/* const */ unsigned int LGM            : 16;	/* Last Global Mark */
	} B;
	int I;
	unsigned int U;

} CAN_LGMR_type;
#define CAN_LGMR	(*( CAN_LGMR_type *) 0xf00182a0u)	/* Last Global Mark Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int BEGIN          : 8;	/* List Begin */
		/* const */ unsigned int END            : 8;	/* List End */
		/* const */ unsigned int SIZE           : 8;	/* List Size */
		/* const */ unsigned int EMPTY          : 1;	/* List Empty Indication */
		/* const */ unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} CAN_LIST0_type;
#define CAN_LIST0	(*( CAN_LIST0_type *) 0xf0018100u)	/* List Register 0 */
#define CAN_LIST1	(*( CAN_LIST0_type *) 0xf0018104u)	/* List Register 1 */
#define CAN_LIST10	(*( CAN_LIST0_type *) 0xf0018128u)	/* List Register 10 */
#define CAN_LIST11	(*( CAN_LIST0_type *) 0xf001812cu)	/* List Register 11 */
#define CAN_LIST12	(*( CAN_LIST0_type *) 0xf0018130u)	/* List Register 12 */
#define CAN_LIST13	(*( CAN_LIST0_type *) 0xf0018134u)	/* List Register 13 */
#define CAN_LIST14	(*( CAN_LIST0_type *) 0xf0018138u)	/* List Register 14 */
#define CAN_LIST15	(*( CAN_LIST0_type *) 0xf001813cu)	/* List Register 15 */
#define CAN_LIST2	(*( CAN_LIST0_type *) 0xf0018108u)	/* List Register 2 */
#define CAN_LIST3	(*( CAN_LIST0_type *) 0xf001810cu)	/* List Register 3 */
#define CAN_LIST4	(*( CAN_LIST0_type *) 0xf0018110u)	/* List Register 4 */
#define CAN_LIST5	(*( CAN_LIST0_type *) 0xf0018114u)	/* List Register 5 */
#define CAN_LIST6	(*( CAN_LIST0_type *) 0xf0018118u)	/* List Register 6 */
#define CAN_LIST7	(*( CAN_LIST0_type *) 0xf001811cu)	/* List Register 7 */
#define CAN_LIST8	(*( CAN_LIST0_type *) 0xf0018120u)	/* List Register 8 */
#define CAN_LIST9	(*( CAN_LIST0_type *) 0xf0018124u)	/* List Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NEWDISC        : 1;	/* New Discontinuity Bit */
		/* const */ unsigned int DISC           : 1;	/* Discontinuity Bit */
		unsigned int                : 7;
		unsigned int LOFFR          : 7;	/* Local Offset Fraction */
		unsigned int LOF            : 16;	/* Local Offset */
	} B;
	int I;
	unsigned int U;

} CAN_LOR_type;
#define CAN_LOR	(*( CAN_LOR_type *) 0xf0018298u)	/* Local Offset Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 9;
		/* const */ unsigned int LREFMFR        : 7;	/* Last Reference Mark Fraction */
		/* const */ unsigned int LREFM          : 16;	/* Last Reference Mark */
	} B;
	int I;
	unsigned int U;

} CAN_LREFMR_type;
#define CAN_LREFMR	(*( CAN_LREFMR_type *) 0xf001828cu)	/* Last Reference Mark Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 6;
		/* const */ unsigned int LTFRC          : 10;	/* Local Time Fraction Value Capture */
		/* const */ unsigned int LTC            : 16;	/* Local Time Value Capture */
	} B;
	int I;
	unsigned int U;

} CAN_LTCR_type;
#define CAN_LTCR	(*( CAN_LTCR_type *) 0xf00182a8u)	/* Local Time Capture Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 6;
		/* const */ unsigned int LTFR           : 10;	/* Local Time Fraction */
		/* const */ unsigned int LT             : 16;	/* Local Time */
	} B;
	int I;
	unsigned int U;

} CAN_LTR_type;
#define CAN_LTR	(*( CAN_LTR_type *) 0xf0018280u)	/* Local Time Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLKSEL         : 4;	/* Baud Rate Logic Clock Select */
		unsigned int                : 8;
		unsigned int MPSEL          : 4;	/* Message Pending Selector */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CAN_MCR_type;
#define CAN_MCR	(*( CAN_MCR_type *) 0xf00181c8u)	/* Module Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IT             : 16;	/* Interrupt Trigger */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CAN_MITR_type;
#define CAN_MITR	(*( CAN_MITR_type *) 0xf00181ccu)	/* Module Interrupt Trigger Register */

typedef volatile union
{
	struct
	{ 
		unsigned int AM             : 29;	/* Acceptance Mask for Message Identifier */
		unsigned int MIDE           : 1;	/* Acceptance Mask Bit for Message IDE Bit */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} CAN_MOAMR0_type;
#define CAN_MOAMR0	(*( CAN_MOAMR0_type *) 0xf001900cu)	/* Message Object 0 Acceptance Mask Register */
#define CAN_MOAMR1	(*( CAN_MOAMR0_type *) 0xf001902cu)	/* Message Object 1 Acceptance Mask Register */
#define CAN_MOAMR10	(*( CAN_MOAMR0_type *) 0xf001914cu)	/* Message Object 10 Acceptance Mask Register */
#define CAN_MOAMR100	(*( CAN_MOAMR0_type *) 0xf0019c8cu)	/* Message Object 100 Acceptance Mask Register */
#define CAN_MOAMR101	(*( CAN_MOAMR0_type *) 0xf0019cacu)	/* Message Object 101 Acceptance Mask Register */
#define CAN_MOAMR102	(*( CAN_MOAMR0_type *) 0xf0019cccu)	/* Message Object 102 Acceptance Mask Register */
#define CAN_MOAMR103	(*( CAN_MOAMR0_type *) 0xf0019cecu)	/* Message Object 103 Acceptance Mask Register */
#define CAN_MOAMR104	(*( CAN_MOAMR0_type *) 0xf0019d0cu)	/* Message Object 104 Acceptance Mask Register */
#define CAN_MOAMR105	(*( CAN_MOAMR0_type *) 0xf0019d2cu)	/* Message Object 105 Acceptance Mask Register */
#define CAN_MOAMR106	(*( CAN_MOAMR0_type *) 0xf0019d4cu)	/* Message Object 106 Acceptance Mask Register */
#define CAN_MOAMR107	(*( CAN_MOAMR0_type *) 0xf0019d6cu)	/* Message Object 107 Acceptance Mask Register */
#define CAN_MOAMR108	(*( CAN_MOAMR0_type *) 0xf0019d8cu)	/* Message Object 108 Acceptance Mask Register */
#define CAN_MOAMR109	(*( CAN_MOAMR0_type *) 0xf0019dacu)	/* Message Object 109 Acceptance Mask Register */
#define CAN_MOAMR11	(*( CAN_MOAMR0_type *) 0xf001916cu)	/* Message Object 11 Acceptance Mask Register */
#define CAN_MOAMR110	(*( CAN_MOAMR0_type *) 0xf0019dccu)	/* Message Object 110 Acceptance Mask Register */
#define CAN_MOAMR111	(*( CAN_MOAMR0_type *) 0xf0019decu)	/* Message Object 111 Acceptance Mask Register */
#define CAN_MOAMR112	(*( CAN_MOAMR0_type *) 0xf0019e0cu)	/* Message Object 112 Acceptance Mask Register */
#define CAN_MOAMR113	(*( CAN_MOAMR0_type *) 0xf0019e2cu)	/* Message Object 113 Acceptance Mask Register */
#define CAN_MOAMR114	(*( CAN_MOAMR0_type *) 0xf0019e4cu)	/* Message Object 114 Acceptance Mask Register */
#define CAN_MOAMR115	(*( CAN_MOAMR0_type *) 0xf0019e6cu)	/* Message Object 115 Acceptance Mask Register */
#define CAN_MOAMR116	(*( CAN_MOAMR0_type *) 0xf0019e8cu)	/* Message Object 116 Acceptance Mask Register */
#define CAN_MOAMR117	(*( CAN_MOAMR0_type *) 0xf0019eacu)	/* Message Object 117 Acceptance Mask Register */
#define CAN_MOAMR118	(*( CAN_MOAMR0_type *) 0xf0019eccu)	/* Message Object 118 Acceptance Mask Register */
#define CAN_MOAMR119	(*( CAN_MOAMR0_type *) 0xf0019eecu)	/* Message Object 119 Acceptance Mask Register */
#define CAN_MOAMR12	(*( CAN_MOAMR0_type *) 0xf001918cu)	/* Message Object 12 Acceptance Mask Register */
#define CAN_MOAMR120	(*( CAN_MOAMR0_type *) 0xf0019f0cu)	/* Message Object 120 Acceptance Mask Register */
#define CAN_MOAMR121	(*( CAN_MOAMR0_type *) 0xf0019f2cu)	/* Message Object 121 Acceptance Mask Register */
#define CAN_MOAMR122	(*( CAN_MOAMR0_type *) 0xf0019f4cu)	/* Message Object 122 Acceptance Mask Register */
#define CAN_MOAMR123	(*( CAN_MOAMR0_type *) 0xf0019f6cu)	/* Message Object 123 Acceptance Mask Register */
#define CAN_MOAMR124	(*( CAN_MOAMR0_type *) 0xf0019f8cu)	/* Message Object 124 Acceptance Mask Register */
#define CAN_MOAMR125	(*( CAN_MOAMR0_type *) 0xf0019facu)	/* Message Object 125 Acceptance Mask Register */
#define CAN_MOAMR126	(*( CAN_MOAMR0_type *) 0xf0019fccu)	/* Message Object 126 Acceptance Mask Register */
#define CAN_MOAMR127	(*( CAN_MOAMR0_type *) 0xf0019fecu)	/* Message Object 127 Acceptance Mask Register */
#define CAN_MOAMR128	(*( CAN_MOAMR0_type *) 0xf001a00cu)	/* Message Object 128 Acceptance Mask Register */
#define CAN_MOAMR129	(*( CAN_MOAMR0_type *) 0xf001a02cu)	/* Message Object 129 Acceptance Mask Register */
#define CAN_MOAMR13	(*( CAN_MOAMR0_type *) 0xf00191acu)	/* Message Object 13 Acceptance Mask Register */
#define CAN_MOAMR130	(*( CAN_MOAMR0_type *) 0xf001a04cu)	/* Message Object 130 Acceptance Mask Register */
#define CAN_MOAMR131	(*( CAN_MOAMR0_type *) 0xf001a06cu)	/* Message Object 131 Acceptance Mask Register */
#define CAN_MOAMR132	(*( CAN_MOAMR0_type *) 0xf001a08cu)	/* Message Object 132 Acceptance Mask Register */
#define CAN_MOAMR133	(*( CAN_MOAMR0_type *) 0xf001a0acu)	/* Message Object 133 Acceptance Mask Register */
#define CAN_MOAMR134	(*( CAN_MOAMR0_type *) 0xf001a0ccu)	/* Message Object 134 Acceptance Mask Register */
#define CAN_MOAMR135	(*( CAN_MOAMR0_type *) 0xf001a0ecu)	/* Message Object 135 Acceptance Mask Register */
#define CAN_MOAMR136	(*( CAN_MOAMR0_type *) 0xf001a10cu)	/* Message Object 136 Acceptance Mask Register */
#define CAN_MOAMR137	(*( CAN_MOAMR0_type *) 0xf001a12cu)	/* Message Object 137 Acceptance Mask Register */
#define CAN_MOAMR138	(*( CAN_MOAMR0_type *) 0xf001a14cu)	/* Message Object 138 Acceptance Mask Register */
#define CAN_MOAMR139	(*( CAN_MOAMR0_type *) 0xf001a16cu)	/* Message Object 139 Acceptance Mask Register */
#define CAN_MOAMR14	(*( CAN_MOAMR0_type *) 0xf00191ccu)	/* Message Object 14 Acceptance Mask Register */
#define CAN_MOAMR140	(*( CAN_MOAMR0_type *) 0xf001a18cu)	/* Message Object 140 Acceptance Mask Register */
#define CAN_MOAMR141	(*( CAN_MOAMR0_type *) 0xf001a1acu)	/* Message Object 141 Acceptance Mask Register */
#define CAN_MOAMR142	(*( CAN_MOAMR0_type *) 0xf001a1ccu)	/* Message Object 142 Acceptance Mask Register */
#define CAN_MOAMR143	(*( CAN_MOAMR0_type *) 0xf001a1ecu)	/* Message Object 143 Acceptance Mask Register */
#define CAN_MOAMR144	(*( CAN_MOAMR0_type *) 0xf001a20cu)	/* Message Object 144 Acceptance Mask Register */
#define CAN_MOAMR145	(*( CAN_MOAMR0_type *) 0xf001a22cu)	/* Message Object 145 Acceptance Mask Register */
#define CAN_MOAMR146	(*( CAN_MOAMR0_type *) 0xf001a24cu)	/* Message Object 146 Acceptance Mask Register */
#define CAN_MOAMR147	(*( CAN_MOAMR0_type *) 0xf001a26cu)	/* Message Object 147 Acceptance Mask Register */
#define CAN_MOAMR148	(*( CAN_MOAMR0_type *) 0xf001a28cu)	/* Message Object 148 Acceptance Mask Register */
#define CAN_MOAMR149	(*( CAN_MOAMR0_type *) 0xf001a2acu)	/* Message Object 149 Acceptance Mask Register */
#define CAN_MOAMR15	(*( CAN_MOAMR0_type *) 0xf00191ecu)	/* Message Object 15 Acceptance Mask Register */
#define CAN_MOAMR150	(*( CAN_MOAMR0_type *) 0xf001a2ccu)	/* Message Object 150 Acceptance Mask Register */
#define CAN_MOAMR151	(*( CAN_MOAMR0_type *) 0xf001a2ecu)	/* Message Object 151 Acceptance Mask Register */
#define CAN_MOAMR152	(*( CAN_MOAMR0_type *) 0xf001a30cu)	/* Message Object 152 Acceptance Mask Register */
#define CAN_MOAMR153	(*( CAN_MOAMR0_type *) 0xf001a32cu)	/* Message Object 153 Acceptance Mask Register */
#define CAN_MOAMR154	(*( CAN_MOAMR0_type *) 0xf001a34cu)	/* Message Object 154 Acceptance Mask Register */
#define CAN_MOAMR155	(*( CAN_MOAMR0_type *) 0xf001a36cu)	/* Message Object 155 Acceptance Mask Register */
#define CAN_MOAMR156	(*( CAN_MOAMR0_type *) 0xf001a38cu)	/* Message Object 156 Acceptance Mask Register */
#define CAN_MOAMR157	(*( CAN_MOAMR0_type *) 0xf001a3acu)	/* Message Object 157 Acceptance Mask Register */
#define CAN_MOAMR158	(*( CAN_MOAMR0_type *) 0xf001a3ccu)	/* Message Object 158 Acceptance Mask Register */
#define CAN_MOAMR159	(*( CAN_MOAMR0_type *) 0xf001a3ecu)	/* Message Object 159 Acceptance Mask Register */
#define CAN_MOAMR16	(*( CAN_MOAMR0_type *) 0xf001920cu)	/* Message Object 16 Acceptance Mask Register */
#define CAN_MOAMR160	(*( CAN_MOAMR0_type *) 0xf001a40cu)	/* Message Object 160 Acceptance Mask Register */
#define CAN_MOAMR161	(*( CAN_MOAMR0_type *) 0xf001a42cu)	/* Message Object 161 Acceptance Mask Register */
#define CAN_MOAMR162	(*( CAN_MOAMR0_type *) 0xf001a44cu)	/* Message Object 162 Acceptance Mask Register */
#define CAN_MOAMR163	(*( CAN_MOAMR0_type *) 0xf001a46cu)	/* Message Object 163 Acceptance Mask Register */
#define CAN_MOAMR164	(*( CAN_MOAMR0_type *) 0xf001a48cu)	/* Message Object 164 Acceptance Mask Register */
#define CAN_MOAMR165	(*( CAN_MOAMR0_type *) 0xf001a4acu)	/* Message Object 165 Acceptance Mask Register */
#define CAN_MOAMR166	(*( CAN_MOAMR0_type *) 0xf001a4ccu)	/* Message Object 166 Acceptance Mask Register */
#define CAN_MOAMR167	(*( CAN_MOAMR0_type *) 0xf001a4ecu)	/* Message Object 167 Acceptance Mask Register */
#define CAN_MOAMR168	(*( CAN_MOAMR0_type *) 0xf001a50cu)	/* Message Object 168 Acceptance Mask Register */
#define CAN_MOAMR169	(*( CAN_MOAMR0_type *) 0xf001a52cu)	/* Message Object 169 Acceptance Mask Register */
#define CAN_MOAMR17	(*( CAN_MOAMR0_type *) 0xf001922cu)	/* Message Object 17 Acceptance Mask Register */
#define CAN_MOAMR170	(*( CAN_MOAMR0_type *) 0xf001a54cu)	/* Message Object 170 Acceptance Mask Register */
#define CAN_MOAMR171	(*( CAN_MOAMR0_type *) 0xf001a56cu)	/* Message Object 171 Acceptance Mask Register */
#define CAN_MOAMR172	(*( CAN_MOAMR0_type *) 0xf001a58cu)	/* Message Object 172 Acceptance Mask Register */
#define CAN_MOAMR173	(*( CAN_MOAMR0_type *) 0xf001a5acu)	/* Message Object 173 Acceptance Mask Register */
#define CAN_MOAMR174	(*( CAN_MOAMR0_type *) 0xf001a5ccu)	/* Message Object 174 Acceptance Mask Register */
#define CAN_MOAMR175	(*( CAN_MOAMR0_type *) 0xf001a5ecu)	/* Message Object 175 Acceptance Mask Register */
#define CAN_MOAMR176	(*( CAN_MOAMR0_type *) 0xf001a60cu)	/* Message Object 176 Acceptance Mask Register */
#define CAN_MOAMR177	(*( CAN_MOAMR0_type *) 0xf001a62cu)	/* Message Object 177 Acceptance Mask Register */
#define CAN_MOAMR178	(*( CAN_MOAMR0_type *) 0xf001a64cu)	/* Message Object 178 Acceptance Mask Register */
#define CAN_MOAMR179	(*( CAN_MOAMR0_type *) 0xf001a66cu)	/* Message Object 179 Acceptance Mask Register */
#define CAN_MOAMR18	(*( CAN_MOAMR0_type *) 0xf001924cu)	/* Message Object 18 Acceptance Mask Register */
#define CAN_MOAMR180	(*( CAN_MOAMR0_type *) 0xf001a68cu)	/* Message Object 180 Acceptance Mask Register */
#define CAN_MOAMR181	(*( CAN_MOAMR0_type *) 0xf001a6acu)	/* Message Object 181 Acceptance Mask Register */
#define CAN_MOAMR182	(*( CAN_MOAMR0_type *) 0xf001a6ccu)	/* Message Object 182 Acceptance Mask Register */
#define CAN_MOAMR183	(*( CAN_MOAMR0_type *) 0xf001a6ecu)	/* Message Object 183 Acceptance Mask Register */
#define CAN_MOAMR184	(*( CAN_MOAMR0_type *) 0xf001a70cu)	/* Message Object 184 Acceptance Mask Register */
#define CAN_MOAMR185	(*( CAN_MOAMR0_type *) 0xf001a72cu)	/* Message Object 185 Acceptance Mask Register */
#define CAN_MOAMR186	(*( CAN_MOAMR0_type *) 0xf001a74cu)	/* Message Object 186 Acceptance Mask Register */
#define CAN_MOAMR187	(*( CAN_MOAMR0_type *) 0xf001a76cu)	/* Message Object 187 Acceptance Mask Register */
#define CAN_MOAMR188	(*( CAN_MOAMR0_type *) 0xf001a78cu)	/* Message Object 188 Acceptance Mask Register */
#define CAN_MOAMR189	(*( CAN_MOAMR0_type *) 0xf001a7acu)	/* Message Object 189 Acceptance Mask Register */
#define CAN_MOAMR19	(*( CAN_MOAMR0_type *) 0xf001926cu)	/* Message Object 19 Acceptance Mask Register */
#define CAN_MOAMR190	(*( CAN_MOAMR0_type *) 0xf001a7ccu)	/* Message Object 190 Acceptance Mask Register */
#define CAN_MOAMR191	(*( CAN_MOAMR0_type *) 0xf001a7ecu)	/* Message Object 191 Acceptance Mask Register */
#define CAN_MOAMR192	(*( CAN_MOAMR0_type *) 0xf001a80cu)	/* Message Object 192 Acceptance Mask Register */
#define CAN_MOAMR193	(*( CAN_MOAMR0_type *) 0xf001a82cu)	/* Message Object 193 Acceptance Mask Register */
#define CAN_MOAMR194	(*( CAN_MOAMR0_type *) 0xf001a84cu)	/* Message Object 194 Acceptance Mask Register */
#define CAN_MOAMR195	(*( CAN_MOAMR0_type *) 0xf001a86cu)	/* Message Object 195 Acceptance Mask Register */
#define CAN_MOAMR196	(*( CAN_MOAMR0_type *) 0xf001a88cu)	/* Message Object 196 Acceptance Mask Register */
#define CAN_MOAMR197	(*( CAN_MOAMR0_type *) 0xf001a8acu)	/* Message Object 197 Acceptance Mask Register */
#define CAN_MOAMR198	(*( CAN_MOAMR0_type *) 0xf001a8ccu)	/* Message Object 198 Acceptance Mask Register */
#define CAN_MOAMR199	(*( CAN_MOAMR0_type *) 0xf001a8ecu)	/* Message Object 199 Acceptance Mask Register */
#define CAN_MOAMR2	(*( CAN_MOAMR0_type *) 0xf001904cu)	/* Message Object 2 Acceptance Mask Register */
#define CAN_MOAMR20	(*( CAN_MOAMR0_type *) 0xf001928cu)	/* Message Object 20 Acceptance Mask Register */
#define CAN_MOAMR200	(*( CAN_MOAMR0_type *) 0xf001a90cu)	/* Message Object 200 Acceptance Mask Register */
#define CAN_MOAMR201	(*( CAN_MOAMR0_type *) 0xf001a92cu)	/* Message Object 201 Acceptance Mask Register */
#define CAN_MOAMR202	(*( CAN_MOAMR0_type *) 0xf001a94cu)	/* Message Object 202 Acceptance Mask Register */
#define CAN_MOAMR203	(*( CAN_MOAMR0_type *) 0xf001a96cu)	/* Message Object 203 Acceptance Mask Register */
#define CAN_MOAMR204	(*( CAN_MOAMR0_type *) 0xf001a98cu)	/* Message Object 204 Acceptance Mask Register */
#define CAN_MOAMR205	(*( CAN_MOAMR0_type *) 0xf001a9acu)	/* Message Object 205 Acceptance Mask Register */
#define CAN_MOAMR206	(*( CAN_MOAMR0_type *) 0xf001a9ccu)	/* Message Object 206 Acceptance Mask Register */
#define CAN_MOAMR207	(*( CAN_MOAMR0_type *) 0xf001a9ecu)	/* Message Object 207 Acceptance Mask Register */
#define CAN_MOAMR208	(*( CAN_MOAMR0_type *) 0xf001aa0cu)	/* Message Object 208 Acceptance Mask Register */
#define CAN_MOAMR209	(*( CAN_MOAMR0_type *) 0xf001aa2cu)	/* Message Object 209 Acceptance Mask Register */
#define CAN_MOAMR21	(*( CAN_MOAMR0_type *) 0xf00192acu)	/* Message Object 21 Acceptance Mask Register */
#define CAN_MOAMR210	(*( CAN_MOAMR0_type *) 0xf001aa4cu)	/* Message Object 210 Acceptance Mask Register */
#define CAN_MOAMR211	(*( CAN_MOAMR0_type *) 0xf001aa6cu)	/* Message Object 211 Acceptance Mask Register */
#define CAN_MOAMR212	(*( CAN_MOAMR0_type *) 0xf001aa8cu)	/* Message Object 212 Acceptance Mask Register */
#define CAN_MOAMR213	(*( CAN_MOAMR0_type *) 0xf001aaacu)	/* Message Object 213 Acceptance Mask Register */
#define CAN_MOAMR214	(*( CAN_MOAMR0_type *) 0xf001aaccu)	/* Message Object 214 Acceptance Mask Register */
#define CAN_MOAMR215	(*( CAN_MOAMR0_type *) 0xf001aaecu)	/* Message Object 215 Acceptance Mask Register */
#define CAN_MOAMR216	(*( CAN_MOAMR0_type *) 0xf001ab0cu)	/* Message Object 216 Acceptance Mask Register */
#define CAN_MOAMR217	(*( CAN_MOAMR0_type *) 0xf001ab2cu)	/* Message Object 217 Acceptance Mask Register */
#define CAN_MOAMR218	(*( CAN_MOAMR0_type *) 0xf001ab4cu)	/* Message Object 218 Acceptance Mask Register */
#define CAN_MOAMR219	(*( CAN_MOAMR0_type *) 0xf001ab6cu)	/* Message Object 219 Acceptance Mask Register */
#define CAN_MOAMR22	(*( CAN_MOAMR0_type *) 0xf00192ccu)	/* Message Object 22 Acceptance Mask Register */
#define CAN_MOAMR220	(*( CAN_MOAMR0_type *) 0xf001ab8cu)	/* Message Object 220 Acceptance Mask Register */
#define CAN_MOAMR221	(*( CAN_MOAMR0_type *) 0xf001abacu)	/* Message Object 221 Acceptance Mask Register */
#define CAN_MOAMR222	(*( CAN_MOAMR0_type *) 0xf001abccu)	/* Message Object 222 Acceptance Mask Register */
#define CAN_MOAMR223	(*( CAN_MOAMR0_type *) 0xf001abecu)	/* Message Object 223 Acceptance Mask Register */
#define CAN_MOAMR224	(*( CAN_MOAMR0_type *) 0xf001ac0cu)	/* Message Object 224 Acceptance Mask Register */
#define CAN_MOAMR225	(*( CAN_MOAMR0_type *) 0xf001ac2cu)	/* Message Object 225 Acceptance Mask Register */
#define CAN_MOAMR226	(*( CAN_MOAMR0_type *) 0xf001ac4cu)	/* Message Object 226 Acceptance Mask Register */
#define CAN_MOAMR227	(*( CAN_MOAMR0_type *) 0xf001ac6cu)	/* Message Object 227 Acceptance Mask Register */
#define CAN_MOAMR228	(*( CAN_MOAMR0_type *) 0xf001ac8cu)	/* Message Object 228 Acceptance Mask Register */
#define CAN_MOAMR229	(*( CAN_MOAMR0_type *) 0xf001acacu)	/* Message Object 229 Acceptance Mask Register */
#define CAN_MOAMR23	(*( CAN_MOAMR0_type *) 0xf00192ecu)	/* Message Object 23 Acceptance Mask Register */
#define CAN_MOAMR230	(*( CAN_MOAMR0_type *) 0xf001acccu)	/* Message Object 230 Acceptance Mask Register */
#define CAN_MOAMR231	(*( CAN_MOAMR0_type *) 0xf001acecu)	/* Message Object 231 Acceptance Mask Register */
#define CAN_MOAMR232	(*( CAN_MOAMR0_type *) 0xf001ad0cu)	/* Message Object 232 Acceptance Mask Register */
#define CAN_MOAMR233	(*( CAN_MOAMR0_type *) 0xf001ad2cu)	/* Message Object 233 Acceptance Mask Register */
#define CAN_MOAMR234	(*( CAN_MOAMR0_type *) 0xf001ad4cu)	/* Message Object 234 Acceptance Mask Register */
#define CAN_MOAMR235	(*( CAN_MOAMR0_type *) 0xf001ad6cu)	/* Message Object 235 Acceptance Mask Register */
#define CAN_MOAMR236	(*( CAN_MOAMR0_type *) 0xf001ad8cu)	/* Message Object 236 Acceptance Mask Register */
#define CAN_MOAMR237	(*( CAN_MOAMR0_type *) 0xf001adacu)	/* Message Object 237 Acceptance Mask Register */
#define CAN_MOAMR238	(*( CAN_MOAMR0_type *) 0xf001adccu)	/* Message Object 238 Acceptance Mask Register */
#define CAN_MOAMR239	(*( CAN_MOAMR0_type *) 0xf001adecu)	/* Message Object 239 Acceptance Mask Register */
#define CAN_MOAMR24	(*( CAN_MOAMR0_type *) 0xf001930cu)	/* Message Object 24 Acceptance Mask Register */
#define CAN_MOAMR240	(*( CAN_MOAMR0_type *) 0xf001ae0cu)	/* Message Object 240 Acceptance Mask Register */
#define CAN_MOAMR241	(*( CAN_MOAMR0_type *) 0xf001ae2cu)	/* Message Object 241 Acceptance Mask Register */
#define CAN_MOAMR242	(*( CAN_MOAMR0_type *) 0xf001ae4cu)	/* Message Object 242 Acceptance Mask Register */
#define CAN_MOAMR243	(*( CAN_MOAMR0_type *) 0xf001ae6cu)	/* Message Object 243 Acceptance Mask Register */
#define CAN_MOAMR244	(*( CAN_MOAMR0_type *) 0xf001ae8cu)	/* Message Object 244 Acceptance Mask Register */
#define CAN_MOAMR245	(*( CAN_MOAMR0_type *) 0xf001aeacu)	/* Message Object 245 Acceptance Mask Register */
#define CAN_MOAMR246	(*( CAN_MOAMR0_type *) 0xf001aeccu)	/* Message Object 246 Acceptance Mask Register */
#define CAN_MOAMR247	(*( CAN_MOAMR0_type *) 0xf001aeecu)	/* Message Object 247 Acceptance Mask Register */
#define CAN_MOAMR248	(*( CAN_MOAMR0_type *) 0xf001af0cu)	/* Message Object 248 Acceptance Mask Register */
#define CAN_MOAMR249	(*( CAN_MOAMR0_type *) 0xf001af2cu)	/* Message Object 249 Acceptance Mask Register */
#define CAN_MOAMR25	(*( CAN_MOAMR0_type *) 0xf001932cu)	/* Message Object 25 Acceptance Mask Register */
#define CAN_MOAMR250	(*( CAN_MOAMR0_type *) 0xf001af4cu)	/* Message Object 250 Acceptance Mask Register */
#define CAN_MOAMR251	(*( CAN_MOAMR0_type *) 0xf001af6cu)	/* Message Object 251 Acceptance Mask Register */
#define CAN_MOAMR252	(*( CAN_MOAMR0_type *) 0xf001af8cu)	/* Message Object 252 Acceptance Mask Register */
#define CAN_MOAMR253	(*( CAN_MOAMR0_type *) 0xf001afacu)	/* Message Object 253 Acceptance Mask Register */
#define CAN_MOAMR254	(*( CAN_MOAMR0_type *) 0xf001afccu)	/* Message Object 254 Acceptance Mask Register */
#define CAN_MOAMR255	(*( CAN_MOAMR0_type *) 0xf001afecu)	/* Message Object 255 Acceptance Mask Register */
#define CAN_MOAMR26	(*( CAN_MOAMR0_type *) 0xf001934cu)	/* Message Object 26 Acceptance Mask Register */
#define CAN_MOAMR27	(*( CAN_MOAMR0_type *) 0xf001936cu)	/* Message Object 27 Acceptance Mask Register */
#define CAN_MOAMR28	(*( CAN_MOAMR0_type *) 0xf001938cu)	/* Message Object 28 Acceptance Mask Register */
#define CAN_MOAMR29	(*( CAN_MOAMR0_type *) 0xf00193acu)	/* Message Object 29 Acceptance Mask Register */
