svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOAMR3	(*( CAN_MOAMR0_type *) 0xf001906cu)	/* Message Object 3 Acceptance Mask Register */
#define CAN_MOAMR30	(*( CAN_MOAMR0_type *) 0xf00193ccu)	/* Message Object 30 Acceptance Mask Register */
#define CAN_MOAMR31	(*( CAN_MOAMR0_type *) 0xf00193ecu)	/* Message Object 31 Acceptance Mask Register */
#define CAN_MOAMR32	(*( CAN_MOAMR0_type *) 0xf001940cu)	/* Message Object 32 Acceptance Mask Register */
#define CAN_MOAMR33	(*( CAN_MOAMR0_type *) 0xf001942cu)	/* Message Object 33 Acceptance Mask Register */
#define CAN_MOAMR34	(*( CAN_MOAMR0_type *) 0xf001944cu)	/* Message Object 34 Acceptance Mask Register */
#define CAN_MOAMR35	(*( CAN_MOAMR0_type *) 0xf001946cu)	/* Message Object 35 Acceptance Mask Register */
#define CAN_MOAMR36	(*( CAN_MOAMR0_type *) 0xf001948cu)	/* Message Object 36 Acceptance Mask Register */
#define CAN_MOAMR37	(*( CAN_MOAMR0_type *) 0xf00194acu)	/* Message Object 37 Acceptance Mask Register */
#define CAN_MOAMR38	(*( CAN_MOAMR0_type *) 0xf00194ccu)	/* Message Object 38 Acceptance Mask Register */
#define CAN_MOAMR39	(*( CAN_MOAMR0_type *) 0xf00194ecu)	/* Message Object 39 Acceptance Mask Register */
#define CAN_MOAMR4	(*( CAN_MOAMR0_type *) 0xf001908cu)	/* Message Object 4 Acceptance Mask Register */
#define CAN_MOAMR40	(*( CAN_MOAMR0_type *) 0xf001950cu)	/* Message Object 40 Acceptance Mask Register */
#define CAN_MOAMR41	(*( CAN_MOAMR0_type *) 0xf001952cu)	/* Message Object 41 Acceptance Mask Register */
#define CAN_MOAMR42	(*( CAN_MOAMR0_type *) 0xf001954cu)	/* Message Object 42 Acceptance Mask Register */
#define CAN_MOAMR43	(*( CAN_MOAMR0_type *) 0xf001956cu)	/* Message Object 43 Acceptance Mask Register */
#define CAN_MOAMR44	(*( CAN_MOAMR0_type *) 0xf001958cu)	/* Message Object 44 Acceptance Mask Register */
#define CAN_MOAMR45	(*( CAN_MOAMR0_type *) 0xf00195acu)	/* Message Object 45 Acceptance Mask Register */
#define CAN_MOAMR46	(*( CAN_MOAMR0_type *) 0xf00195ccu)	/* Message Object 46 Acceptance Mask Register */
#define CAN_MOAMR47	(*( CAN_MOAMR0_type *) 0xf00195ecu)	/* Message Object 47 Acceptance Mask Register */
#define CAN_MOAMR48	(*( CAN_MOAMR0_type *) 0xf001960cu)	/* Message Object 48 Acceptance Mask Register */
#define CAN_MOAMR49	(*( CAN_MOAMR0_type *) 0xf001962cu)	/* Message Object 49 Acceptance Mask Register */
#define CAN_MOAMR5	(*( CAN_MOAMR0_type *) 0xf00190acu)	/* Message Object 5 Acceptance Mask Register */
#define CAN_MOAMR50	(*( CAN_MOAMR0_type *) 0xf001964cu)	/* Message Object 50 Acceptance Mask Register */
#define CAN_MOAMR51	(*( CAN_MOAMR0_type *) 0xf001966cu)	/* Message Object 51 Acceptance Mask Register */
#define CAN_MOAMR52	(*( CAN_MOAMR0_type *) 0xf001968cu)	/* Message Object 52 Acceptance Mask Register */
#define CAN_MOAMR53	(*( CAN_MOAMR0_type *) 0xf00196acu)	/* Message Object 53 Acceptance Mask Register */
#define CAN_MOAMR54	(*( CAN_MOAMR0_type *) 0xf00196ccu)	/* Message Object 54 Acceptance Mask Register */
#define CAN_MOAMR55	(*( CAN_MOAMR0_type *) 0xf00196ecu)	/* Message Object 55 Acceptance Mask Register */
#define CAN_MOAMR56	(*( CAN_MOAMR0_type *) 0xf001970cu)	/* Message Object 56 Acceptance Mask Register */
#define CAN_MOAMR57	(*( CAN_MOAMR0_type *) 0xf001972cu)	/* Message Object 57 Acceptance Mask Register */
#define CAN_MOAMR58	(*( CAN_MOAMR0_type *) 0xf001974cu)	/* Message Object 58 Acceptance Mask Register */
#define CAN_MOAMR59	(*( CAN_MOAMR0_type *) 0xf001976cu)	/* Message Object 59 Acceptance Mask Register */
#define CAN_MOAMR6	(*( CAN_MOAMR0_type *) 0xf00190ccu)	/* Message Object 6 Acceptance Mask Register */
#define CAN_MOAMR60	(*( CAN_MOAMR0_type *) 0xf001978cu)	/* Message Object 60 Acceptance Mask Register */
#define CAN_MOAMR61	(*( CAN_MOAMR0_type *) 0xf00197acu)	/* Message Object 61 Acceptance Mask Register */
#define CAN_MOAMR62	(*( CAN_MOAMR0_type *) 0xf00197ccu)	/* Message Object 62 Acceptance Mask Register */
#define CAN_MOAMR63	(*( CAN_MOAMR0_type *) 0xf00197ecu)	/* Message Object 63 Acceptance Mask Register */
#define CAN_MOAMR64	(*( CAN_MOAMR0_type *) 0xf001980cu)	/* Message Object 64 Acceptance Mask Register */
#define CAN_MOAMR65	(*( CAN_MOAMR0_type *) 0xf001982cu)	/* Message Object 65 Acceptance Mask Register */
#define CAN_MOAMR66	(*( CAN_MOAMR0_type *) 0xf001984cu)	/* Message Object 66 Acceptance Mask Register */
#define CAN_MOAMR67	(*( CAN_MOAMR0_type *) 0xf001986cu)	/* Message Object 67 Acceptance Mask Register */
#define CAN_MOAMR68	(*( CAN_MOAMR0_type *) 0xf001988cu)	/* Message Object 68 Acceptance Mask Register */
#define CAN_MOAMR69	(*( CAN_MOAMR0_type *) 0xf00198acu)	/* Message Object 69 Acceptance Mask Register */
#define CAN_MOAMR7	(*( CAN_MOAMR0_type *) 0xf00190ecu)	/* Message Object 7 Acceptance Mask Register */
#define CAN_MOAMR70	(*( CAN_MOAMR0_type *) 0xf00198ccu)	/* Message Object 70 Acceptance Mask Register */
#define CAN_MOAMR71	(*( CAN_MOAMR0_type *) 0xf00198ecu)	/* Message Object 71 Acceptance Mask Register */
#define CAN_MOAMR72	(*( CAN_MOAMR0_type *) 0xf001990cu)	/* Message Object 72 Acceptance Mask Register */
#define CAN_MOAMR73	(*( CAN_MOAMR0_type *) 0xf001992cu)	/* Message Object 73 Acceptance Mask Register */
#define CAN_MOAMR74	(*( CAN_MOAMR0_type *) 0xf001994cu)	/* Message Object 74 Acceptance Mask Register */
#define CAN_MOAMR75	(*( CAN_MOAMR0_type *) 0xf001996cu)	/* Message Object 75 Acceptance Mask Register */
#define CAN_MOAMR76	(*( CAN_MOAMR0_type *) 0xf001998cu)	/* Message Object 76 Acceptance Mask Register */
#define CAN_MOAMR77	(*( CAN_MOAMR0_type *) 0xf00199acu)	/* Message Object 77 Acceptance Mask Register */
#define CAN_MOAMR78	(*( CAN_MOAMR0_type *) 0xf00199ccu)	/* Message Object 78 Acceptance Mask Register */
#define CAN_MOAMR79	(*( CAN_MOAMR0_type *) 0xf00199ecu)	/* Message Object 79 Acceptance Mask Register */
#define CAN_MOAMR8	(*( CAN_MOAMR0_type *) 0xf001910cu)	/* Message Object 8 Acceptance Mask Register */
#define CAN_MOAMR80	(*( CAN_MOAMR0_type *) 0xf0019a0cu)	/* Message Object 80 Acceptance Mask Register */
#define CAN_MOAMR81	(*( CAN_MOAMR0_type *) 0xf0019a2cu)	/* Message Object 81 Acceptance Mask Register */
#define CAN_MOAMR82	(*( CAN_MOAMR0_type *) 0xf0019a4cu)	/* Message Object 82 Acceptance Mask Register */
#define CAN_MOAMR83	(*( CAN_MOAMR0_type *) 0xf0019a6cu)	/* Message Object 83 Acceptance Mask Register */
#define CAN_MOAMR84	(*( CAN_MOAMR0_type *) 0xf0019a8cu)	/* Message Object 84 Acceptance Mask Register */
#define CAN_MOAMR85	(*( CAN_MOAMR0_type *) 0xf0019aacu)	/* Message Object 85 Acceptance Mask Register */
#define CAN_MOAMR86	(*( CAN_MOAMR0_type *) 0xf0019accu)	/* Message Object 86 Acceptance Mask Register */
#define CAN_MOAMR87	(*( CAN_MOAMR0_type *) 0xf0019aecu)	/* Message Object 87 Acceptance Mask Register */
#define CAN_MOAMR88	(*( CAN_MOAMR0_type *) 0xf0019b0cu)	/* Message Object 88 Acceptance Mask Register */
#define CAN_MOAMR89	(*( CAN_MOAMR0_type *) 0xf0019b2cu)	/* Message Object 89 Acceptance Mask Register */
#define CAN_MOAMR9	(*( CAN_MOAMR0_type *) 0xf001912cu)	/* Message Object 9 Acceptance Mask Register */
#define CAN_MOAMR90	(*( CAN_MOAMR0_type *) 0xf0019b4cu)	/* Message Object 90 Acceptance Mask Register */
#define CAN_MOAMR91	(*( CAN_MOAMR0_type *) 0xf0019b6cu)	/* Message Object 91 Acceptance Mask Register */
#define CAN_MOAMR92	(*( CAN_MOAMR0_type *) 0xf0019b8cu)	/* Message Object 92 Acceptance Mask Register */
#define CAN_MOAMR93	(*( CAN_MOAMR0_type *) 0xf0019bacu)	/* Message Object 93 Acceptance Mask Register */
#define CAN_MOAMR94	(*( CAN_MOAMR0_type *) 0xf0019bccu)	/* Message Object 94 Acceptance Mask Register */
#define CAN_MOAMR95	(*( CAN_MOAMR0_type *) 0xf0019becu)	/* Message Object 95 Acceptance Mask Register */
#define CAN_MOAMR96	(*( CAN_MOAMR0_type *) 0xf0019c0cu)	/* Message Object 96 Acceptance Mask Register */
#define CAN_MOAMR97	(*( CAN_MOAMR0_type *) 0xf0019c2cu)	/* Message Object 97 Acceptance Mask Register */
#define CAN_MOAMR98	(*( CAN_MOAMR0_type *) 0xf0019c4cu)	/* Message Object 98 Acceptance Mask Register */
#define CAN_MOAMR99	(*( CAN_MOAMR0_type *) 0xf0019c6cu)	/* Message Object 99 Acceptance Mask Register */

