svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ID             : 29;	/* CAN Identifier of Message Object n */
		unsigned int IDE            : 1;	/* Identifier Extension Bit of Message Object n */
		unsigned int PRI            : 2;	/* Priority Class */
	} B;
	int I;
	unsigned int U;

} CAN_MOAR0_type;
#define CAN_MOAR0	(*( CAN_MOAR0_type *) 0xf0019018u)	/* Message Object 0 Arbitration Register */
#define CAN_MOAR1	(*( CAN_MOAR0_type *) 0xf0019038u)	/* Message Object 1 Arbitration Register */
#define CAN_MOAR10	(*( CAN_MOAR0_type *) 0xf0019158u)	/* Message Object 10 Arbitration Register */
#define CAN_MOAR100	(*( CAN_MOAR0_type *) 0xf0019c98u)	/* Message Object 100 Arbitration Register */
#define CAN_MOAR101	(*( CAN_MOAR0_type *) 0xf0019cb8u)	/* Message Object 101 Arbitration Register */
#define CAN_MOAR102	(*( CAN_MOAR0_type *) 0xf0019cd8u)	/* Message Object 102 Arbitration Register */
#define CAN_MOAR103	(*( CAN_MOAR0_type *) 0xf0019cf8u)	/* Message Object 103 Arbitration Register */
#define CAN_MOAR104	(*( CAN_MOAR0_type *) 0xf0019d18u)	/* Message Object 104 Arbitration Register */
#define CAN_MOAR105	(*( CAN_MOAR0_type *) 0xf0019d38u)	/* Message Object 105 Arbitration Register */
#define CAN_MOAR106	(*( CAN_MOAR0_type *) 0xf0019d58u)	/* Message Object 106 Arbitration Register */
#define CAN_MOAR107	(*( CAN_MOAR0_type *) 0xf0019d78u)	/* Message Object 107 Arbitration Register */
#define CAN_MOAR108	(*( CAN_MOAR0_type *) 0xf0019d98u)	/* Message Object 108 Arbitration Register */
#define CAN_MOAR109	(*( CAN_MOAR0_type *) 0xf0019db8u)	/* Message Object 109 Arbitration Register */
#define CAN_MOAR11	(*( CAN_MOAR0_type *) 0xf0019178u)	/* Message Object 11 Arbitration Register */
#define CAN_MOAR110	(*( CAN_MOAR0_type *) 0xf0019dd8u)	/* Message Object 110 Arbitration Register */
#define CAN_MOAR111	(*( CAN_MOAR0_type *) 0xf0019df8u)	/* Message Object 111 Arbitration Register */
#define CAN_MOAR112	(*( CAN_MOAR0_type *) 0xf0019e18u)	/* Message Object 112 Arbitration Register */
#define CAN_MOAR113	(*( CAN_MOAR0_type *) 0xf0019e38u)	/* Message Object 113 Arbitration Register */
#define CAN_MOAR114	(*( CAN_MOAR0_type *) 0xf0019e58u)	/* Message Object 114 Arbitration Register */
#define CAN_MOAR115	(*( CAN_MOAR0_type *) 0xf0019e78u)	/* Message Object 115 Arbitration Register */
#define CAN_MOAR116	(*( CAN_MOAR0_type *) 0xf0019e98u)	/* Message Object 116 Arbitration Register */
#define CAN_MOAR117	(*( CAN_MOAR0_type *) 0xf0019eb8u)	/* Message Object 117 Arbitration Register */
#define CAN_MOAR118	(*( CAN_MOAR0_type *) 0xf0019ed8u)	/* Message Object 118 Arbitration Register */
#define CAN_MOAR119	(*( CAN_MOAR0_type *) 0xf0019ef8u)	/* Message Object 119 Arbitration Register */
#define CAN_MOAR12	(*( CAN_MOAR0_type *) 0xf0019198u)	/* Message Object 12 Arbitration Register */
#define CAN_MOAR120	(*( CAN_MOAR0_type *) 0xf0019f18u)	/* Message Object 120 Arbitration Register */
#define CAN_MOAR121	(*( CAN_MOAR0_type *) 0xf0019f38u)	/* Message Object 121 Arbitration Register */
#define CAN_MOAR122	(*( CAN_MOAR0_type *) 0xf0019f58u)	/* Message Object 122 Arbitration Register */
#define CAN_MOAR123	(*( CAN_MOAR0_type *) 0xf0019f78u)	/* Message Object 123 Arbitration Register */
#define CAN_MOAR124	(*( CAN_MOAR0_type *) 0xf0019f98u)	/* Message Object 124 Arbitration Register */
#define CAN_MOAR125	(*( CAN_MOAR0_type *) 0xf0019fb8u)	/* Message Object 125 Arbitration Register */
#define CAN_MOAR126	(*( CAN_MOAR0_type *) 0xf0019fd8u)	/* Message Object 126 Arbitration Register */
#define CAN_MOAR127	(*( CAN_MOAR0_type *) 0xf0019ff8u)	/* Message Object 127 Arbitration Register */
#define CAN_MOAR128	(*( CAN_MOAR0_type *) 0xf001a018u)	/* Message Object 128 Arbitration Register */
#define CAN_MOAR129	(*( CAN_MOAR0_type *) 0xf001a038u)	/* Message Object 129 Arbitration Register */
#define CAN_MOAR13	(*( CAN_MOAR0_type *) 0xf00191b8u)	/* Message Object 13 Arbitration Register */
#define CAN_MOAR130	(*( CAN_MOAR0_type *) 0xf001a058u)	/* Message Object 130 Arbitration Register */
#define CAN_MOAR131	(*( CAN_MOAR0_type *) 0xf001a078u)	/* Message Object 131 Arbitration Register */
#define CAN_MOAR132	(*( CAN_MOAR0_type *) 0xf001a098u)	/* Message Object 132 Arbitration Register */
#define CAN_MOAR133	(*( CAN_MOAR0_type *) 0xf001a0b8u)	/* Message Object 133 Arbitration Register */
#define CAN_MOAR134	(*( CAN_MOAR0_type *) 0xf001a0d8u)	/* Message Object 134 Arbitration Register */
#define CAN_MOAR135	(*( CAN_MOAR0_type *) 0xf001a0f8u)	/* Message Object 135 Arbitration Register */
#define CAN_MOAR136	(*( CAN_MOAR0_type *) 0xf001a118u)	/* Message Object 136 Arbitration Register */
#define CAN_MOAR137	(*( CAN_MOAR0_type *) 0xf001a138u)	/* Message Object 137 Arbitration Register */
#define CAN_MOAR138	(*( CAN_MOAR0_type *) 0xf001a158u)	/* Message Object 138 Arbitration Register */
#define CAN_MOAR139	(*( CAN_MOAR0_type *) 0xf001a178u)	/* Message Object 139 Arbitration Register */
#define CAN_MOAR14	(*( CAN_MOAR0_type *) 0xf00191d8u)	/* Message Object 14 Arbitration Register */
#define CAN_MOAR140	(*( CAN_MOAR0_type *) 0xf001a198u)	/* Message Object 140 Arbitration Register */
#define CAN_MOAR141	(*( CAN_MOAR0_type *) 0xf001a1b8u)	/* Message Object 141 Arbitration Register */
#define CAN_MOAR142	(*( CAN_MOAR0_type *) 0xf001a1d8u)	/* Message Object 142 Arbitration Register */
#define CAN_MOAR143	(*( CAN_MOAR0_type *) 0xf001a1f8u)	/* Message Object 143 Arbitration Register */
#define CAN_MOAR144	(*( CAN_MOAR0_type *) 0xf001a218u)	/* Message Object 144 Arbitration Register */
#define CAN_MOAR145	(*( CAN_MOAR0_type *) 0xf001a238u)	/* Message Object 145 Arbitration Register */
#define CAN_MOAR146	(*( CAN_MOAR0_type *) 0xf001a258u)	/* Message Object 146 Arbitration Register */
#define CAN_MOAR147	(*( CAN_MOAR0_type *) 0xf001a278u)	/* Message Object 147 Arbitration Register */
#define CAN_MOAR148	(*( CAN_MOAR0_type *) 0xf001a298u)	/* Message Object 148 Arbitration Register */
#define CAN_MOAR149	(*( CAN_MOAR0_type *) 0xf001a2b8u)	/* Message Object 149 Arbitration Register */
#define CAN_MOAR15	(*( CAN_MOAR0_type *) 0xf00191f8u)	/* Message Object 15 Arbitration Register */
#define CAN_MOAR150	(*( CAN_MOAR0_type *) 0xf001a2d8u)	/* Message Object 150 Arbitration Register */
#define CAN_MOAR151	(*( CAN_MOAR0_type *) 0xf001a2f8u)	/* Message Object 151 Arbitration Register */
#define CAN_MOAR152	(*( CAN_MOAR0_type *) 0xf001a318u)	/* Message Object 152 Arbitration Register */
#define CAN_MOAR153	(*( CAN_MOAR0_type *) 0xf001a338u)	/* Message Object 153 Arbitration Register */
#define CAN_MOAR154	(*( CAN_MOAR0_type *) 0xf001a358u)	/* Message Object 154 Arbitration Register */
#define CAN_MOAR155	(*( CAN_MOAR0_type *) 0xf001a378u)	/* Message Object 155 Arbitration Register */
#define CAN_MOAR156	(*( CAN_MOAR0_type *) 0xf001a398u)	/* Message Object 156 Arbitration Register */
#define CAN_MOAR157	(*( CAN_MOAR0_type *) 0xf001a3b8u)	/* Message Object 157 Arbitration Register */
#define CAN_MOAR158	(*( CAN_MOAR0_type *) 0xf001a3d8u)	/* Message Object 158 Arbitration Register */
#define CAN_MOAR159	(*( CAN_MOAR0_type *) 0xf001a3f8u)	/* Message Object 159 Arbitration Register */
#define CAN_MOAR16	(*( CAN_MOAR0_type *) 0xf0019218u)	/* Message Object 16 Arbitration Register */
#define CAN_MOAR160	(*( CAN_MOAR0_type *) 0xf001a418u)	/* Message Object 160 Arbitration Register */
#define CAN_MOAR161	(*( CAN_MOAR0_type *) 0xf001a438u)	/* Message Object 161 Arbitration Register */
#define CAN_MOAR162	(*( CAN_MOAR0_type *) 0xf001a458u)	/* Message Object 162 Arbitration Register */
#define CAN_MOAR163	(*( CAN_MOAR0_type *) 0xf001a478u)	/* Message Object 163 Arbitration Register */
#define CAN_MOAR164	(*( CAN_MOAR0_type *) 0xf001a498u)	/* Message Object 164 Arbitration Register */
#define CAN_MOAR165	(*( CAN_MOAR0_type *) 0xf001a4b8u)	/* Message Object 165 Arbitration Register */
#define CAN_MOAR166	(*( CAN_MOAR0_type *) 0xf001a4d8u)	/* Message Object 166 Arbitration Register */
#define CAN_MOAR167	(*( CAN_MOAR0_type *) 0xf001a4f8u)	/* Message Object 167 Arbitration Register */
#define CAN_MOAR168	(*( CAN_MOAR0_type *) 0xf001a518u)	/* Message Object 168 Arbitration Register */
#define CAN_MOAR169	(*( CAN_MOAR0_type *) 0xf001a538u)	/* Message Object 169 Arbitration Register */
#define CAN_MOAR17	(*( CAN_MOAR0_type *) 0xf0019238u)	/* Message Object 17 Arbitration Register */
#define CAN_MOAR170	(*( CAN_MOAR0_type *) 0xf001a558u)	/* Message Object 170 Arbitration Register */
#define CAN_MOAR171	(*( CAN_MOAR0_type *) 0xf001a578u)	/* Message Object 171 Arbitration Register */
#define CAN_MOAR172	(*( CAN_MOAR0_type *) 0xf001a598u)	/* Message Object 172 Arbitration Register */
#define CAN_MOAR173	(*( CAN_MOAR0_type *) 0xf001a5b8u)	/* Message Object 173 Arbitration Register */
#define CAN_MOAR174	(*( CAN_MOAR0_type *) 0xf001a5d8u)	/* Message Object 174 Arbitration Register */
#define CAN_MOAR175	(*( CAN_MOAR0_type *) 0xf001a5f8u)	/* Message Object 175 Arbitration Register */
#define CAN_MOAR176	(*( CAN_MOAR0_type *) 0xf001a618u)	/* Message Object 176 Arbitration Register */
#define CAN_MOAR177	(*( CAN_MOAR0_type *) 0xf001a638u)	/* Message Object 177 Arbitration Register */
#define CAN_MOAR178	(*( CAN_MOAR0_type *) 0xf001a658u)	/* Message Object 178 Arbitration Register */
#define CAN_MOAR179	(*( CAN_MOAR0_type *) 0xf001a678u)	/* Message Object 179 Arbitration Register */
#define CAN_MOAR18	(*( CAN_MOAR0_type *) 0xf0019258u)	/* Message Object 18 Arbitration Register */
#define CAN_MOAR180	(*( CAN_MOAR0_type *) 0xf001a698u)	/* Message Object 180 Arbitration Register */
#define CAN_MOAR181	(*( CAN_MOAR0_type *) 0xf001a6b8u)	/* Message Object 181 Arbitration Register */
#define CAN_MOAR182	(*( CAN_MOAR0_type *) 0xf001a6d8u)	/* Message Object 182 Arbitration Register */
#define CAN_MOAR183	(*( CAN_MOAR0_type *) 0xf001a6f8u)	/* Message Object 183 Arbitration Register */
#define CAN_MOAR184	(*( CAN_MOAR0_type *) 0xf001a718u)	/* Message Object 184 Arbitration Register */
#define CAN_MOAR185	(*( CAN_MOAR0_type *) 0xf001a738u)	/* Message Object 185 Arbitration Register */
#define CAN_MOAR186	(*( CAN_MOAR0_type *) 0xf001a758u)	/* Message Object 186 Arbitration Register */
#define CAN_MOAR187	(*( CAN_MOAR0_type *) 0xf001a778u)	/* Message Object 187 Arbitration Register */
#define CAN_MOAR188	(*( CAN_MOAR0_type *) 0xf001a798u)	/* Message Object 188 Arbitration Register */
#define CAN_MOAR189	(*( CAN_MOAR0_type *) 0xf001a7b8u)	/* Message Object 189 Arbitration Register */
#define CAN_MOAR19	(*( CAN_MOAR0_type *) 0xf0019278u)	/* Message Object 19 Arbitration Register */
#define CAN_MOAR190	(*( CAN_MOAR0_type *) 0xf001a7d8u)	/* Message Object 190 Arbitration Register */
#define CAN_MOAR191	(*( CAN_MOAR0_type *) 0xf001a7f8u)	/* Message Object 191 Arbitration Register */
#define CAN_MOAR192	(*( CAN_MOAR0_type *) 0xf001a818u)	/* Message Object 192 Arbitration Register */
#define CAN_MOAR193	(*( CAN_MOAR0_type *) 0xf001a838u)	/* Message Object 193 Arbitration Register */
#define CAN_MOAR194	(*( CAN_MOAR0_type *) 0xf001a858u)	/* Message Object 194 Arbitration Register */
#define CAN_MOAR195	(*( CAN_MOAR0_type *) 0xf001a878u)	/* Message Object 195 Arbitration Register */
#define CAN_MOAR196	(*( CAN_MOAR0_type *) 0xf001a898u)	/* Message Object 196 Arbitration Register */
#define CAN_MOAR197	(*( CAN_MOAR0_type *) 0xf001a8b8u)	/* Message Object 197 Arbitration Register */
#define CAN_MOAR198	(*( CAN_MOAR0_type *) 0xf001a8d8u)	/* Message Object 198 Arbitration Register */
#define CAN_MOAR199	(*( CAN_MOAR0_type *) 0xf001a8f8u)	/* Message Object 199 Arbitration Register */
#define CAN_MOAR2	(*( CAN_MOAR0_type *) 0xf0019058u)	/* Message Object 2 Arbitration Register */
#define CAN_MOAR20	(*( CAN_MOAR0_type *) 0xf0019298u)	/* Message Object 20 Arbitration Register */
#define CAN_MOAR200	(*( CAN_MOAR0_type *) 0xf001a918u)	/* Message Object 200 Arbitration Register */
#define CAN_MOAR201	(*( CAN_MOAR0_type *) 0xf001a938u)	/* Message Object 201 Arbitration Register */
#define CAN_MOAR202	(*( CAN_MOAR0_type *) 0xf001a958u)	/* Message Object 202 Arbitration Register */
#define CAN_MOAR203	(*( CAN_MOAR0_type *) 0xf001a978u)	/* Message Object 203 Arbitration Register */
#define CAN_MOAR204	(*( CAN_MOAR0_type *) 0xf001a998u)	/* Message Object 204 Arbitration Register */
#define CAN_MOAR205	(*( CAN_MOAR0_type *) 0xf001a9b8u)	/* Message Object 205 Arbitration Register */
#define CAN_MOAR206	(*( CAN_MOAR0_type *) 0xf001a9d8u)	/* Message Object 206 Arbitration Register */
#define CAN_MOAR207	(*( CAN_MOAR0_type *) 0xf001a9f8u)	/* Message Object 207 Arbitration Register */
#define CAN_MOAR208	(*( CAN_MOAR0_type *) 0xf001aa18u)	/* Message Object 208 Arbitration Register */
#define CAN_MOAR209	(*( CAN_MOAR0_type *) 0xf001aa38u)	/* Message Object 209 Arbitration Register */
#define CAN_MOAR21	(*( CAN_MOAR0_type *) 0xf00192b8u)	/* Message Object 21 Arbitration Register */
#define CAN_MOAR210	(*( CAN_MOAR0_type *) 0xf001aa58u)	/* Message Object 210 Arbitration Register */
#define CAN_MOAR211	(*( CAN_MOAR0_type *) 0xf001aa78u)	/* Message Object 211 Arbitration Register */
#define CAN_MOAR212	(*( CAN_MOAR0_type *) 0xf001aa98u)	/* Message Object 212 Arbitration Register */
#define CAN_MOAR213	(*( CAN_MOAR0_type *) 0xf001aab8u)	/* Message Object 213 Arbitration Register */
#define CAN_MOAR214	(*( CAN_MOAR0_type *) 0xf001aad8u)	/* Message Object 214 Arbitration Register */
#define CAN_MOAR215	(*( CAN_MOAR0_type *) 0xf001aaf8u)	/* Message Object 215 Arbitration Register */
#define CAN_MOAR216	(*( CAN_MOAR0_type *) 0xf001ab18u)	/* Message Object 216 Arbitration Register */
#define CAN_MOAR217	(*( CAN_MOAR0_type *) 0xf001ab38u)	/* Message Object 217 Arbitration Register */
#define CAN_MOAR218	(*( CAN_MOAR0_type *) 0xf001ab58u)	/* Message Object 218 Arbitration Register */
#define CAN_MOAR219	(*( CAN_MOAR0_type *) 0xf001ab78u)	/* Message Object 219 Arbitration Register */
#define CAN_MOAR22	(*( CAN_MOAR0_type *) 0xf00192d8u)	/* Message Object 22 Arbitration Register */
#define CAN_MOAR220	(*( CAN_MOAR0_type *) 0xf001ab98u)	/* Message Object 220 Arbitration Register */
#define CAN_MOAR221	(*( CAN_MOAR0_type *) 0xf001abb8u)	/* Message Object 221 Arbitration Register */
#define CAN_MOAR222	(*( CAN_MOAR0_type *) 0xf001abd8u)	/* Message Object 222 Arbitration Register */
#define CAN_MOAR223	(*( CAN_MOAR0_type *) 0xf001abf8u)	/* Message Object 223 Arbitration Register */
#define CAN_MOAR224	(*( CAN_MOAR0_type *) 0xf001ac18u)	/* Message Object 224 Arbitration Register */
#define CAN_MOAR225	(*( CAN_MOAR0_type *) 0xf001ac38u)	/* Message Object 225 Arbitration Register */
#define CAN_MOAR226	(*( CAN_MOAR0_type *) 0xf001ac58u)	/* Message Object 226 Arbitration Register */
#define CAN_MOAR227	(*( CAN_MOAR0_type *) 0xf001ac78u)	/* Message Object 227 Arbitration Register */
#define CAN_MOAR228	(*( CAN_MOAR0_type *) 0xf001ac98u)	/* Message Object 228 Arbitration Register */
#define CAN_MOAR229	(*( CAN_MOAR0_type *) 0xf001acb8u)	/* Message Object 229 Arbitration Register */
#define CAN_MOAR23	(*( CAN_MOAR0_type *) 0xf00192f8u)	/* Message Object 23 Arbitration Register */
#define CAN_MOAR230	(*( CAN_MOAR0_type *) 0xf001acd8u)	/* Message Object 230 Arbitration Register */
#define CAN_MOAR231	(*( CAN_MOAR0_type *) 0xf001acf8u)	/* Message Object 231 Arbitration Register */
#define CAN_MOAR232	(*( CAN_MOAR0_type *) 0xf001ad18u)	/* Message Object 232 Arbitration Register */
#define CAN_MOAR233	(*( CAN_MOAR0_type *) 0xf001ad38u)	/* Message Object 233 Arbitration Register */
#define CAN_MOAR234	(*( CAN_MOAR0_type *) 0xf001ad58u)	/* Message Object 234 Arbitration Register */
#define CAN_MOAR235	(*( CAN_MOAR0_type *) 0xf001ad78u)	/* Message Object 235 Arbitration Register */
#define CAN_MOAR236	(*( CAN_MOAR0_type *) 0xf001ad98u)	/* Message Object 236 Arbitration Register */
#define CAN_MOAR237	(*( CAN_MOAR0_type *) 0xf001adb8u)	/* Message Object 237 Arbitration Register */
#define CAN_MOAR238	(*( CAN_MOAR0_type *) 0xf001add8u)	/* Message Object 238 Arbitration Register */
#define CAN_MOAR239	(*( CAN_MOAR0_type *) 0xf001adf8u)	/* Message Object 239 Arbitration Register */
#define CAN_MOAR24	(*( CAN_MOAR0_type *) 0xf0019318u)	/* Message Object 24 Arbitration Register */
#define CAN_MOAR240	(*( CAN_MOAR0_type *) 0xf001ae18u)	/* Message Object 240 Arbitration Register */
#define CAN_MOAR241	(*( CAN_MOAR0_type *) 0xf001ae38u)	/* Message Object 241 Arbitration Register */
#define CAN_MOAR242	(*( CAN_MOAR0_type *) 0xf001ae58u)	/* Message Object 242 Arbitration Register */
#define CAN_MOAR243	(*( CAN_MOAR0_type *) 0xf001ae78u)	/* Message Object 243 Arbitration Register */
#define CAN_MOAR244	(*( CAN_MOAR0_type *) 0xf001ae98u)	/* Message Object 244 Arbitration Register */
#define CAN_MOAR245	(*( CAN_MOAR0_type *) 0xf001aeb8u)	/* Message Object 245 Arbitration Register */
#define CAN_MOAR246	(*( CAN_MOAR0_type *) 0xf001aed8u)	/* Message Object 246 Arbitration Register */
#define CAN_MOAR247	(*( CAN_MOAR0_type *) 0xf001aef8u)	/* Message Object 247 Arbitration Register */
#define CAN_MOAR248	(*( CAN_MOAR0_type *) 0xf001af18u)	/* Message Object 248 Arbitration Register */
#define CAN_MOAR249	(*( CAN_MOAR0_type *) 0xf001af38u)	/* Message Object 249 Arbitration Register */
#define CAN_MOAR25	(*( CAN_MOAR0_type *) 0xf0019338u)	/* Message Object 25 Arbitration Register */
#define CAN_MOAR250	(*( CAN_MOAR0_type *) 0xf001af58u)	/* Message Object 250 Arbitration Register */
#define CAN_MOAR251	(*( CAN_MOAR0_type *) 0xf001af78u)	/* Message Object 251 Arbitration Register */
#define CAN_MOAR252	(*( CAN_MOAR0_type *) 0xf001af98u)	/* Message Object 252 Arbitration Register */
#define CAN_MOAR253	(*( CAN_MOAR0_type *) 0xf001afb8u)	/* Message Object 253 Arbitration Register */
#define CAN_MOAR254	(*( CAN_MOAR0_type *) 0xf001afd8u)	/* Message Object 254 Arbitration Register */
#define CAN_MOAR255	(*( CAN_MOAR0_type *) 0xf001aff8u)	/* Message Object 255 Arbitration Register */
#define CAN_MOAR26	(*( CAN_MOAR0_type *) 0xf0019358u)	/* Message Object 26 Arbitration Register */
#define CAN_MOAR27	(*( CAN_MOAR0_type *) 0xf0019378u)	/* Message Object 27 Arbitration Register */
#define CAN_MOAR28	(*( CAN_MOAR0_type *) 0xf0019398u)	/* Message Object 28 Arbitration Register */
#define CAN_MOAR29	(*( CAN_MOAR0_type *) 0xf00193b8u)	/* Message Object 29 Arbitration Register */
#define CAN_MOAR3	(*( CAN_MOAR0_type *) 0xf0019078u)	/* Message Object 3 Arbitration Register */
#define CAN_MOAR30	(*( CAN_MOAR0_type *) 0xf00193d8u)	/* Message Object 30 Arbitration Register */
#define CAN_MOAR31	(*( CAN_MOAR0_type *) 0xf00193f8u)	/* Message Object 31 Arbitration Register */
#define CAN_MOAR32	(*( CAN_MOAR0_type *) 0xf0019418u)	/* Message Object 32 Arbitration Register */
#define CAN_MOAR33	(*( CAN_MOAR0_type *) 0xf0019438u)	/* Message Object 33 Arbitration Register */
#define CAN_MOAR34	(*( CAN_MOAR0_type *) 0xf0019458u)	/* Message Object 34 Arbitration Register */
#define CAN_MOAR35	(*( CAN_MOAR0_type *) 0xf0019478u)	/* Message Object 35 Arbitration Register */
#define CAN_MOAR36	(*( CAN_MOAR0_type *) 0xf0019498u)	/* Message Object 36 Arbitration Register */
#define CAN_MOAR37	(*( CAN_MOAR0_type *) 0xf00194b8u)	/* Message Object 37 Arbitration Register */
#define CAN_MOAR38	(*( CAN_MOAR0_type *) 0xf00194d8u)	/* Message Object 38 Arbitration Register */
#define CAN_MOAR39	(*( CAN_MOAR0_type *) 0xf00194f8u)	/* Message Object 39 Arbitration Register */
#define CAN_MOAR4	(*( CAN_MOAR0_type *) 0xf0019098u)	/* Message Object 4 Arbitration Register */
#define CAN_MOAR40	(*( CAN_MOAR0_type *) 0xf0019518u)	/* Message Object 40 Arbitration Register */
#define CAN_MOAR41	(*( CAN_MOAR0_type *) 0xf0019538u)	/* Message Object 41 Arbitration Register */
#define CAN_MOAR42	(*( CAN_MOAR0_type *) 0xf0019558u)	/* Message Object 42 Arbitration Register */
#define CAN_MOAR43	(*( CAN_MOAR0_type *) 0xf0019578u)	/* Message Object 43 Arbitration Register */
#define CAN_MOAR44	(*( CAN_MOAR0_type *) 0xf0019598u)	/* Message Object 44 Arbitration Register */
#define CAN_MOAR45	(*( CAN_MOAR0_type *) 0xf00195b8u)	/* Message Object 45 Arbitration Register */
#define CAN_MOAR46	(*( CAN_MOAR0_type *) 0xf00195d8u)	/* Message Object 46 Arbitration Register */
#define CAN_MOAR47	(*( CAN_MOAR0_type *) 0xf00195f8u)	/* Message Object 47 Arbitration Register */
#define CAN_MOAR48	(*( CAN_MOAR0_type *) 0xf0019618u)	/* Message Object 48 Arbitration Register */
#define CAN_MOAR49	(*( CAN_MOAR0_type *) 0xf0019638u)	/* Message Object 49 Arbitration Register */
#define CAN_MOAR5	(*( CAN_MOAR0_type *) 0xf00190b8u)	/* Message Object 5 Arbitration Register */
#define CAN_MOAR50	(*( CAN_MOAR0_type *) 0xf0019658u)	/* Message Object 50 Arbitration Register */
#define CAN_MOAR51	(*( CAN_MOAR0_type *) 0xf0019678u)	/* Message Object 51 Arbitration Register */
#define CAN_MOAR52	(*( CAN_MOAR0_type *) 0xf0019698u)	/* Message Object 52 Arbitration Register */
#define CAN_MOAR53	(*( CAN_MOAR0_type *) 0xf00196b8u)	/* Message Object 53 Arbitration Register */
#define CAN_MOAR54	(*( CAN_MOAR0_type *) 0xf00196d8u)	/* Message Object 54 Arbitration Register */
#define CAN_MOAR55	(*( CAN_MOAR0_type *) 0xf00196f8u)	/* Message Object 55 Arbitration Register */
#define CAN_MOAR56	(*( CAN_MOAR0_type *) 0xf0019718u)	/* Message Object 56 Arbitration Register */
#define CAN_MOAR57	(*( CAN_MOAR0_type *) 0xf0019738u)	/* Message Object 57 Arbitration Register */
#define CAN_MOAR58	(*( CAN_MOAR0_type *) 0xf0019758u)	/* Message Object 58 Arbitration Register */
#define CAN_MOAR59	(*( CAN_MOAR0_type *) 0xf0019778u)	/* Message Object 59 Arbitration Register */
#define CAN_MOAR6	(*( CAN_MOAR0_type *) 0xf00190d8u)	/* Message Object 6 Arbitration Register */
#define CAN_MOAR60	(*( CAN_MOAR0_type *) 0xf0019798u)	/* Message Object 60 Arbitration Register */
#define CAN_MOAR61	(*( CAN_MOAR0_type *) 0xf00197b8u)	/* Message Object 61 Arbitration Register */
#define CAN_MOAR62	(*( CAN_MOAR0_type *) 0xf00197d8u)	/* Message Object 62 Arbitration Register */
#define CAN_MOAR63	(*( CAN_MOAR0_type *) 0xf00197f8u)	/* Message Object 63 Arbitration Register */
#define CAN_MOAR64	(*( CAN_MOAR0_type *) 0xf0019818u)	/* Message Object 64 Arbitration Register */
#define CAN_MOAR65	(*( CAN_MOAR0_type *) 0xf0019838u)	/* Message Object 65 Arbitration Register */
#define CAN_MOAR66	(*( CAN_MOAR0_type *) 0xf0019858u)	/* Message Object 66 Arbitration Register */
#define CAN_MOAR67	(*( CAN_MOAR0_type *) 0xf0019878u)	/* Message Object 67 Arbitration Register */
#define CAN_MOAR68	(*( CAN_MOAR0_type *) 0xf0019898u)	/* Message Object 68 Arbitration Register */
#define CAN_MOAR69	(*( CAN_MOAR0_type *) 0xf00198b8u)	/* Message Object 69 Arbitration Register */
#define CAN_MOAR7	(*( CAN_MOAR0_type *) 0xf00190f8u)	/* Message Object 7 Arbitration Register */
#define CAN_MOAR70	(*( CAN_MOAR0_type *) 0xf00198d8u)	/* Message Object 70 Arbitration Register */
#define CAN_MOAR71	(*( CAN_MOAR0_type *) 0xf00198f8u)	/* Message Object 71 Arbitration Register */
#define CAN_MOAR72	(*( CAN_MOAR0_type *) 0xf0019918u)	/* Message Object 72 Arbitration Register */
#define CAN_MOAR73	(*( CAN_MOAR0_type *) 0xf0019938u)	/* Message Object 73 Arbitration Register */
#define CAN_MOAR74	(*( CAN_MOAR0_type *) 0xf0019958u)	/* Message Object 74 Arbitration Register */
#define CAN_MOAR75	(*( CAN_MOAR0_type *) 0xf0019978u)	/* Message Object 75 Arbitration Register */
#define CAN_MOAR76	(*( CAN_MOAR0_type *) 0xf0019998u)	/* Message Object 76 Arbitration Register */
#define CAN_MOAR77	(*( CAN_MOAR0_type *) 0xf00199b8u)	/* Message Object 77 Arbitration Register */
#define CAN_MOAR78	(*( CAN_MOAR0_type *) 0xf00199d8u)	/* Message Object 78 Arbitration Register */
