svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOAR79	(*( CAN_MOAR0_type *) 0xf00199f8u)	/* Message Object 79 Arbitration Register */
#define CAN_MOAR8	(*( CAN_MOAR0_type *) 0xf0019118u)	/* Message Object 8 Arbitration Register */
#define CAN_MOAR80	(*( CAN_MOAR0_type *) 0xf0019a18u)	/* Message Object 80 Arbitration Register */
#define CAN_MOAR81	(*( CAN_MOAR0_type *) 0xf0019a38u)	/* Message Object 81 Arbitration Register */
#define CAN_MOAR82	(*( CAN_MOAR0_type *) 0xf0019a58u)	/* Message Object 82 Arbitration Register */
#define CAN_MOAR83	(*( CAN_MOAR0_type *) 0xf0019a78u)	/* Message Object 83 Arbitration Register */
#define CAN_MOAR84	(*( CAN_MOAR0_type *) 0xf0019a98u)	/* Message Object 84 Arbitration Register */
#define CAN_MOAR85	(*( CAN_MOAR0_type *) 0xf0019ab8u)	/* Message Object 85 Arbitration Register */
#define CAN_MOAR86	(*( CAN_MOAR0_type *) 0xf0019ad8u)	/* Message Object 86 Arbitration Register */
#define CAN_MOAR87	(*( CAN_MOAR0_type *) 0xf0019af8u)	/* Message Object 87 Arbitration Register */
#define CAN_MOAR88	(*( CAN_MOAR0_type *) 0xf0019b18u)	/* Message Object 88 Arbitration Register */
#define CAN_MOAR89	(*( CAN_MOAR0_type *) 0xf0019b38u)	/* Message Object 89 Arbitration Register */
#define CAN_MOAR9	(*( CAN_MOAR0_type *) 0xf0019138u)	/* Message Object 9 Arbitration Register */
#define CAN_MOAR90	(*( CAN_MOAR0_type *) 0xf0019b58u)	/* Message Object 90 Arbitration Register */
#define CAN_MOAR91	(*( CAN_MOAR0_type *) 0xf0019b78u)	/* Message Object 91 Arbitration Register */
#define CAN_MOAR92	(*( CAN_MOAR0_type *) 0xf0019b98u)	/* Message Object 92 Arbitration Register */
#define CAN_MOAR93	(*( CAN_MOAR0_type *) 0xf0019bb8u)	/* Message Object 93 Arbitration Register */
#define CAN_MOAR94	(*( CAN_MOAR0_type *) 0xf0019bd8u)	/* Message Object 94 Arbitration Register */
#define CAN_MOAR95	(*( CAN_MOAR0_type *) 0xf0019bf8u)	/* Message Object 95 Arbitration Register */
#define CAN_MOAR96	(*( CAN_MOAR0_type *) 0xf0019c18u)	/* Message Object 96 Arbitration Register */
#define CAN_MOAR97	(*( CAN_MOAR0_type *) 0xf0019c38u)	/* Message Object 97 Arbitration Register */
#define CAN_MOAR98	(*( CAN_MOAR0_type *) 0xf0019c58u)	/* Message Object 98 Arbitration Register */
#define CAN_MOAR99	(*( CAN_MOAR0_type *) 0xf0019c78u)	/* Message Object 99 Arbitration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RESRXPND       : 1;	/* Reset/Set Receive Pending */
		unsigned int RESTXPND       : 1;	/* Reset/Set Transmit Pending */
		unsigned int RESRXUPD       : 1;	/* Reset/Set Receive Updating */
		unsigned int RESNEWDAT      : 1;	/* Reset/Set New Data */
		unsigned int RESMSGLST      : 1;	/* Reset/Set Message Lost */
		unsigned int RESMSGVAL      : 1;	/* Reset/Set Message Valid */
		unsigned int RESRTSEL       : 1;	/* Reset/Set Receive/Transmit Selected */
		unsigned int RESRXEN        : 1;	/* Reset/Set Receive Enable */
		unsigned int RESTXRQ        : 1;	/* Reset/Set Transmit Request */
		unsigned int RESTXEN0       : 1;	/* Reset/Set Transmit Enable 0 */
		unsigned int RESTXEN1       : 1;	/* Reset/Set Transmit Enable 1 */
		unsigned int RESDIR         : 1;	/* Reset/Set Message Direction */
		unsigned int                : 4;
		unsigned int SETRXPND       : 1;	/* Reset/Set Receive Pending */
		unsigned int SETTXPND       : 1;	/* Reset/Set Transmit Pending */
		unsigned int SETRXUPD       : 1;	/* Reset/Set Receive Updating */
		unsigned int SETNEWDAT      : 1;	/* Reset/Set New Data */
		unsigned int SETMSGLST      : 1;	/* Reset/Set Message Lost */
		unsigned int SETMSGVAL      : 1;	/* Reset/Set Message Valid */
		unsigned int SETRTSEL       : 1;	/* Reset/Set Receive/Transmit Selected */
		unsigned int SETRXEN        : 1;	/* Reset/Set Receive Enable */
		unsigned int SETTXRQ        : 1;	/* Reset/Set Transmit Request */
		unsigned int SETTXEN0       : 1;	/* Reset/Set Transmit Enable 0 */
		unsigned int SETTXEN1       : 1;	/* Reset/Set Transmit Enable 1 */
		unsigned int SETDIR         : 1;	/* Reset/Set Message Direction */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} CAN_MOCTR0_type;
#define CAN_MOCTR0	(*( CAN_MOCTR0_type *) 0xf001901cu)	/* Message Object 0 Control Register */
#define CAN_MOCTR1	(*( CAN_MOCTR0_type *) 0xf001903cu)	/* Message Object 1 Control Register */
#define CAN_MOCTR10	(*( CAN_MOCTR0_type *) 0xf001915cu)	/* Message Object 10 Control Register */
#define CAN_MOCTR100	(*( CAN_MOCTR0_type *) 0xf0019c9cu)	/* Message Object 100 Control Register */
#define CAN_MOCTR101	(*( CAN_MOCTR0_type *) 0xf0019cbcu)	/* Message Object 101 Control Register */
#define CAN_MOCTR102	(*( CAN_MOCTR0_type *) 0xf0019cdcu)	/* Message Object 102 Control Register */
#define CAN_MOCTR103	(*( CAN_MOCTR0_type *) 0xf0019cfcu)	/* Message Object 103 Control Register */
#define CAN_MOCTR104	(*( CAN_MOCTR0_type *) 0xf0019d1cu)	/* Message Object 104 Control Register */
#define CAN_MOCTR105	(*( CAN_MOCTR0_type *) 0xf0019d3cu)	/* Message Object 105 Control Register */
#define CAN_MOCTR106	(*( CAN_MOCTR0_type *) 0xf0019d5cu)	/* Message Object 106 Control Register */
#define CAN_MOCTR107	(*( CAN_MOCTR0_type *) 0xf0019d7cu)	/* Message Object 107 Control Register */
#define CAN_MOCTR108	(*( CAN_MOCTR0_type *) 0xf0019d9cu)	/* Message Object 108 Control Register */
#define CAN_MOCTR109	(*( CAN_MOCTR0_type *) 0xf0019dbcu)	/* Message Object 109 Control Register */
#define CAN_MOCTR11	(*( CAN_MOCTR0_type *) 0xf001917cu)	/* Message Object 11 Control Register */
#define CAN_MOCTR110	(*( CAN_MOCTR0_type *) 0xf0019ddcu)	/* Message Object 110 Control Register */
#define CAN_MOCTR111	(*( CAN_MOCTR0_type *) 0xf0019dfcu)	/* Message Object 111 Control Register */
#define CAN_MOCTR112	(*( CAN_MOCTR0_type *) 0xf0019e1cu)	/* Message Object 112 Control Register */
#define CAN_MOCTR113	(*( CAN_MOCTR0_type *) 0xf0019e3cu)	/* Message Object 113 Control Register */
#define CAN_MOCTR114	(*( CAN_MOCTR0_type *) 0xf0019e5cu)	/* Message Object 114 Control Register */
#define CAN_MOCTR115	(*( CAN_MOCTR0_type *) 0xf0019e7cu)	/* Message Object 115 Control Register */
#define CAN_MOCTR116	(*( CAN_MOCTR0_type *) 0xf0019e9cu)	/* Message Object 116 Control Register */
#define CAN_MOCTR117	(*( CAN_MOCTR0_type *) 0xf0019ebcu)	/* Message Object 117 Control Register */
#define CAN_MOCTR118	(*( CAN_MOCTR0_type *) 0xf0019edcu)	/* Message Object 118 Control Register */
#define CAN_MOCTR119	(*( CAN_MOCTR0_type *) 0xf0019efcu)	/* Message Object 119 Control Register */
#define CAN_MOCTR12	(*( CAN_MOCTR0_type *) 0xf001919cu)	/* Message Object 12 Control Register */
#define CAN_MOCTR120	(*( CAN_MOCTR0_type *) 0xf0019f1cu)	/* Message Object 120 Control Register */
#define CAN_MOCTR121	(*( CAN_MOCTR0_type *) 0xf0019f3cu)	/* Message Object 121 Control Register */
#define CAN_MOCTR122	(*( CAN_MOCTR0_type *) 0xf0019f5cu)	/* Message Object 122 Control Register */
#define CAN_MOCTR123	(*( CAN_MOCTR0_type *) 0xf0019f7cu)	/* Message Object 123 Control Register */
#define CAN_MOCTR124	(*( CAN_MOCTR0_type *) 0xf0019f9cu)	/* Message Object 124 Control Register */
#define CAN_MOCTR125	(*( CAN_MOCTR0_type *) 0xf0019fbcu)	/* Message Object 125 Control Register */
#define CAN_MOCTR126	(*( CAN_MOCTR0_type *) 0xf0019fdcu)	/* Message Object 126 Control Register */
#define CAN_MOCTR127	(*( CAN_MOCTR0_type *) 0xf0019ffcu)	/* Message Object 127 Control Register */
#define CAN_MOCTR128	(*( CAN_MOCTR0_type *) 0xf001a01cu)	/* Message Object 128 Control Register */
#define CAN_MOCTR129	(*( CAN_MOCTR0_type *) 0xf001a03cu)	/* Message Object 129 Control Register */
#define CAN_MOCTR13	(*( CAN_MOCTR0_type *) 0xf00191bcu)	/* Message Object 13 Control Register */
#define CAN_MOCTR130	(*( CAN_MOCTR0_type *) 0xf001a05cu)	/* Message Object 130 Control Register */
#define CAN_MOCTR131	(*( CAN_MOCTR0_type *) 0xf001a07cu)	/* Message Object 131 Control Register */
#define CAN_MOCTR132	(*( CAN_MOCTR0_type *) 0xf001a09cu)	/* Message Object 132 Control Register */
#define CAN_MOCTR133	(*( CAN_MOCTR0_type *) 0xf001a0bcu)	/* Message Object 133 Control Register */
#define CAN_MOCTR134	(*( CAN_MOCTR0_type *) 0xf001a0dcu)	/* Message Object 134 Control Register */
#define CAN_MOCTR135	(*( CAN_MOCTR0_type *) 0xf001a0fcu)	/* Message Object 135 Control Register */
#define CAN_MOCTR136	(*( CAN_MOCTR0_type *) 0xf001a11cu)	/* Message Object 136 Control Register */
#define CAN_MOCTR137	(*( CAN_MOCTR0_type *) 0xf001a13cu)	/* Message Object 137 Control Register */
#define CAN_MOCTR138	(*( CAN_MOCTR0_type *) 0xf001a15cu)	/* Message Object 138 Control Register */
#define CAN_MOCTR139	(*( CAN_MOCTR0_type *) 0xf001a17cu)	/* Message Object 139 Control Register */
#define CAN_MOCTR14	(*( CAN_MOCTR0_type *) 0xf00191dcu)	/* Message Object 14 Control Register */
#define CAN_MOCTR140	(*( CAN_MOCTR0_type *) 0xf001a19cu)	/* Message Object 140 Control Register */
#define CAN_MOCTR141	(*( CAN_MOCTR0_type *) 0xf001a1bcu)	/* Message Object 141 Control Register */
#define CAN_MOCTR142	(*( CAN_MOCTR0_type *) 0xf001a1dcu)	/* Message Object 142 Control Register */
#define CAN_MOCTR143	(*( CAN_MOCTR0_type *) 0xf001a1fcu)	/* Message Object 143 Control Register */
#define CAN_MOCTR144	(*( CAN_MOCTR0_type *) 0xf001a21cu)	/* Message Object 144 Control Register */
#define CAN_MOCTR145	(*( CAN_MOCTR0_type *) 0xf001a23cu)	/* Message Object 145 Control Register */
#define CAN_MOCTR146	(*( CAN_MOCTR0_type *) 0xf001a25cu)	/* Message Object 146 Control Register */
#define CAN_MOCTR147	(*( CAN_MOCTR0_type *) 0xf001a27cu)	/* Message Object 147 Control Register */
#define CAN_MOCTR148	(*( CAN_MOCTR0_type *) 0xf001a29cu)	/* Message Object 148 Control Register */
#define CAN_MOCTR149	(*( CAN_MOCTR0_type *) 0xf001a2bcu)	/* Message Object 149 Control Register */
#define CAN_MOCTR15	(*( CAN_MOCTR0_type *) 0xf00191fcu)	/* Message Object 15 Control Register */
#define CAN_MOCTR150	(*( CAN_MOCTR0_type *) 0xf001a2dcu)	/* Message Object 150 Control Register */
#define CAN_MOCTR151	(*( CAN_MOCTR0_type *) 0xf001a2fcu)	/* Message Object 151 Control Register */
#define CAN_MOCTR152	(*( CAN_MOCTR0_type *) 0xf001a31cu)	/* Message Object 152 Control Register */
#define CAN_MOCTR153	(*( CAN_MOCTR0_type *) 0xf001a33cu)	/* Message Object 153 Control Register */
#define CAN_MOCTR154	(*( CAN_MOCTR0_type *) 0xf001a35cu)	/* Message Object 154 Control Register */
#define CAN_MOCTR155	(*( CAN_MOCTR0_type *) 0xf001a37cu)	/* Message Object 155 Control Register */
#define CAN_MOCTR156	(*( CAN_MOCTR0_type *) 0xf001a39cu)	/* Message Object 156 Control Register */
#define CAN_MOCTR157	(*( CAN_MOCTR0_type *) 0xf001a3bcu)	/* Message Object 157 Control Register */
#define CAN_MOCTR158	(*( CAN_MOCTR0_type *) 0xf001a3dcu)	/* Message Object 158 Control Register */
#define CAN_MOCTR159	(*( CAN_MOCTR0_type *) 0xf001a3fcu)	/* Message Object 159 Control Register */
#define CAN_MOCTR16	(*( CAN_MOCTR0_type *) 0xf001921cu)	/* Message Object 16 Control Register */
#define CAN_MOCTR160	(*( CAN_MOCTR0_type *) 0xf001a41cu)	/* Message Object 160 Control Register */
#define CAN_MOCTR161	(*( CAN_MOCTR0_type *) 0xf001a43cu)	/* Message Object 161 Control Register */
#define CAN_MOCTR162	(*( CAN_MOCTR0_type *) 0xf001a45cu)	/* Message Object 162 Control Register */
#define CAN_MOCTR163	(*( CAN_MOCTR0_type *) 0xf001a47cu)	/* Message Object 163 Control Register */
#define CAN_MOCTR164	(*( CAN_MOCTR0_type *) 0xf001a49cu)	/* Message Object 164 Control Register */
#define CAN_MOCTR165	(*( CAN_MOCTR0_type *) 0xf001a4bcu)	/* Message Object 165 Control Register */
#define CAN_MOCTR166	(*( CAN_MOCTR0_type *) 0xf001a4dcu)	/* Message Object 166 Control Register */
#define CAN_MOCTR167	(*( CAN_MOCTR0_type *) 0xf001a4fcu)	/* Message Object 167 Control Register */
#define CAN_MOCTR168	(*( CAN_MOCTR0_type *) 0xf001a51cu)	/* Message Object 168 Control Register */
#define CAN_MOCTR169	(*( CAN_MOCTR0_type *) 0xf001a53cu)	/* Message Object 169 Control Register */
#define CAN_MOCTR17	(*( CAN_MOCTR0_type *) 0xf001923cu)	/* Message Object 17 Control Register */
#define CAN_MOCTR170	(*( CAN_MOCTR0_type *) 0xf001a55cu)	/* Message Object 170 Control Register */
#define CAN_MOCTR171	(*( CAN_MOCTR0_type *) 0xf001a57cu)	/* Message Object 171 Control Register */
#define CAN_MOCTR172	(*( CAN_MOCTR0_type *) 0xf001a59cu)	/* Message Object 172 Control Register */
#define CAN_MOCTR173	(*( CAN_MOCTR0_type *) 0xf001a5bcu)	/* Message Object 173 Control Register */
#define CAN_MOCTR174	(*( CAN_MOCTR0_type *) 0xf001a5dcu)	/* Message Object 174 Control Register */
#define CAN_MOCTR175	(*( CAN_MOCTR0_type *) 0xf001a5fcu)	/* Message Object 175 Control Register */
#define CAN_MOCTR176	(*( CAN_MOCTR0_type *) 0xf001a61cu)	/* Message Object 176 Control Register */
#define CAN_MOCTR177	(*( CAN_MOCTR0_type *) 0xf001a63cu)	/* Message Object 177 Control Register */
#define CAN_MOCTR178	(*( CAN_MOCTR0_type *) 0xf001a65cu)	/* Message Object 178 Control Register */
#define CAN_MOCTR179	(*( CAN_MOCTR0_type *) 0xf001a67cu)	/* Message Object 179 Control Register */
#define CAN_MOCTR18	(*( CAN_MOCTR0_type *) 0xf001925cu)	/* Message Object 18 Control Register */
#define CAN_MOCTR180	(*( CAN_MOCTR0_type *) 0xf001a69cu)	/* Message Object 180 Control Register */
#define CAN_MOCTR181	(*( CAN_MOCTR0_type *) 0xf001a6bcu)	/* Message Object 181 Control Register */
#define CAN_MOCTR182	(*( CAN_MOCTR0_type *) 0xf001a6dcu)	/* Message Object 182 Control Register */
#define CAN_MOCTR183	(*( CAN_MOCTR0_type *) 0xf001a6fcu)	/* Message Object 183 Control Register */
#define CAN_MOCTR184	(*( CAN_MOCTR0_type *) 0xf001a71cu)	/* Message Object 184 Control Register */
#define CAN_MOCTR185	(*( CAN_MOCTR0_type *) 0xf001a73cu)	/* Message Object 185 Control Register */
#define CAN_MOCTR186	(*( CAN_MOCTR0_type *) 0xf001a75cu)	/* Message Object 186 Control Register */
#define CAN_MOCTR187	(*( CAN_MOCTR0_type *) 0xf001a77cu)	/* Message Object 187 Control Register */
#define CAN_MOCTR188	(*( CAN_MOCTR0_type *) 0xf001a79cu)	/* Message Object 188 Control Register */
#define CAN_MOCTR189	(*( CAN_MOCTR0_type *) 0xf001a7bcu)	/* Message Object 189 Control Register */
#define CAN_MOCTR19	(*( CAN_MOCTR0_type *) 0xf001927cu)	/* Message Object 19 Control Register */
#define CAN_MOCTR190	(*( CAN_MOCTR0_type *) 0xf001a7dcu)	/* Message Object 190 Control Register */
#define CAN_MOCTR191	(*( CAN_MOCTR0_type *) 0xf001a7fcu)	/* Message Object 191 Control Register */
#define CAN_MOCTR192	(*( CAN_MOCTR0_type *) 0xf001a81cu)	/* Message Object 192 Control Register */
#define CAN_MOCTR193	(*( CAN_MOCTR0_type *) 0xf001a83cu)	/* Message Object 193 Control Register */
#define CAN_MOCTR194	(*( CAN_MOCTR0_type *) 0xf001a85cu)	/* Message Object 194 Control Register */
#define CAN_MOCTR195	(*( CAN_MOCTR0_type *) 0xf001a87cu)	/* Message Object 195 Control Register */
#define CAN_MOCTR196	(*( CAN_MOCTR0_type *) 0xf001a89cu)	/* Message Object 196 Control Register */
#define CAN_MOCTR197	(*( CAN_MOCTR0_type *) 0xf001a8bcu)	/* Message Object 197 Control Register */
#define CAN_MOCTR198	(*( CAN_MOCTR0_type *) 0xf001a8dcu)	/* Message Object 198 Control Register */
#define CAN_MOCTR199	(*( CAN_MOCTR0_type *) 0xf001a8fcu)	/* Message Object 199 Control Register */
#define CAN_MOCTR2	(*( CAN_MOCTR0_type *) 0xf001905cu)	/* Message Object 2 Control Register */
#define CAN_MOCTR20	(*( CAN_MOCTR0_type *) 0xf001929cu)	/* Message Object 20 Control Register */
#define CAN_MOCTR200	(*( CAN_MOCTR0_type *) 0xf001a91cu)	/* Message Object 200 Control Register */
#define CAN_MOCTR201	(*( CAN_MOCTR0_type *) 0xf001a93cu)	/* Message Object 201 Control Register */
#define CAN_MOCTR202	(*( CAN_MOCTR0_type *) 0xf001a95cu)	/* Message Object 202 Control Register */
#define CAN_MOCTR203	(*( CAN_MOCTR0_type *) 0xf001a97cu)	/* Message Object 203 Control Register */
#define CAN_MOCTR204	(*( CAN_MOCTR0_type *) 0xf001a99cu)	/* Message Object 204 Control Register */
#define CAN_MOCTR205	(*( CAN_MOCTR0_type *) 0xf001a9bcu)	/* Message Object 205 Control Register */
#define CAN_MOCTR206	(*( CAN_MOCTR0_type *) 0xf001a9dcu)	/* Message Object 206 Control Register */
#define CAN_MOCTR207	(*( CAN_MOCTR0_type *) 0xf001a9fcu)	/* Message Object 207 Control Register */
#define CAN_MOCTR208	(*( CAN_MOCTR0_type *) 0xf001aa1cu)	/* Message Object 208 Control Register */
#define CAN_MOCTR209	(*( CAN_MOCTR0_type *) 0xf001aa3cu)	/* Message Object 209 Control Register */
#define CAN_MOCTR21	(*( CAN_MOCTR0_type *) 0xf00192bcu)	/* Message Object 21 Control Register */
#define CAN_MOCTR210	(*( CAN_MOCTR0_type *) 0xf001aa5cu)	/* Message Object 210 Control Register */
#define CAN_MOCTR211	(*( CAN_MOCTR0_type *) 0xf001aa7cu)	/* Message Object 211 Control Register */
#define CAN_MOCTR212	(*( CAN_MOCTR0_type *) 0xf001aa9cu)	/* Message Object 212 Control Register */
#define CAN_MOCTR213	(*( CAN_MOCTR0_type *) 0xf001aabcu)	/* Message Object 213 Control Register */
#define CAN_MOCTR214	(*( CAN_MOCTR0_type *) 0xf001aadcu)	/* Message Object 214 Control Register */
#define CAN_MOCTR215	(*( CAN_MOCTR0_type *) 0xf001aafcu)	/* Message Object 215 Control Register */
#define CAN_MOCTR216	(*( CAN_MOCTR0_type *) 0xf001ab1cu)	/* Message Object 216 Control Register */
#define CAN_MOCTR217	(*( CAN_MOCTR0_type *) 0xf001ab3cu)	/* Message Object 217 Control Register */
#define CAN_MOCTR218	(*( CAN_MOCTR0_type *) 0xf001ab5cu)	/* Message Object 218 Control Register */
#define CAN_MOCTR219	(*( CAN_MOCTR0_type *) 0xf001ab7cu)	/* Message Object 219 Control Register */
#define CAN_MOCTR22	(*( CAN_MOCTR0_type *) 0xf00192dcu)	/* Message Object 22 Control Register */
#define CAN_MOCTR220	(*( CAN_MOCTR0_type *) 0xf001ab9cu)	/* Message Object 220 Control Register */
#define CAN_MOCTR221	(*( CAN_MOCTR0_type *) 0xf001abbcu)	/* Message Object 221 Control Register */
#define CAN_MOCTR222	(*( CAN_MOCTR0_type *) 0xf001abdcu)	/* Message Object 222 Control Register */
#define CAN_MOCTR223	(*( CAN_MOCTR0_type *) 0xf001abfcu)	/* Message Object 223 Control Register */
#define CAN_MOCTR224	(*( CAN_MOCTR0_type *) 0xf001ac1cu)	/* Message Object 224 Control Register */
#define CAN_MOCTR225	(*( CAN_MOCTR0_type *) 0xf001ac3cu)	/* Message Object 225 Control Register */
#define CAN_MOCTR226	(*( CAN_MOCTR0_type *) 0xf001ac5cu)	/* Message Object 226 Control Register */
#define CAN_MOCTR227	(*( CAN_MOCTR0_type *) 0xf001ac7cu)	/* Message Object 227 Control Register */
#define CAN_MOCTR228	(*( CAN_MOCTR0_type *) 0xf001ac9cu)	/* Message Object 228 Control Register */
#define CAN_MOCTR229	(*( CAN_MOCTR0_type *) 0xf001acbcu)	/* Message Object 229 Control Register */
#define CAN_MOCTR23	(*( CAN_MOCTR0_type *) 0xf00192fcu)	/* Message Object 23 Control Register */
#define CAN_MOCTR230	(*( CAN_MOCTR0_type *) 0xf001acdcu)	/* Message Object 230 Control Register */
#define CAN_MOCTR231	(*( CAN_MOCTR0_type *) 0xf001acfcu)	/* Message Object 231 Control Register */
#define CAN_MOCTR232	(*( CAN_MOCTR0_type *) 0xf001ad1cu)	/* Message Object 232 Control Register */
#define CAN_MOCTR233	(*( CAN_MOCTR0_type *) 0xf001ad3cu)	/* Message Object 233 Control Register */
#define CAN_MOCTR234	(*( CAN_MOCTR0_type *) 0xf001ad5cu)	/* Message Object 234 Control Register */
#define CAN_MOCTR235	(*( CAN_MOCTR0_type *) 0xf001ad7cu)	/* Message Object 235 Control Register */
#define CAN_MOCTR236	(*( CAN_MOCTR0_type *) 0xf001ad9cu)	/* Message Object 236 Control Register */
#define CAN_MOCTR237	(*( CAN_MOCTR0_type *) 0xf001adbcu)	/* Message Object 237 Control Register */
#define CAN_MOCTR238	(*( CAN_MOCTR0_type *) 0xf001addcu)	/* Message Object 238 Control Register */
#define CAN_MOCTR239	(*( CAN_MOCTR0_type *) 0xf001adfcu)	/* Message Object 239 Control Register */
#define CAN_MOCTR24	(*( CAN_MOCTR0_type *) 0xf001931cu)	/* Message Object 24 Control Register */
#define CAN_MOCTR240	(*( CAN_MOCTR0_type *) 0xf001ae1cu)	/* Message Object 240 Control Register */
#define CAN_MOCTR241	(*( CAN_MOCTR0_type *) 0xf001ae3cu)	/* Message Object 241 Control Register */
#define CAN_MOCTR242	(*( CAN_MOCTR0_type *) 0xf001ae5cu)	/* Message Object 242 Control Register */
#define CAN_MOCTR243	(*( CAN_MOCTR0_type *) 0xf001ae7cu)	/* Message Object 243 Control Register */
#define CAN_MOCTR244	(*( CAN_MOCTR0_type *) 0xf001ae9cu)	/* Message Object 244 Control Register */
#define CAN_MOCTR245	(*( CAN_MOCTR0_type *) 0xf001aebcu)	/* Message Object 245 Control Register */
#define CAN_MOCTR246	(*( CAN_MOCTR0_type *) 0xf001aedcu)	/* Message Object 246 Control Register */
#define CAN_MOCTR247	(*( CAN_MOCTR0_type *) 0xf001aefcu)	/* Message Object 247 Control Register */
#define CAN_MOCTR248	(*( CAN_MOCTR0_type *) 0xf001af1cu)	/* Message Object 248 Control Register */
#define CAN_MOCTR249	(*( CAN_MOCTR0_type *) 0xf001af3cu)	/* Message Object 249 Control Register */
#define CAN_MOCTR25	(*( CAN_MOCTR0_type *) 0xf001933cu)	/* Message Object 25 Control Register */
#define CAN_MOCTR250	(*( CAN_MOCTR0_type *) 0xf001af5cu)	/* Message Object 250 Control Register */
#define CAN_MOCTR251	(*( CAN_MOCTR0_type *) 0xf001af7cu)	/* Message Object 251 Control Register */
#define CAN_MOCTR252	(*( CAN_MOCTR0_type *) 0xf001af9cu)	/* Message Object 252 Control Register */
#define CAN_MOCTR253	(*( CAN_MOCTR0_type *) 0xf001afbcu)	/* Message Object 253 Control Register */
#define CAN_MOCTR254	(*( CAN_MOCTR0_type *) 0xf001afdcu)	/* Message Object 254 Control Register */
#define CAN_MOCTR255	(*( CAN_MOCTR0_type *) 0xf001affcu)	/* Message Object 255 Control Register */
#define CAN_MOCTR26	(*( CAN_MOCTR0_type *) 0xf001935cu)	/* Message Object 26 Control Register */
#define CAN_MOCTR27	(*( CAN_MOCTR0_type *) 0xf001937cu)	/* Message Object 27 Control Register */
#define CAN_MOCTR28	(*( CAN_MOCTR0_type *) 0xf001939cu)	/* Message Object 28 Control Register */
#define CAN_MOCTR29	(*( CAN_MOCTR0_type *) 0xf00193bcu)	/* Message Object 29 Control Register */
#define CAN_MOCTR3	(*( CAN_MOCTR0_type *) 0xf001907cu)	/* Message Object 3 Control Register */
#define CAN_MOCTR30	(*( CAN_MOCTR0_type *) 0xf00193dcu)	/* Message Object 30 Control Register */
#define CAN_MOCTR31	(*( CAN_MOCTR0_type *) 0xf00193fcu)	/* Message Object 31 Control Register */
#define CAN_MOCTR32	(*( CAN_MOCTR0_type *) 0xf001941cu)	/* Message Object 32 Control Register */
#define CAN_MOCTR33	(*( CAN_MOCTR0_type *) 0xf001943cu)	/* Message Object 33 Control Register */
#define CAN_MOCTR34	(*( CAN_MOCTR0_type *) 0xf001945cu)	/* Message Object 34 Control Register */
#define CAN_MOCTR35	(*( CAN_MOCTR0_type *) 0xf001947cu)	/* Message Object 35 Control Register */
#define CAN_MOCTR36	(*( CAN_MOCTR0_type *) 0xf001949cu)	/* Message Object 36 Control Register */
#define CAN_MOCTR37	(*( CAN_MOCTR0_type *) 0xf00194bcu)	/* Message Object 37 Control Register */
#define CAN_MOCTR38	(*( CAN_MOCTR0_type *) 0xf00194dcu)	/* Message Object 38 Control Register */
#define CAN_MOCTR39	(*( CAN_MOCTR0_type *) 0xf00194fcu)	/* Message Object 39 Control Register */
#define CAN_MOCTR4	(*( CAN_MOCTR0_type *) 0xf001909cu)	/* Message Object 4 Control Register */
#define CAN_MOCTR40	(*( CAN_MOCTR0_type *) 0xf001951cu)	/* Message Object 40 Control Register */
#define CAN_MOCTR41	(*( CAN_MOCTR0_type *) 0xf001953cu)	/* Message Object 41 Control Register */
#define CAN_MOCTR42	(*( CAN_MOCTR0_type *) 0xf001955cu)	/* Message Object 42 Control Register */
#define CAN_MOCTR43	(*( CAN_MOCTR0_type *) 0xf001957cu)	/* Message Object 43 Control Register */
#define CAN_MOCTR44	(*( CAN_MOCTR0_type *) 0xf001959cu)	/* Message Object 44 Control Register */
#define CAN_MOCTR45	(*( CAN_MOCTR0_type *) 0xf00195bcu)	/* Message Object 45 Control Register */
#define CAN_MOCTR46	(*( CAN_MOCTR0_type *) 0xf00195dcu)	/* Message Object 46 Control Register */
#define CAN_MOCTR47	(*( CAN_MOCTR0_type *) 0xf00195fcu)	/* Message Object 47 Control Register */
