svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOCTR48	(*( CAN_MOCTR0_type *) 0xf001961cu)	/* Message Object 48 Control Register */
#define CAN_MOCTR49	(*( CAN_MOCTR0_type *) 0xf001963cu)	/* Message Object 49 Control Register */
#define CAN_MOCTR5	(*( CAN_MOCTR0_type *) 0xf00190bcu)	/* Message Object 5 Control Register */
#define CAN_MOCTR50	(*( CAN_MOCTR0_type *) 0xf001965cu)	/* Message Object 50 Control Register */
#define CAN_MOCTR51	(*( CAN_MOCTR0_type *) 0xf001967cu)	/* Message Object 51 Control Register */
#define CAN_MOCTR52	(*( CAN_MOCTR0_type *) 0xf001969cu)	/* Message Object 52 Control Register */
#define CAN_MOCTR53	(*( CAN_MOCTR0_type *) 0xf00196bcu)	/* Message Object 53 Control Register */
#define CAN_MOCTR54	(*( CAN_MOCTR0_type *) 0xf00196dcu)	/* Message Object 54 Control Register */
#define CAN_MOCTR55	(*( CAN_MOCTR0_type *) 0xf00196fcu)	/* Message Object 55 Control Register */
#define CAN_MOCTR56	(*( CAN_MOCTR0_type *) 0xf001971cu)	/* Message Object 56 Control Register */
#define CAN_MOCTR57	(*( CAN_MOCTR0_type *) 0xf001973cu)	/* Message Object 57 Control Register */
#define CAN_MOCTR58	(*( CAN_MOCTR0_type *) 0xf001975cu)	/* Message Object 58 Control Register */
#define CAN_MOCTR59	(*( CAN_MOCTR0_type *) 0xf001977cu)	/* Message Object 59 Control Register */
#define CAN_MOCTR6	(*( CAN_MOCTR0_type *) 0xf00190dcu)	/* Message Object 6 Control Register */
#define CAN_MOCTR60	(*( CAN_MOCTR0_type *) 0xf001979cu)	/* Message Object 60 Control Register */
#define CAN_MOCTR61	(*( CAN_MOCTR0_type *) 0xf00197bcu)	/* Message Object 61 Control Register */
#define CAN_MOCTR62	(*( CAN_MOCTR0_type *) 0xf00197dcu)	/* Message Object 62 Control Register */
#define CAN_MOCTR63	(*( CAN_MOCTR0_type *) 0xf00197fcu)	/* Message Object 63 Control Register */
#define CAN_MOCTR64	(*( CAN_MOCTR0_type *) 0xf001981cu)	/* Message Object 64 Control Register */
#define CAN_MOCTR65	(*( CAN_MOCTR0_type *) 0xf001983cu)	/* Message Object 65 Control Register */
#define CAN_MOCTR66	(*( CAN_MOCTR0_type *) 0xf001985cu)	/* Message Object 66 Control Register */
#define CAN_MOCTR67	(*( CAN_MOCTR0_type *) 0xf001987cu)	/* Message Object 67 Control Register */
#define CAN_MOCTR68	(*( CAN_MOCTR0_type *) 0xf001989cu)	/* Message Object 68 Control Register */
#define CAN_MOCTR69	(*( CAN_MOCTR0_type *) 0xf00198bcu)	/* Message Object 69 Control Register */
#define CAN_MOCTR7	(*( CAN_MOCTR0_type *) 0xf00190fcu)	/* Message Object 7 Control Register */
#define CAN_MOCTR70	(*( CAN_MOCTR0_type *) 0xf00198dcu)	/* Message Object 70 Control Register */
#define CAN_MOCTR71	(*( CAN_MOCTR0_type *) 0xf00198fcu)	/* Message Object 71 Control Register */
#define CAN_MOCTR72	(*( CAN_MOCTR0_type *) 0xf001991cu)	/* Message Object 72 Control Register */
#define CAN_MOCTR73	(*( CAN_MOCTR0_type *) 0xf001993cu)	/* Message Object 73 Control Register */
#define CAN_MOCTR74	(*( CAN_MOCTR0_type *) 0xf001995cu)	/* Message Object 74 Control Register */
#define CAN_MOCTR75	(*( CAN_MOCTR0_type *) 0xf001997cu)	/* Message Object 75 Control Register */
#define CAN_MOCTR76	(*( CAN_MOCTR0_type *) 0xf001999cu)	/* Message Object 76 Control Register */
#define CAN_MOCTR77	(*( CAN_MOCTR0_type *) 0xf00199bcu)	/* Message Object 77 Control Register */
#define CAN_MOCTR78	(*( CAN_MOCTR0_type *) 0xf00199dcu)	/* Message Object 78 Control Register */
#define CAN_MOCTR79	(*( CAN_MOCTR0_type *) 0xf00199fcu)	/* Message Object 79 Control Register */
#define CAN_MOCTR8	(*( CAN_MOCTR0_type *) 0xf001911cu)	/* Message Object 8 Control Register */
#define CAN_MOCTR80	(*( CAN_MOCTR0_type *) 0xf0019a1cu)	/* Message Object 80 Control Register */
#define CAN_MOCTR81	(*( CAN_MOCTR0_type *) 0xf0019a3cu)	/* Message Object 81 Control Register */
#define CAN_MOCTR82	(*( CAN_MOCTR0_type *) 0xf0019a5cu)	/* Message Object 82 Control Register */
#define CAN_MOCTR83	(*( CAN_MOCTR0_type *) 0xf0019a7cu)	/* Message Object 83 Control Register */
#define CAN_MOCTR84	(*( CAN_MOCTR0_type *) 0xf0019a9cu)	/* Message Object 84 Control Register */
#define CAN_MOCTR85	(*( CAN_MOCTR0_type *) 0xf0019abcu)	/* Message Object 85 Control Register */
#define CAN_MOCTR86	(*( CAN_MOCTR0_type *) 0xf0019adcu)	/* Message Object 86 Control Register */
#define CAN_MOCTR87	(*( CAN_MOCTR0_type *) 0xf0019afcu)	/* Message Object 87 Control Register */
#define CAN_MOCTR88	(*( CAN_MOCTR0_type *) 0xf0019b1cu)	/* Message Object 88 Control Register */
#define CAN_MOCTR89	(*( CAN_MOCTR0_type *) 0xf0019b3cu)	/* Message Object 89 Control Register */
#define CAN_MOCTR9	(*( CAN_MOCTR0_type *) 0xf001913cu)	/* Message Object 9 Control Register */
#define CAN_MOCTR90	(*( CAN_MOCTR0_type *) 0xf0019b5cu)	/* Message Object 90 Control Register */
#define CAN_MOCTR91	(*( CAN_MOCTR0_type *) 0xf0019b7cu)	/* Message Object 91 Control Register */
#define CAN_MOCTR92	(*( CAN_MOCTR0_type *) 0xf0019b9cu)	/* Message Object 92 Control Register */
#define CAN_MOCTR93	(*( CAN_MOCTR0_type *) 0xf0019bbcu)	/* Message Object 93 Control Register */
#define CAN_MOCTR94	(*( CAN_MOCTR0_type *) 0xf0019bdcu)	/* Message Object 94 Control Register */
#define CAN_MOCTR95	(*( CAN_MOCTR0_type *) 0xf0019bfcu)	/* Message Object 95 Control Register */
#define CAN_MOCTR96	(*( CAN_MOCTR0_type *) 0xf0019c1cu)	/* Message Object 96 Control Register */
#define CAN_MOCTR97	(*( CAN_MOCTR0_type *) 0xf0019c3cu)	/* Message Object 97 Control Register */
#define CAN_MOCTR98	(*( CAN_MOCTR0_type *) 0xf0019c5cu)	/* Message Object 98 Control Register */
#define CAN_MOCTR99	(*( CAN_MOCTR0_type *) 0xf0019c7cu)	/* Message Object 99 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DB4            : 8;	/* Data Byte 4 of Message Object n */
		unsigned int DB5            : 8;	/* Data Byte 5 of Message Object n */
		unsigned int DB6            : 8;	/* Data Byte 6 of Message Object n */
		unsigned int DB7            : 8;	/* Data Byte 7 of Message Object n */
	} B;
	int I;
	unsigned int U;

} CAN_MODATAH0_type;
#define CAN_MODATAH0	(*( CAN_MODATAH0_type *) 0xf0019014u)	/* Message Object 0 Data Register High */
#define CAN_MODATAH1	(*( CAN_MODATAH0_type *) 0xf0019034u)	/* Message Object 1 Data Register High */
#define CAN_MODATAH10	(*( CAN_MODATAH0_type *) 0xf0019154u)	/* Message Object 10 Data Register High */
#define CAN_MODATAH100	(*( CAN_MODATAH0_type *) 0xf0019c94u)	/* Message Object 100 Data Register High */
#define CAN_MODATAH101	(*( CAN_MODATAH0_type *) 0xf0019cb4u)	/* Message Object 101 Data Register High */
#define CAN_MODATAH102	(*( CAN_MODATAH0_type *) 0xf0019cd4u)	/* Message Object 102 Data Register High */
#define CAN_MODATAH103	(*( CAN_MODATAH0_type *) 0xf0019cf4u)	/* Message Object 103 Data Register High */
#define CAN_MODATAH104	(*( CAN_MODATAH0_type *) 0xf0019d14u)	/* Message Object 104 Data Register High */
#define CAN_MODATAH105	(*( CAN_MODATAH0_type *) 0xf0019d34u)	/* Message Object 105 Data Register High */
#define CAN_MODATAH106	(*( CAN_MODATAH0_type *) 0xf0019d54u)	/* Message Object 106 Data Register High */
#define CAN_MODATAH107	(*( CAN_MODATAH0_type *) 0xf0019d74u)	/* Message Object 107 Data Register High */
#define CAN_MODATAH108	(*( CAN_MODATAH0_type *) 0xf0019d94u)	/* Message Object 108 Data Register High */
#define CAN_MODATAH109	(*( CAN_MODATAH0_type *) 0xf0019db4u)	/* Message Object 109 Data Register High */
#define CAN_MODATAH11	(*( CAN_MODATAH0_type *) 0xf0019174u)	/* Message Object 11 Data Register High */
#define CAN_MODATAH110	(*( CAN_MODATAH0_type *) 0xf0019dd4u)	/* Message Object 110 Data Register High */
#define CAN_MODATAH111	(*( CAN_MODATAH0_type *) 0xf0019df4u)	/* Message Object 111 Data Register High */
#define CAN_MODATAH112	(*( CAN_MODATAH0_type *) 0xf0019e14u)	/* Message Object 112 Data Register High */
#define CAN_MODATAH113	(*( CAN_MODATAH0_type *) 0xf0019e34u)	/* Message Object 113 Data Register High */
#define CAN_MODATAH114	(*( CAN_MODATAH0_type *) 0xf0019e54u)	/* Message Object 114 Data Register High */
#define CAN_MODATAH115	(*( CAN_MODATAH0_type *) 0xf0019e74u)	/* Message Object 115 Data Register High */
#define CAN_MODATAH116	(*( CAN_MODATAH0_type *) 0xf0019e94u)	/* Message Object 116 Data Register High */
#define CAN_MODATAH117	(*( CAN_MODATAH0_type *) 0xf0019eb4u)	/* Message Object 117 Data Register High */
#define CAN_MODATAH118	(*( CAN_MODATAH0_type *) 0xf0019ed4u)	/* Message Object 118 Data Register High */
#define CAN_MODATAH119	(*( CAN_MODATAH0_type *) 0xf0019ef4u)	/* Message Object 119 Data Register High */
#define CAN_MODATAH12	(*( CAN_MODATAH0_type *) 0xf0019194u)	/* Message Object 12 Data Register High */
#define CAN_MODATAH120	(*( CAN_MODATAH0_type *) 0xf0019f14u)	/* Message Object 120 Data Register High */
#define CAN_MODATAH121	(*( CAN_MODATAH0_type *) 0xf0019f34u)	/* Message Object 121 Data Register High */
#define CAN_MODATAH122	(*( CAN_MODATAH0_type *) 0xf0019f54u)	/* Message Object 122 Data Register High */
#define CAN_MODATAH123	(*( CAN_MODATAH0_type *) 0xf0019f74u)	/* Message Object 123 Data Register High */
#define CAN_MODATAH124	(*( CAN_MODATAH0_type *) 0xf0019f94u)	/* Message Object 124 Data Register High */
#define CAN_MODATAH125	(*( CAN_MODATAH0_type *) 0xf0019fb4u)	/* Message Object 125 Data Register High */
#define CAN_MODATAH126	(*( CAN_MODATAH0_type *) 0xf0019fd4u)	/* Message Object 126 Data Register High */
#define CAN_MODATAH127	(*( CAN_MODATAH0_type *) 0xf0019ff4u)	/* Message Object 127 Data Register High */
#define CAN_MODATAH128	(*( CAN_MODATAH0_type *) 0xf001a014u)	/* Message Object 128 Data Register High */
#define CAN_MODATAH129	(*( CAN_MODATAH0_type *) 0xf001a034u)	/* Message Object 129 Data Register High */
#define CAN_MODATAH13	(*( CAN_MODATAH0_type *) 0xf00191b4u)	/* Message Object 13 Data Register High */
#define CAN_MODATAH130	(*( CAN_MODATAH0_type *) 0xf001a054u)	/* Message Object 130 Data Register High */
#define CAN_MODATAH131	(*( CAN_MODATAH0_type *) 0xf001a074u)	/* Message Object 131 Data Register High */
#define CAN_MODATAH132	(*( CAN_MODATAH0_type *) 0xf001a094u)	/* Message Object 132 Data Register High */
#define CAN_MODATAH133	(*( CAN_MODATAH0_type *) 0xf001a0b4u)	/* Message Object 133 Data Register High */
#define CAN_MODATAH134	(*( CAN_MODATAH0_type *) 0xf001a0d4u)	/* Message Object 134 Data Register High */
#define CAN_MODATAH135	(*( CAN_MODATAH0_type *) 0xf001a0f4u)	/* Message Object 135 Data Register High */
#define CAN_MODATAH136	(*( CAN_MODATAH0_type *) 0xf001a114u)	/* Message Object 136 Data Register High */
#define CAN_MODATAH137	(*( CAN_MODATAH0_type *) 0xf001a134u)	/* Message Object 137 Data Register High */
#define CAN_MODATAH138	(*( CAN_MODATAH0_type *) 0xf001a154u)	/* Message Object 138 Data Register High */
#define CAN_MODATAH139	(*( CAN_MODATAH0_type *) 0xf001a174u)	/* Message Object 139 Data Register High */
#define CAN_MODATAH14	(*( CAN_MODATAH0_type *) 0xf00191d4u)	/* Message Object 14 Data Register High */
#define CAN_MODATAH140	(*( CAN_MODATAH0_type *) 0xf001a194u)	/* Message Object 140 Data Register High */
#define CAN_MODATAH141	(*( CAN_MODATAH0_type *) 0xf001a1b4u)	/* Message Object 141 Data Register High */
#define CAN_MODATAH142	(*( CAN_MODATAH0_type *) 0xf001a1d4u)	/* Message Object 142 Data Register High */
#define CAN_MODATAH143	(*( CAN_MODATAH0_type *) 0xf001a1f4u)	/* Message Object 143 Data Register High */
#define CAN_MODATAH144	(*( CAN_MODATAH0_type *) 0xf001a214u)	/* Message Object 144 Data Register High */
#define CAN_MODATAH145	(*( CAN_MODATAH0_type *) 0xf001a234u)	/* Message Object 145 Data Register High */
#define CAN_MODATAH146	(*( CAN_MODATAH0_type *) 0xf001a254u)	/* Message Object 146 Data Register High */
#define CAN_MODATAH147	(*( CAN_MODATAH0_type *) 0xf001a274u)	/* Message Object 147 Data Register High */
#define CAN_MODATAH148	(*( CAN_MODATAH0_type *) 0xf001a294u)	/* Message Object 148 Data Register High */
#define CAN_MODATAH149	(*( CAN_MODATAH0_type *) 0xf001a2b4u)	/* Message Object 149 Data Register High */
#define CAN_MODATAH15	(*( CAN_MODATAH0_type *) 0xf00191f4u)	/* Message Object 15 Data Register High */
#define CAN_MODATAH150	(*( CAN_MODATAH0_type *) 0xf001a2d4u)	/* Message Object 150 Data Register High */
#define CAN_MODATAH151	(*( CAN_MODATAH0_type *) 0xf001a2f4u)	/* Message Object 151 Data Register High */
#define CAN_MODATAH152	(*( CAN_MODATAH0_type *) 0xf001a314u)	/* Message Object 152 Data Register High */
#define CAN_MODATAH153	(*( CAN_MODATAH0_type *) 0xf001a334u)	/* Message Object 153 Data Register High */
#define CAN_MODATAH154	(*( CAN_MODATAH0_type *) 0xf001a354u)	/* Message Object 154 Data Register High */
#define CAN_MODATAH155	(*( CAN_MODATAH0_type *) 0xf001a374u)	/* Message Object 155 Data Register High */
#define CAN_MODATAH156	(*( CAN_MODATAH0_type *) 0xf001a394u)	/* Message Object 156 Data Register High */
#define CAN_MODATAH157	(*( CAN_MODATAH0_type *) 0xf001a3b4u)	/* Message Object 157 Data Register High */
#define CAN_MODATAH158	(*( CAN_MODATAH0_type *) 0xf001a3d4u)	/* Message Object 158 Data Register High */
#define CAN_MODATAH159	(*( CAN_MODATAH0_type *) 0xf001a3f4u)	/* Message Object 159 Data Register High */
#define CAN_MODATAH16	(*( CAN_MODATAH0_type *) 0xf0019214u)	/* Message Object 16 Data Register High */
#define CAN_MODATAH160	(*( CAN_MODATAH0_type *) 0xf001a414u)	/* Message Object 160 Data Register High */
#define CAN_MODATAH161	(*( CAN_MODATAH0_type *) 0xf001a434u)	/* Message Object 161 Data Register High */
#define CAN_MODATAH162	(*( CAN_MODATAH0_type *) 0xf001a454u)	/* Message Object 162 Data Register High */
#define CAN_MODATAH163	(*( CAN_MODATAH0_type *) 0xf001a474u)	/* Message Object 163 Data Register High */
#define CAN_MODATAH164	(*( CAN_MODATAH0_type *) 0xf001a494u)	/* Message Object 164 Data Register High */
#define CAN_MODATAH165	(*( CAN_MODATAH0_type *) 0xf001a4b4u)	/* Message Object 165 Data Register High */
#define CAN_MODATAH166	(*( CAN_MODATAH0_type *) 0xf001a4d4u)	/* Message Object 166 Data Register High */
#define CAN_MODATAH167	(*( CAN_MODATAH0_type *) 0xf001a4f4u)	/* Message Object 167 Data Register High */
#define CAN_MODATAH168	(*( CAN_MODATAH0_type *) 0xf001a514u)	/* Message Object 168 Data Register High */
#define CAN_MODATAH169	(*( CAN_MODATAH0_type *) 0xf001a534u)	/* Message Object 169 Data Register High */
#define CAN_MODATAH17	(*( CAN_MODATAH0_type *) 0xf0019234u)	/* Message Object 17 Data Register High */
#define CAN_MODATAH170	(*( CAN_MODATAH0_type *) 0xf001a554u)	/* Message Object 170 Data Register High */
#define CAN_MODATAH171	(*( CAN_MODATAH0_type *) 0xf001a574u)	/* Message Object 171 Data Register High */
#define CAN_MODATAH172	(*( CAN_MODATAH0_type *) 0xf001a594u)	/* Message Object 172 Data Register High */
#define CAN_MODATAH173	(*( CAN_MODATAH0_type *) 0xf001a5b4u)	/* Message Object 173 Data Register High */
#define CAN_MODATAH174	(*( CAN_MODATAH0_type *) 0xf001a5d4u)	/* Message Object 174 Data Register High */
#define CAN_MODATAH175	(*( CAN_MODATAH0_type *) 0xf001a5f4u)	/* Message Object 175 Data Register High */
#define CAN_MODATAH176	(*( CAN_MODATAH0_type *) 0xf001a614u)	/* Message Object 176 Data Register High */
#define CAN_MODATAH177	(*( CAN_MODATAH0_type *) 0xf001a634u)	/* Message Object 177 Data Register High */
#define CAN_MODATAH178	(*( CAN_MODATAH0_type *) 0xf001a654u)	/* Message Object 178 Data Register High */
#define CAN_MODATAH179	(*( CAN_MODATAH0_type *) 0xf001a674u)	/* Message Object 179 Data Register High */
#define CAN_MODATAH18	(*( CAN_MODATAH0_type *) 0xf0019254u)	/* Message Object 18 Data Register High */
#define CAN_MODATAH180	(*( CAN_MODATAH0_type *) 0xf001a694u)	/* Message Object 180 Data Register High */
#define CAN_MODATAH181	(*( CAN_MODATAH0_type *) 0xf001a6b4u)	/* Message Object 181 Data Register High */
#define CAN_MODATAH182	(*( CAN_MODATAH0_type *) 0xf001a6d4u)	/* Message Object 182 Data Register High */
#define CAN_MODATAH183	(*( CAN_MODATAH0_type *) 0xf001a6f4u)	/* Message Object 183 Data Register High */
#define CAN_MODATAH184	(*( CAN_MODATAH0_type *) 0xf001a714u)	/* Message Object 184 Data Register High */
#define CAN_MODATAH185	(*( CAN_MODATAH0_type *) 0xf001a734u)	/* Message Object 185 Data Register High */
#define CAN_MODATAH186	(*( CAN_MODATAH0_type *) 0xf001a754u)	/* Message Object 186 Data Register High */
#define CAN_MODATAH187	(*( CAN_MODATAH0_type *) 0xf001a774u)	/* Message Object 187 Data Register High */
#define CAN_MODATAH188	(*( CAN_MODATAH0_type *) 0xf001a794u)	/* Message Object 188 Data Register High */
#define CAN_MODATAH189	(*( CAN_MODATAH0_type *) 0xf001a7b4u)	/* Message Object 189 Data Register High */
#define CAN_MODATAH19	(*( CAN_MODATAH0_type *) 0xf0019274u)	/* Message Object 19 Data Register High */
#define CAN_MODATAH190	(*( CAN_MODATAH0_type *) 0xf001a7d4u)	/* Message Object 190 Data Register High */
#define CAN_MODATAH191	(*( CAN_MODATAH0_type *) 0xf001a7f4u)	/* Message Object 191 Data Register High */
#define CAN_MODATAH192	(*( CAN_MODATAH0_type *) 0xf001a814u)	/* Message Object 192 Data Register High */
#define CAN_MODATAH193	(*( CAN_MODATAH0_type *) 0xf001a834u)	/* Message Object 193 Data Register High */
#define CAN_MODATAH194	(*( CAN_MODATAH0_type *) 0xf001a854u)	/* Message Object 194 Data Register High */
#define CAN_MODATAH195	(*( CAN_MODATAH0_type *) 0xf001a874u)	/* Message Object 195 Data Register High */
#define CAN_MODATAH196	(*( CAN_MODATAH0_type *) 0xf001a894u)	/* Message Object 196 Data Register High */
#define CAN_MODATAH197	(*( CAN_MODATAH0_type *) 0xf001a8b4u)	/* Message Object 197 Data Register High */
#define CAN_MODATAH198	(*( CAN_MODATAH0_type *) 0xf001a8d4u)	/* Message Object 198 Data Register High */
#define CAN_MODATAH199	(*( CAN_MODATAH0_type *) 0xf001a8f4u)	/* Message Object 199 Data Register High */
#define CAN_MODATAH2	(*( CAN_MODATAH0_type *) 0xf0019054u)	/* Message Object 2 Data Register High */
#define CAN_MODATAH20	(*( CAN_MODATAH0_type *) 0xf0019294u)	/* Message Object 20 Data Register High */
#define CAN_MODATAH200	(*( CAN_MODATAH0_type *) 0xf001a914u)	/* Message Object 200 Data Register High */
#define CAN_MODATAH201	(*( CAN_MODATAH0_type *) 0xf001a934u)	/* Message Object 201 Data Register High */
#define CAN_MODATAH202	(*( CAN_MODATAH0_type *) 0xf001a954u)	/* Message Object 202 Data Register High */
#define CAN_MODATAH203	(*( CAN_MODATAH0_type *) 0xf001a974u)	/* Message Object 203 Data Register High */
#define CAN_MODATAH204	(*( CAN_MODATAH0_type *) 0xf001a994u)	/* Message Object 204 Data Register High */
#define CAN_MODATAH205	(*( CAN_MODATAH0_type *) 0xf001a9b4u)	/* Message Object 205 Data Register High */
#define CAN_MODATAH206	(*( CAN_MODATAH0_type *) 0xf001a9d4u)	/* Message Object 206 Data Register High */
#define CAN_MODATAH207	(*( CAN_MODATAH0_type *) 0xf001a9f4u)	/* Message Object 207 Data Register High */
#define CAN_MODATAH208	(*( CAN_MODATAH0_type *) 0xf001aa14u)	/* Message Object 208 Data Register High */
#define CAN_MODATAH209	(*( CAN_MODATAH0_type *) 0xf001aa34u)	/* Message Object 209 Data Register High */
#define CAN_MODATAH21	(*( CAN_MODATAH0_type *) 0xf00192b4u)	/* Message Object 21 Data Register High */
#define CAN_MODATAH210	(*( CAN_MODATAH0_type *) 0xf001aa54u)	/* Message Object 210 Data Register High */
#define CAN_MODATAH211	(*( CAN_MODATAH0_type *) 0xf001aa74u)	/* Message Object 211 Data Register High */
#define CAN_MODATAH212	(*( CAN_MODATAH0_type *) 0xf001aa94u)	/* Message Object 212 Data Register High */
#define CAN_MODATAH213	(*( CAN_MODATAH0_type *) 0xf001aab4u)	/* Message Object 213 Data Register High */
#define CAN_MODATAH214	(*( CAN_MODATAH0_type *) 0xf001aad4u)	/* Message Object 214 Data Register High */
#define CAN_MODATAH215	(*( CAN_MODATAH0_type *) 0xf001aaf4u)	/* Message Object 215 Data Register High */
#define CAN_MODATAH216	(*( CAN_MODATAH0_type *) 0xf001ab14u)	/* Message Object 216 Data Register High */
#define CAN_MODATAH217	(*( CAN_MODATAH0_type *) 0xf001ab34u)	/* Message Object 217 Data Register High */
#define CAN_MODATAH218	(*( CAN_MODATAH0_type *) 0xf001ab54u)	/* Message Object 218 Data Register High */
#define CAN_MODATAH219	(*( CAN_MODATAH0_type *) 0xf001ab74u)	/* Message Object 219 Data Register High */
#define CAN_MODATAH22	(*( CAN_MODATAH0_type *) 0xf00192d4u)	/* Message Object 22 Data Register High */
#define CAN_MODATAH220	(*( CAN_MODATAH0_type *) 0xf001ab94u)	/* Message Object 220 Data Register High */
#define CAN_MODATAH221	(*( CAN_MODATAH0_type *) 0xf001abb4u)	/* Message Object 221 Data Register High */
#define CAN_MODATAH222	(*( CAN_MODATAH0_type *) 0xf001abd4u)	/* Message Object 222 Data Register High */
#define CAN_MODATAH223	(*( CAN_MODATAH0_type *) 0xf001abf4u)	/* Message Object 223 Data Register High */
#define CAN_MODATAH224	(*( CAN_MODATAH0_type *) 0xf001ac14u)	/* Message Object 224 Data Register High */
#define CAN_MODATAH225	(*( CAN_MODATAH0_type *) 0xf001ac34u)	/* Message Object 225 Data Register High */
#define CAN_MODATAH226	(*( CAN_MODATAH0_type *) 0xf001ac54u)	/* Message Object 226 Data Register High */
#define CAN_MODATAH227	(*( CAN_MODATAH0_type *) 0xf001ac74u)	/* Message Object 227 Data Register High */
#define CAN_MODATAH228	(*( CAN_MODATAH0_type *) 0xf001ac94u)	/* Message Object 228 Data Register High */
#define CAN_MODATAH229	(*( CAN_MODATAH0_type *) 0xf001acb4u)	/* Message Object 229 Data Register High */
#define CAN_MODATAH23	(*( CAN_MODATAH0_type *) 0xf00192f4u)	/* Message Object 23 Data Register High */
#define CAN_MODATAH230	(*( CAN_MODATAH0_type *) 0xf001acd4u)	/* Message Object 230 Data Register High */
#define CAN_MODATAH231	(*( CAN_MODATAH0_type *) 0xf001acf4u)	/* Message Object 231 Data Register High */
#define CAN_MODATAH232	(*( CAN_MODATAH0_type *) 0xf001ad14u)	/* Message Object 232 Data Register High */
#define CAN_MODATAH233	(*( CAN_MODATAH0_type *) 0xf001ad34u)	/* Message Object 233 Data Register High */
#define CAN_MODATAH234	(*( CAN_MODATAH0_type *) 0xf001ad54u)	/* Message Object 234 Data Register High */
#define CAN_MODATAH235	(*( CAN_MODATAH0_type *) 0xf001ad74u)	/* Message Object 235 Data Register High */
#define CAN_MODATAH236	(*( CAN_MODATAH0_type *) 0xf001ad94u)	/* Message Object 236 Data Register High */
#define CAN_MODATAH237	(*( CAN_MODATAH0_type *) 0xf001adb4u)	/* Message Object 237 Data Register High */
#define CAN_MODATAH238	(*( CAN_MODATAH0_type *) 0xf001add4u)	/* Message Object 238 Data Register High */
#define CAN_MODATAH239	(*( CAN_MODATAH0_type *) 0xf001adf4u)	/* Message Object 239 Data Register High */
#define CAN_MODATAH24	(*( CAN_MODATAH0_type *) 0xf0019314u)	/* Message Object 24 Data Register High */
#define CAN_MODATAH240	(*( CAN_MODATAH0_type *) 0xf001ae14u)	/* Message Object 240 Data Register High */
#define CAN_MODATAH241	(*( CAN_MODATAH0_type *) 0xf001ae34u)	/* Message Object 241 Data Register High */
#define CAN_MODATAH242	(*( CAN_MODATAH0_type *) 0xf001ae54u)	/* Message Object 242 Data Register High */
#define CAN_MODATAH243	(*( CAN_MODATAH0_type *) 0xf001ae74u)	/* Message Object 243 Data Register High */
#define CAN_MODATAH244	(*( CAN_MODATAH0_type *) 0xf001ae94u)	/* Message Object 244 Data Register High */
#define CAN_MODATAH245	(*( CAN_MODATAH0_type *) 0xf001aeb4u)	/* Message Object 245 Data Register High */
#define CAN_MODATAH246	(*( CAN_MODATAH0_type *) 0xf001aed4u)	/* Message Object 246 Data Register High */
#define CAN_MODATAH247	(*( CAN_MODATAH0_type *) 0xf001aef4u)	/* Message Object 247 Data Register High */
#define CAN_MODATAH248	(*( CAN_MODATAH0_type *) 0xf001af14u)	/* Message Object 248 Data Register High */
#define CAN_MODATAH249	(*( CAN_MODATAH0_type *) 0xf001af34u)	/* Message Object 249 Data Register High */
#define CAN_MODATAH25	(*( CAN_MODATAH0_type *) 0xf0019334u)	/* Message Object 25 Data Register High */
#define CAN_MODATAH250	(*( CAN_MODATAH0_type *) 0xf001af54u)	/* Message Object 250 Data Register High */
