svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MODATAH251	(*( CAN_MODATAH0_type *) 0xf001af74u)	/* Message Object 251 Data Register High */
#define CAN_MODATAH252	(*( CAN_MODATAH0_type *) 0xf001af94u)	/* Message Object 252 Data Register High */
#define CAN_MODATAH253	(*( CAN_MODATAH0_type *) 0xf001afb4u)	/* Message Object 253 Data Register High */
#define CAN_MODATAH254	(*( CAN_MODATAH0_type *) 0xf001afd4u)	/* Message Object 254 Data Register High */
#define CAN_MODATAH255	(*( CAN_MODATAH0_type *) 0xf001aff4u)	/* Message Object 255 Data Register High */
#define CAN_MODATAH26	(*( CAN_MODATAH0_type *) 0xf0019354u)	/* Message Object 26 Data Register High */
#define CAN_MODATAH27	(*( CAN_MODATAH0_type *) 0xf0019374u)	/* Message Object 27 Data Register High */
#define CAN_MODATAH28	(*( CAN_MODATAH0_type *) 0xf0019394u)	/* Message Object 28 Data Register High */
#define CAN_MODATAH29	(*( CAN_MODATAH0_type *) 0xf00193b4u)	/* Message Object 29 Data Register High */
#define CAN_MODATAH3	(*( CAN_MODATAH0_type *) 0xf0019074u)	/* Message Object 3 Data Register High */
#define CAN_MODATAH30	(*( CAN_MODATAH0_type *) 0xf00193d4u)	/* Message Object 30 Data Register High */
#define CAN_MODATAH31	(*( CAN_MODATAH0_type *) 0xf00193f4u)	/* Message Object 31 Data Register High */
#define CAN_MODATAH32	(*( CAN_MODATAH0_type *) 0xf0019414u)	/* Message Object 32 Data Register High */
#define CAN_MODATAH33	(*( CAN_MODATAH0_type *) 0xf0019434u)	/* Message Object 33 Data Register High */
#define CAN_MODATAH34	(*( CAN_MODATAH0_type *) 0xf0019454u)	/* Message Object 34 Data Register High */
#define CAN_MODATAH35	(*( CAN_MODATAH0_type *) 0xf0019474u)	/* Message Object 35 Data Register High */
#define CAN_MODATAH36	(*( CAN_MODATAH0_type *) 0xf0019494u)	/* Message Object 36 Data Register High */
#define CAN_MODATAH37	(*( CAN_MODATAH0_type *) 0xf00194b4u)	/* Message Object 37 Data Register High */
#define CAN_MODATAH38	(*( CAN_MODATAH0_type *) 0xf00194d4u)	/* Message Object 38 Data Register High */
#define CAN_MODATAH39	(*( CAN_MODATAH0_type *) 0xf00194f4u)	/* Message Object 39 Data Register High */
#define CAN_MODATAH4	(*( CAN_MODATAH0_type *) 0xf0019094u)	/* Message Object 4 Data Register High */
#define CAN_MODATAH40	(*( CAN_MODATAH0_type *) 0xf0019514u)	/* Message Object 40 Data Register High */
#define CAN_MODATAH41	(*( CAN_MODATAH0_type *) 0xf0019534u)	/* Message Object 41 Data Register High */
#define CAN_MODATAH42	(*( CAN_MODATAH0_type *) 0xf0019554u)	/* Message Object 42 Data Register High */
#define CAN_MODATAH43	(*( CAN_MODATAH0_type *) 0xf0019574u)	/* Message Object 43 Data Register High */
#define CAN_MODATAH44	(*( CAN_MODATAH0_type *) 0xf0019594u)	/* Message Object 44 Data Register High */
#define CAN_MODATAH45	(*( CAN_MODATAH0_type *) 0xf00195b4u)	/* Message Object 45 Data Register High */
#define CAN_MODATAH46	(*( CAN_MODATAH0_type *) 0xf00195d4u)	/* Message Object 46 Data Register High */
#define CAN_MODATAH47	(*( CAN_MODATAH0_type *) 0xf00195f4u)	/* Message Object 47 Data Register High */
#define CAN_MODATAH48	(*( CAN_MODATAH0_type *) 0xf0019614u)	/* Message Object 48 Data Register High */
#define CAN_MODATAH49	(*( CAN_MODATAH0_type *) 0xf0019634u)	/* Message Object 49 Data Register High */
#define CAN_MODATAH5	(*( CAN_MODATAH0_type *) 0xf00190b4u)	/* Message Object 5 Data Register High */
#define CAN_MODATAH50	(*( CAN_MODATAH0_type *) 0xf0019654u)	/* Message Object 50 Data Register High */
#define CAN_MODATAH51	(*( CAN_MODATAH0_type *) 0xf0019674u)	/* Message Object 51 Data Register High */
#define CAN_MODATAH52	(*( CAN_MODATAH0_type *) 0xf0019694u)	/* Message Object 52 Data Register High */
#define CAN_MODATAH53	(*( CAN_MODATAH0_type *) 0xf00196b4u)	/* Message Object 53 Data Register High */
#define CAN_MODATAH54	(*( CAN_MODATAH0_type *) 0xf00196d4u)	/* Message Object 54 Data Register High */
#define CAN_MODATAH55	(*( CAN_MODATAH0_type *) 0xf00196f4u)	/* Message Object 55 Data Register High */
#define CAN_MODATAH56	(*( CAN_MODATAH0_type *) 0xf0019714u)	/* Message Object 56 Data Register High */
#define CAN_MODATAH57	(*( CAN_MODATAH0_type *) 0xf0019734u)	/* Message Object 57 Data Register High */
#define CAN_MODATAH58	(*( CAN_MODATAH0_type *) 0xf0019754u)	/* Message Object 58 Data Register High */
#define CAN_MODATAH59	(*( CAN_MODATAH0_type *) 0xf0019774u)	/* Message Object 59 Data Register High */
#define CAN_MODATAH6	(*( CAN_MODATAH0_type *) 0xf00190d4u)	/* Message Object 6 Data Register High */
#define CAN_MODATAH60	(*( CAN_MODATAH0_type *) 0xf0019794u)	/* Message Object 60 Data Register High */
#define CAN_MODATAH61	(*( CAN_MODATAH0_type *) 0xf00197b4u)	/* Message Object 61 Data Register High */
#define CAN_MODATAH62	(*( CAN_MODATAH0_type *) 0xf00197d4u)	/* Message Object 62 Data Register High */
#define CAN_MODATAH63	(*( CAN_MODATAH0_type *) 0xf00197f4u)	/* Message Object 63 Data Register High */
#define CAN_MODATAH64	(*( CAN_MODATAH0_type *) 0xf0019814u)	/* Message Object 64 Data Register High */
#define CAN_MODATAH65	(*( CAN_MODATAH0_type *) 0xf0019834u)	/* Message Object 65 Data Register High */
#define CAN_MODATAH66	(*( CAN_MODATAH0_type *) 0xf0019854u)	/* Message Object 66 Data Register High */
#define CAN_MODATAH67	(*( CAN_MODATAH0_type *) 0xf0019874u)	/* Message Object 67 Data Register High */
#define CAN_MODATAH68	(*( CAN_MODATAH0_type *) 0xf0019894u)	/* Message Object 68 Data Register High */
#define CAN_MODATAH69	(*( CAN_MODATAH0_type *) 0xf00198b4u)	/* Message Object 69 Data Register High */
#define CAN_MODATAH7	(*( CAN_MODATAH0_type *) 0xf00190f4u)	/* Message Object 7 Data Register High */
#define CAN_MODATAH70	(*( CAN_MODATAH0_type *) 0xf00198d4u)	/* Message Object 70 Data Register High */
#define CAN_MODATAH71	(*( CAN_MODATAH0_type *) 0xf00198f4u)	/* Message Object 71 Data Register High */
#define CAN_MODATAH72	(*( CAN_MODATAH0_type *) 0xf0019914u)	/* Message Object 72 Data Register High */
#define CAN_MODATAH73	(*( CAN_MODATAH0_type *) 0xf0019934u)	/* Message Object 73 Data Register High */
#define CAN_MODATAH74	(*( CAN_MODATAH0_type *) 0xf0019954u)	/* Message Object 74 Data Register High */
#define CAN_MODATAH75	(*( CAN_MODATAH0_type *) 0xf0019974u)	/* Message Object 75 Data Register High */
#define CAN_MODATAH76	(*( CAN_MODATAH0_type *) 0xf0019994u)	/* Message Object 76 Data Register High */
#define CAN_MODATAH77	(*( CAN_MODATAH0_type *) 0xf00199b4u)	/* Message Object 77 Data Register High */
#define CAN_MODATAH78	(*( CAN_MODATAH0_type *) 0xf00199d4u)	/* Message Object 78 Data Register High */
#define CAN_MODATAH79	(*( CAN_MODATAH0_type *) 0xf00199f4u)	/* Message Object 79 Data Register High */
#define CAN_MODATAH8	(*( CAN_MODATAH0_type *) 0xf0019114u)	/* Message Object 8 Data Register High */
#define CAN_MODATAH80	(*( CAN_MODATAH0_type *) 0xf0019a14u)	/* Message Object 80 Data Register High */
#define CAN_MODATAH81	(*( CAN_MODATAH0_type *) 0xf0019a34u)	/* Message Object 81 Data Register High */
#define CAN_MODATAH82	(*( CAN_MODATAH0_type *) 0xf0019a54u)	/* Message Object 82 Data Register High */
#define CAN_MODATAH83	(*( CAN_MODATAH0_type *) 0xf0019a74u)	/* Message Object 83 Data Register High */
#define CAN_MODATAH84	(*( CAN_MODATAH0_type *) 0xf0019a94u)	/* Message Object 84 Data Register High */
#define CAN_MODATAH85	(*( CAN_MODATAH0_type *) 0xf0019ab4u)	/* Message Object 85 Data Register High */
#define CAN_MODATAH86	(*( CAN_MODATAH0_type *) 0xf0019ad4u)	/* Message Object 86 Data Register High */
#define CAN_MODATAH87	(*( CAN_MODATAH0_type *) 0xf0019af4u)	/* Message Object 87 Data Register High */
#define CAN_MODATAH88	(*( CAN_MODATAH0_type *) 0xf0019b14u)	/* Message Object 88 Data Register High */
#define CAN_MODATAH89	(*( CAN_MODATAH0_type *) 0xf0019b34u)	/* Message Object 89 Data Register High */
#define CAN_MODATAH9	(*( CAN_MODATAH0_type *) 0xf0019134u)	/* Message Object 9 Data Register High */
#define CAN_MODATAH90	(*( CAN_MODATAH0_type *) 0xf0019b54u)	/* Message Object 90 Data Register High */
#define CAN_MODATAH91	(*( CAN_MODATAH0_type *) 0xf0019b74u)	/* Message Object 91 Data Register High */
#define CAN_MODATAH92	(*( CAN_MODATAH0_type *) 0xf0019b94u)	/* Message Object 92 Data Register High */
#define CAN_MODATAH93	(*( CAN_MODATAH0_type *) 0xf0019bb4u)	/* Message Object 93 Data Register High */
#define CAN_MODATAH94	(*( CAN_MODATAH0_type *) 0xf0019bd4u)	/* Message Object 94 Data Register High */
#define CAN_MODATAH95	(*( CAN_MODATAH0_type *) 0xf0019bf4u)	/* Message Object 95 Data Register High */
#define CAN_MODATAH96	(*( CAN_MODATAH0_type *) 0xf0019c14u)	/* Message Object 96 Data Register High */
#define CAN_MODATAH97	(*( CAN_MODATAH0_type *) 0xf0019c34u)	/* Message Object 97 Data Register High */
#define CAN_MODATAH98	(*( CAN_MODATAH0_type *) 0xf0019c54u)	/* Message Object 98 Data Register High */
#define CAN_MODATAH99	(*( CAN_MODATAH0_type *) 0xf0019c74u)	/* Message Object 99 Data Register High */

