svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int DB0            : 8;	/* Data Byte 0 of Message Object n */
		unsigned int DB1            : 8;	/* Data Byte 1 of Message Object n */
		unsigned int DB2            : 8;	/* Data Byte 2 of Message Object n */
		unsigned int DB3            : 8;	/* Data Byte 3 of Message Object n */
	} B;
	int I;
	unsigned int U;

} CAN_MODATAL0_type;
#define CAN_MODATAL0	(*( CAN_MODATAL0_type *) 0xf0019010u)	/* Message Object 0 Data Register Low */
#define CAN_MODATAL1	(*( CAN_MODATAL0_type *) 0xf0019030u)	/* Message Object 1 Data Register Low */
#define CAN_MODATAL10	(*( CAN_MODATAL0_type *) 0xf0019150u)	/* Message Object 10 Data Register Low */
#define CAN_MODATAL100	(*( CAN_MODATAL0_type *) 0xf0019c90u)	/* Message Object 100 Data Register Low */
#define CAN_MODATAL101	(*( CAN_MODATAL0_type *) 0xf0019cb0u)	/* Message Object 101 Data Register Low */
#define CAN_MODATAL102	(*( CAN_MODATAL0_type *) 0xf0019cd0u)	/* Message Object 102 Data Register Low */
#define CAN_MODATAL103	(*( CAN_MODATAL0_type *) 0xf0019cf0u)	/* Message Object 103 Data Register Low */
#define CAN_MODATAL104	(*( CAN_MODATAL0_type *) 0xf0019d10u)	/* Message Object 104 Data Register Low */
#define CAN_MODATAL105	(*( CAN_MODATAL0_type *) 0xf0019d30u)	/* Message Object 105 Data Register Low */
#define CAN_MODATAL106	(*( CAN_MODATAL0_type *) 0xf0019d50u)	/* Message Object 106 Data Register Low */
#define CAN_MODATAL107	(*( CAN_MODATAL0_type *) 0xf0019d70u)	/* Message Object 107 Data Register Low */
#define CAN_MODATAL108	(*( CAN_MODATAL0_type *) 0xf0019d90u)	/* Message Object 108 Data Register Low */
#define CAN_MODATAL109	(*( CAN_MODATAL0_type *) 0xf0019db0u)	/* Message Object 109 Data Register Low */
#define CAN_MODATAL11	(*( CAN_MODATAL0_type *) 0xf0019170u)	/* Message Object 11 Data Register Low */
#define CAN_MODATAL110	(*( CAN_MODATAL0_type *) 0xf0019dd0u)	/* Message Object 110 Data Register Low */
#define CAN_MODATAL111	(*( CAN_MODATAL0_type *) 0xf0019df0u)	/* Message Object 111 Data Register Low */
#define CAN_MODATAL112	(*( CAN_MODATAL0_type *) 0xf0019e10u)	/* Message Object 112 Data Register Low */
#define CAN_MODATAL113	(*( CAN_MODATAL0_type *) 0xf0019e30u)	/* Message Object 113 Data Register Low */
#define CAN_MODATAL114	(*( CAN_MODATAL0_type *) 0xf0019e50u)	/* Message Object 114 Data Register Low */
#define CAN_MODATAL115	(*( CAN_MODATAL0_type *) 0xf0019e70u)	/* Message Object 115 Data Register Low */
#define CAN_MODATAL116	(*( CAN_MODATAL0_type *) 0xf0019e90u)	/* Message Object 116 Data Register Low */
#define CAN_MODATAL117	(*( CAN_MODATAL0_type *) 0xf0019eb0u)	/* Message Object 117 Data Register Low */
#define CAN_MODATAL118	(*( CAN_MODATAL0_type *) 0xf0019ed0u)	/* Message Object 118 Data Register Low */
#define CAN_MODATAL119	(*( CAN_MODATAL0_type *) 0xf0019ef0u)	/* Message Object 119 Data Register Low */
#define CAN_MODATAL12	(*( CAN_MODATAL0_type *) 0xf0019190u)	/* Message Object 12 Data Register Low */
#define CAN_MODATAL120	(*( CAN_MODATAL0_type *) 0xf0019f10u)	/* Message Object 120 Data Register Low */
#define CAN_MODATAL121	(*( CAN_MODATAL0_type *) 0xf0019f30u)	/* Message Object 121 Data Register Low */
#define CAN_MODATAL122	(*( CAN_MODATAL0_type *) 0xf0019f50u)	/* Message Object 122 Data Register Low */
#define CAN_MODATAL123	(*( CAN_MODATAL0_type *) 0xf0019f70u)	/* Message Object 123 Data Register Low */
#define CAN_MODATAL124	(*( CAN_MODATAL0_type *) 0xf0019f90u)	/* Message Object 124 Data Register Low */
#define CAN_MODATAL125	(*( CAN_MODATAL0_type *) 0xf0019fb0u)	/* Message Object 125 Data Register Low */
#define CAN_MODATAL126	(*( CAN_MODATAL0_type *) 0xf0019fd0u)	/* Message Object 126 Data Register Low */
#define CAN_MODATAL127	(*( CAN_MODATAL0_type *) 0xf0019ff0u)	/* Message Object 127 Data Register Low */
#define CAN_MODATAL128	(*( CAN_MODATAL0_type *) 0xf001a010u)	/* Message Object 128 Data Register Low */
#define CAN_MODATAL129	(*( CAN_MODATAL0_type *) 0xf001a030u)	/* Message Object 129 Data Register Low */
#define CAN_MODATAL13	(*( CAN_MODATAL0_type *) 0xf00191b0u)	/* Message Object 13 Data Register Low */
#define CAN_MODATAL130	(*( CAN_MODATAL0_type *) 0xf001a050u)	/* Message Object 130 Data Register Low */
#define CAN_MODATAL131	(*( CAN_MODATAL0_type *) 0xf001a070u)	/* Message Object 131 Data Register Low */
#define CAN_MODATAL132	(*( CAN_MODATAL0_type *) 0xf001a090u)	/* Message Object 132 Data Register Low */
#define CAN_MODATAL133	(*( CAN_MODATAL0_type *) 0xf001a0b0u)	/* Message Object 133 Data Register Low */
#define CAN_MODATAL134	(*( CAN_MODATAL0_type *) 0xf001a0d0u)	/* Message Object 134 Data Register Low */
#define CAN_MODATAL135	(*( CAN_MODATAL0_type *) 0xf001a0f0u)	/* Message Object 135 Data Register Low */
#define CAN_MODATAL136	(*( CAN_MODATAL0_type *) 0xf001a110u)	/* Message Object 136 Data Register Low */
#define CAN_MODATAL137	(*( CAN_MODATAL0_type *) 0xf001a130u)	/* Message Object 137 Data Register Low */
#define CAN_MODATAL138	(*( CAN_MODATAL0_type *) 0xf001a150u)	/* Message Object 138 Data Register Low */
#define CAN_MODATAL139	(*( CAN_MODATAL0_type *) 0xf001a170u)	/* Message Object 139 Data Register Low */
#define CAN_MODATAL14	(*( CAN_MODATAL0_type *) 0xf00191d0u)	/* Message Object 14 Data Register Low */
#define CAN_MODATAL140	(*( CAN_MODATAL0_type *) 0xf001a190u)	/* Message Object 140 Data Register Low */
#define CAN_MODATAL141	(*( CAN_MODATAL0_type *) 0xf001a1b0u)	/* Message Object 141 Data Register Low */
#define CAN_MODATAL142	(*( CAN_MODATAL0_type *) 0xf001a1d0u)	/* Message Object 142 Data Register Low */
#define CAN_MODATAL143	(*( CAN_MODATAL0_type *) 0xf001a1f0u)	/* Message Object 143 Data Register Low */
#define CAN_MODATAL144	(*( CAN_MODATAL0_type *) 0xf001a210u)	/* Message Object 144 Data Register Low */
#define CAN_MODATAL145	(*( CAN_MODATAL0_type *) 0xf001a230u)	/* Message Object 145 Data Register Low */
#define CAN_MODATAL146	(*( CAN_MODATAL0_type *) 0xf001a250u)	/* Message Object 146 Data Register Low */
#define CAN_MODATAL147	(*( CAN_MODATAL0_type *) 0xf001a270u)	/* Message Object 147 Data Register Low */
#define CAN_MODATAL148	(*( CAN_MODATAL0_type *) 0xf001a290u)	/* Message Object 148 Data Register Low */
#define CAN_MODATAL149	(*( CAN_MODATAL0_type *) 0xf001a2b0u)	/* Message Object 149 Data Register Low */
#define CAN_MODATAL15	(*( CAN_MODATAL0_type *) 0xf00191f0u)	/* Message Object 15 Data Register Low */
#define CAN_MODATAL150	(*( CAN_MODATAL0_type *) 0xf001a2d0u)	/* Message Object 150 Data Register Low */
#define CAN_MODATAL151	(*( CAN_MODATAL0_type *) 0xf001a2f0u)	/* Message Object 151 Data Register Low */
#define CAN_MODATAL152	(*( CAN_MODATAL0_type *) 0xf001a310u)	/* Message Object 152 Data Register Low */
#define CAN_MODATAL153	(*( CAN_MODATAL0_type *) 0xf001a330u)	/* Message Object 153 Data Register Low */
#define CAN_MODATAL154	(*( CAN_MODATAL0_type *) 0xf001a350u)	/* Message Object 154 Data Register Low */
#define CAN_MODATAL155	(*( CAN_MODATAL0_type *) 0xf001a370u)	/* Message Object 155 Data Register Low */
#define CAN_MODATAL156	(*( CAN_MODATAL0_type *) 0xf001a390u)	/* Message Object 156 Data Register Low */
#define CAN_MODATAL157	(*( CAN_MODATAL0_type *) 0xf001a3b0u)	/* Message Object 157 Data Register Low */
#define CAN_MODATAL158	(*( CAN_MODATAL0_type *) 0xf001a3d0u)	/* Message Object 158 Data Register Low */
#define CAN_MODATAL159	(*( CAN_MODATAL0_type *) 0xf001a3f0u)	/* Message Object 159 Data Register Low */
#define CAN_MODATAL16	(*( CAN_MODATAL0_type *) 0xf0019210u)	/* Message Object 16 Data Register Low */
#define CAN_MODATAL160	(*( CAN_MODATAL0_type *) 0xf001a410u)	/* Message Object 160 Data Register Low */
#define CAN_MODATAL161	(*( CAN_MODATAL0_type *) 0xf001a430u)	/* Message Object 161 Data Register Low */
#define CAN_MODATAL162	(*( CAN_MODATAL0_type *) 0xf001a450u)	/* Message Object 162 Data Register Low */
#define CAN_MODATAL163	(*( CAN_MODATAL0_type *) 0xf001a470u)	/* Message Object 163 Data Register Low */
#define CAN_MODATAL164	(*( CAN_MODATAL0_type *) 0xf001a490u)	/* Message Object 164 Data Register Low */
#define CAN_MODATAL165	(*( CAN_MODATAL0_type *) 0xf001a4b0u)	/* Message Object 165 Data Register Low */
#define CAN_MODATAL166	(*( CAN_MODATAL0_type *) 0xf001a4d0u)	/* Message Object 166 Data Register Low */
#define CAN_MODATAL167	(*( CAN_MODATAL0_type *) 0xf001a4f0u)	/* Message Object 167 Data Register Low */
#define CAN_MODATAL168	(*( CAN_MODATAL0_type *) 0xf001a510u)	/* Message Object 168 Data Register Low */
#define CAN_MODATAL169	(*( CAN_MODATAL0_type *) 0xf001a530u)	/* Message Object 169 Data Register Low */
#define CAN_MODATAL17	(*( CAN_MODATAL0_type *) 0xf0019230u)	/* Message Object 17 Data Register Low */
#define CAN_MODATAL170	(*( CAN_MODATAL0_type *) 0xf001a550u)	/* Message Object 170 Data Register Low */
#define CAN_MODATAL171	(*( CAN_MODATAL0_type *) 0xf001a570u)	/* Message Object 171 Data Register Low */
#define CAN_MODATAL172	(*( CAN_MODATAL0_type *) 0xf001a590u)	/* Message Object 172 Data Register Low */
#define CAN_MODATAL173	(*( CAN_MODATAL0_type *) 0xf001a5b0u)	/* Message Object 173 Data Register Low */
#define CAN_MODATAL174	(*( CAN_MODATAL0_type *) 0xf001a5d0u)	/* Message Object 174 Data Register Low */
#define CAN_MODATAL175	(*( CAN_MODATAL0_type *) 0xf001a5f0u)	/* Message Object 175 Data Register Low */
#define CAN_MODATAL176	(*( CAN_MODATAL0_type *) 0xf001a610u)	/* Message Object 176 Data Register Low */
#define CAN_MODATAL177	(*( CAN_MODATAL0_type *) 0xf001a630u)	/* Message Object 177 Data Register Low */
#define CAN_MODATAL178	(*( CAN_MODATAL0_type *) 0xf001a650u)	/* Message Object 178 Data Register Low */
#define CAN_MODATAL179	(*( CAN_MODATAL0_type *) 0xf001a670u)	/* Message Object 179 Data Register Low */
#define CAN_MODATAL18	(*( CAN_MODATAL0_type *) 0xf0019250u)	/* Message Object 18 Data Register Low */
#define CAN_MODATAL180	(*( CAN_MODATAL0_type *) 0xf001a690u)	/* Message Object 180 Data Register Low */
#define CAN_MODATAL181	(*( CAN_MODATAL0_type *) 0xf001a6b0u)	/* Message Object 181 Data Register Low */
#define CAN_MODATAL182	(*( CAN_MODATAL0_type *) 0xf001a6d0u)	/* Message Object 182 Data Register Low */
#define CAN_MODATAL183	(*( CAN_MODATAL0_type *) 0xf001a6f0u)	/* Message Object 183 Data Register Low */
#define CAN_MODATAL184	(*( CAN_MODATAL0_type *) 0xf001a710u)	/* Message Object 184 Data Register Low */
#define CAN_MODATAL185	(*( CAN_MODATAL0_type *) 0xf001a730u)	/* Message Object 185 Data Register Low */
#define CAN_MODATAL186	(*( CAN_MODATAL0_type *) 0xf001a750u)	/* Message Object 186 Data Register Low */
#define CAN_MODATAL187	(*( CAN_MODATAL0_type *) 0xf001a770u)	/* Message Object 187 Data Register Low */
#define CAN_MODATAL188	(*( CAN_MODATAL0_type *) 0xf001a790u)	/* Message Object 188 Data Register Low */
#define CAN_MODATAL189	(*( CAN_MODATAL0_type *) 0xf001a7b0u)	/* Message Object 189 Data Register Low */
#define CAN_MODATAL19	(*( CAN_MODATAL0_type *) 0xf0019270u)	/* Message Object 19 Data Register Low */
#define CAN_MODATAL190	(*( CAN_MODATAL0_type *) 0xf001a7d0u)	/* Message Object 190 Data Register Low */
#define CAN_MODATAL191	(*( CAN_MODATAL0_type *) 0xf001a7f0u)	/* Message Object 191 Data Register Low */
#define CAN_MODATAL192	(*( CAN_MODATAL0_type *) 0xf001a810u)	/* Message Object 192 Data Register Low */
#define CAN_MODATAL193	(*( CAN_MODATAL0_type *) 0xf001a830u)	/* Message Object 193 Data Register Low */
#define CAN_MODATAL194	(*( CAN_MODATAL0_type *) 0xf001a850u)	/* Message Object 194 Data Register Low */
#define CAN_MODATAL195	(*( CAN_MODATAL0_type *) 0xf001a870u)	/* Message Object 195 Data Register Low */
#define CAN_MODATAL196	(*( CAN_MODATAL0_type *) 0xf001a890u)	/* Message Object 196 Data Register Low */
#define CAN_MODATAL197	(*( CAN_MODATAL0_type *) 0xf001a8b0u)	/* Message Object 197 Data Register Low */
#define CAN_MODATAL198	(*( CAN_MODATAL0_type *) 0xf001a8d0u)	/* Message Object 198 Data Register Low */
#define CAN_MODATAL199	(*( CAN_MODATAL0_type *) 0xf001a8f0u)	/* Message Object 199 Data Register Low */
#define CAN_MODATAL2	(*( CAN_MODATAL0_type *) 0xf0019050u)	/* Message Object 2 Data Register Low */
#define CAN_MODATAL20	(*( CAN_MODATAL0_type *) 0xf0019290u)	/* Message Object 20 Data Register Low */
#define CAN_MODATAL200	(*( CAN_MODATAL0_type *) 0xf001a910u)	/* Message Object 200 Data Register Low */
#define CAN_MODATAL201	(*( CAN_MODATAL0_type *) 0xf001a930u)	/* Message Object 201 Data Register Low */
#define CAN_MODATAL202	(*( CAN_MODATAL0_type *) 0xf001a950u)	/* Message Object 202 Data Register Low */
#define CAN_MODATAL203	(*( CAN_MODATAL0_type *) 0xf001a970u)	/* Message Object 203 Data Register Low */
#define CAN_MODATAL204	(*( CAN_MODATAL0_type *) 0xf001a990u)	/* Message Object 204 Data Register Low */
#define CAN_MODATAL205	(*( CAN_MODATAL0_type *) 0xf001a9b0u)	/* Message Object 205 Data Register Low */
#define CAN_MODATAL206	(*( CAN_MODATAL0_type *) 0xf001a9d0u)	/* Message Object 206 Data Register Low */
#define CAN_MODATAL207	(*( CAN_MODATAL0_type *) 0xf001a9f0u)	/* Message Object 207 Data Register Low */
#define CAN_MODATAL208	(*( CAN_MODATAL0_type *) 0xf001aa10u)	/* Message Object 208 Data Register Low */
#define CAN_MODATAL209	(*( CAN_MODATAL0_type *) 0xf001aa30u)	/* Message Object 209 Data Register Low */
#define CAN_MODATAL21	(*( CAN_MODATAL0_type *) 0xf00192b0u)	/* Message Object 21 Data Register Low */
#define CAN_MODATAL210	(*( CAN_MODATAL0_type *) 0xf001aa50u)	/* Message Object 210 Data Register Low */
#define CAN_MODATAL211	(*( CAN_MODATAL0_type *) 0xf001aa70u)	/* Message Object 211 Data Register Low */
#define CAN_MODATAL212	(*( CAN_MODATAL0_type *) 0xf001aa90u)	/* Message Object 212 Data Register Low */
#define CAN_MODATAL213	(*( CAN_MODATAL0_type *) 0xf001aab0u)	/* Message Object 213 Data Register Low */
#define CAN_MODATAL214	(*( CAN_MODATAL0_type *) 0xf001aad0u)	/* Message Object 214 Data Register Low */
#define CAN_MODATAL215	(*( CAN_MODATAL0_type *) 0xf001aaf0u)	/* Message Object 215 Data Register Low */
#define CAN_MODATAL216	(*( CAN_MODATAL0_type *) 0xf001ab10u)	/* Message Object 216 Data Register Low */
#define CAN_MODATAL217	(*( CAN_MODATAL0_type *) 0xf001ab30u)	/* Message Object 217 Data Register Low */
#define CAN_MODATAL218	(*( CAN_MODATAL0_type *) 0xf001ab50u)	/* Message Object 218 Data Register Low */
#define CAN_MODATAL219	(*( CAN_MODATAL0_type *) 0xf001ab70u)	/* Message Object 219 Data Register Low */
#define CAN_MODATAL22	(*( CAN_MODATAL0_type *) 0xf00192d0u)	/* Message Object 22 Data Register Low */
#define CAN_MODATAL220	(*( CAN_MODATAL0_type *) 0xf001ab90u)	/* Message Object 220 Data Register Low */
#define CAN_MODATAL221	(*( CAN_MODATAL0_type *) 0xf001abb0u)	/* Message Object 221 Data Register Low */
#define CAN_MODATAL222	(*( CAN_MODATAL0_type *) 0xf001abd0u)	/* Message Object 222 Data Register Low */
#define CAN_MODATAL223	(*( CAN_MODATAL0_type *) 0xf001abf0u)	/* Message Object 223 Data Register Low */
#define CAN_MODATAL224	(*( CAN_MODATAL0_type *) 0xf001ac10u)	/* Message Object 224 Data Register Low */
#define CAN_MODATAL225	(*( CAN_MODATAL0_type *) 0xf001ac30u)	/* Message Object 225 Data Register Low */
#define CAN_MODATAL226	(*( CAN_MODATAL0_type *) 0xf001ac50u)	/* Message Object 226 Data Register Low */
#define CAN_MODATAL227	(*( CAN_MODATAL0_type *) 0xf001ac70u)	/* Message Object 227 Data Register Low */
#define CAN_MODATAL228	(*( CAN_MODATAL0_type *) 0xf001ac90u)	/* Message Object 228 Data Register Low */
#define CAN_MODATAL229	(*( CAN_MODATAL0_type *) 0xf001acb0u)	/* Message Object 229 Data Register Low */
#define CAN_MODATAL23	(*( CAN_MODATAL0_type *) 0xf00192f0u)	/* Message Object 23 Data Register Low */
#define CAN_MODATAL230	(*( CAN_MODATAL0_type *) 0xf001acd0u)	/* Message Object 230 Data Register Low */
#define CAN_MODATAL231	(*( CAN_MODATAL0_type *) 0xf001acf0u)	/* Message Object 231 Data Register Low */
#define CAN_MODATAL232	(*( CAN_MODATAL0_type *) 0xf001ad10u)	/* Message Object 232 Data Register Low */
#define CAN_MODATAL233	(*( CAN_MODATAL0_type *) 0xf001ad30u)	/* Message Object 233 Data Register Low */
#define CAN_MODATAL234	(*( CAN_MODATAL0_type *) 0xf001ad50u)	/* Message Object 234 Data Register Low */
#define CAN_MODATAL235	(*( CAN_MODATAL0_type *) 0xf001ad70u)	/* Message Object 235 Data Register Low */
#define CAN_MODATAL236	(*( CAN_MODATAL0_type *) 0xf001ad90u)	/* Message Object 236 Data Register Low */
#define CAN_MODATAL237	(*( CAN_MODATAL0_type *) 0xf001adb0u)	/* Message Object 237 Data Register Low */
#define CAN_MODATAL238	(*( CAN_MODATAL0_type *) 0xf001add0u)	/* Message Object 238 Data Register Low */
#define CAN_MODATAL239	(*( CAN_MODATAL0_type *) 0xf001adf0u)	/* Message Object 239 Data Register Low */
#define CAN_MODATAL24	(*( CAN_MODATAL0_type *) 0xf0019310u)	/* Message Object 24 Data Register Low */
#define CAN_MODATAL240	(*( CAN_MODATAL0_type *) 0xf001ae10u)	/* Message Object 240 Data Register Low */
#define CAN_MODATAL241	(*( CAN_MODATAL0_type *) 0xf001ae30u)	/* Message Object 241 Data Register Low */
#define CAN_MODATAL242	(*( CAN_MODATAL0_type *) 0xf001ae50u)	/* Message Object 242 Data Register Low */
#define CAN_MODATAL243	(*( CAN_MODATAL0_type *) 0xf001ae70u)	/* Message Object 243 Data Register Low */
#define CAN_MODATAL244	(*( CAN_MODATAL0_type *) 0xf001ae90u)	/* Message Object 244 Data Register Low */
#define CAN_MODATAL245	(*( CAN_MODATAL0_type *) 0xf001aeb0u)	/* Message Object 245 Data Register Low */
#define CAN_MODATAL246	(*( CAN_MODATAL0_type *) 0xf001aed0u)	/* Message Object 246 Data Register Low */
#define CAN_MODATAL247	(*( CAN_MODATAL0_type *) 0xf001aef0u)	/* Message Object 247 Data Register Low */
#define CAN_MODATAL248	(*( CAN_MODATAL0_type *) 0xf001af10u)	/* Message Object 248 Data Register Low */
#define CAN_MODATAL249	(*( CAN_MODATAL0_type *) 0xf001af30u)	/* Message Object 249 Data Register Low */
#define CAN_MODATAL25	(*( CAN_MODATAL0_type *) 0xf0019330u)	/* Message Object 25 Data Register Low */
#define CAN_MODATAL250	(*( CAN_MODATAL0_type *) 0xf001af50u)	/* Message Object 250 Data Register Low */
#define CAN_MODATAL251	(*( CAN_MODATAL0_type *) 0xf001af70u)	/* Message Object 251 Data Register Low */
#define CAN_MODATAL252	(*( CAN_MODATAL0_type *) 0xf001af90u)	/* Message Object 252 Data Register Low */
#define CAN_MODATAL253	(*( CAN_MODATAL0_type *) 0xf001afb0u)	/* Message Object 253 Data Register Low */
#define CAN_MODATAL254	(*( CAN_MODATAL0_type *) 0xf001afd0u)	/* Message Object 254 Data Register Low */
#define CAN_MODATAL255	(*( CAN_MODATAL0_type *) 0xf001aff0u)	/* Message Object 255 Data Register Low */
#define CAN_MODATAL26	(*( CAN_MODATAL0_type *) 0xf0019350u)	/* Message Object 26 Data Register Low */
#define CAN_MODATAL27	(*( CAN_MODATAL0_type *) 0xf0019370u)	/* Message Object 27 Data Register Low */
#define CAN_MODATAL28	(*( CAN_MODATAL0_type *) 0xf0019390u)	/* Message Object 28 Data Register Low */
#define CAN_MODATAL29	(*( CAN_MODATAL0_type *) 0xf00193b0u)	/* Message Object 29 Data Register Low */
#define CAN_MODATAL3	(*( CAN_MODATAL0_type *) 0xf0019070u)	/* Message Object 3 Data Register Low */
#define CAN_MODATAL30	(*( CAN_MODATAL0_type *) 0xf00193d0u)	/* Message Object 30 Data Register Low */
#define CAN_MODATAL31	(*( CAN_MODATAL0_type *) 0xf00193f0u)	/* Message Object 31 Data Register Low */
#define CAN_MODATAL32	(*( CAN_MODATAL0_type *) 0xf0019410u)	/* Message Object 32 Data Register Low */
#define CAN_MODATAL33	(*( CAN_MODATAL0_type *) 0xf0019430u)	/* Message Object 33 Data Register Low */
#define CAN_MODATAL34	(*( CAN_MODATAL0_type *) 0xf0019450u)	/* Message Object 34 Data Register Low */
#define CAN_MODATAL35	(*( CAN_MODATAL0_type *) 0xf0019470u)	/* Message Object 35 Data Register Low */
#define CAN_MODATAL36	(*( CAN_MODATAL0_type *) 0xf0019490u)	/* Message Object 36 Data Register Low */
#define CAN_MODATAL37	(*( CAN_MODATAL0_type *) 0xf00194b0u)	/* Message Object 37 Data Register Low */
#define CAN_MODATAL38	(*( CAN_MODATAL0_type *) 0xf00194d0u)	/* Message Object 38 Data Register Low */
#define CAN_MODATAL39	(*( CAN_MODATAL0_type *) 0xf00194f0u)	/* Message Object 39 Data Register Low */
#define CAN_MODATAL4	(*( CAN_MODATAL0_type *) 0xf0019090u)	/* Message Object 4 Data Register Low */
#define CAN_MODATAL40	(*( CAN_MODATAL0_type *) 0xf0019510u)	/* Message Object 40 Data Register Low */
#define CAN_MODATAL41	(*( CAN_MODATAL0_type *) 0xf0019530u)	/* Message Object 41 Data Register Low */
#define CAN_MODATAL42	(*( CAN_MODATAL0_type *) 0xf0019550u)	/* Message Object 42 Data Register Low */
#define CAN_MODATAL43	(*( CAN_MODATAL0_type *) 0xf0019570u)	/* Message Object 43 Data Register Low */
#define CAN_MODATAL44	(*( CAN_MODATAL0_type *) 0xf0019590u)	/* Message Object 44 Data Register Low */
#define CAN_MODATAL45	(*( CAN_MODATAL0_type *) 0xf00195b0u)	/* Message Object 45 Data Register Low */
#define CAN_MODATAL46	(*( CAN_MODATAL0_type *) 0xf00195d0u)	/* Message Object 46 Data Register Low */
#define CAN_MODATAL47	(*( CAN_MODATAL0_type *) 0xf00195f0u)	/* Message Object 47 Data Register Low */
#define CAN_MODATAL48	(*( CAN_MODATAL0_type *) 0xf0019610u)	/* Message Object 48 Data Register Low */
#define CAN_MODATAL49	(*( CAN_MODATAL0_type *) 0xf0019630u)	/* Message Object 49 Data Register Low */
#define CAN_MODATAL5	(*( CAN_MODATAL0_type *) 0xf00190b0u)	/* Message Object 5 Data Register Low */
#define CAN_MODATAL50	(*( CAN_MODATAL0_type *) 0xf0019650u)	/* Message Object 50 Data Register Low */
#define CAN_MODATAL51	(*( CAN_MODATAL0_type *) 0xf0019670u)	/* Message Object 51 Data Register Low */
#define CAN_MODATAL52	(*( CAN_MODATAL0_type *) 0xf0019690u)	/* Message Object 52 Data Register Low */
#define CAN_MODATAL53	(*( CAN_MODATAL0_type *) 0xf00196b0u)	/* Message Object 53 Data Register Low */
#define CAN_MODATAL54	(*( CAN_MODATAL0_type *) 0xf00196d0u)	/* Message Object 54 Data Register Low */
#define CAN_MODATAL55	(*( CAN_MODATAL0_type *) 0xf00196f0u)	/* Message Object 55 Data Register Low */
#define CAN_MODATAL56	(*( CAN_MODATAL0_type *) 0xf0019710u)	/* Message Object 56 Data Register Low */
#define CAN_MODATAL57	(*( CAN_MODATAL0_type *) 0xf0019730u)	/* Message Object 57 Data Register Low */
#define CAN_MODATAL58	(*( CAN_MODATAL0_type *) 0xf0019750u)	/* Message Object 58 Data Register Low */
#define CAN_MODATAL59	(*( CAN_MODATAL0_type *) 0xf0019770u)	/* Message Object 59 Data Register Low */
#define CAN_MODATAL6	(*( CAN_MODATAL0_type *) 0xf00190d0u)	/* Message Object 6 Data Register Low */
#define CAN_MODATAL60	(*( CAN_MODATAL0_type *) 0xf0019790u)	/* Message Object 60 Data Register Low */
#define CAN_MODATAL61	(*( CAN_MODATAL0_type *) 0xf00197b0u)	/* Message Object 61 Data Register Low */
#define CAN_MODATAL62	(*( CAN_MODATAL0_type *) 0xf00197d0u)	/* Message Object 62 Data Register Low */
#define CAN_MODATAL63	(*( CAN_MODATAL0_type *) 0xf00197f0u)	/* Message Object 63 Data Register Low */
#define CAN_MODATAL64	(*( CAN_MODATAL0_type *) 0xf0019810u)	/* Message Object 64 Data Register Low */
#define CAN_MODATAL65	(*( CAN_MODATAL0_type *) 0xf0019830u)	/* Message Object 65 Data Register Low */
#define CAN_MODATAL66	(*( CAN_MODATAL0_type *) 0xf0019850u)	/* Message Object 66 Data Register Low */
#define CAN_MODATAL67	(*( CAN_MODATAL0_type *) 0xf0019870u)	/* Message Object 67 Data Register Low */
#define CAN_MODATAL68	(*( CAN_MODATAL0_type *) 0xf0019890u)	/* Message Object 68 Data Register Low */
#define CAN_MODATAL69	(*( CAN_MODATAL0_type *) 0xf00198b0u)	/* Message Object 69 Data Register Low */
#define CAN_MODATAL7	(*( CAN_MODATAL0_type *) 0xf00190f0u)	/* Message Object 7 Data Register Low */
#define CAN_MODATAL70	(*( CAN_MODATAL0_type *) 0xf00198d0u)	/* Message Object 70 Data Register Low */
#define CAN_MODATAL71	(*( CAN_MODATAL0_type *) 0xf00198f0u)	/* Message Object 71 Data Register Low */
