svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MODATAL72	(*( CAN_MODATAL0_type *) 0xf0019910u)	/* Message Object 72 Data Register Low */
#define CAN_MODATAL73	(*( CAN_MODATAL0_type *) 0xf0019930u)	/* Message Object 73 Data Register Low */
#define CAN_MODATAL74	(*( CAN_MODATAL0_type *) 0xf0019950u)	/* Message Object 74 Data Register Low */
#define CAN_MODATAL75	(*( CAN_MODATAL0_type *) 0xf0019970u)	/* Message Object 75 Data Register Low */
#define CAN_MODATAL76	(*( CAN_MODATAL0_type *) 0xf0019990u)	/* Message Object 76 Data Register Low */
#define CAN_MODATAL77	(*( CAN_MODATAL0_type *) 0xf00199b0u)	/* Message Object 77 Data Register Low */
#define CAN_MODATAL78	(*( CAN_MODATAL0_type *) 0xf00199d0u)	/* Message Object 78 Data Register Low */
#define CAN_MODATAL79	(*( CAN_MODATAL0_type *) 0xf00199f0u)	/* Message Object 79 Data Register Low */
#define CAN_MODATAL8	(*( CAN_MODATAL0_type *) 0xf0019110u)	/* Message Object 8 Data Register Low */
#define CAN_MODATAL80	(*( CAN_MODATAL0_type *) 0xf0019a10u)	/* Message Object 80 Data Register Low */
#define CAN_MODATAL81	(*( CAN_MODATAL0_type *) 0xf0019a30u)	/* Message Object 81 Data Register Low */
#define CAN_MODATAL82	(*( CAN_MODATAL0_type *) 0xf0019a50u)	/* Message Object 82 Data Register Low */
#define CAN_MODATAL83	(*( CAN_MODATAL0_type *) 0xf0019a70u)	/* Message Object 83 Data Register Low */
#define CAN_MODATAL84	(*( CAN_MODATAL0_type *) 0xf0019a90u)	/* Message Object 84 Data Register Low */
#define CAN_MODATAL85	(*( CAN_MODATAL0_type *) 0xf0019ab0u)	/* Message Object 85 Data Register Low */
#define CAN_MODATAL86	(*( CAN_MODATAL0_type *) 0xf0019ad0u)	/* Message Object 86 Data Register Low */
#define CAN_MODATAL87	(*( CAN_MODATAL0_type *) 0xf0019af0u)	/* Message Object 87 Data Register Low */
#define CAN_MODATAL88	(*( CAN_MODATAL0_type *) 0xf0019b10u)	/* Message Object 88 Data Register Low */
#define CAN_MODATAL89	(*( CAN_MODATAL0_type *) 0xf0019b30u)	/* Message Object 89 Data Register Low */
#define CAN_MODATAL9	(*( CAN_MODATAL0_type *) 0xf0019130u)	/* Message Object 9 Data Register Low */
#define CAN_MODATAL90	(*( CAN_MODATAL0_type *) 0xf0019b50u)	/* Message Object 90 Data Register Low */
#define CAN_MODATAL91	(*( CAN_MODATAL0_type *) 0xf0019b70u)	/* Message Object 91 Data Register Low */
#define CAN_MODATAL92	(*( CAN_MODATAL0_type *) 0xf0019b90u)	/* Message Object 92 Data Register Low */
#define CAN_MODATAL93	(*( CAN_MODATAL0_type *) 0xf0019bb0u)	/* Message Object 93 Data Register Low */
#define CAN_MODATAL94	(*( CAN_MODATAL0_type *) 0xf0019bd0u)	/* Message Object 94 Data Register Low */
#define CAN_MODATAL95	(*( CAN_MODATAL0_type *) 0xf0019bf0u)	/* Message Object 95 Data Register Low */
#define CAN_MODATAL96	(*( CAN_MODATAL0_type *) 0xf0019c10u)	/* Message Object 96 Data Register Low */
#define CAN_MODATAL97	(*( CAN_MODATAL0_type *) 0xf0019c30u)	/* Message Object 97 Data Register Low */
#define CAN_MODATAL98	(*( CAN_MODATAL0_type *) 0xf0019c50u)	/* Message Object 98 Data Register Low */
#define CAN_MODATAL99	(*( CAN_MODATAL0_type *) 0xf0019c70u)	/* Message Object 99 Data Register Low */

typedef volatile union
{
	struct
	{ 
		unsigned int MMC            : 4;	/* Message Mode Control */
		unsigned int RXTOE          : 1;	/* Receive Time-Out Enable */
		unsigned int                : 3;
		unsigned int GDFS           : 1;	/* Gateway Data Frame Send */
		unsigned int IDC            : 1;	/* Identifier Copy */
		unsigned int DLCC           : 1;	/* Data Length Code Copy */
		unsigned int DATC           : 1;	/* Data Copy */
		unsigned int                : 4;
		unsigned int RXIE           : 1;	/* Receive Interrupt Enable */
		unsigned int TXIE           : 1;	/* Transmit Interrupt Enable */
		unsigned int OVIE           : 1;	/* Overflow Interrupt Enable */
		unsigned int                : 1;
		unsigned int FRREN          : 1;	/* Foreign Remote Request Enable */
		unsigned int RMM            : 1;	/* Transmit Object Remote Monitoring */
		unsigned int SDT            : 1;	/* Single Data Transfer */
		unsigned int STT            : 1;	/* Single Transmit Trial */
		unsigned int DLC            : 4;	/* Data Length Code */
		unsigned int MSC            : 4;	/* Message Status Count (TTCAN only) */
	} B;
	int I;
	unsigned int U;

} CAN_MOFCR0_type;
#define CAN_MOFCR0	(*( CAN_MOFCR0_type *) 0xf0019000u)	/* Message Object 0 Function Control Register */
#define CAN_MOFCR1	(*( CAN_MOFCR0_type *) 0xf0019020u)	/* Message Object 1 Function Control Register */
#define CAN_MOFCR10	(*( CAN_MOFCR0_type *) 0xf0019140u)	/* Message Object 10 Function Control Register */
#define CAN_MOFCR100	(*( CAN_MOFCR0_type *) 0xf0019c80u)	/* Message Object 100 Function Control Register */
#define CAN_MOFCR101	(*( CAN_MOFCR0_type *) 0xf0019ca0u)	/* Message Object 101 Function Control Register */
#define CAN_MOFCR102	(*( CAN_MOFCR0_type *) 0xf0019cc0u)	/* Message Object 102 Function Control Register */
#define CAN_MOFCR103	(*( CAN_MOFCR0_type *) 0xf0019ce0u)	/* Message Object 103 Function Control Register */
#define CAN_MOFCR104	(*( CAN_MOFCR0_type *) 0xf0019d00u)	/* Message Object 104 Function Control Register */
#define CAN_MOFCR105	(*( CAN_MOFCR0_type *) 0xf0019d20u)	/* Message Object 105 Function Control Register */
#define CAN_MOFCR106	(*( CAN_MOFCR0_type *) 0xf0019d40u)	/* Message Object 106 Function Control Register */
#define CAN_MOFCR107	(*( CAN_MOFCR0_type *) 0xf0019d60u)	/* Message Object 107 Function Control Register */
#define CAN_MOFCR108	(*( CAN_MOFCR0_type *) 0xf0019d80u)	/* Message Object 108 Function Control Register */
#define CAN_MOFCR109	(*( CAN_MOFCR0_type *) 0xf0019da0u)	/* Message Object 109 Function Control Register */
#define CAN_MOFCR11	(*( CAN_MOFCR0_type *) 0xf0019160u)	/* Message Object 11 Function Control Register */
#define CAN_MOFCR110	(*( CAN_MOFCR0_type *) 0xf0019dc0u)	/* Message Object 110 Function Control Register */
#define CAN_MOFCR111	(*( CAN_MOFCR0_type *) 0xf0019de0u)	/* Message Object 111 Function Control Register */
#define CAN_MOFCR112	(*( CAN_MOFCR0_type *) 0xf0019e00u)	/* Message Object 112 Function Control Register */
#define CAN_MOFCR113	(*( CAN_MOFCR0_type *) 0xf0019e20u)	/* Message Object 113 Function Control Register */
#define CAN_MOFCR114	(*( CAN_MOFCR0_type *) 0xf0019e40u)	/* Message Object 114 Function Control Register */
#define CAN_MOFCR115	(*( CAN_MOFCR0_type *) 0xf0019e60u)	/* Message Object 115 Function Control Register */
#define CAN_MOFCR116	(*( CAN_MOFCR0_type *) 0xf0019e80u)	/* Message Object 116 Function Control Register */
#define CAN_MOFCR117	(*( CAN_MOFCR0_type *) 0xf0019ea0u)	/* Message Object 117 Function Control Register */
#define CAN_MOFCR118	(*( CAN_MOFCR0_type *) 0xf0019ec0u)	/* Message Object 118 Function Control Register */
#define CAN_MOFCR119	(*( CAN_MOFCR0_type *) 0xf0019ee0u)	/* Message Object 119 Function Control Register */
#define CAN_MOFCR12	(*( CAN_MOFCR0_type *) 0xf0019180u)	/* Message Object 12 Function Control Register */
#define CAN_MOFCR120	(*( CAN_MOFCR0_type *) 0xf0019f00u)	/* Message Object 120 Function Control Register */
#define CAN_MOFCR121	(*( CAN_MOFCR0_type *) 0xf0019f20u)	/* Message Object 121 Function Control Register */
#define CAN_MOFCR122	(*( CAN_MOFCR0_type *) 0xf0019f40u)	/* Message Object 122 Function Control Register */
#define CAN_MOFCR123	(*( CAN_MOFCR0_type *) 0xf0019f60u)	/* Message Object 123 Function Control Register */
#define CAN_MOFCR124	(*( CAN_MOFCR0_type *) 0xf0019f80u)	/* Message Object 124 Function Control Register */
#define CAN_MOFCR125	(*( CAN_MOFCR0_type *) 0xf0019fa0u)	/* Message Object 125 Function Control Register */
#define CAN_MOFCR126	(*( CAN_MOFCR0_type *) 0xf0019fc0u)	/* Message Object 126 Function Control Register */
#define CAN_MOFCR127	(*( CAN_MOFCR0_type *) 0xf0019fe0u)	/* Message Object 127 Function Control Register */
#define CAN_MOFCR128	(*( CAN_MOFCR0_type *) 0xf001a000u)	/* Message Object 128 Function Control Register */
#define CAN_MOFCR129	(*( CAN_MOFCR0_type *) 0xf001a020u)	/* Message Object 129 Function Control Register */
#define CAN_MOFCR13	(*( CAN_MOFCR0_type *) 0xf00191a0u)	/* Message Object 13 Function Control Register */
#define CAN_MOFCR130	(*( CAN_MOFCR0_type *) 0xf001a040u)	/* Message Object 130 Function Control Register */
#define CAN_MOFCR131	(*( CAN_MOFCR0_type *) 0xf001a060u)	/* Message Object 131 Function Control Register */
#define CAN_MOFCR132	(*( CAN_MOFCR0_type *) 0xf001a080u)	/* Message Object 132 Function Control Register */
#define CAN_MOFCR133	(*( CAN_MOFCR0_type *) 0xf001a0a0u)	/* Message Object 133 Function Control Register */
#define CAN_MOFCR134	(*( CAN_MOFCR0_type *) 0xf001a0c0u)	/* Message Object 134 Function Control Register */
#define CAN_MOFCR135	(*( CAN_MOFCR0_type *) 0xf001a0e0u)	/* Message Object 135 Function Control Register */
#define CAN_MOFCR136	(*( CAN_MOFCR0_type *) 0xf001a100u)	/* Message Object 136 Function Control Register */
#define CAN_MOFCR137	(*( CAN_MOFCR0_type *) 0xf001a120u)	/* Message Object 137 Function Control Register */
#define CAN_MOFCR138	(*( CAN_MOFCR0_type *) 0xf001a140u)	/* Message Object 138 Function Control Register */
#define CAN_MOFCR139	(*( CAN_MOFCR0_type *) 0xf001a160u)	/* Message Object 139 Function Control Register */
#define CAN_MOFCR14	(*( CAN_MOFCR0_type *) 0xf00191c0u)	/* Message Object 14 Function Control Register */
#define CAN_MOFCR140	(*( CAN_MOFCR0_type *) 0xf001a180u)	/* Message Object 140 Function Control Register */
#define CAN_MOFCR141	(*( CAN_MOFCR0_type *) 0xf001a1a0u)	/* Message Object 141 Function Control Register */
#define CAN_MOFCR142	(*( CAN_MOFCR0_type *) 0xf001a1c0u)	/* Message Object 142 Function Control Register */
#define CAN_MOFCR143	(*( CAN_MOFCR0_type *) 0xf001a1e0u)	/* Message Object 143 Function Control Register */
#define CAN_MOFCR144	(*( CAN_MOFCR0_type *) 0xf001a200u)	/* Message Object 144 Function Control Register */
#define CAN_MOFCR145	(*( CAN_MOFCR0_type *) 0xf001a220u)	/* Message Object 145 Function Control Register */
#define CAN_MOFCR146	(*( CAN_MOFCR0_type *) 0xf001a240u)	/* Message Object 146 Function Control Register */
#define CAN_MOFCR147	(*( CAN_MOFCR0_type *) 0xf001a260u)	/* Message Object 147 Function Control Register */
#define CAN_MOFCR148	(*( CAN_MOFCR0_type *) 0xf001a280u)	/* Message Object 148 Function Control Register */
#define CAN_MOFCR149	(*( CAN_MOFCR0_type *) 0xf001a2a0u)	/* Message Object 149 Function Control Register */
#define CAN_MOFCR15	(*( CAN_MOFCR0_type *) 0xf00191e0u)	/* Message Object 15 Function Control Register */
#define CAN_MOFCR150	(*( CAN_MOFCR0_type *) 0xf001a2c0u)	/* Message Object 150 Function Control Register */
#define CAN_MOFCR151	(*( CAN_MOFCR0_type *) 0xf001a2e0u)	/* Message Object 151 Function Control Register */
#define CAN_MOFCR152	(*( CAN_MOFCR0_type *) 0xf001a300u)	/* Message Object 152 Function Control Register */
#define CAN_MOFCR153	(*( CAN_MOFCR0_type *) 0xf001a320u)	/* Message Object 153 Function Control Register */
#define CAN_MOFCR154	(*( CAN_MOFCR0_type *) 0xf001a340u)	/* Message Object 154 Function Control Register */
#define CAN_MOFCR155	(*( CAN_MOFCR0_type *) 0xf001a360u)	/* Message Object 155 Function Control Register */
#define CAN_MOFCR156	(*( CAN_MOFCR0_type *) 0xf001a380u)	/* Message Object 156 Function Control Register */
#define CAN_MOFCR157	(*( CAN_MOFCR0_type *) 0xf001a3a0u)	/* Message Object 157 Function Control Register */
#define CAN_MOFCR158	(*( CAN_MOFCR0_type *) 0xf001a3c0u)	/* Message Object 158 Function Control Register */
#define CAN_MOFCR159	(*( CAN_MOFCR0_type *) 0xf001a3e0u)	/* Message Object 159 Function Control Register */
#define CAN_MOFCR16	(*( CAN_MOFCR0_type *) 0xf0019200u)	/* Message Object 16 Function Control Register */
#define CAN_MOFCR160	(*( CAN_MOFCR0_type *) 0xf001a400u)	/* Message Object 160 Function Control Register */
#define CAN_MOFCR161	(*( CAN_MOFCR0_type *) 0xf001a420u)	/* Message Object 161 Function Control Register */
#define CAN_MOFCR162	(*( CAN_MOFCR0_type *) 0xf001a440u)	/* Message Object 162 Function Control Register */
#define CAN_MOFCR163	(*( CAN_MOFCR0_type *) 0xf001a460u)	/* Message Object 163 Function Control Register */
#define CAN_MOFCR164	(*( CAN_MOFCR0_type *) 0xf001a480u)	/* Message Object 164 Function Control Register */
#define CAN_MOFCR165	(*( CAN_MOFCR0_type *) 0xf001a4a0u)	/* Message Object 165 Function Control Register */
#define CAN_MOFCR166	(*( CAN_MOFCR0_type *) 0xf001a4c0u)	/* Message Object 166 Function Control Register */
#define CAN_MOFCR167	(*( CAN_MOFCR0_type *) 0xf001a4e0u)	/* Message Object 167 Function Control Register */
#define CAN_MOFCR168	(*( CAN_MOFCR0_type *) 0xf001a500u)	/* Message Object 168 Function Control Register */
#define CAN_MOFCR169	(*( CAN_MOFCR0_type *) 0xf001a520u)	/* Message Object 169 Function Control Register */
#define CAN_MOFCR17	(*( CAN_MOFCR0_type *) 0xf0019220u)	/* Message Object 17 Function Control Register */
#define CAN_MOFCR170	(*( CAN_MOFCR0_type *) 0xf001a540u)	/* Message Object 170 Function Control Register */
#define CAN_MOFCR171	(*( CAN_MOFCR0_type *) 0xf001a560u)	/* Message Object 171 Function Control Register */
#define CAN_MOFCR172	(*( CAN_MOFCR0_type *) 0xf001a580u)	/* Message Object 172 Function Control Register */
#define CAN_MOFCR173	(*( CAN_MOFCR0_type *) 0xf001a5a0u)	/* Message Object 173 Function Control Register */
#define CAN_MOFCR174	(*( CAN_MOFCR0_type *) 0xf001a5c0u)	/* Message Object 174 Function Control Register */
#define CAN_MOFCR175	(*( CAN_MOFCR0_type *) 0xf001a5e0u)	/* Message Object 175 Function Control Register */
#define CAN_MOFCR176	(*( CAN_MOFCR0_type *) 0xf001a600u)	/* Message Object 176 Function Control Register */
#define CAN_MOFCR177	(*( CAN_MOFCR0_type *) 0xf001a620u)	/* Message Object 177 Function Control Register */
#define CAN_MOFCR178	(*( CAN_MOFCR0_type *) 0xf001a640u)	/* Message Object 178 Function Control Register */
#define CAN_MOFCR179	(*( CAN_MOFCR0_type *) 0xf001a660u)	/* Message Object 179 Function Control Register */
#define CAN_MOFCR18	(*( CAN_MOFCR0_type *) 0xf0019240u)	/* Message Object 18 Function Control Register */
#define CAN_MOFCR180	(*( CAN_MOFCR0_type *) 0xf001a680u)	/* Message Object 180 Function Control Register */
#define CAN_MOFCR181	(*( CAN_MOFCR0_type *) 0xf001a6a0u)	/* Message Object 181 Function Control Register */
#define CAN_MOFCR182	(*( CAN_MOFCR0_type *) 0xf001a6c0u)	/* Message Object 182 Function Control Register */
#define CAN_MOFCR183	(*( CAN_MOFCR0_type *) 0xf001a6e0u)	/* Message Object 183 Function Control Register */
#define CAN_MOFCR184	(*( CAN_MOFCR0_type *) 0xf001a700u)	/* Message Object 184 Function Control Register */
#define CAN_MOFCR185	(*( CAN_MOFCR0_type *) 0xf001a720u)	/* Message Object 185 Function Control Register */
#define CAN_MOFCR186	(*( CAN_MOFCR0_type *) 0xf001a740u)	/* Message Object 186 Function Control Register */
#define CAN_MOFCR187	(*( CAN_MOFCR0_type *) 0xf001a760u)	/* Message Object 187 Function Control Register */
#define CAN_MOFCR188	(*( CAN_MOFCR0_type *) 0xf001a780u)	/* Message Object 188 Function Control Register */
#define CAN_MOFCR189	(*( CAN_MOFCR0_type *) 0xf001a7a0u)	/* Message Object 189 Function Control Register */
#define CAN_MOFCR19	(*( CAN_MOFCR0_type *) 0xf0019260u)	/* Message Object 19 Function Control Register */
#define CAN_MOFCR190	(*( CAN_MOFCR0_type *) 0xf001a7c0u)	/* Message Object 190 Function Control Register */
#define CAN_MOFCR191	(*( CAN_MOFCR0_type *) 0xf001a7e0u)	/* Message Object 191 Function Control Register */
#define CAN_MOFCR192	(*( CAN_MOFCR0_type *) 0xf001a800u)	/* Message Object 192 Function Control Register */
#define CAN_MOFCR193	(*( CAN_MOFCR0_type *) 0xf001a820u)	/* Message Object 193 Function Control Register */
#define CAN_MOFCR194	(*( CAN_MOFCR0_type *) 0xf001a840u)	/* Message Object 194 Function Control Register */
#define CAN_MOFCR195	(*( CAN_MOFCR0_type *) 0xf001a860u)	/* Message Object 195 Function Control Register */
#define CAN_MOFCR196	(*( CAN_MOFCR0_type *) 0xf001a880u)	/* Message Object 196 Function Control Register */
#define CAN_MOFCR197	(*( CAN_MOFCR0_type *) 0xf001a8a0u)	/* Message Object 197 Function Control Register */
#define CAN_MOFCR198	(*( CAN_MOFCR0_type *) 0xf001a8c0u)	/* Message Object 198 Function Control Register */
#define CAN_MOFCR199	(*( CAN_MOFCR0_type *) 0xf001a8e0u)	/* Message Object 199 Function Control Register */
#define CAN_MOFCR2	(*( CAN_MOFCR0_type *) 0xf0019040u)	/* Message Object 2 Function Control Register */
#define CAN_MOFCR20	(*( CAN_MOFCR0_type *) 0xf0019280u)	/* Message Object 20 Function Control Register */
#define CAN_MOFCR200	(*( CAN_MOFCR0_type *) 0xf001a900u)	/* Message Object 200 Function Control Register */
#define CAN_MOFCR201	(*( CAN_MOFCR0_type *) 0xf001a920u)	/* Message Object 201 Function Control Register */
#define CAN_MOFCR202	(*( CAN_MOFCR0_type *) 0xf001a940u)	/* Message Object 202 Function Control Register */
#define CAN_MOFCR203	(*( CAN_MOFCR0_type *) 0xf001a960u)	/* Message Object 203 Function Control Register */
#define CAN_MOFCR204	(*( CAN_MOFCR0_type *) 0xf001a980u)	/* Message Object 204 Function Control Register */
#define CAN_MOFCR205	(*( CAN_MOFCR0_type *) 0xf001a9a0u)	/* Message Object 205 Function Control Register */
#define CAN_MOFCR206	(*( CAN_MOFCR0_type *) 0xf001a9c0u)	/* Message Object 206 Function Control Register */
#define CAN_MOFCR207	(*( CAN_MOFCR0_type *) 0xf001a9e0u)	/* Message Object 207 Function Control Register */
#define CAN_MOFCR208	(*( CAN_MOFCR0_type *) 0xf001aa00u)	/* Message Object 208 Function Control Register */
#define CAN_MOFCR209	(*( CAN_MOFCR0_type *) 0xf001aa20u)	/* Message Object 209 Function Control Register */
#define CAN_MOFCR21	(*( CAN_MOFCR0_type *) 0xf00192a0u)	/* Message Object 21 Function Control Register */
#define CAN_MOFCR210	(*( CAN_MOFCR0_type *) 0xf001aa40u)	/* Message Object 210 Function Control Register */
#define CAN_MOFCR211	(*( CAN_MOFCR0_type *) 0xf001aa60u)	/* Message Object 211 Function Control Register */
#define CAN_MOFCR212	(*( CAN_MOFCR0_type *) 0xf001aa80u)	/* Message Object 212 Function Control Register */
#define CAN_MOFCR213	(*( CAN_MOFCR0_type *) 0xf001aaa0u)	/* Message Object 213 Function Control Register */
#define CAN_MOFCR214	(*( CAN_MOFCR0_type *) 0xf001aac0u)	/* Message Object 214 Function Control Register */
#define CAN_MOFCR215	(*( CAN_MOFCR0_type *) 0xf001aae0u)	/* Message Object 215 Function Control Register */
#define CAN_MOFCR216	(*( CAN_MOFCR0_type *) 0xf001ab00u)	/* Message Object 216 Function Control Register */
#define CAN_MOFCR217	(*( CAN_MOFCR0_type *) 0xf001ab20u)	/* Message Object 217 Function Control Register */
#define CAN_MOFCR218	(*( CAN_MOFCR0_type *) 0xf001ab40u)	/* Message Object 218 Function Control Register */
#define CAN_MOFCR219	(*( CAN_MOFCR0_type *) 0xf001ab60u)	/* Message Object 219 Function Control Register */
#define CAN_MOFCR22	(*( CAN_MOFCR0_type *) 0xf00192c0u)	/* Message Object 22 Function Control Register */
#define CAN_MOFCR220	(*( CAN_MOFCR0_type *) 0xf001ab80u)	/* Message Object 220 Function Control Register */
#define CAN_MOFCR221	(*( CAN_MOFCR0_type *) 0xf001aba0u)	/* Message Object 221 Function Control Register */
#define CAN_MOFCR222	(*( CAN_MOFCR0_type *) 0xf001abc0u)	/* Message Object 222 Function Control Register */
#define CAN_MOFCR223	(*( CAN_MOFCR0_type *) 0xf001abe0u)	/* Message Object 223 Function Control Register */
#define CAN_MOFCR224	(*( CAN_MOFCR0_type *) 0xf001ac00u)	/* Message Object 224 Function Control Register */
#define CAN_MOFCR225	(*( CAN_MOFCR0_type *) 0xf001ac20u)	/* Message Object 225 Function Control Register */
#define CAN_MOFCR226	(*( CAN_MOFCR0_type *) 0xf001ac40u)	/* Message Object 226 Function Control Register */
#define CAN_MOFCR227	(*( CAN_MOFCR0_type *) 0xf001ac60u)	/* Message Object 227 Function Control Register */
#define CAN_MOFCR228	(*( CAN_MOFCR0_type *) 0xf001ac80u)	/* Message Object 228 Function Control Register */
#define CAN_MOFCR229	(*( CAN_MOFCR0_type *) 0xf001aca0u)	/* Message Object 229 Function Control Register */
#define CAN_MOFCR23	(*( CAN_MOFCR0_type *) 0xf00192e0u)	/* Message Object 23 Function Control Register */
#define CAN_MOFCR230	(*( CAN_MOFCR0_type *) 0xf001acc0u)	/* Message Object 230 Function Control Register */
#define CAN_MOFCR231	(*( CAN_MOFCR0_type *) 0xf001ace0u)	/* Message Object 231 Function Control Register */
#define CAN_MOFCR232	(*( CAN_MOFCR0_type *) 0xf001ad00u)	/* Message Object 232 Function Control Register */
#define CAN_MOFCR233	(*( CAN_MOFCR0_type *) 0xf001ad20u)	/* Message Object 233 Function Control Register */
#define CAN_MOFCR234	(*( CAN_MOFCR0_type *) 0xf001ad40u)	/* Message Object 234 Function Control Register */
#define CAN_MOFCR235	(*( CAN_MOFCR0_type *) 0xf001ad60u)	/* Message Object 235 Function Control Register */
#define CAN_MOFCR236	(*( CAN_MOFCR0_type *) 0xf001ad80u)	/* Message Object 236 Function Control Register */
#define CAN_MOFCR237	(*( CAN_MOFCR0_type *) 0xf001ada0u)	/* Message Object 237 Function Control Register */
#define CAN_MOFCR238	(*( CAN_MOFCR0_type *) 0xf001adc0u)	/* Message Object 238 Function Control Register */
#define CAN_MOFCR239	(*( CAN_MOFCR0_type *) 0xf001ade0u)	/* Message Object 239 Function Control Register */
#define CAN_MOFCR24	(*( CAN_MOFCR0_type *) 0xf0019300u)	/* Message Object 24 Function Control Register */
#define CAN_MOFCR240	(*( CAN_MOFCR0_type *) 0xf001ae00u)	/* Message Object 240 Function Control Register */
#define CAN_MOFCR241	(*( CAN_MOFCR0_type *) 0xf001ae20u)	/* Message Object 241 Function Control Register */
#define CAN_MOFCR242	(*( CAN_MOFCR0_type *) 0xf001ae40u)	/* Message Object 242 Function Control Register */
#define CAN_MOFCR243	(*( CAN_MOFCR0_type *) 0xf001ae60u)	/* Message Object 243 Function Control Register */
#define CAN_MOFCR244	(*( CAN_MOFCR0_type *) 0xf001ae80u)	/* Message Object 244 Function Control Register */
#define CAN_MOFCR245	(*( CAN_MOFCR0_type *) 0xf001aea0u)	/* Message Object 245 Function Control Register */
#define CAN_MOFCR246	(*( CAN_MOFCR0_type *) 0xf001aec0u)	/* Message Object 246 Function Control Register */
#define CAN_MOFCR247	(*( CAN_MOFCR0_type *) 0xf001aee0u)	/* Message Object 247 Function Control Register */
#define CAN_MOFCR248	(*( CAN_MOFCR0_type *) 0xf001af00u)	/* Message Object 248 Function Control Register */
#define CAN_MOFCR249	(*( CAN_MOFCR0_type *) 0xf001af20u)	/* Message Object 249 Function Control Register */
#define CAN_MOFCR25	(*( CAN_MOFCR0_type *) 0xf0019320u)	/* Message Object 25 Function Control Register */
#define CAN_MOFCR250	(*( CAN_MOFCR0_type *) 0xf001af40u)	/* Message Object 250 Function Control Register */
#define CAN_MOFCR251	(*( CAN_MOFCR0_type *) 0xf001af60u)	/* Message Object 251 Function Control Register */
#define CAN_MOFCR252	(*( CAN_MOFCR0_type *) 0xf001af80u)	/* Message Object 252 Function Control Register */
#define CAN_MOFCR253	(*( CAN_MOFCR0_type *) 0xf001afa0u)	/* Message Object 253 Function Control Register */
#define CAN_MOFCR254	(*( CAN_MOFCR0_type *) 0xf001afc0u)	/* Message Object 254 Function Control Register */
#define CAN_MOFCR255	(*( CAN_MOFCR0_type *) 0xf001afe0u)	/* Message Object 255 Function Control Register */
#define CAN_MOFCR26	(*( CAN_MOFCR0_type *) 0xf0019340u)	/* Message Object 26 Function Control Register */
#define CAN_MOFCR27	(*( CAN_MOFCR0_type *) 0xf0019360u)	/* Message Object 27 Function Control Register */
#define CAN_MOFCR28	(*( CAN_MOFCR0_type *) 0xf0019380u)	/* Message Object 28 Function Control Register */
#define CAN_MOFCR29	(*( CAN_MOFCR0_type *) 0xf00193a0u)	/* Message Object 29 Function Control Register */
#define CAN_MOFCR3	(*( CAN_MOFCR0_type *) 0xf0019060u)	/* Message Object 3 Function Control Register */
#define CAN_MOFCR30	(*( CAN_MOFCR0_type *) 0xf00193c0u)	/* Message Object 30 Function Control Register */
