svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOFCR31	(*( CAN_MOFCR0_type *) 0xf00193e0u)	/* Message Object 31 Function Control Register */
#define CAN_MOFCR32	(*( CAN_MOFCR0_type *) 0xf0019400u)	/* Message Object 32 Function Control Register */
#define CAN_MOFCR33	(*( CAN_MOFCR0_type *) 0xf0019420u)	/* Message Object 33 Function Control Register */
#define CAN_MOFCR34	(*( CAN_MOFCR0_type *) 0xf0019440u)	/* Message Object 34 Function Control Register */
#define CAN_MOFCR35	(*( CAN_MOFCR0_type *) 0xf0019460u)	/* Message Object 35 Function Control Register */
#define CAN_MOFCR36	(*( CAN_MOFCR0_type *) 0xf0019480u)	/* Message Object 36 Function Control Register */
#define CAN_MOFCR37	(*( CAN_MOFCR0_type *) 0xf00194a0u)	/* Message Object 37 Function Control Register */
#define CAN_MOFCR38	(*( CAN_MOFCR0_type *) 0xf00194c0u)	/* Message Object 38 Function Control Register */
#define CAN_MOFCR39	(*( CAN_MOFCR0_type *) 0xf00194e0u)	/* Message Object 39 Function Control Register */
#define CAN_MOFCR4	(*( CAN_MOFCR0_type *) 0xf0019080u)	/* Message Object 4 Function Control Register */
#define CAN_MOFCR40	(*( CAN_MOFCR0_type *) 0xf0019500u)	/* Message Object 40 Function Control Register */
#define CAN_MOFCR41	(*( CAN_MOFCR0_type *) 0xf0019520u)	/* Message Object 41 Function Control Register */
#define CAN_MOFCR42	(*( CAN_MOFCR0_type *) 0xf0019540u)	/* Message Object 42 Function Control Register */
#define CAN_MOFCR43	(*( CAN_MOFCR0_type *) 0xf0019560u)	/* Message Object 43 Function Control Register */
#define CAN_MOFCR44	(*( CAN_MOFCR0_type *) 0xf0019580u)	/* Message Object 44 Function Control Register */
#define CAN_MOFCR45	(*( CAN_MOFCR0_type *) 0xf00195a0u)	/* Message Object 45 Function Control Register */
#define CAN_MOFCR46	(*( CAN_MOFCR0_type *) 0xf00195c0u)	/* Message Object 46 Function Control Register */
#define CAN_MOFCR47	(*( CAN_MOFCR0_type *) 0xf00195e0u)	/* Message Object 47 Function Control Register */
#define CAN_MOFCR48	(*( CAN_MOFCR0_type *) 0xf0019600u)	/* Message Object 48 Function Control Register */
#define CAN_MOFCR49	(*( CAN_MOFCR0_type *) 0xf0019620u)	/* Message Object 49 Function Control Register */
#define CAN_MOFCR5	(*( CAN_MOFCR0_type *) 0xf00190a0u)	/* Message Object 5 Function Control Register */
#define CAN_MOFCR50	(*( CAN_MOFCR0_type *) 0xf0019640u)	/* Message Object 50 Function Control Register */
#define CAN_MOFCR51	(*( CAN_MOFCR0_type *) 0xf0019660u)	/* Message Object 51 Function Control Register */
#define CAN_MOFCR52	(*( CAN_MOFCR0_type *) 0xf0019680u)	/* Message Object 52 Function Control Register */
#define CAN_MOFCR53	(*( CAN_MOFCR0_type *) 0xf00196a0u)	/* Message Object 53 Function Control Register */
#define CAN_MOFCR54	(*( CAN_MOFCR0_type *) 0xf00196c0u)	/* Message Object 54 Function Control Register */
#define CAN_MOFCR55	(*( CAN_MOFCR0_type *) 0xf00196e0u)	/* Message Object 55 Function Control Register */
#define CAN_MOFCR56	(*( CAN_MOFCR0_type *) 0xf0019700u)	/* Message Object 56 Function Control Register */
#define CAN_MOFCR57	(*( CAN_MOFCR0_type *) 0xf0019720u)	/* Message Object 57 Function Control Register */
#define CAN_MOFCR58	(*( CAN_MOFCR0_type *) 0xf0019740u)	/* Message Object 58 Function Control Register */
#define CAN_MOFCR59	(*( CAN_MOFCR0_type *) 0xf0019760u)	/* Message Object 59 Function Control Register */
#define CAN_MOFCR6	(*( CAN_MOFCR0_type *) 0xf00190c0u)	/* Message Object 6 Function Control Register */
#define CAN_MOFCR60	(*( CAN_MOFCR0_type *) 0xf0019780u)	/* Message Object 60 Function Control Register */
#define CAN_MOFCR61	(*( CAN_MOFCR0_type *) 0xf00197a0u)	/* Message Object 61 Function Control Register */
#define CAN_MOFCR62	(*( CAN_MOFCR0_type *) 0xf00197c0u)	/* Message Object 62 Function Control Register */
#define CAN_MOFCR63	(*( CAN_MOFCR0_type *) 0xf00197e0u)	/* Message Object 63 Function Control Register */
#define CAN_MOFCR64	(*( CAN_MOFCR0_type *) 0xf0019800u)	/* Message Object 64 Function Control Register */
#define CAN_MOFCR65	(*( CAN_MOFCR0_type *) 0xf0019820u)	/* Message Object 65 Function Control Register */
#define CAN_MOFCR66	(*( CAN_MOFCR0_type *) 0xf0019840u)	/* Message Object 66 Function Control Register */
#define CAN_MOFCR67	(*( CAN_MOFCR0_type *) 0xf0019860u)	/* Message Object 67 Function Control Register */
#define CAN_MOFCR68	(*( CAN_MOFCR0_type *) 0xf0019880u)	/* Message Object 68 Function Control Register */
#define CAN_MOFCR69	(*( CAN_MOFCR0_type *) 0xf00198a0u)	/* Message Object 69 Function Control Register */
#define CAN_MOFCR7	(*( CAN_MOFCR0_type *) 0xf00190e0u)	/* Message Object 7 Function Control Register */
#define CAN_MOFCR70	(*( CAN_MOFCR0_type *) 0xf00198c0u)	/* Message Object 70 Function Control Register */
#define CAN_MOFCR71	(*( CAN_MOFCR0_type *) 0xf00198e0u)	/* Message Object 71 Function Control Register */
#define CAN_MOFCR72	(*( CAN_MOFCR0_type *) 0xf0019900u)	/* Message Object 72 Function Control Register */
#define CAN_MOFCR73	(*( CAN_MOFCR0_type *) 0xf0019920u)	/* Message Object 73 Function Control Register */
#define CAN_MOFCR74	(*( CAN_MOFCR0_type *) 0xf0019940u)	/* Message Object 74 Function Control Register */
#define CAN_MOFCR75	(*( CAN_MOFCR0_type *) 0xf0019960u)	/* Message Object 75 Function Control Register */
#define CAN_MOFCR76	(*( CAN_MOFCR0_type *) 0xf0019980u)	/* Message Object 76 Function Control Register */
#define CAN_MOFCR77	(*( CAN_MOFCR0_type *) 0xf00199a0u)	/* Message Object 77 Function Control Register */
#define CAN_MOFCR78	(*( CAN_MOFCR0_type *) 0xf00199c0u)	/* Message Object 78 Function Control Register */
#define CAN_MOFCR79	(*( CAN_MOFCR0_type *) 0xf00199e0u)	/* Message Object 79 Function Control Register */
#define CAN_MOFCR8	(*( CAN_MOFCR0_type *) 0xf0019100u)	/* Message Object 8 Function Control Register */
#define CAN_MOFCR80	(*( CAN_MOFCR0_type *) 0xf0019a00u)	/* Message Object 80 Function Control Register */
#define CAN_MOFCR81	(*( CAN_MOFCR0_type *) 0xf0019a20u)	/* Message Object 81 Function Control Register */
#define CAN_MOFCR82	(*( CAN_MOFCR0_type *) 0xf0019a40u)	/* Message Object 82 Function Control Register */
#define CAN_MOFCR83	(*( CAN_MOFCR0_type *) 0xf0019a60u)	/* Message Object 83 Function Control Register */
#define CAN_MOFCR84	(*( CAN_MOFCR0_type *) 0xf0019a80u)	/* Message Object 84 Function Control Register */
#define CAN_MOFCR85	(*( CAN_MOFCR0_type *) 0xf0019aa0u)	/* Message Object 85 Function Control Register */
#define CAN_MOFCR86	(*( CAN_MOFCR0_type *) 0xf0019ac0u)	/* Message Object 86 Function Control Register */
#define CAN_MOFCR87	(*( CAN_MOFCR0_type *) 0xf0019ae0u)	/* Message Object 87 Function Control Register */
#define CAN_MOFCR88	(*( CAN_MOFCR0_type *) 0xf0019b00u)	/* Message Object 88 Function Control Register */
#define CAN_MOFCR89	(*( CAN_MOFCR0_type *) 0xf0019b20u)	/* Message Object 89 Function Control Register */
#define CAN_MOFCR9	(*( CAN_MOFCR0_type *) 0xf0019120u)	/* Message Object 9 Function Control Register */
#define CAN_MOFCR90	(*( CAN_MOFCR0_type *) 0xf0019b40u)	/* Message Object 90 Function Control Register */
#define CAN_MOFCR91	(*( CAN_MOFCR0_type *) 0xf0019b60u)	/* Message Object 91 Function Control Register */
#define CAN_MOFCR92	(*( CAN_MOFCR0_type *) 0xf0019b80u)	/* Message Object 92 Function Control Register */
#define CAN_MOFCR93	(*( CAN_MOFCR0_type *) 0xf0019ba0u)	/* Message Object 93 Function Control Register */
#define CAN_MOFCR94	(*( CAN_MOFCR0_type *) 0xf0019bc0u)	/* Message Object 94 Function Control Register */
#define CAN_MOFCR95	(*( CAN_MOFCR0_type *) 0xf0019be0u)	/* Message Object 95 Function Control Register */
#define CAN_MOFCR96	(*( CAN_MOFCR0_type *) 0xf0019c00u)	/* Message Object 96 Function Control Register */
#define CAN_MOFCR97	(*( CAN_MOFCR0_type *) 0xf0019c20u)	/* Message Object 97 Function Control Register */
#define CAN_MOFCR98	(*( CAN_MOFCR0_type *) 0xf0019c40u)	/* Message Object 98 Function Control Register */
#define CAN_MOFCR99	(*( CAN_MOFCR0_type *) 0xf0019c60u)	/* Message Object 99 Function Control Register */

