svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int BOT            : 8;	/* Bottom Pointer */
		unsigned int TOP            : 8;	/* Top Pointer */
		unsigned int CUR            : 8;	/* Current Object Pointer */
		unsigned int SEL            : 8;	/* Object Select Pointer */
	} B;
	int I;
	unsigned int U;

} CAN_MOFGPR0_type;
#define CAN_MOFGPR0	(*( CAN_MOFGPR0_type *) 0xf0019004u)	/* Message Object 0 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR1	(*( CAN_MOFGPR0_type *) 0xf0019024u)	/* Message Object 1 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR10	(*( CAN_MOFGPR0_type *) 0xf0019144u)	/* Message Object 10 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR100	(*( CAN_MOFGPR0_type *) 0xf0019c84u)	/* Message Object 100 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR101	(*( CAN_MOFGPR0_type *) 0xf0019ca4u)	/* Message Object 101 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR102	(*( CAN_MOFGPR0_type *) 0xf0019cc4u)	/* Message Object 102 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR103	(*( CAN_MOFGPR0_type *) 0xf0019ce4u)	/* Message Object 103 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR104	(*( CAN_MOFGPR0_type *) 0xf0019d04u)	/* Message Object 104 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR105	(*( CAN_MOFGPR0_type *) 0xf0019d24u)	/* Message Object 105 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR106	(*( CAN_MOFGPR0_type *) 0xf0019d44u)	/* Message Object 106 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR107	(*( CAN_MOFGPR0_type *) 0xf0019d64u)	/* Message Object 107 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR108	(*( CAN_MOFGPR0_type *) 0xf0019d84u)	/* Message Object 108 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR109	(*( CAN_MOFGPR0_type *) 0xf0019da4u)	/* Message Object 109 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR11	(*( CAN_MOFGPR0_type *) 0xf0019164u)	/* Message Object 11 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR110	(*( CAN_MOFGPR0_type *) 0xf0019dc4u)	/* Message Object 110 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR111	(*( CAN_MOFGPR0_type *) 0xf0019de4u)	/* Message Object 111 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR112	(*( CAN_MOFGPR0_type *) 0xf0019e04u)	/* Message Object 112 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR113	(*( CAN_MOFGPR0_type *) 0xf0019e24u)	/* Message Object 113 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR114	(*( CAN_MOFGPR0_type *) 0xf0019e44u)	/* Message Object 114 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR115	(*( CAN_MOFGPR0_type *) 0xf0019e64u)	/* Message Object 115 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR116	(*( CAN_MOFGPR0_type *) 0xf0019e84u)	/* Message Object 116 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR117	(*( CAN_MOFGPR0_type *) 0xf0019ea4u)	/* Message Object 117 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR118	(*( CAN_MOFGPR0_type *) 0xf0019ec4u)	/* Message Object 118 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR119	(*( CAN_MOFGPR0_type *) 0xf0019ee4u)	/* Message Object 119 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR12	(*( CAN_MOFGPR0_type *) 0xf0019184u)	/* Message Object 12 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR120	(*( CAN_MOFGPR0_type *) 0xf0019f04u)	/* Message Object 120 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR121	(*( CAN_MOFGPR0_type *) 0xf0019f24u)	/* Message Object 121 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR122	(*( CAN_MOFGPR0_type *) 0xf0019f44u)	/* Message Object 122 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR123	(*( CAN_MOFGPR0_type *) 0xf0019f64u)	/* Message Object 123 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR124	(*( CAN_MOFGPR0_type *) 0xf0019f84u)	/* Message Object 124 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR125	(*( CAN_MOFGPR0_type *) 0xf0019fa4u)	/* Message Object 125 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR126	(*( CAN_MOFGPR0_type *) 0xf0019fc4u)	/* Message Object 126 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR127	(*( CAN_MOFGPR0_type *) 0xf0019fe4u)	/* Message Object 127 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR128	(*( CAN_MOFGPR0_type *) 0xf001a004u)	/* Message Object 128 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR129	(*( CAN_MOFGPR0_type *) 0xf001a024u)	/* Message Object 129 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR13	(*( CAN_MOFGPR0_type *) 0xf00191a4u)	/* Message Object 13 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR130	(*( CAN_MOFGPR0_type *) 0xf001a044u)	/* Message Object 130 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR131	(*( CAN_MOFGPR0_type *) 0xf001a064u)	/* Message Object 131 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR132	(*( CAN_MOFGPR0_type *) 0xf001a084u)	/* Message Object 132 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR133	(*( CAN_MOFGPR0_type *) 0xf001a0a4u)	/* Message Object 133 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR134	(*( CAN_MOFGPR0_type *) 0xf001a0c4u)	/* Message Object 134 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR135	(*( CAN_MOFGPR0_type *) 0xf001a0e4u)	/* Message Object 135 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR136	(*( CAN_MOFGPR0_type *) 0xf001a104u)	/* Message Object 136 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR137	(*( CAN_MOFGPR0_type *) 0xf001a124u)	/* Message Object 137 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR138	(*( CAN_MOFGPR0_type *) 0xf001a144u)	/* Message Object 138 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR139	(*( CAN_MOFGPR0_type *) 0xf001a164u)	/* Message Object 139 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR14	(*( CAN_MOFGPR0_type *) 0xf00191c4u)	/* Message Object 14 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR140	(*( CAN_MOFGPR0_type *) 0xf001a184u)	/* Message Object 140 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR141	(*( CAN_MOFGPR0_type *) 0xf001a1a4u)	/* Message Object 141 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR142	(*( CAN_MOFGPR0_type *) 0xf001a1c4u)	/* Message Object 142 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR143	(*( CAN_MOFGPR0_type *) 0xf001a1e4u)	/* Message Object 143 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR144	(*( CAN_MOFGPR0_type *) 0xf001a204u)	/* Message Object 144 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR145	(*( CAN_MOFGPR0_type *) 0xf001a224u)	/* Message Object 145 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR146	(*( CAN_MOFGPR0_type *) 0xf001a244u)	/* Message Object 146 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR147	(*( CAN_MOFGPR0_type *) 0xf001a264u)	/* Message Object 147 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR148	(*( CAN_MOFGPR0_type *) 0xf001a284u)	/* Message Object 148 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR149	(*( CAN_MOFGPR0_type *) 0xf001a2a4u)	/* Message Object 149 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR15	(*( CAN_MOFGPR0_type *) 0xf00191e4u)	/* Message Object 15 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR150	(*( CAN_MOFGPR0_type *) 0xf001a2c4u)	/* Message Object 150 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR151	(*( CAN_MOFGPR0_type *) 0xf001a2e4u)	/* Message Object 151 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR152	(*( CAN_MOFGPR0_type *) 0xf001a304u)	/* Message Object 152 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR153	(*( CAN_MOFGPR0_type *) 0xf001a324u)	/* Message Object 153 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR154	(*( CAN_MOFGPR0_type *) 0xf001a344u)	/* Message Object 154 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR155	(*( CAN_MOFGPR0_type *) 0xf001a364u)	/* Message Object 155 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR156	(*( CAN_MOFGPR0_type *) 0xf001a384u)	/* Message Object 156 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR157	(*( CAN_MOFGPR0_type *) 0xf001a3a4u)	/* Message Object 157 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR158	(*( CAN_MOFGPR0_type *) 0xf001a3c4u)	/* Message Object 158 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR159	(*( CAN_MOFGPR0_type *) 0xf001a3e4u)	/* Message Object 159 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR16	(*( CAN_MOFGPR0_type *) 0xf0019204u)	/* Message Object 16 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR160	(*( CAN_MOFGPR0_type *) 0xf001a404u)	/* Message Object 160 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR161	(*( CAN_MOFGPR0_type *) 0xf001a424u)	/* Message Object 161 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR162	(*( CAN_MOFGPR0_type *) 0xf001a444u)	/* Message Object 162 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR163	(*( CAN_MOFGPR0_type *) 0xf001a464u)	/* Message Object 163 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR164	(*( CAN_MOFGPR0_type *) 0xf001a484u)	/* Message Object 164 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR165	(*( CAN_MOFGPR0_type *) 0xf001a4a4u)	/* Message Object 165 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR166	(*( CAN_MOFGPR0_type *) 0xf001a4c4u)	/* Message Object 166 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR167	(*( CAN_MOFGPR0_type *) 0xf001a4e4u)	/* Message Object 167 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR168	(*( CAN_MOFGPR0_type *) 0xf001a504u)	/* Message Object 168 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR169	(*( CAN_MOFGPR0_type *) 0xf001a524u)	/* Message Object 169 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR17	(*( CAN_MOFGPR0_type *) 0xf0019224u)	/* Message Object 17 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR170	(*( CAN_MOFGPR0_type *) 0xf001a544u)	/* Message Object 170 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR171	(*( CAN_MOFGPR0_type *) 0xf001a564u)	/* Message Object 171 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR172	(*( CAN_MOFGPR0_type *) 0xf001a584u)	/* Message Object 172 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR173	(*( CAN_MOFGPR0_type *) 0xf001a5a4u)	/* Message Object 173 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR174	(*( CAN_MOFGPR0_type *) 0xf001a5c4u)	/* Message Object 174 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR175	(*( CAN_MOFGPR0_type *) 0xf001a5e4u)	/* Message Object 175 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR176	(*( CAN_MOFGPR0_type *) 0xf001a604u)	/* Message Object 176 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR177	(*( CAN_MOFGPR0_type *) 0xf001a624u)	/* Message Object 177 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR178	(*( CAN_MOFGPR0_type *) 0xf001a644u)	/* Message Object 178 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR179	(*( CAN_MOFGPR0_type *) 0xf001a664u)	/* Message Object 179 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR18	(*( CAN_MOFGPR0_type *) 0xf0019244u)	/* Message Object 18 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR180	(*( CAN_MOFGPR0_type *) 0xf001a684u)	/* Message Object 180 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR181	(*( CAN_MOFGPR0_type *) 0xf001a6a4u)	/* Message Object 181 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR182	(*( CAN_MOFGPR0_type *) 0xf001a6c4u)	/* Message Object 182 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR183	(*( CAN_MOFGPR0_type *) 0xf001a6e4u)	/* Message Object 183 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR184	(*( CAN_MOFGPR0_type *) 0xf001a704u)	/* Message Object 184 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR185	(*( CAN_MOFGPR0_type *) 0xf001a724u)	/* Message Object 185 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR186	(*( CAN_MOFGPR0_type *) 0xf001a744u)	/* Message Object 186 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR187	(*( CAN_MOFGPR0_type *) 0xf001a764u)	/* Message Object 187 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR188	(*( CAN_MOFGPR0_type *) 0xf001a784u)	/* Message Object 188 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR189	(*( CAN_MOFGPR0_type *) 0xf001a7a4u)	/* Message Object 189 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR19	(*( CAN_MOFGPR0_type *) 0xf0019264u)	/* Message Object 19 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR190	(*( CAN_MOFGPR0_type *) 0xf001a7c4u)	/* Message Object 190 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR191	(*( CAN_MOFGPR0_type *) 0xf001a7e4u)	/* Message Object 191 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR192	(*( CAN_MOFGPR0_type *) 0xf001a804u)	/* Message Object 192 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR193	(*( CAN_MOFGPR0_type *) 0xf001a824u)	/* Message Object 193 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR194	(*( CAN_MOFGPR0_type *) 0xf001a844u)	/* Message Object 194 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR195	(*( CAN_MOFGPR0_type *) 0xf001a864u)	/* Message Object 195 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR196	(*( CAN_MOFGPR0_type *) 0xf001a884u)	/* Message Object 196 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR197	(*( CAN_MOFGPR0_type *) 0xf001a8a4u)	/* Message Object 197 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR198	(*( CAN_MOFGPR0_type *) 0xf001a8c4u)	/* Message Object 198 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR199	(*( CAN_MOFGPR0_type *) 0xf001a8e4u)	/* Message Object 199 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR2	(*( CAN_MOFGPR0_type *) 0xf0019044u)	/* Message Object 2 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR20	(*( CAN_MOFGPR0_type *) 0xf0019284u)	/* Message Object 20 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR200	(*( CAN_MOFGPR0_type *) 0xf001a904u)	/* Message Object 200 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR201	(*( CAN_MOFGPR0_type *) 0xf001a924u)	/* Message Object 201 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR202	(*( CAN_MOFGPR0_type *) 0xf001a944u)	/* Message Object 202 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR203	(*( CAN_MOFGPR0_type *) 0xf001a964u)	/* Message Object 203 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR204	(*( CAN_MOFGPR0_type *) 0xf001a984u)	/* Message Object 204 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR205	(*( CAN_MOFGPR0_type *) 0xf001a9a4u)	/* Message Object 205 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR206	(*( CAN_MOFGPR0_type *) 0xf001a9c4u)	/* Message Object 206 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR207	(*( CAN_MOFGPR0_type *) 0xf001a9e4u)	/* Message Object 207 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR208	(*( CAN_MOFGPR0_type *) 0xf001aa04u)	/* Message Object 208 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR209	(*( CAN_MOFGPR0_type *) 0xf001aa24u)	/* Message Object 209 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR21	(*( CAN_MOFGPR0_type *) 0xf00192a4u)	/* Message Object 21 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR210	(*( CAN_MOFGPR0_type *) 0xf001aa44u)	/* Message Object 210 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR211	(*( CAN_MOFGPR0_type *) 0xf001aa64u)	/* Message Object 211 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR212	(*( CAN_MOFGPR0_type *) 0xf001aa84u)	/* Message Object 212 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR213	(*( CAN_MOFGPR0_type *) 0xf001aaa4u)	/* Message Object 213 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR214	(*( CAN_MOFGPR0_type *) 0xf001aac4u)	/* Message Object 214 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR215	(*( CAN_MOFGPR0_type *) 0xf001aae4u)	/* Message Object 215 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR216	(*( CAN_MOFGPR0_type *) 0xf001ab04u)	/* Message Object 216 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR217	(*( CAN_MOFGPR0_type *) 0xf001ab24u)	/* Message Object 217 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR218	(*( CAN_MOFGPR0_type *) 0xf001ab44u)	/* Message Object 218 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR219	(*( CAN_MOFGPR0_type *) 0xf001ab64u)	/* Message Object 219 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR22	(*( CAN_MOFGPR0_type *) 0xf00192c4u)	/* Message Object 22 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR220	(*( CAN_MOFGPR0_type *) 0xf001ab84u)	/* Message Object 220 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR221	(*( CAN_MOFGPR0_type *) 0xf001aba4u)	/* Message Object 221 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR222	(*( CAN_MOFGPR0_type *) 0xf001abc4u)	/* Message Object 222 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR223	(*( CAN_MOFGPR0_type *) 0xf001abe4u)	/* Message Object 223 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR224	(*( CAN_MOFGPR0_type *) 0xf001ac04u)	/* Message Object 224 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR225	(*( CAN_MOFGPR0_type *) 0xf001ac24u)	/* Message Object 225 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR226	(*( CAN_MOFGPR0_type *) 0xf001ac44u)	/* Message Object 226 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR227	(*( CAN_MOFGPR0_type *) 0xf001ac64u)	/* Message Object 227 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR228	(*( CAN_MOFGPR0_type *) 0xf001ac84u)	/* Message Object 228 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR229	(*( CAN_MOFGPR0_type *) 0xf001aca4u)	/* Message Object 229 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR23	(*( CAN_MOFGPR0_type *) 0xf00192e4u)	/* Message Object 23 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR230	(*( CAN_MOFGPR0_type *) 0xf001acc4u)	/* Message Object 230 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR231	(*( CAN_MOFGPR0_type *) 0xf001ace4u)	/* Message Object 231 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR232	(*( CAN_MOFGPR0_type *) 0xf001ad04u)	/* Message Object 232 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR233	(*( CAN_MOFGPR0_type *) 0xf001ad24u)	/* Message Object 233 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR234	(*( CAN_MOFGPR0_type *) 0xf001ad44u)	/* Message Object 234 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR235	(*( CAN_MOFGPR0_type *) 0xf001ad64u)	/* Message Object 235 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR236	(*( CAN_MOFGPR0_type *) 0xf001ad84u)	/* Message Object 236 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR237	(*( CAN_MOFGPR0_type *) 0xf001ada4u)	/* Message Object 237 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR238	(*( CAN_MOFGPR0_type *) 0xf001adc4u)	/* Message Object 238 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR239	(*( CAN_MOFGPR0_type *) 0xf001ade4u)	/* Message Object 239 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR24	(*( CAN_MOFGPR0_type *) 0xf0019304u)	/* Message Object 24 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR240	(*( CAN_MOFGPR0_type *) 0xf001ae04u)	/* Message Object 240 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR241	(*( CAN_MOFGPR0_type *) 0xf001ae24u)	/* Message Object 241 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR242	(*( CAN_MOFGPR0_type *) 0xf001ae44u)	/* Message Object 242 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR243	(*( CAN_MOFGPR0_type *) 0xf001ae64u)	/* Message Object 243 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR244	(*( CAN_MOFGPR0_type *) 0xf001ae84u)	/* Message Object 244 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR245	(*( CAN_MOFGPR0_type *) 0xf001aea4u)	/* Message Object 245 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR246	(*( CAN_MOFGPR0_type *) 0xf001aec4u)	/* Message Object 246 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR247	(*( CAN_MOFGPR0_type *) 0xf001aee4u)	/* Message Object 247 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR248	(*( CAN_MOFGPR0_type *) 0xf001af04u)	/* Message Object 248 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR249	(*( CAN_MOFGPR0_type *) 0xf001af24u)	/* Message Object 249 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR25	(*( CAN_MOFGPR0_type *) 0xf0019324u)	/* Message Object 25 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR250	(*( CAN_MOFGPR0_type *) 0xf001af44u)	/* Message Object 250 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR251	(*( CAN_MOFGPR0_type *) 0xf001af64u)	/* Message Object 251 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR252	(*( CAN_MOFGPR0_type *) 0xf001af84u)	/* Message Object 252 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR253	(*( CAN_MOFGPR0_type *) 0xf001afa4u)	/* Message Object 253 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR254	(*( CAN_MOFGPR0_type *) 0xf001afc4u)	/* Message Object 254 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR255	(*( CAN_MOFGPR0_type *) 0xf001afe4u)	/* Message Object 255 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR26	(*( CAN_MOFGPR0_type *) 0xf0019344u)	/* Message Object 26 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR27	(*( CAN_MOFGPR0_type *) 0xf0019364u)	/* Message Object 27 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR28	(*( CAN_MOFGPR0_type *) 0xf0019384u)	/* Message Object 28 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR29	(*( CAN_MOFGPR0_type *) 0xf00193a4u)	/* Message Object 29 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR3	(*( CAN_MOFGPR0_type *) 0xf0019064u)	/* Message Object 3 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR30	(*( CAN_MOFGPR0_type *) 0xf00193c4u)	/* Message Object 30 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR31	(*( CAN_MOFGPR0_type *) 0xf00193e4u)	/* Message Object 31 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR32	(*( CAN_MOFGPR0_type *) 0xf0019404u)	/* Message Object 32 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR33	(*( CAN_MOFGPR0_type *) 0xf0019424u)	/* Message Object 33 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR34	(*( CAN_MOFGPR0_type *) 0xf0019444u)	/* Message Object 34 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR35	(*( CAN_MOFGPR0_type *) 0xf0019464u)	/* Message Object 35 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR36	(*( CAN_MOFGPR0_type *) 0xf0019484u)	/* Message Object 36 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR37	(*( CAN_MOFGPR0_type *) 0xf00194a4u)	/* Message Object 37 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR38	(*( CAN_MOFGPR0_type *) 0xf00194c4u)	/* Message Object 38 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR39	(*( CAN_MOFGPR0_type *) 0xf00194e4u)	/* Message Object 39 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR4	(*( CAN_MOFGPR0_type *) 0xf0019084u)	/* Message Object 4 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR40	(*( CAN_MOFGPR0_type *) 0xf0019504u)	/* Message Object 40 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR41	(*( CAN_MOFGPR0_type *) 0xf0019524u)	/* Message Object 41 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR42	(*( CAN_MOFGPR0_type *) 0xf0019544u)	/* Message Object 42 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR43	(*( CAN_MOFGPR0_type *) 0xf0019564u)	/* Message Object 43 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR44	(*( CAN_MOFGPR0_type *) 0xf0019584u)	/* Message Object 44 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR45	(*( CAN_MOFGPR0_type *) 0xf00195a4u)	/* Message Object 45 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR46	(*( CAN_MOFGPR0_type *) 0xf00195c4u)	/* Message Object 46 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR47	(*( CAN_MOFGPR0_type *) 0xf00195e4u)	/* Message Object 47 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR48	(*( CAN_MOFGPR0_type *) 0xf0019604u)	/* Message Object 48 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR49	(*( CAN_MOFGPR0_type *) 0xf0019624u)	/* Message Object 49 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR5	(*( CAN_MOFGPR0_type *) 0xf00190a4u)	/* Message Object 5 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR50	(*( CAN_MOFGPR0_type *) 0xf0019644u)	/* Message Object 50 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR51	(*( CAN_MOFGPR0_type *) 0xf0019664u)	/* Message Object 51 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR52	(*( CAN_MOFGPR0_type *) 0xf0019684u)	/* Message Object 52 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR53	(*( CAN_MOFGPR0_type *) 0xf00196a4u)	/* Message Object 53 FIFO/Gateway Pointer Register */
