svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOFGPR54	(*( CAN_MOFGPR0_type *) 0xf00196c4u)	/* Message Object 54 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR55	(*( CAN_MOFGPR0_type *) 0xf00196e4u)	/* Message Object 55 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR56	(*( CAN_MOFGPR0_type *) 0xf0019704u)	/* Message Object 56 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR57	(*( CAN_MOFGPR0_type *) 0xf0019724u)	/* Message Object 57 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR58	(*( CAN_MOFGPR0_type *) 0xf0019744u)	/* Message Object 58 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR59	(*( CAN_MOFGPR0_type *) 0xf0019764u)	/* Message Object 59 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR6	(*( CAN_MOFGPR0_type *) 0xf00190c4u)	/* Message Object 6 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR60	(*( CAN_MOFGPR0_type *) 0xf0019784u)	/* Message Object 60 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR61	(*( CAN_MOFGPR0_type *) 0xf00197a4u)	/* Message Object 61 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR62	(*( CAN_MOFGPR0_type *) 0xf00197c4u)	/* Message Object 62 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR63	(*( CAN_MOFGPR0_type *) 0xf00197e4u)	/* Message Object 63 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR64	(*( CAN_MOFGPR0_type *) 0xf0019804u)	/* Message Object 64 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR65	(*( CAN_MOFGPR0_type *) 0xf0019824u)	/* Message Object 65 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR66	(*( CAN_MOFGPR0_type *) 0xf0019844u)	/* Message Object 66 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR67	(*( CAN_MOFGPR0_type *) 0xf0019864u)	/* Message Object 67 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR68	(*( CAN_MOFGPR0_type *) 0xf0019884u)	/* Message Object 68 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR69	(*( CAN_MOFGPR0_type *) 0xf00198a4u)	/* Message Object 69 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR7	(*( CAN_MOFGPR0_type *) 0xf00190e4u)	/* Message Object 7 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR70	(*( CAN_MOFGPR0_type *) 0xf00198c4u)	/* Message Object 70 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR71	(*( CAN_MOFGPR0_type *) 0xf00198e4u)	/* Message Object 71 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR72	(*( CAN_MOFGPR0_type *) 0xf0019904u)	/* Message Object 72 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR73	(*( CAN_MOFGPR0_type *) 0xf0019924u)	/* Message Object 73 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR74	(*( CAN_MOFGPR0_type *) 0xf0019944u)	/* Message Object 74 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR75	(*( CAN_MOFGPR0_type *) 0xf0019964u)	/* Message Object 75 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR76	(*( CAN_MOFGPR0_type *) 0xf0019984u)	/* Message Object 76 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR77	(*( CAN_MOFGPR0_type *) 0xf00199a4u)	/* Message Object 77 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR78	(*( CAN_MOFGPR0_type *) 0xf00199c4u)	/* Message Object 78 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR79	(*( CAN_MOFGPR0_type *) 0xf00199e4u)	/* Message Object 79 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR8	(*( CAN_MOFGPR0_type *) 0xf0019104u)	/* Message Object 8 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR80	(*( CAN_MOFGPR0_type *) 0xf0019a04u)	/* Message Object 80 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR81	(*( CAN_MOFGPR0_type *) 0xf0019a24u)	/* Message Object 81 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR82	(*( CAN_MOFGPR0_type *) 0xf0019a44u)	/* Message Object 82 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR83	(*( CAN_MOFGPR0_type *) 0xf0019a64u)	/* Message Object 83 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR84	(*( CAN_MOFGPR0_type *) 0xf0019a84u)	/* Message Object 84 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR85	(*( CAN_MOFGPR0_type *) 0xf0019aa4u)	/* Message Object 85 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR86	(*( CAN_MOFGPR0_type *) 0xf0019ac4u)	/* Message Object 86 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR87	(*( CAN_MOFGPR0_type *) 0xf0019ae4u)	/* Message Object 87 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR88	(*( CAN_MOFGPR0_type *) 0xf0019b04u)	/* Message Object 88 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR89	(*( CAN_MOFGPR0_type *) 0xf0019b24u)	/* Message Object 89 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR9	(*( CAN_MOFGPR0_type *) 0xf0019124u)	/* Message Object 9 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR90	(*( CAN_MOFGPR0_type *) 0xf0019b44u)	/* Message Object 90 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR91	(*( CAN_MOFGPR0_type *) 0xf0019b64u)	/* Message Object 91 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR92	(*( CAN_MOFGPR0_type *) 0xf0019b84u)	/* Message Object 92 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR93	(*( CAN_MOFGPR0_type *) 0xf0019ba4u)	/* Message Object 93 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR94	(*( CAN_MOFGPR0_type *) 0xf0019bc4u)	/* Message Object 94 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR95	(*( CAN_MOFGPR0_type *) 0xf0019be4u)	/* Message Object 95 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR96	(*( CAN_MOFGPR0_type *) 0xf0019c04u)	/* Message Object 96 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR97	(*( CAN_MOFGPR0_type *) 0xf0019c24u)	/* Message Object 97 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR98	(*( CAN_MOFGPR0_type *) 0xf0019c44u)	/* Message Object 98 FIFO/Gateway Pointer Register */
#define CAN_MOFGPR99	(*( CAN_MOFGPR0_type *) 0xf0019c64u)	/* Message Object 99 FIFO/Gateway Pointer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXINP          : 4;	/* Receive Interrupt Node Pointer */
		unsigned int TXINP          : 4;	/* Transmit Interrupt Node Pointer */
		unsigned int MPN            : 8;	/* Message Pending Number */
		unsigned int CFCVAL         : 16;	/* CAN Frame Counter Value */
	} B;
	int I;
	unsigned int U;

} CAN_MOIPR0_type;
