svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOIPR0	(*( CAN_MOIPR0_type *) 0xf0019008u)	/* Message Object 0 Interrupt Pointer Register */
#define CAN_MOIPR1	(*( CAN_MOIPR0_type *) 0xf0019028u)	/* Message Object 1 Interrupt Pointer Register */
#define CAN_MOIPR10	(*( CAN_MOIPR0_type *) 0xf0019148u)	/* Message Object 10 Interrupt Pointer Register */
#define CAN_MOIPR100	(*( CAN_MOIPR0_type *) 0xf0019c88u)	/* Message Object 100 Interrupt Pointer Register */
#define CAN_MOIPR101	(*( CAN_MOIPR0_type *) 0xf0019ca8u)	/* Message Object 101 Interrupt Pointer Register */
#define CAN_MOIPR102	(*( CAN_MOIPR0_type *) 0xf0019cc8u)	/* Message Object 102 Interrupt Pointer Register */
#define CAN_MOIPR103	(*( CAN_MOIPR0_type *) 0xf0019ce8u)	/* Message Object 103 Interrupt Pointer Register */
#define CAN_MOIPR104	(*( CAN_MOIPR0_type *) 0xf0019d08u)	/* Message Object 104 Interrupt Pointer Register */
#define CAN_MOIPR105	(*( CAN_MOIPR0_type *) 0xf0019d28u)	/* Message Object 105 Interrupt Pointer Register */
#define CAN_MOIPR106	(*( CAN_MOIPR0_type *) 0xf0019d48u)	/* Message Object 106 Interrupt Pointer Register */
#define CAN_MOIPR107	(*( CAN_MOIPR0_type *) 0xf0019d68u)	/* Message Object 107 Interrupt Pointer Register */
#define CAN_MOIPR108	(*( CAN_MOIPR0_type *) 0xf0019d88u)	/* Message Object 108 Interrupt Pointer Register */
#define CAN_MOIPR109	(*( CAN_MOIPR0_type *) 0xf0019da8u)	/* Message Object 109 Interrupt Pointer Register */
#define CAN_MOIPR11	(*( CAN_MOIPR0_type *) 0xf0019168u)	/* Message Object 11 Interrupt Pointer Register */
#define CAN_MOIPR110	(*( CAN_MOIPR0_type *) 0xf0019dc8u)	/* Message Object 110 Interrupt Pointer Register */
#define CAN_MOIPR111	(*( CAN_MOIPR0_type *) 0xf0019de8u)	/* Message Object 111 Interrupt Pointer Register */
#define CAN_MOIPR112	(*( CAN_MOIPR0_type *) 0xf0019e08u)	/* Message Object 112 Interrupt Pointer Register */
#define CAN_MOIPR113	(*( CAN_MOIPR0_type *) 0xf0019e28u)	/* Message Object 113 Interrupt Pointer Register */
#define CAN_MOIPR114	(*( CAN_MOIPR0_type *) 0xf0019e48u)	/* Message Object 114 Interrupt Pointer Register */
#define CAN_MOIPR115	(*( CAN_MOIPR0_type *) 0xf0019e68u)	/* Message Object 115 Interrupt Pointer Register */
#define CAN_MOIPR116	(*( CAN_MOIPR0_type *) 0xf0019e88u)	/* Message Object 116 Interrupt Pointer Register */
#define CAN_MOIPR117	(*( CAN_MOIPR0_type *) 0xf0019ea8u)	/* Message Object 117 Interrupt Pointer Register */
#define CAN_MOIPR118	(*( CAN_MOIPR0_type *) 0xf0019ec8u)	/* Message Object 118 Interrupt Pointer Register */
#define CAN_MOIPR119	(*( CAN_MOIPR0_type *) 0xf0019ee8u)	/* Message Object 119 Interrupt Pointer Register */
#define CAN_MOIPR12	(*( CAN_MOIPR0_type *) 0xf0019188u)	/* Message Object 12 Interrupt Pointer Register */
#define CAN_MOIPR120	(*( CAN_MOIPR0_type *) 0xf0019f08u)	/* Message Object 120 Interrupt Pointer Register */
#define CAN_MOIPR121	(*( CAN_MOIPR0_type *) 0xf0019f28u)	/* Message Object 121 Interrupt Pointer Register */
#define CAN_MOIPR122	(*( CAN_MOIPR0_type *) 0xf0019f48u)	/* Message Object 122 Interrupt Pointer Register */
#define CAN_MOIPR123	(*( CAN_MOIPR0_type *) 0xf0019f68u)	/* Message Object 123 Interrupt Pointer Register */
#define CAN_MOIPR124	(*( CAN_MOIPR0_type *) 0xf0019f88u)	/* Message Object 124 Interrupt Pointer Register */
#define CAN_MOIPR125	(*( CAN_MOIPR0_type *) 0xf0019fa8u)	/* Message Object 125 Interrupt Pointer Register */
#define CAN_MOIPR126	(*( CAN_MOIPR0_type *) 0xf0019fc8u)	/* Message Object 126 Interrupt Pointer Register */
#define CAN_MOIPR127	(*( CAN_MOIPR0_type *) 0xf0019fe8u)	/* Message Object 127 Interrupt Pointer Register */
#define CAN_MOIPR128	(*( CAN_MOIPR0_type *) 0xf001a008u)	/* Message Object 128 Interrupt Pointer Register */
#define CAN_MOIPR129	(*( CAN_MOIPR0_type *) 0xf001a028u)	/* Message Object 129 Interrupt Pointer Register */
#define CAN_MOIPR13	(*( CAN_MOIPR0_type *) 0xf00191a8u)	/* Message Object 13 Interrupt Pointer Register */
#define CAN_MOIPR130	(*( CAN_MOIPR0_type *) 0xf001a048u)	/* Message Object 130 Interrupt Pointer Register */
#define CAN_MOIPR131	(*( CAN_MOIPR0_type *) 0xf001a068u)	/* Message Object 131 Interrupt Pointer Register */
#define CAN_MOIPR132	(*( CAN_MOIPR0_type *) 0xf001a088u)	/* Message Object 132 Interrupt Pointer Register */
#define CAN_MOIPR133	(*( CAN_MOIPR0_type *) 0xf001a0a8u)	/* Message Object 133 Interrupt Pointer Register */
#define CAN_MOIPR134	(*( CAN_MOIPR0_type *) 0xf001a0c8u)	/* Message Object 134 Interrupt Pointer Register */
#define CAN_MOIPR135	(*( CAN_MOIPR0_type *) 0xf001a0e8u)	/* Message Object 135 Interrupt Pointer Register */
#define CAN_MOIPR136	(*( CAN_MOIPR0_type *) 0xf001a108u)	/* Message Object 136 Interrupt Pointer Register */
#define CAN_MOIPR137	(*( CAN_MOIPR0_type *) 0xf001a128u)	/* Message Object 137 Interrupt Pointer Register */
#define CAN_MOIPR138	(*( CAN_MOIPR0_type *) 0xf001a148u)	/* Message Object 138 Interrupt Pointer Register */
#define CAN_MOIPR139	(*( CAN_MOIPR0_type *) 0xf001a168u)	/* Message Object 139 Interrupt Pointer Register */
#define CAN_MOIPR14	(*( CAN_MOIPR0_type *) 0xf00191c8u)	/* Message Object 14 Interrupt Pointer Register */
#define CAN_MOIPR140	(*( CAN_MOIPR0_type *) 0xf001a188u)	/* Message Object 140 Interrupt Pointer Register */
#define CAN_MOIPR141	(*( CAN_MOIPR0_type *) 0xf001a1a8u)	/* Message Object 141 Interrupt Pointer Register */
#define CAN_MOIPR142	(*( CAN_MOIPR0_type *) 0xf001a1c8u)	/* Message Object 142 Interrupt Pointer Register */
#define CAN_MOIPR143	(*( CAN_MOIPR0_type *) 0xf001a1e8u)	/* Message Object 143 Interrupt Pointer Register */
#define CAN_MOIPR144	(*( CAN_MOIPR0_type *) 0xf001a208u)	/* Message Object 144 Interrupt Pointer Register */
#define CAN_MOIPR145	(*( CAN_MOIPR0_type *) 0xf001a228u)	/* Message Object 145 Interrupt Pointer Register */
#define CAN_MOIPR146	(*( CAN_MOIPR0_type *) 0xf001a248u)	/* Message Object 146 Interrupt Pointer Register */
#define CAN_MOIPR147	(*( CAN_MOIPR0_type *) 0xf001a268u)	/* Message Object 147 Interrupt Pointer Register */
#define CAN_MOIPR148	(*( CAN_MOIPR0_type *) 0xf001a288u)	/* Message Object 148 Interrupt Pointer Register */
#define CAN_MOIPR149	(*( CAN_MOIPR0_type *) 0xf001a2a8u)	/* Message Object 149 Interrupt Pointer Register */
#define CAN_MOIPR15	(*( CAN_MOIPR0_type *) 0xf00191e8u)	/* Message Object 15 Interrupt Pointer Register */
#define CAN_MOIPR150	(*( CAN_MOIPR0_type *) 0xf001a2c8u)	/* Message Object 150 Interrupt Pointer Register */
#define CAN_MOIPR151	(*( CAN_MOIPR0_type *) 0xf001a2e8u)	/* Message Object 151 Interrupt Pointer Register */
#define CAN_MOIPR152	(*( CAN_MOIPR0_type *) 0xf001a308u)	/* Message Object 152 Interrupt Pointer Register */
#define CAN_MOIPR153	(*( CAN_MOIPR0_type *) 0xf001a328u)	/* Message Object 153 Interrupt Pointer Register */
#define CAN_MOIPR154	(*( CAN_MOIPR0_type *) 0xf001a348u)	/* Message Object 154 Interrupt Pointer Register */
#define CAN_MOIPR155	(*( CAN_MOIPR0_type *) 0xf001a368u)	/* Message Object 155 Interrupt Pointer Register */
#define CAN_MOIPR156	(*( CAN_MOIPR0_type *) 0xf001a388u)	/* Message Object 156 Interrupt Pointer Register */
#define CAN_MOIPR157	(*( CAN_MOIPR0_type *) 0xf001a3a8u)	/* Message Object 157 Interrupt Pointer Register */
#define CAN_MOIPR158	(*( CAN_MOIPR0_type *) 0xf001a3c8u)	/* Message Object 158 Interrupt Pointer Register */
#define CAN_MOIPR159	(*( CAN_MOIPR0_type *) 0xf001a3e8u)	/* Message Object 159 Interrupt Pointer Register */
#define CAN_MOIPR16	(*( CAN_MOIPR0_type *) 0xf0019208u)	/* Message Object 16 Interrupt Pointer Register */
#define CAN_MOIPR160	(*( CAN_MOIPR0_type *) 0xf001a408u)	/* Message Object 160 Interrupt Pointer Register */
#define CAN_MOIPR161	(*( CAN_MOIPR0_type *) 0xf001a428u)	/* Message Object 161 Interrupt Pointer Register */
#define CAN_MOIPR162	(*( CAN_MOIPR0_type *) 0xf001a448u)	/* Message Object 162 Interrupt Pointer Register */
#define CAN_MOIPR163	(*( CAN_MOIPR0_type *) 0xf001a468u)	/* Message Object 163 Interrupt Pointer Register */
#define CAN_MOIPR164	(*( CAN_MOIPR0_type *) 0xf001a488u)	/* Message Object 164 Interrupt Pointer Register */
#define CAN_MOIPR165	(*( CAN_MOIPR0_type *) 0xf001a4a8u)	/* Message Object 165 Interrupt Pointer Register */
#define CAN_MOIPR166	(*( CAN_MOIPR0_type *) 0xf001a4c8u)	/* Message Object 166 Interrupt Pointer Register */
#define CAN_MOIPR167	(*( CAN_MOIPR0_type *) 0xf001a4e8u)	/* Message Object 167 Interrupt Pointer Register */
#define CAN_MOIPR168	(*( CAN_MOIPR0_type *) 0xf001a508u)	/* Message Object 168 Interrupt Pointer Register */
#define CAN_MOIPR169	(*( CAN_MOIPR0_type *) 0xf001a528u)	/* Message Object 169 Interrupt Pointer Register */
#define CAN_MOIPR17	(*( CAN_MOIPR0_type *) 0xf0019228u)	/* Message Object 17 Interrupt Pointer Register */
#define CAN_MOIPR170	(*( CAN_MOIPR0_type *) 0xf001a548u)	/* Message Object 170 Interrupt Pointer Register */
#define CAN_MOIPR171	(*( CAN_MOIPR0_type *) 0xf001a568u)	/* Message Object 171 Interrupt Pointer Register */
#define CAN_MOIPR172	(*( CAN_MOIPR0_type *) 0xf001a588u)	/* Message Object 172 Interrupt Pointer Register */
#define CAN_MOIPR173	(*( CAN_MOIPR0_type *) 0xf001a5a8u)	/* Message Object 173 Interrupt Pointer Register */
#define CAN_MOIPR174	(*( CAN_MOIPR0_type *) 0xf001a5c8u)	/* Message Object 174 Interrupt Pointer Register */
#define CAN_MOIPR175	(*( CAN_MOIPR0_type *) 0xf001a5e8u)	/* Message Object 175 Interrupt Pointer Register */
#define CAN_MOIPR176	(*( CAN_MOIPR0_type *) 0xf001a608u)	/* Message Object 176 Interrupt Pointer Register */
#define CAN_MOIPR177	(*( CAN_MOIPR0_type *) 0xf001a628u)	/* Message Object 177 Interrupt Pointer Register */
#define CAN_MOIPR178	(*( CAN_MOIPR0_type *) 0xf001a648u)	/* Message Object 178 Interrupt Pointer Register */
#define CAN_MOIPR179	(*( CAN_MOIPR0_type *) 0xf001a668u)	/* Message Object 179 Interrupt Pointer Register */
#define CAN_MOIPR18	(*( CAN_MOIPR0_type *) 0xf0019248u)	/* Message Object 18 Interrupt Pointer Register */
#define CAN_MOIPR180	(*( CAN_MOIPR0_type *) 0xf001a688u)	/* Message Object 180 Interrupt Pointer Register */
#define CAN_MOIPR181	(*( CAN_MOIPR0_type *) 0xf001a6a8u)	/* Message Object 181 Interrupt Pointer Register */
#define CAN_MOIPR182	(*( CAN_MOIPR0_type *) 0xf001a6c8u)	/* Message Object 182 Interrupt Pointer Register */
#define CAN_MOIPR183	(*( CAN_MOIPR0_type *) 0xf001a6e8u)	/* Message Object 183 Interrupt Pointer Register */
#define CAN_MOIPR184	(*( CAN_MOIPR0_type *) 0xf001a708u)	/* Message Object 184 Interrupt Pointer Register */
#define CAN_MOIPR185	(*( CAN_MOIPR0_type *) 0xf001a728u)	/* Message Object 185 Interrupt Pointer Register */
#define CAN_MOIPR186	(*( CAN_MOIPR0_type *) 0xf001a748u)	/* Message Object 186 Interrupt Pointer Register */
#define CAN_MOIPR187	(*( CAN_MOIPR0_type *) 0xf001a768u)	/* Message Object 187 Interrupt Pointer Register */
#define CAN_MOIPR188	(*( CAN_MOIPR0_type *) 0xf001a788u)	/* Message Object 188 Interrupt Pointer Register */
#define CAN_MOIPR189	(*( CAN_MOIPR0_type *) 0xf001a7a8u)	/* Message Object 189 Interrupt Pointer Register */
#define CAN_MOIPR19	(*( CAN_MOIPR0_type *) 0xf0019268u)	/* Message Object 19 Interrupt Pointer Register */
#define CAN_MOIPR190	(*( CAN_MOIPR0_type *) 0xf001a7c8u)	/* Message Object 190 Interrupt Pointer Register */
#define CAN_MOIPR191	(*( CAN_MOIPR0_type *) 0xf001a7e8u)	/* Message Object 191 Interrupt Pointer Register */
#define CAN_MOIPR192	(*( CAN_MOIPR0_type *) 0xf001a808u)	/* Message Object 192 Interrupt Pointer Register */
#define CAN_MOIPR193	(*( CAN_MOIPR0_type *) 0xf001a828u)	/* Message Object 193 Interrupt Pointer Register */
#define CAN_MOIPR194	(*( CAN_MOIPR0_type *) 0xf001a848u)	/* Message Object 194 Interrupt Pointer Register */
#define CAN_MOIPR195	(*( CAN_MOIPR0_type *) 0xf001a868u)	/* Message Object 195 Interrupt Pointer Register */
#define CAN_MOIPR196	(*( CAN_MOIPR0_type *) 0xf001a888u)	/* Message Object 196 Interrupt Pointer Register */
#define CAN_MOIPR197	(*( CAN_MOIPR0_type *) 0xf001a8a8u)	/* Message Object 197 Interrupt Pointer Register */
#define CAN_MOIPR198	(*( CAN_MOIPR0_type *) 0xf001a8c8u)	/* Message Object 198 Interrupt Pointer Register */
#define CAN_MOIPR199	(*( CAN_MOIPR0_type *) 0xf001a8e8u)	/* Message Object 199 Interrupt Pointer Register */
#define CAN_MOIPR2	(*( CAN_MOIPR0_type *) 0xf0019048u)	/* Message Object 2 Interrupt Pointer Register */
#define CAN_MOIPR20	(*( CAN_MOIPR0_type *) 0xf0019288u)	/* Message Object 20 Interrupt Pointer Register */
#define CAN_MOIPR200	(*( CAN_MOIPR0_type *) 0xf001a908u)	/* Message Object 200 Interrupt Pointer Register */
#define CAN_MOIPR201	(*( CAN_MOIPR0_type *) 0xf001a928u)	/* Message Object 201 Interrupt Pointer Register */
#define CAN_MOIPR202	(*( CAN_MOIPR0_type *) 0xf001a948u)	/* Message Object 202 Interrupt Pointer Register */
#define CAN_MOIPR203	(*( CAN_MOIPR0_type *) 0xf001a968u)	/* Message Object 203 Interrupt Pointer Register */
#define CAN_MOIPR204	(*( CAN_MOIPR0_type *) 0xf001a988u)	/* Message Object 204 Interrupt Pointer Register */
#define CAN_MOIPR205	(*( CAN_MOIPR0_type *) 0xf001a9a8u)	/* Message Object 205 Interrupt Pointer Register */
#define CAN_MOIPR206	(*( CAN_MOIPR0_type *) 0xf001a9c8u)	/* Message Object 206 Interrupt Pointer Register */
#define CAN_MOIPR207	(*( CAN_MOIPR0_type *) 0xf001a9e8u)	/* Message Object 207 Interrupt Pointer Register */
#define CAN_MOIPR208	(*( CAN_MOIPR0_type *) 0xf001aa08u)	/* Message Object 208 Interrupt Pointer Register */
#define CAN_MOIPR209	(*( CAN_MOIPR0_type *) 0xf001aa28u)	/* Message Object 209 Interrupt Pointer Register */
#define CAN_MOIPR21	(*( CAN_MOIPR0_type *) 0xf00192a8u)	/* Message Object 21 Interrupt Pointer Register */
#define CAN_MOIPR210	(*( CAN_MOIPR0_type *) 0xf001aa48u)	/* Message Object 210 Interrupt Pointer Register */
#define CAN_MOIPR211	(*( CAN_MOIPR0_type *) 0xf001aa68u)	/* Message Object 211 Interrupt Pointer Register */
#define CAN_MOIPR212	(*( CAN_MOIPR0_type *) 0xf001aa88u)	/* Message Object 212 Interrupt Pointer Register */
#define CAN_MOIPR213	(*( CAN_MOIPR0_type *) 0xf001aaa8u)	/* Message Object 213 Interrupt Pointer Register */
#define CAN_MOIPR214	(*( CAN_MOIPR0_type *) 0xf001aac8u)	/* Message Object 214 Interrupt Pointer Register */
#define CAN_MOIPR215	(*( CAN_MOIPR0_type *) 0xf001aae8u)	/* Message Object 215 Interrupt Pointer Register */
#define CAN_MOIPR216	(*( CAN_MOIPR0_type *) 0xf001ab08u)	/* Message Object 216 Interrupt Pointer Register */
#define CAN_MOIPR217	(*( CAN_MOIPR0_type *) 0xf001ab28u)	/* Message Object 217 Interrupt Pointer Register */
#define CAN_MOIPR218	(*( CAN_MOIPR0_type *) 0xf001ab48u)	/* Message Object 218 Interrupt Pointer Register */
#define CAN_MOIPR219	(*( CAN_MOIPR0_type *) 0xf001ab68u)	/* Message Object 219 Interrupt Pointer Register */
#define CAN_MOIPR22	(*( CAN_MOIPR0_type *) 0xf00192c8u)	/* Message Object 22 Interrupt Pointer Register */
#define CAN_MOIPR220	(*( CAN_MOIPR0_type *) 0xf001ab88u)	/* Message Object 220 Interrupt Pointer Register */
#define CAN_MOIPR221	(*( CAN_MOIPR0_type *) 0xf001aba8u)	/* Message Object 221 Interrupt Pointer Register */
#define CAN_MOIPR222	(*( CAN_MOIPR0_type *) 0xf001abc8u)	/* Message Object 222 Interrupt Pointer Register */
#define CAN_MOIPR223	(*( CAN_MOIPR0_type *) 0xf001abe8u)	/* Message Object 223 Interrupt Pointer Register */
#define CAN_MOIPR224	(*( CAN_MOIPR0_type *) 0xf001ac08u)	/* Message Object 224 Interrupt Pointer Register */
#define CAN_MOIPR225	(*( CAN_MOIPR0_type *) 0xf001ac28u)	/* Message Object 225 Interrupt Pointer Register */
#define CAN_MOIPR226	(*( CAN_MOIPR0_type *) 0xf001ac48u)	/* Message Object 226 Interrupt Pointer Register */
#define CAN_MOIPR227	(*( CAN_MOIPR0_type *) 0xf001ac68u)	/* Message Object 227 Interrupt Pointer Register */
#define CAN_MOIPR228	(*( CAN_MOIPR0_type *) 0xf001ac88u)	/* Message Object 228 Interrupt Pointer Register */
#define CAN_MOIPR229	(*( CAN_MOIPR0_type *) 0xf001aca8u)	/* Message Object 229 Interrupt Pointer Register */
#define CAN_MOIPR23	(*( CAN_MOIPR0_type *) 0xf00192e8u)	/* Message Object 23 Interrupt Pointer Register */
#define CAN_MOIPR230	(*( CAN_MOIPR0_type *) 0xf001acc8u)	/* Message Object 230 Interrupt Pointer Register */
#define CAN_MOIPR231	(*( CAN_MOIPR0_type *) 0xf001ace8u)	/* Message Object 231 Interrupt Pointer Register */
#define CAN_MOIPR232	(*( CAN_MOIPR0_type *) 0xf001ad08u)	/* Message Object 232 Interrupt Pointer Register */
#define CAN_MOIPR233	(*( CAN_MOIPR0_type *) 0xf001ad28u)	/* Message Object 233 Interrupt Pointer Register */
#define CAN_MOIPR234	(*( CAN_MOIPR0_type *) 0xf001ad48u)	/* Message Object 234 Interrupt Pointer Register */
#define CAN_MOIPR235	(*( CAN_MOIPR0_type *) 0xf001ad68u)	/* Message Object 235 Interrupt Pointer Register */
#define CAN_MOIPR236	(*( CAN_MOIPR0_type *) 0xf001ad88u)	/* Message Object 236 Interrupt Pointer Register */
#define CAN_MOIPR237	(*( CAN_MOIPR0_type *) 0xf001ada8u)	/* Message Object 237 Interrupt Pointer Register */
#define CAN_MOIPR238	(*( CAN_MOIPR0_type *) 0xf001adc8u)	/* Message Object 238 Interrupt Pointer Register */
#define CAN_MOIPR239	(*( CAN_MOIPR0_type *) 0xf001ade8u)	/* Message Object 239 Interrupt Pointer Register */
#define CAN_MOIPR24	(*( CAN_MOIPR0_type *) 0xf0019308u)	/* Message Object 24 Interrupt Pointer Register */
#define CAN_MOIPR240	(*( CAN_MOIPR0_type *) 0xf001ae08u)	/* Message Object 240 Interrupt Pointer Register */
#define CAN_MOIPR241	(*( CAN_MOIPR0_type *) 0xf001ae28u)	/* Message Object 241 Interrupt Pointer Register */
#define CAN_MOIPR242	(*( CAN_MOIPR0_type *) 0xf001ae48u)	/* Message Object 242 Interrupt Pointer Register */
#define CAN_MOIPR243	(*( CAN_MOIPR0_type *) 0xf001ae68u)	/* Message Object 243 Interrupt Pointer Register */
#define CAN_MOIPR244	(*( CAN_MOIPR0_type *) 0xf001ae88u)	/* Message Object 244 Interrupt Pointer Register */
#define CAN_MOIPR245	(*( CAN_MOIPR0_type *) 0xf001aea8u)	/* Message Object 245 Interrupt Pointer Register */
#define CAN_MOIPR246	(*( CAN_MOIPR0_type *) 0xf001aec8u)	/* Message Object 246 Interrupt Pointer Register */
#define CAN_MOIPR247	(*( CAN_MOIPR0_type *) 0xf001aee8u)	/* Message Object 247 Interrupt Pointer Register */
#define CAN_MOIPR248	(*( CAN_MOIPR0_type *) 0xf001af08u)	/* Message Object 248 Interrupt Pointer Register */
#define CAN_MOIPR249	(*( CAN_MOIPR0_type *) 0xf001af28u)	/* Message Object 249 Interrupt Pointer Register */
#define CAN_MOIPR25	(*( CAN_MOIPR0_type *) 0xf0019328u)	/* Message Object 25 Interrupt Pointer Register */
#define CAN_MOIPR250	(*( CAN_MOIPR0_type *) 0xf001af48u)	/* Message Object 250 Interrupt Pointer Register */
#define CAN_MOIPR251	(*( CAN_MOIPR0_type *) 0xf001af68u)	/* Message Object 251 Interrupt Pointer Register */
#define CAN_MOIPR252	(*( CAN_MOIPR0_type *) 0xf001af88u)	/* Message Object 252 Interrupt Pointer Register */
#define CAN_MOIPR253	(*( CAN_MOIPR0_type *) 0xf001afa8u)	/* Message Object 253 Interrupt Pointer Register */
#define CAN_MOIPR254	(*( CAN_MOIPR0_type *) 0xf001afc8u)	/* Message Object 254 Interrupt Pointer Register */
#define CAN_MOIPR255	(*( CAN_MOIPR0_type *) 0xf001afe8u)	/* Message Object 255 Interrupt Pointer Register */
#define CAN_MOIPR26	(*( CAN_MOIPR0_type *) 0xf0019348u)	/* Message Object 26 Interrupt Pointer Register */
#define CAN_MOIPR27	(*( CAN_MOIPR0_type *) 0xf0019368u)	/* Message Object 27 Interrupt Pointer Register */
#define CAN_MOIPR28	(*( CAN_MOIPR0_type *) 0xf0019388u)	/* Message Object 28 Interrupt Pointer Register */
#define CAN_MOIPR29	(*( CAN_MOIPR0_type *) 0xf00193a8u)	/* Message Object 29 Interrupt Pointer Register */
#define CAN_MOIPR3	(*( CAN_MOIPR0_type *) 0xf0019068u)	/* Message Object 3 Interrupt Pointer Register */
#define CAN_MOIPR30	(*( CAN_MOIPR0_type *) 0xf00193c8u)	/* Message Object 30 Interrupt Pointer Register */
#define CAN_MOIPR31	(*( CAN_MOIPR0_type *) 0xf00193e8u)	/* Message Object 31 Interrupt Pointer Register */
#define CAN_MOIPR32	(*( CAN_MOIPR0_type *) 0xf0019408u)	/* Message Object 32 Interrupt Pointer Register */
#define CAN_MOIPR33	(*( CAN_MOIPR0_type *) 0xf0019428u)	/* Message Object 33 Interrupt Pointer Register */
#define CAN_MOIPR34	(*( CAN_MOIPR0_type *) 0xf0019448u)	/* Message Object 34 Interrupt Pointer Register */
#define CAN_MOIPR35	(*( CAN_MOIPR0_type *) 0xf0019468u)	/* Message Object 35 Interrupt Pointer Register */
#define CAN_MOIPR36	(*( CAN_MOIPR0_type *) 0xf0019488u)	/* Message Object 36 Interrupt Pointer Register */
#define CAN_MOIPR37	(*( CAN_MOIPR0_type *) 0xf00194a8u)	/* Message Object 37 Interrupt Pointer Register */
#define CAN_MOIPR38	(*( CAN_MOIPR0_type *) 0xf00194c8u)	/* Message Object 38 Interrupt Pointer Register */
#define CAN_MOIPR39	(*( CAN_MOIPR0_type *) 0xf00194e8u)	/* Message Object 39 Interrupt Pointer Register */
#define CAN_MOIPR4	(*( CAN_MOIPR0_type *) 0xf0019088u)	/* Message Object 4 Interrupt Pointer Register */
#define CAN_MOIPR40	(*( CAN_MOIPR0_type *) 0xf0019508u)	/* Message Object 40 Interrupt Pointer Register */
#define CAN_MOIPR41	(*( CAN_MOIPR0_type *) 0xf0019528u)	/* Message Object 41 Interrupt Pointer Register */
#define CAN_MOIPR42	(*( CAN_MOIPR0_type *) 0xf0019548u)	/* Message Object 42 Interrupt Pointer Register */
#define CAN_MOIPR43	(*( CAN_MOIPR0_type *) 0xf0019568u)	/* Message Object 43 Interrupt Pointer Register */
#define CAN_MOIPR44	(*( CAN_MOIPR0_type *) 0xf0019588u)	/* Message Object 44 Interrupt Pointer Register */
#define CAN_MOIPR45	(*( CAN_MOIPR0_type *) 0xf00195a8u)	/* Message Object 45 Interrupt Pointer Register */
#define CAN_MOIPR46	(*( CAN_MOIPR0_type *) 0xf00195c8u)	/* Message Object 46 Interrupt Pointer Register */
#define CAN_MOIPR47	(*( CAN_MOIPR0_type *) 0xf00195e8u)	/* Message Object 47 Interrupt Pointer Register */
#define CAN_MOIPR48	(*( CAN_MOIPR0_type *) 0xf0019608u)	/* Message Object 48 Interrupt Pointer Register */
#define CAN_MOIPR49	(*( CAN_MOIPR0_type *) 0xf0019628u)	/* Message Object 49 Interrupt Pointer Register */
#define CAN_MOIPR5	(*( CAN_MOIPR0_type *) 0xf00190a8u)	/* Message Object 5 Interrupt Pointer Register */
#define CAN_MOIPR50	(*( CAN_MOIPR0_type *) 0xf0019648u)	/* Message Object 50 Interrupt Pointer Register */
#define CAN_MOIPR51	(*( CAN_MOIPR0_type *) 0xf0019668u)	/* Message Object 51 Interrupt Pointer Register */
#define CAN_MOIPR52	(*( CAN_MOIPR0_type *) 0xf0019688u)	/* Message Object 52 Interrupt Pointer Register */
#define CAN_MOIPR53	(*( CAN_MOIPR0_type *) 0xf00196a8u)	/* Message Object 53 Interrupt Pointer Register */
#define CAN_MOIPR54	(*( CAN_MOIPR0_type *) 0xf00196c8u)	/* Message Object 54 Interrupt Pointer Register */
#define CAN_MOIPR55	(*( CAN_MOIPR0_type *) 0xf00196e8u)	/* Message Object 55 Interrupt Pointer Register */
#define CAN_MOIPR56	(*( CAN_MOIPR0_type *) 0xf0019708u)	/* Message Object 56 Interrupt Pointer Register */
#define CAN_MOIPR57	(*( CAN_MOIPR0_type *) 0xf0019728u)	/* Message Object 57 Interrupt Pointer Register */
#define CAN_MOIPR58	(*( CAN_MOIPR0_type *) 0xf0019748u)	/* Message Object 58 Interrupt Pointer Register */
#define CAN_MOIPR59	(*( CAN_MOIPR0_type *) 0xf0019768u)	/* Message Object 59 Interrupt Pointer Register */
#define CAN_MOIPR6	(*( CAN_MOIPR0_type *) 0xf00190c8u)	/* Message Object 6 Interrupt Pointer Register */
#define CAN_MOIPR60	(*( CAN_MOIPR0_type *) 0xf0019788u)	/* Message Object 60 Interrupt Pointer Register */
#define CAN_MOIPR61	(*( CAN_MOIPR0_type *) 0xf00197a8u)	/* Message Object 61 Interrupt Pointer Register */
#define CAN_MOIPR62	(*( CAN_MOIPR0_type *) 0xf00197c8u)	/* Message Object 62 Interrupt Pointer Register */
#define CAN_MOIPR63	(*( CAN_MOIPR0_type *) 0xf00197e8u)	/* Message Object 63 Interrupt Pointer Register */
#define CAN_MOIPR64	(*( CAN_MOIPR0_type *) 0xf0019808u)	/* Message Object 64 Interrupt Pointer Register */
#define CAN_MOIPR65	(*( CAN_MOIPR0_type *) 0xf0019828u)	/* Message Object 65 Interrupt Pointer Register */
