svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOIPR66	(*( CAN_MOIPR0_type *) 0xf0019848u)	/* Message Object 66 Interrupt Pointer Register */
#define CAN_MOIPR67	(*( CAN_MOIPR0_type *) 0xf0019868u)	/* Message Object 67 Interrupt Pointer Register */
#define CAN_MOIPR68	(*( CAN_MOIPR0_type *) 0xf0019888u)	/* Message Object 68 Interrupt Pointer Register */
#define CAN_MOIPR69	(*( CAN_MOIPR0_type *) 0xf00198a8u)	/* Message Object 69 Interrupt Pointer Register */
#define CAN_MOIPR7	(*( CAN_MOIPR0_type *) 0xf00190e8u)	/* Message Object 7 Interrupt Pointer Register */
#define CAN_MOIPR70	(*( CAN_MOIPR0_type *) 0xf00198c8u)	/* Message Object 70 Interrupt Pointer Register */
#define CAN_MOIPR71	(*( CAN_MOIPR0_type *) 0xf00198e8u)	/* Message Object 71 Interrupt Pointer Register */
#define CAN_MOIPR72	(*( CAN_MOIPR0_type *) 0xf0019908u)	/* Message Object 72 Interrupt Pointer Register */
#define CAN_MOIPR73	(*( CAN_MOIPR0_type *) 0xf0019928u)	/* Message Object 73 Interrupt Pointer Register */
#define CAN_MOIPR74	(*( CAN_MOIPR0_type *) 0xf0019948u)	/* Message Object 74 Interrupt Pointer Register */
#define CAN_MOIPR75	(*( CAN_MOIPR0_type *) 0xf0019968u)	/* Message Object 75 Interrupt Pointer Register */
#define CAN_MOIPR76	(*( CAN_MOIPR0_type *) 0xf0019988u)	/* Message Object 76 Interrupt Pointer Register */
#define CAN_MOIPR77	(*( CAN_MOIPR0_type *) 0xf00199a8u)	/* Message Object 77 Interrupt Pointer Register */
#define CAN_MOIPR78	(*( CAN_MOIPR0_type *) 0xf00199c8u)	/* Message Object 78 Interrupt Pointer Register */
#define CAN_MOIPR79	(*( CAN_MOIPR0_type *) 0xf00199e8u)	/* Message Object 79 Interrupt Pointer Register */
#define CAN_MOIPR8	(*( CAN_MOIPR0_type *) 0xf0019108u)	/* Message Object 8 Interrupt Pointer Register */
#define CAN_MOIPR80	(*( CAN_MOIPR0_type *) 0xf0019a08u)	/* Message Object 80 Interrupt Pointer Register */
#define CAN_MOIPR81	(*( CAN_MOIPR0_type *) 0xf0019a28u)	/* Message Object 81 Interrupt Pointer Register */
#define CAN_MOIPR82	(*( CAN_MOIPR0_type *) 0xf0019a48u)	/* Message Object 82 Interrupt Pointer Register */
#define CAN_MOIPR83	(*( CAN_MOIPR0_type *) 0xf0019a68u)	/* Message Object 83 Interrupt Pointer Register */
#define CAN_MOIPR84	(*( CAN_MOIPR0_type *) 0xf0019a88u)	/* Message Object 84 Interrupt Pointer Register */
#define CAN_MOIPR85	(*( CAN_MOIPR0_type *) 0xf0019aa8u)	/* Message Object 85 Interrupt Pointer Register */
#define CAN_MOIPR86	(*( CAN_MOIPR0_type *) 0xf0019ac8u)	/* Message Object 86 Interrupt Pointer Register */
#define CAN_MOIPR87	(*( CAN_MOIPR0_type *) 0xf0019ae8u)	/* Message Object 87 Interrupt Pointer Register */
#define CAN_MOIPR88	(*( CAN_MOIPR0_type *) 0xf0019b08u)	/* Message Object 88 Interrupt Pointer Register */
#define CAN_MOIPR89	(*( CAN_MOIPR0_type *) 0xf0019b28u)	/* Message Object 89 Interrupt Pointer Register */
#define CAN_MOIPR9	(*( CAN_MOIPR0_type *) 0xf0019128u)	/* Message Object 9 Interrupt Pointer Register */
#define CAN_MOIPR90	(*( CAN_MOIPR0_type *) 0xf0019b48u)	/* Message Object 90 Interrupt Pointer Register */
#define CAN_MOIPR91	(*( CAN_MOIPR0_type *) 0xf0019b68u)	/* Message Object 91 Interrupt Pointer Register */
#define CAN_MOIPR92	(*( CAN_MOIPR0_type *) 0xf0019b88u)	/* Message Object 92 Interrupt Pointer Register */
#define CAN_MOIPR93	(*( CAN_MOIPR0_type *) 0xf0019ba8u)	/* Message Object 93 Interrupt Pointer Register */
#define CAN_MOIPR94	(*( CAN_MOIPR0_type *) 0xf0019bc8u)	/* Message Object 94 Interrupt Pointer Register */
#define CAN_MOIPR95	(*( CAN_MOIPR0_type *) 0xf0019be8u)	/* Message Object 95 Interrupt Pointer Register */
#define CAN_MOIPR96	(*( CAN_MOIPR0_type *) 0xf0019c08u)	/* Message Object 96 Interrupt Pointer Register */
#define CAN_MOIPR97	(*( CAN_MOIPR0_type *) 0xf0019c28u)	/* Message Object 97 Interrupt Pointer Register */
#define CAN_MOIPR98	(*( CAN_MOIPR0_type *) 0xf0019c48u)	/* Message Object 98 Interrupt Pointer Register */
#define CAN_MOIPR99	(*( CAN_MOIPR0_type *) 0xf0019c68u)	/* Message Object 99 Interrupt Pointer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXPND          : 1;	/* Receive Pending */
		/* const */ unsigned int TXPND          : 1;	/* Transmit Pending */
		/* const */ unsigned int RXUPD          : 1;	/* Receive Updating */
		/* const */ unsigned int NEWDAT         : 1;	/* New Data */
		/* const */ unsigned int MSGLST         : 1;	/* Message Lost */
		/* const */ unsigned int MSGVAL         : 1;	/* Message Valid */
		/* const */ unsigned int RTSEL          : 1;	/* Receive/Transmit Selected */
		/* const */ unsigned int RXEN           : 1;	/* Receive Enable */
		/* const */ unsigned int TXRQ           : 1;	/* Transmit Request */
		/* const */ unsigned int TXEN0          : 1;	/* Transmit Enable 0 */
		/* const */ unsigned int TXEN1          : 1;	/* Transmit Enable 1 */
		/* const */ unsigned int DIR            : 1;	/* Message Direction */
		/* const */ unsigned int LIST           : 4;	/* List Allocation */
		/* const */ unsigned int PPREV          : 8;	/* Pointer to Previous Message Object */
		/* const */ unsigned int PNEXT          : 8;	/* Pointer to Next Message Object */
	} B;
	int I;
	unsigned int U;

} CAN_MOSTAT0_type;
#define CAN_MOSTAT0	(*( CAN_MOSTAT0_type *) 0xf001901cu)	/* Message Object 0 Status Register */
#define CAN_MOSTAT1	(*( CAN_MOSTAT0_type *) 0xf001903cu)	/* Message Object 1 Status Register */
#define CAN_MOSTAT10	(*( CAN_MOSTAT0_type *) 0xf001915cu)	/* Message Object 10 Status Register */
#define CAN_MOSTAT100	(*( CAN_MOSTAT0_type *) 0xf0019c9cu)	/* Message Object 100 Status Register */
#define CAN_MOSTAT101	(*( CAN_MOSTAT0_type *) 0xf0019cbcu)	/* Message Object 101 Status Register */
#define CAN_MOSTAT102	(*( CAN_MOSTAT0_type *) 0xf0019cdcu)	/* Message Object 102 Status Register */
#define CAN_MOSTAT103	(*( CAN_MOSTAT0_type *) 0xf0019cfcu)	/* Message Object 103 Status Register */
#define CAN_MOSTAT104	(*( CAN_MOSTAT0_type *) 0xf0019d1cu)	/* Message Object 104 Status Register */
#define CAN_MOSTAT105	(*( CAN_MOSTAT0_type *) 0xf0019d3cu)	/* Message Object 105 Status Register */
#define CAN_MOSTAT106	(*( CAN_MOSTAT0_type *) 0xf0019d5cu)	/* Message Object 106 Status Register */
#define CAN_MOSTAT107	(*( CAN_MOSTAT0_type *) 0xf0019d7cu)	/* Message Object 107 Status Register */
#define CAN_MOSTAT108	(*( CAN_MOSTAT0_type *) 0xf0019d9cu)	/* Message Object 108 Status Register */
#define CAN_MOSTAT109	(*( CAN_MOSTAT0_type *) 0xf0019dbcu)	/* Message Object 109 Status Register */
#define CAN_MOSTAT11	(*( CAN_MOSTAT0_type *) 0xf001917cu)	/* Message Object 11 Status Register */
#define CAN_MOSTAT110	(*( CAN_MOSTAT0_type *) 0xf0019ddcu)	/* Message Object 110 Status Register */
#define CAN_MOSTAT111	(*( CAN_MOSTAT0_type *) 0xf0019dfcu)	/* Message Object 111 Status Register */
#define CAN_MOSTAT112	(*( CAN_MOSTAT0_type *) 0xf0019e1cu)	/* Message Object 112 Status Register */
#define CAN_MOSTAT113	(*( CAN_MOSTAT0_type *) 0xf0019e3cu)	/* Message Object 113 Status Register */
#define CAN_MOSTAT114	(*( CAN_MOSTAT0_type *) 0xf0019e5cu)	/* Message Object 114 Status Register */
#define CAN_MOSTAT115	(*( CAN_MOSTAT0_type *) 0xf0019e7cu)	/* Message Object 115 Status Register */
#define CAN_MOSTAT116	(*( CAN_MOSTAT0_type *) 0xf0019e9cu)	/* Message Object 116 Status Register */
#define CAN_MOSTAT117	(*( CAN_MOSTAT0_type *) 0xf0019ebcu)	/* Message Object 117 Status Register */
#define CAN_MOSTAT118	(*( CAN_MOSTAT0_type *) 0xf0019edcu)	/* Message Object 118 Status Register */
#define CAN_MOSTAT119	(*( CAN_MOSTAT0_type *) 0xf0019efcu)	/* Message Object 119 Status Register */
#define CAN_MOSTAT12	(*( CAN_MOSTAT0_type *) 0xf001919cu)	/* Message Object 12 Status Register */
#define CAN_MOSTAT120	(*( CAN_MOSTAT0_type *) 0xf0019f1cu)	/* Message Object 120 Status Register */
#define CAN_MOSTAT121	(*( CAN_MOSTAT0_type *) 0xf0019f3cu)	/* Message Object 121 Status Register */
#define CAN_MOSTAT122	(*( CAN_MOSTAT0_type *) 0xf0019f5cu)	/* Message Object 122 Status Register */
#define CAN_MOSTAT123	(*( CAN_MOSTAT0_type *) 0xf0019f7cu)	/* Message Object 123 Status Register */
#define CAN_MOSTAT124	(*( CAN_MOSTAT0_type *) 0xf0019f9cu)	/* Message Object 124 Status Register */
#define CAN_MOSTAT125	(*( CAN_MOSTAT0_type *) 0xf0019fbcu)	/* Message Object 125 Status Register */
#define CAN_MOSTAT126	(*( CAN_MOSTAT0_type *) 0xf0019fdcu)	/* Message Object 126 Status Register */
#define CAN_MOSTAT127	(*( CAN_MOSTAT0_type *) 0xf0019ffcu)	/* Message Object 127 Status Register */
#define CAN_MOSTAT128	(*( CAN_MOSTAT0_type *) 0xf001a01cu)	/* Message Object 128 Status Register */
#define CAN_MOSTAT129	(*( CAN_MOSTAT0_type *) 0xf001a03cu)	/* Message Object 129 Status Register */
#define CAN_MOSTAT13	(*( CAN_MOSTAT0_type *) 0xf00191bcu)	/* Message Object 13 Status Register */
#define CAN_MOSTAT130	(*( CAN_MOSTAT0_type *) 0xf001a05cu)	/* Message Object 130 Status Register */
#define CAN_MOSTAT131	(*( CAN_MOSTAT0_type *) 0xf001a07cu)	/* Message Object 131 Status Register */
#define CAN_MOSTAT132	(*( CAN_MOSTAT0_type *) 0xf001a09cu)	/* Message Object 132 Status Register */
#define CAN_MOSTAT133	(*( CAN_MOSTAT0_type *) 0xf001a0bcu)	/* Message Object 133 Status Register */
#define CAN_MOSTAT134	(*( CAN_MOSTAT0_type *) 0xf001a0dcu)	/* Message Object 134 Status Register */
#define CAN_MOSTAT135	(*( CAN_MOSTAT0_type *) 0xf001a0fcu)	/* Message Object 135 Status Register */
#define CAN_MOSTAT136	(*( CAN_MOSTAT0_type *) 0xf001a11cu)	/* Message Object 136 Status Register */
#define CAN_MOSTAT137	(*( CAN_MOSTAT0_type *) 0xf001a13cu)	/* Message Object 137 Status Register */
#define CAN_MOSTAT138	(*( CAN_MOSTAT0_type *) 0xf001a15cu)	/* Message Object 138 Status Register */
#define CAN_MOSTAT139	(*( CAN_MOSTAT0_type *) 0xf001a17cu)	/* Message Object 139 Status Register */
#define CAN_MOSTAT14	(*( CAN_MOSTAT0_type *) 0xf00191dcu)	/* Message Object 14 Status Register */
#define CAN_MOSTAT140	(*( CAN_MOSTAT0_type *) 0xf001a19cu)	/* Message Object 140 Status Register */
#define CAN_MOSTAT141	(*( CAN_MOSTAT0_type *) 0xf001a1bcu)	/* Message Object 141 Status Register */
#define CAN_MOSTAT142	(*( CAN_MOSTAT0_type *) 0xf001a1dcu)	/* Message Object 142 Status Register */
#define CAN_MOSTAT143	(*( CAN_MOSTAT0_type *) 0xf001a1fcu)	/* Message Object 143 Status Register */
#define CAN_MOSTAT144	(*( CAN_MOSTAT0_type *) 0xf001a21cu)	/* Message Object 144 Status Register */
#define CAN_MOSTAT145	(*( CAN_MOSTAT0_type *) 0xf001a23cu)	/* Message Object 145 Status Register */
#define CAN_MOSTAT146	(*( CAN_MOSTAT0_type *) 0xf001a25cu)	/* Message Object 146 Status Register */
#define CAN_MOSTAT147	(*( CAN_MOSTAT0_type *) 0xf001a27cu)	/* Message Object 147 Status Register */
#define CAN_MOSTAT148	(*( CAN_MOSTAT0_type *) 0xf001a29cu)	/* Message Object 148 Status Register */
#define CAN_MOSTAT149	(*( CAN_MOSTAT0_type *) 0xf001a2bcu)	/* Message Object 149 Status Register */
#define CAN_MOSTAT15	(*( CAN_MOSTAT0_type *) 0xf00191fcu)	/* Message Object 15 Status Register */
#define CAN_MOSTAT150	(*( CAN_MOSTAT0_type *) 0xf001a2dcu)	/* Message Object 150 Status Register */
#define CAN_MOSTAT151	(*( CAN_MOSTAT0_type *) 0xf001a2fcu)	/* Message Object 151 Status Register */
#define CAN_MOSTAT152	(*( CAN_MOSTAT0_type *) 0xf001a31cu)	/* Message Object 152 Status Register */
#define CAN_MOSTAT153	(*( CAN_MOSTAT0_type *) 0xf001a33cu)	/* Message Object 153 Status Register */
#define CAN_MOSTAT154	(*( CAN_MOSTAT0_type *) 0xf001a35cu)	/* Message Object 154 Status Register */
#define CAN_MOSTAT155	(*( CAN_MOSTAT0_type *) 0xf001a37cu)	/* Message Object 155 Status Register */
#define CAN_MOSTAT156	(*( CAN_MOSTAT0_type *) 0xf001a39cu)	/* Message Object 156 Status Register */
#define CAN_MOSTAT157	(*( CAN_MOSTAT0_type *) 0xf001a3bcu)	/* Message Object 157 Status Register */
#define CAN_MOSTAT158	(*( CAN_MOSTAT0_type *) 0xf001a3dcu)	/* Message Object 158 Status Register */
#define CAN_MOSTAT159	(*( CAN_MOSTAT0_type *) 0xf001a3fcu)	/* Message Object 159 Status Register */
#define CAN_MOSTAT16	(*( CAN_MOSTAT0_type *) 0xf001921cu)	/* Message Object 16 Status Register */
#define CAN_MOSTAT160	(*( CAN_MOSTAT0_type *) 0xf001a41cu)	/* Message Object 160 Status Register */
#define CAN_MOSTAT161	(*( CAN_MOSTAT0_type *) 0xf001a43cu)	/* Message Object 161 Status Register */
#define CAN_MOSTAT162	(*( CAN_MOSTAT0_type *) 0xf001a45cu)	/* Message Object 162 Status Register */
#define CAN_MOSTAT163	(*( CAN_MOSTAT0_type *) 0xf001a47cu)	/* Message Object 163 Status Register */
#define CAN_MOSTAT164	(*( CAN_MOSTAT0_type *) 0xf001a49cu)	/* Message Object 164 Status Register */
#define CAN_MOSTAT165	(*( CAN_MOSTAT0_type *) 0xf001a4bcu)	/* Message Object 165 Status Register */
#define CAN_MOSTAT166	(*( CAN_MOSTAT0_type *) 0xf001a4dcu)	/* Message Object 166 Status Register */
#define CAN_MOSTAT167	(*( CAN_MOSTAT0_type *) 0xf001a4fcu)	/* Message Object 167 Status Register */
#define CAN_MOSTAT168	(*( CAN_MOSTAT0_type *) 0xf001a51cu)	/* Message Object 168 Status Register */
#define CAN_MOSTAT169	(*( CAN_MOSTAT0_type *) 0xf001a53cu)	/* Message Object 169 Status Register */
#define CAN_MOSTAT17	(*( CAN_MOSTAT0_type *) 0xf001923cu)	/* Message Object 17 Status Register */
#define CAN_MOSTAT170	(*( CAN_MOSTAT0_type *) 0xf001a55cu)	/* Message Object 170 Status Register */
#define CAN_MOSTAT171	(*( CAN_MOSTAT0_type *) 0xf001a57cu)	/* Message Object 171 Status Register */
#define CAN_MOSTAT172	(*( CAN_MOSTAT0_type *) 0xf001a59cu)	/* Message Object 172 Status Register */
#define CAN_MOSTAT173	(*( CAN_MOSTAT0_type *) 0xf001a5bcu)	/* Message Object 173 Status Register */
#define CAN_MOSTAT174	(*( CAN_MOSTAT0_type *) 0xf001a5dcu)	/* Message Object 174 Status Register */
#define CAN_MOSTAT175	(*( CAN_MOSTAT0_type *) 0xf001a5fcu)	/* Message Object 175 Status Register */
#define CAN_MOSTAT176	(*( CAN_MOSTAT0_type *) 0xf001a61cu)	/* Message Object 176 Status Register */
#define CAN_MOSTAT177	(*( CAN_MOSTAT0_type *) 0xf001a63cu)	/* Message Object 177 Status Register */
#define CAN_MOSTAT178	(*( CAN_MOSTAT0_type *) 0xf001a65cu)	/* Message Object 178 Status Register */
#define CAN_MOSTAT179	(*( CAN_MOSTAT0_type *) 0xf001a67cu)	/* Message Object 179 Status Register */
#define CAN_MOSTAT18	(*( CAN_MOSTAT0_type *) 0xf001925cu)	/* Message Object 18 Status Register */
#define CAN_MOSTAT180	(*( CAN_MOSTAT0_type *) 0xf001a69cu)	/* Message Object 180 Status Register */
#define CAN_MOSTAT181	(*( CAN_MOSTAT0_type *) 0xf001a6bcu)	/* Message Object 181 Status Register */
#define CAN_MOSTAT182	(*( CAN_MOSTAT0_type *) 0xf001a6dcu)	/* Message Object 182 Status Register */
#define CAN_MOSTAT183	(*( CAN_MOSTAT0_type *) 0xf001a6fcu)	/* Message Object 183 Status Register */
#define CAN_MOSTAT184	(*( CAN_MOSTAT0_type *) 0xf001a71cu)	/* Message Object 184 Status Register */
#define CAN_MOSTAT185	(*( CAN_MOSTAT0_type *) 0xf001a73cu)	/* Message Object 185 Status Register */
#define CAN_MOSTAT186	(*( CAN_MOSTAT0_type *) 0xf001a75cu)	/* Message Object 186 Status Register */
#define CAN_MOSTAT187	(*( CAN_MOSTAT0_type *) 0xf001a77cu)	/* Message Object 187 Status Register */
#define CAN_MOSTAT188	(*( CAN_MOSTAT0_type *) 0xf001a79cu)	/* Message Object 188 Status Register */
#define CAN_MOSTAT189	(*( CAN_MOSTAT0_type *) 0xf001a7bcu)	/* Message Object 189 Status Register */
#define CAN_MOSTAT19	(*( CAN_MOSTAT0_type *) 0xf001927cu)	/* Message Object 19 Status Register */
#define CAN_MOSTAT190	(*( CAN_MOSTAT0_type *) 0xf001a7dcu)	/* Message Object 190 Status Register */
#define CAN_MOSTAT191	(*( CAN_MOSTAT0_type *) 0xf001a7fcu)	/* Message Object 191 Status Register */
#define CAN_MOSTAT192	(*( CAN_MOSTAT0_type *) 0xf001a81cu)	/* Message Object 192 Status Register */
#define CAN_MOSTAT193	(*( CAN_MOSTAT0_type *) 0xf001a83cu)	/* Message Object 193 Status Register */
#define CAN_MOSTAT194	(*( CAN_MOSTAT0_type *) 0xf001a85cu)	/* Message Object 194 Status Register */
#define CAN_MOSTAT195	(*( CAN_MOSTAT0_type *) 0xf001a87cu)	/* Message Object 195 Status Register */
#define CAN_MOSTAT196	(*( CAN_MOSTAT0_type *) 0xf001a89cu)	/* Message Object 196 Status Register */
#define CAN_MOSTAT197	(*( CAN_MOSTAT0_type *) 0xf001a8bcu)	/* Message Object 197 Status Register */
#define CAN_MOSTAT198	(*( CAN_MOSTAT0_type *) 0xf001a8dcu)	/* Message Object 198 Status Register */
#define CAN_MOSTAT199	(*( CAN_MOSTAT0_type *) 0xf001a8fcu)	/* Message Object 199 Status Register */
#define CAN_MOSTAT2	(*( CAN_MOSTAT0_type *) 0xf001905cu)	/* Message Object 2 Status Register */
#define CAN_MOSTAT20	(*( CAN_MOSTAT0_type *) 0xf001929cu)	/* Message Object 20 Status Register */
#define CAN_MOSTAT200	(*( CAN_MOSTAT0_type *) 0xf001a91cu)	/* Message Object 200 Status Register */
#define CAN_MOSTAT201	(*( CAN_MOSTAT0_type *) 0xf001a93cu)	/* Message Object 201 Status Register */
#define CAN_MOSTAT202	(*( CAN_MOSTAT0_type *) 0xf001a95cu)	/* Message Object 202 Status Register */
#define CAN_MOSTAT203	(*( CAN_MOSTAT0_type *) 0xf001a97cu)	/* Message Object 203 Status Register */
#define CAN_MOSTAT204	(*( CAN_MOSTAT0_type *) 0xf001a99cu)	/* Message Object 204 Status Register */
#define CAN_MOSTAT205	(*( CAN_MOSTAT0_type *) 0xf001a9bcu)	/* Message Object 205 Status Register */
#define CAN_MOSTAT206	(*( CAN_MOSTAT0_type *) 0xf001a9dcu)	/* Message Object 206 Status Register */
#define CAN_MOSTAT207	(*( CAN_MOSTAT0_type *) 0xf001a9fcu)	/* Message Object 207 Status Register */
#define CAN_MOSTAT208	(*( CAN_MOSTAT0_type *) 0xf001aa1cu)	/* Message Object 208 Status Register */
#define CAN_MOSTAT209	(*( CAN_MOSTAT0_type *) 0xf001aa3cu)	/* Message Object 209 Status Register */
#define CAN_MOSTAT21	(*( CAN_MOSTAT0_type *) 0xf00192bcu)	/* Message Object 21 Status Register */
#define CAN_MOSTAT210	(*( CAN_MOSTAT0_type *) 0xf001aa5cu)	/* Message Object 210 Status Register */
#define CAN_MOSTAT211	(*( CAN_MOSTAT0_type *) 0xf001aa7cu)	/* Message Object 211 Status Register */
#define CAN_MOSTAT212	(*( CAN_MOSTAT0_type *) 0xf001aa9cu)	/* Message Object 212 Status Register */
#define CAN_MOSTAT213	(*( CAN_MOSTAT0_type *) 0xf001aabcu)	/* Message Object 213 Status Register */
#define CAN_MOSTAT214	(*( CAN_MOSTAT0_type *) 0xf001aadcu)	/* Message Object 214 Status Register */
#define CAN_MOSTAT215	(*( CAN_MOSTAT0_type *) 0xf001aafcu)	/* Message Object 215 Status Register */
#define CAN_MOSTAT216	(*( CAN_MOSTAT0_type *) 0xf001ab1cu)	/* Message Object 216 Status Register */
#define CAN_MOSTAT217	(*( CAN_MOSTAT0_type *) 0xf001ab3cu)	/* Message Object 217 Status Register */
#define CAN_MOSTAT218	(*( CAN_MOSTAT0_type *) 0xf001ab5cu)	/* Message Object 218 Status Register */
#define CAN_MOSTAT219	(*( CAN_MOSTAT0_type *) 0xf001ab7cu)	/* Message Object 219 Status Register */
#define CAN_MOSTAT22	(*( CAN_MOSTAT0_type *) 0xf00192dcu)	/* Message Object 22 Status Register */
#define CAN_MOSTAT220	(*( CAN_MOSTAT0_type *) 0xf001ab9cu)	/* Message Object 220 Status Register */
#define CAN_MOSTAT221	(*( CAN_MOSTAT0_type *) 0xf001abbcu)	/* Message Object 221 Status Register */
#define CAN_MOSTAT222	(*( CAN_MOSTAT0_type *) 0xf001abdcu)	/* Message Object 222 Status Register */
#define CAN_MOSTAT223	(*( CAN_MOSTAT0_type *) 0xf001abfcu)	/* Message Object 223 Status Register */
#define CAN_MOSTAT224	(*( CAN_MOSTAT0_type *) 0xf001ac1cu)	/* Message Object 224 Status Register */
#define CAN_MOSTAT225	(*( CAN_MOSTAT0_type *) 0xf001ac3cu)	/* Message Object 225 Status Register */
#define CAN_MOSTAT226	(*( CAN_MOSTAT0_type *) 0xf001ac5cu)	/* Message Object 226 Status Register */
#define CAN_MOSTAT227	(*( CAN_MOSTAT0_type *) 0xf001ac7cu)	/* Message Object 227 Status Register */
#define CAN_MOSTAT228	(*( CAN_MOSTAT0_type *) 0xf001ac9cu)	/* Message Object 228 Status Register */
#define CAN_MOSTAT229	(*( CAN_MOSTAT0_type *) 0xf001acbcu)	/* Message Object 229 Status Register */
#define CAN_MOSTAT23	(*( CAN_MOSTAT0_type *) 0xf00192fcu)	/* Message Object 23 Status Register */
#define CAN_MOSTAT230	(*( CAN_MOSTAT0_type *) 0xf001acdcu)	/* Message Object 230 Status Register */
#define CAN_MOSTAT231	(*( CAN_MOSTAT0_type *) 0xf001acfcu)	/* Message Object 231 Status Register */
#define CAN_MOSTAT232	(*( CAN_MOSTAT0_type *) 0xf001ad1cu)	/* Message Object 232 Status Register */
#define CAN_MOSTAT233	(*( CAN_MOSTAT0_type *) 0xf001ad3cu)	/* Message Object 233 Status Register */
#define CAN_MOSTAT234	(*( CAN_MOSTAT0_type *) 0xf001ad5cu)	/* Message Object 234 Status Register */
#define CAN_MOSTAT235	(*( CAN_MOSTAT0_type *) 0xf001ad7cu)	/* Message Object 235 Status Register */
#define CAN_MOSTAT236	(*( CAN_MOSTAT0_type *) 0xf001ad9cu)	/* Message Object 236 Status Register */
#define CAN_MOSTAT237	(*( CAN_MOSTAT0_type *) 0xf001adbcu)	/* Message Object 237 Status Register */
#define CAN_MOSTAT238	(*( CAN_MOSTAT0_type *) 0xf001addcu)	/* Message Object 238 Status Register */
#define CAN_MOSTAT239	(*( CAN_MOSTAT0_type *) 0xf001adfcu)	/* Message Object 239 Status Register */
#define CAN_MOSTAT24	(*( CAN_MOSTAT0_type *) 0xf001931cu)	/* Message Object 24 Status Register */
#define CAN_MOSTAT240	(*( CAN_MOSTAT0_type *) 0xf001ae1cu)	/* Message Object 240 Status Register */
#define CAN_MOSTAT241	(*( CAN_MOSTAT0_type *) 0xf001ae3cu)	/* Message Object 241 Status Register */
#define CAN_MOSTAT242	(*( CAN_MOSTAT0_type *) 0xf001ae5cu)	/* Message Object 242 Status Register */
#define CAN_MOSTAT243	(*( CAN_MOSTAT0_type *) 0xf001ae7cu)	/* Message Object 243 Status Register */
#define CAN_MOSTAT244	(*( CAN_MOSTAT0_type *) 0xf001ae9cu)	/* Message Object 244 Status Register */
#define CAN_MOSTAT245	(*( CAN_MOSTAT0_type *) 0xf001aebcu)	/* Message Object 245 Status Register */
#define CAN_MOSTAT246	(*( CAN_MOSTAT0_type *) 0xf001aedcu)	/* Message Object 246 Status Register */
#define CAN_MOSTAT247	(*( CAN_MOSTAT0_type *) 0xf001aefcu)	/* Message Object 247 Status Register */
#define CAN_MOSTAT248	(*( CAN_MOSTAT0_type *) 0xf001af1cu)	/* Message Object 248 Status Register */
#define CAN_MOSTAT249	(*( CAN_MOSTAT0_type *) 0xf001af3cu)	/* Message Object 249 Status Register */
#define CAN_MOSTAT25	(*( CAN_MOSTAT0_type *) 0xf001933cu)	/* Message Object 25 Status Register */
#define CAN_MOSTAT250	(*( CAN_MOSTAT0_type *) 0xf001af5cu)	/* Message Object 250 Status Register */
#define CAN_MOSTAT251	(*( CAN_MOSTAT0_type *) 0xf001af7cu)	/* Message Object 251 Status Register */
#define CAN_MOSTAT252	(*( CAN_MOSTAT0_type *) 0xf001af9cu)	/* Message Object 252 Status Register */
#define CAN_MOSTAT253	(*( CAN_MOSTAT0_type *) 0xf001afbcu)	/* Message Object 253 Status Register */
#define CAN_MOSTAT254	(*( CAN_MOSTAT0_type *) 0xf001afdcu)	/* Message Object 254 Status Register */
#define CAN_MOSTAT255	(*( CAN_MOSTAT0_type *) 0xf001affcu)	/* Message Object 255 Status Register */
#define CAN_MOSTAT26	(*( CAN_MOSTAT0_type *) 0xf001935cu)	/* Message Object 26 Status Register */
#define CAN_MOSTAT27	(*( CAN_MOSTAT0_type *) 0xf001937cu)	/* Message Object 27 Status Register */
#define CAN_MOSTAT28	(*( CAN_MOSTAT0_type *) 0xf001939cu)	/* Message Object 28 Status Register */
#define CAN_MOSTAT29	(*( CAN_MOSTAT0_type *) 0xf00193bcu)	/* Message Object 29 Status Register */
#define CAN_MOSTAT3	(*( CAN_MOSTAT0_type *) 0xf001907cu)	/* Message Object 3 Status Register */
#define CAN_MOSTAT30	(*( CAN_MOSTAT0_type *) 0xf00193dcu)	/* Message Object 30 Status Register */
#define CAN_MOSTAT31	(*( CAN_MOSTAT0_type *) 0xf00193fcu)	/* Message Object 31 Status Register */
#define CAN_MOSTAT32	(*( CAN_MOSTAT0_type *) 0xf001941cu)	/* Message Object 32 Status Register */
#define CAN_MOSTAT33	(*( CAN_MOSTAT0_type *) 0xf001943cu)	/* Message Object 33 Status Register */
#define CAN_MOSTAT34	(*( CAN_MOSTAT0_type *) 0xf001945cu)	/* Message Object 34 Status Register */
#define CAN_MOSTAT35	(*( CAN_MOSTAT0_type *) 0xf001947cu)	/* Message Object 35 Status Register */
#define CAN_MOSTAT36	(*( CAN_MOSTAT0_type *) 0xf001949cu)	/* Message Object 36 Status Register */
