svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CAN_MOSTAT37	(*( CAN_MOSTAT0_type *) 0xf00194bcu)	/* Message Object 37 Status Register */
#define CAN_MOSTAT38	(*( CAN_MOSTAT0_type *) 0xf00194dcu)	/* Message Object 38 Status Register */
#define CAN_MOSTAT39	(*( CAN_MOSTAT0_type *) 0xf00194fcu)	/* Message Object 39 Status Register */
#define CAN_MOSTAT4	(*( CAN_MOSTAT0_type *) 0xf001909cu)	/* Message Object 4 Status Register */
#define CAN_MOSTAT40	(*( CAN_MOSTAT0_type *) 0xf001951cu)	/* Message Object 40 Status Register */
#define CAN_MOSTAT41	(*( CAN_MOSTAT0_type *) 0xf001953cu)	/* Message Object 41 Status Register */
#define CAN_MOSTAT42	(*( CAN_MOSTAT0_type *) 0xf001955cu)	/* Message Object 42 Status Register */
#define CAN_MOSTAT43	(*( CAN_MOSTAT0_type *) 0xf001957cu)	/* Message Object 43 Status Register */
#define CAN_MOSTAT44	(*( CAN_MOSTAT0_type *) 0xf001959cu)	/* Message Object 44 Status Register */
#define CAN_MOSTAT45	(*( CAN_MOSTAT0_type *) 0xf00195bcu)	/* Message Object 45 Status Register */
#define CAN_MOSTAT46	(*( CAN_MOSTAT0_type *) 0xf00195dcu)	/* Message Object 46 Status Register */
#define CAN_MOSTAT47	(*( CAN_MOSTAT0_type *) 0xf00195fcu)	/* Message Object 47 Status Register */
#define CAN_MOSTAT48	(*( CAN_MOSTAT0_type *) 0xf001961cu)	/* Message Object 48 Status Register */
#define CAN_MOSTAT49	(*( CAN_MOSTAT0_type *) 0xf001963cu)	/* Message Object 49 Status Register */
#define CAN_MOSTAT5	(*( CAN_MOSTAT0_type *) 0xf00190bcu)	/* Message Object 5 Status Register */
#define CAN_MOSTAT50	(*( CAN_MOSTAT0_type *) 0xf001965cu)	/* Message Object 50 Status Register */
#define CAN_MOSTAT51	(*( CAN_MOSTAT0_type *) 0xf001967cu)	/* Message Object 51 Status Register */
#define CAN_MOSTAT52	(*( CAN_MOSTAT0_type *) 0xf001969cu)	/* Message Object 52 Status Register */
#define CAN_MOSTAT53	(*( CAN_MOSTAT0_type *) 0xf00196bcu)	/* Message Object 53 Status Register */
#define CAN_MOSTAT54	(*( CAN_MOSTAT0_type *) 0xf00196dcu)	/* Message Object 54 Status Register */
#define CAN_MOSTAT55	(*( CAN_MOSTAT0_type *) 0xf00196fcu)	/* Message Object 55 Status Register */
#define CAN_MOSTAT56	(*( CAN_MOSTAT0_type *) 0xf001971cu)	/* Message Object 56 Status Register */
#define CAN_MOSTAT57	(*( CAN_MOSTAT0_type *) 0xf001973cu)	/* Message Object 57 Status Register */
#define CAN_MOSTAT58	(*( CAN_MOSTAT0_type *) 0xf001975cu)	/* Message Object 58 Status Register */
#define CAN_MOSTAT59	(*( CAN_MOSTAT0_type *) 0xf001977cu)	/* Message Object 59 Status Register */
#define CAN_MOSTAT6	(*( CAN_MOSTAT0_type *) 0xf00190dcu)	/* Message Object 6 Status Register */
#define CAN_MOSTAT60	(*( CAN_MOSTAT0_type *) 0xf001979cu)	/* Message Object 60 Status Register */
#define CAN_MOSTAT61	(*( CAN_MOSTAT0_type *) 0xf00197bcu)	/* Message Object 61 Status Register */
#define CAN_MOSTAT62	(*( CAN_MOSTAT0_type *) 0xf00197dcu)	/* Message Object 62 Status Register */
#define CAN_MOSTAT63	(*( CAN_MOSTAT0_type *) 0xf00197fcu)	/* Message Object 63 Status Register */
#define CAN_MOSTAT64	(*( CAN_MOSTAT0_type *) 0xf001981cu)	/* Message Object 64 Status Register */
#define CAN_MOSTAT65	(*( CAN_MOSTAT0_type *) 0xf001983cu)	/* Message Object 65 Status Register */
#define CAN_MOSTAT66	(*( CAN_MOSTAT0_type *) 0xf001985cu)	/* Message Object 66 Status Register */
#define CAN_MOSTAT67	(*( CAN_MOSTAT0_type *) 0xf001987cu)	/* Message Object 67 Status Register */
#define CAN_MOSTAT68	(*( CAN_MOSTAT0_type *) 0xf001989cu)	/* Message Object 68 Status Register */
#define CAN_MOSTAT69	(*( CAN_MOSTAT0_type *) 0xf00198bcu)	/* Message Object 69 Status Register */
#define CAN_MOSTAT7	(*( CAN_MOSTAT0_type *) 0xf00190fcu)	/* Message Object 7 Status Register */
#define CAN_MOSTAT70	(*( CAN_MOSTAT0_type *) 0xf00198dcu)	/* Message Object 70 Status Register */
#define CAN_MOSTAT71	(*( CAN_MOSTAT0_type *) 0xf00198fcu)	/* Message Object 71 Status Register */
#define CAN_MOSTAT72	(*( CAN_MOSTAT0_type *) 0xf001991cu)	/* Message Object 72 Status Register */
#define CAN_MOSTAT73	(*( CAN_MOSTAT0_type *) 0xf001993cu)	/* Message Object 73 Status Register */
#define CAN_MOSTAT74	(*( CAN_MOSTAT0_type *) 0xf001995cu)	/* Message Object 74 Status Register */
#define CAN_MOSTAT75	(*( CAN_MOSTAT0_type *) 0xf001997cu)	/* Message Object 75 Status Register */
#define CAN_MOSTAT76	(*( CAN_MOSTAT0_type *) 0xf001999cu)	/* Message Object 76 Status Register */
#define CAN_MOSTAT77	(*( CAN_MOSTAT0_type *) 0xf00199bcu)	/* Message Object 77 Status Register */
#define CAN_MOSTAT78	(*( CAN_MOSTAT0_type *) 0xf00199dcu)	/* Message Object 78 Status Register */
#define CAN_MOSTAT79	(*( CAN_MOSTAT0_type *) 0xf00199fcu)	/* Message Object 79 Status Register */
#define CAN_MOSTAT8	(*( CAN_MOSTAT0_type *) 0xf001911cu)	/* Message Object 8 Status Register */
#define CAN_MOSTAT80	(*( CAN_MOSTAT0_type *) 0xf0019a1cu)	/* Message Object 80 Status Register */
#define CAN_MOSTAT81	(*( CAN_MOSTAT0_type *) 0xf0019a3cu)	/* Message Object 81 Status Register */
#define CAN_MOSTAT82	(*( CAN_MOSTAT0_type *) 0xf0019a5cu)	/* Message Object 82 Status Register */
#define CAN_MOSTAT83	(*( CAN_MOSTAT0_type *) 0xf0019a7cu)	/* Message Object 83 Status Register */
#define CAN_MOSTAT84	(*( CAN_MOSTAT0_type *) 0xf0019a9cu)	/* Message Object 84 Status Register */
#define CAN_MOSTAT85	(*( CAN_MOSTAT0_type *) 0xf0019abcu)	/* Message Object 85 Status Register */
#define CAN_MOSTAT86	(*( CAN_MOSTAT0_type *) 0xf0019adcu)	/* Message Object 86 Status Register */
#define CAN_MOSTAT87	(*( CAN_MOSTAT0_type *) 0xf0019afcu)	/* Message Object 87 Status Register */
#define CAN_MOSTAT88	(*( CAN_MOSTAT0_type *) 0xf0019b1cu)	/* Message Object 88 Status Register */
#define CAN_MOSTAT89	(*( CAN_MOSTAT0_type *) 0xf0019b3cu)	/* Message Object 89 Status Register */
#define CAN_MOSTAT9	(*( CAN_MOSTAT0_type *) 0xf001913cu)	/* Message Object 9 Status Register */
#define CAN_MOSTAT90	(*( CAN_MOSTAT0_type *) 0xf0019b5cu)	/* Message Object 90 Status Register */
#define CAN_MOSTAT91	(*( CAN_MOSTAT0_type *) 0xf0019b7cu)	/* Message Object 91 Status Register */
#define CAN_MOSTAT92	(*( CAN_MOSTAT0_type *) 0xf0019b9cu)	/* Message Object 92 Status Register */
#define CAN_MOSTAT93	(*( CAN_MOSTAT0_type *) 0xf0019bbcu)	/* Message Object 93 Status Register */
#define CAN_MOSTAT94	(*( CAN_MOSTAT0_type *) 0xf0019bdcu)	/* Message Object 94 Status Register */
#define CAN_MOSTAT95	(*( CAN_MOSTAT0_type *) 0xf0019bfcu)	/* Message Object 95 Status Register */
#define CAN_MOSTAT96	(*( CAN_MOSTAT0_type *) 0xf0019c1cu)	/* Message Object 96 Status Register */
#define CAN_MOSTAT97	(*( CAN_MOSTAT0_type *) 0xf0019c3cu)	/* Message Object 97 Status Register */
#define CAN_MOSTAT98	(*( CAN_MOSTAT0_type *) 0xf0019c5cu)	/* Message Object 98 Status Register */
#define CAN_MOSTAT99	(*( CAN_MOSTAT0_type *) 0xf0019c7cu)	/* Message Object 99 Status Register */

