svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int INDEX          : 6;	/* Message Pending Index */
		/* const */ unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CAN_MSID0_type;
#define CAN_MSID0	(*( CAN_MSID0_type *) 0xf0018180u)	/* Message Index Register 0 */
#define CAN_MSID1	(*( CAN_MSID0_type *) 0xf0018184u)	/* Message Index Register 1 */
#define CAN_MSID2	(*( CAN_MSID0_type *) 0xf0018188u)	/* Message Index Register 2 */
#define CAN_MSID3	(*( CAN_MSID0_type *) 0xf001818cu)	/* Message Index Register 3 */
#define CAN_MSID4	(*( CAN_MSID0_type *) 0xf0018190u)	/* Message Index Register 4 */
#define CAN_MSID5	(*( CAN_MSID0_type *) 0xf0018194u)	/* Message Index Register 5 */
#define CAN_MSID6	(*( CAN_MSID0_type *) 0xf0018198u)	/* Message Index Register 6 */
#define CAN_MSID7	(*( CAN_MSID0_type *) 0xf001819cu)	/* Message Index Register 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int IM             : 32;	/* Message Index Mask */
	} B;
	int I;
	unsigned int U;

} CAN_MSIMASK_type;
#define CAN_MSIMASK	(*( CAN_MSIMASK_type *) 0xf00181c0u)	/* Message Index Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PND            : 32;	/* Message Pending */
	} B;
	int I;
	unsigned int U;

} CAN_MSPND0_type;
#define CAN_MSPND0	(*( CAN_MSPND0_type *) 0xf0018140u)	/* Message Pending Register 0 */
#define CAN_MSPND1	(*( CAN_MSPND0_type *) 0xf0018144u)	/* Message Pending Register 1 */
#define CAN_MSPND2	(*( CAN_MSPND0_type *) 0xf0018148u)	/* Message Pending Register 2 */
#define CAN_MSPND3	(*( CAN_MSPND0_type *) 0xf001814cu)	/* Message Pending Register 3 */
#define CAN_MSPND4	(*( CAN_MSPND0_type *) 0xf0018150u)	/* Message Pending Register 4 */
#define CAN_MSPND5	(*( CAN_MSPND0_type *) 0xf0018154u)	/* Message Pending Register 5 */
#define CAN_MSPND6	(*( CAN_MSPND0_type *) 0xf0018158u)	/* Message Pending Register 6 */
#define CAN_MSPND7	(*( CAN_MSPND0_type *) 0xf001815cu)	/* Message Pending Register 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int BRP            : 6;	/* Baud Rate Prescaler */
		unsigned int SJW            : 2;	/* (Re) Synchronization Jump Width */
		unsigned int TSEG1          : 4;	/* Time Segment Before Sample Point */
		unsigned int TSEG2          : 3;	/* Time Segment After Sample Point */
		unsigned int DIV8           : 1;	/* Divide Prescaler Clock by 8 */
		unsigned int FTX            : 1;	/* Fast Transmit (TTCAN only) */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} CAN_NBTR0_type;
#define CAN_NBTR0	(*( CAN_NBTR0_type *) 0xf0018210u)	/* Node 0 Bit Timing Register */
#define CAN_NBTR1	(*( CAN_NBTR0_type *) 0xf0018310u)	/* Node 1 Bit Timing Register */
#define CAN_NBTR2	(*( CAN_NBTR0_type *) 0xf0018410u)	/* Node 2 Bit Timing Register */
#define CAN_NBTR3	(*( CAN_NBTR0_type *) 0xf0018510u)	/* Node 3 Bit Timing Register */
#define CAN_NBTR4	(*( CAN_NBTR0_type *) 0xf0018610u)	/* Node 4 Bit Timing Register */
#define CAN_NBTR5	(*( CAN_NBTR0_type *) 0xf0018710u)	/* Node 5 Bit Timing Register */
#define CAN_NBTR6	(*( CAN_NBTR0_type *) 0xf0018810u)	/* Node 6 Bit Timing Register */
#define CAN_NBTR7	(*( CAN_NBTR0_type *) 0xf0018910u)	/* Node 7 Bit Timing Register */

typedef volatile union
{
	struct
	{ 
		unsigned int INIT           : 1;	/* Node Initialization */
		unsigned int TRIE           : 1;	/* Transfer Interrupt Enable */
		unsigned int LECIE          : 1;	/* LEC Indicated Error Interrupt Enable */
		unsigned int ALIE           : 1;	/* Alert Interrupt Enable */
		unsigned int CANDIS         : 1;	/* CAN Disable */
		unsigned int TXDIS          : 1;	/* Transmit Disable */
		unsigned int CCE            : 1;	/* Configuration Change Enable */
		unsigned int CALM           : 1;	/* CAN Analyzer Mode */
		unsigned int SUSEN          : 1;	/* Suspend Enable */
		unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} CAN_NCR0_type;
#define CAN_NCR0	(*( CAN_NCR0_type *) 0xf0018200u)	/* Node 0 Control Register */
#define CAN_NCR1	(*( CAN_NCR0_type *) 0xf0018300u)	/* Node 1 Control Register */
#define CAN_NCR2	(*( CAN_NCR0_type *) 0xf0018400u)	/* Node 2 Control Register */
#define CAN_NCR3	(*( CAN_NCR0_type *) 0xf0018500u)	/* Node 3 Control Register */
#define CAN_NCR4	(*( CAN_NCR0_type *) 0xf0018600u)	/* Node 4 Control Register */
#define CAN_NCR5	(*( CAN_NCR0_type *) 0xf0018700u)	/* Node 5 Control Register */
#define CAN_NCR6	(*( CAN_NCR0_type *) 0xf0018800u)	/* Node 6 Control Register */
#define CAN_NCR7	(*( CAN_NCR0_type *) 0xf0018900u)	/* Node 7 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int REC            : 8;	/* Receive Error Counter */
		unsigned int TEC            : 8;	/* Transmit Error Counter */
		unsigned int EWRNLVL        : 8;	/* Error Warning Level */
		/* const */ unsigned int LETD           : 1;	/* Last Error Transfer Direction */
		/* const */ unsigned int LEINC          : 1;	/* Last Error Increment */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} CAN_NECNT0_type;
#define CAN_NECNT0	(*( CAN_NECNT0_type *) 0xf0018214u)	/* Node 0 Error Counter Register */
#define CAN_NECNT1	(*( CAN_NECNT0_type *) 0xf0018314u)	/* Node 1 Error Counter Register */
#define CAN_NECNT2	(*( CAN_NECNT0_type *) 0xf0018414u)	/* Node 2 Error Counter Register */
#define CAN_NECNT3	(*( CAN_NECNT0_type *) 0xf0018514u)	/* Node 3 Error Counter Register */
#define CAN_NECNT4	(*( CAN_NECNT0_type *) 0xf0018614u)	/* Node 4 Error Counter Register */
#define CAN_NECNT5	(*( CAN_NECNT0_type *) 0xf0018714u)	/* Node 5 Error Counter Register */
#define CAN_NECNT6	(*( CAN_NECNT0_type *) 0xf0018814u)	/* Node 6 Error Counter Register */
#define CAN_NECNT7	(*( CAN_NECNT0_type *) 0xf0018914u)	/* Node 7 Error Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CFC            : 16;	/* CAN Frame Counter */
		unsigned int CFSEL          : 3;	/* CAN Frame Count Selection */
		unsigned int CFMOD          : 2;	/* CAN Frame Counter Mode */
		unsigned int                : 1;
		unsigned int CFCIE          : 1;	/* CAN Frame Count Interrupt Enable */
		unsigned int CFCOV          : 1;	/* CAN Frame Counter Overflow Flag */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

