svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} CAN_NFCR0_type;
#define CAN_NFCR0	(*( CAN_NFCR0_type *) 0xf0018218u)	/* Node 0 Frame Counter Register */
#define CAN_NFCR1	(*( CAN_NFCR0_type *) 0xf0018318u)	/* Node 1 Frame Counter Register */
#define CAN_NFCR2	(*( CAN_NFCR0_type *) 0xf0018418u)	/* Node 2 Frame Counter Register */
#define CAN_NFCR3	(*( CAN_NFCR0_type *) 0xf0018518u)	/* Node 3 Frame Counter Register */
#define CAN_NFCR4	(*( CAN_NFCR0_type *) 0xf0018618u)	/* Node 4 Frame Counter Register */
#define CAN_NFCR5	(*( CAN_NFCR0_type *) 0xf0018718u)	/* Node 5 Frame Counter Register */
#define CAN_NFCR6	(*( CAN_NFCR0_type *) 0xf0018818u)	/* Node 6 Frame Counter Register */
#define CAN_NFCR7	(*( CAN_NFCR0_type *) 0xf0018918u)	/* Node 7 Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ALINP          : 4;	/* Alert Interrupt Node Pointer */
		unsigned int LECINP         : 4;	/* Last Error Code Interrupt Node Pointer */
		unsigned int TRINP          : 4;	/* Transfer OK Interrupt Node Pointer */
		unsigned int CFCINP         : 4;	/* Frame Counter Interrupt Node Pointer */
		unsigned int TEINP          : 4;	/* Timer Event Interrupt Node Pointer */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CAN_NIPR0_type;
#define CAN_NIPR0	(*( CAN_NIPR0_type *) 0xf0018208u)	/* Node 0 Interrupt Pointer Register */
#define CAN_NIPR1	(*( CAN_NIPR0_type *) 0xf0018308u)	/* Node 1 Interrupt Pointer Register */
#define CAN_NIPR2	(*( CAN_NIPR0_type *) 0xf0018408u)	/* Node 2 Interrupt Pointer Register */
#define CAN_NIPR3	(*( CAN_NIPR0_type *) 0xf0018508u)	/* Node 3 Interrupt Pointer Register */
#define CAN_NIPR4	(*( CAN_NIPR0_type *) 0xf0018608u)	/* Node 4 Interrupt Pointer Register */
#define CAN_NIPR5	(*( CAN_NIPR0_type *) 0xf0018708u)	/* Node 5 Interrupt Pointer Register */
#define CAN_NIPR6	(*( CAN_NIPR0_type *) 0xf0018808u)	/* Node 6 Interrupt Pointer Register */
#define CAN_NIPR7	(*( CAN_NIPR0_type *) 0xf0018908u)	/* Node 7 Interrupt Pointer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXSEL          : 3;	/* Receive Select */
		unsigned int                : 5;
		unsigned int LBM            : 1;	/* Loop-Back Mode */
		unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} CAN_NPCR0_type;
#define CAN_NPCR0	(*( CAN_NPCR0_type *) 0xf001820cu)	/* Node 0 Port Control Register */
#define CAN_NPCR1	(*( CAN_NPCR0_type *) 0xf001830cu)	/* Node 1 Port Control Register */
#define CAN_NPCR2	(*( CAN_NPCR0_type *) 0xf001840cu)	/* Node 2 Port Control Register */
#define CAN_NPCR3	(*( CAN_NPCR0_type *) 0xf001850cu)	/* Node 3 Port Control Register */
#define CAN_NPCR4	(*( CAN_NPCR0_type *) 0xf001860cu)	/* Node 4 Port Control Register */
#define CAN_NPCR5	(*( CAN_NPCR0_type *) 0xf001870cu)	/* Node 5 Port Control Register */
#define CAN_NPCR6	(*( CAN_NPCR0_type *) 0xf001880cu)	/* Node 6 Port Control Register */
#define CAN_NPCR7	(*( CAN_NPCR0_type *) 0xf001890cu)	/* Node 7 Port Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LEC            : 3;	/* Last Error Code */
		unsigned int TXOK           : 1;	/* Message Transmitted Successfully */
		unsigned int RXOK           : 1;	/* Message Received Successfully */
		unsigned int ALERT          : 1;	/* Alert Warning */
		/* const */ unsigned int EWRN           : 1;	/* Error Warning Status */
		/* const */ unsigned int BOFF           : 1;	/* Bus-off Status */
		unsigned int LLE            : 1;	/* List Length Error */
		unsigned int LOE            : 1;	/* List Object Error */
		/* const */ unsigned int SUSACK         : 1;	/* Suspend Acknowledge */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CAN_NSR0_type;
#define CAN_NSR0	(*( CAN_NSR0_type *) 0xf0018204u)	/* Node 0 Status Register */
#define CAN_NSR1	(*( CAN_NSR0_type *) 0xf0018304u)	/* Node 1 Status Register */
#define CAN_NSR2	(*( CAN_NSR0_type *) 0xf0018404u)	/* Node 2 Status Register */
#define CAN_NSR3	(*( CAN_NSR0_type *) 0xf0018504u)	/* Node 3 Status Register */
#define CAN_NSR4	(*( CAN_NSR0_type *) 0xf0018604u)	/* Node 4 Status Register */
#define CAN_NSR5	(*( CAN_NSR0_type *) 0xf0018704u)	/* Node 5 Status Register */
#define CAN_NSR6	(*( CAN_NSR0_type *) 0xf0018804u)	/* Node 6 Status Register */
#define CAN_NSR7	(*( CAN_NSR0_type *) 0xf0018904u)	/* Node 7 Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RELOAD         : 16;	/* Reload Value */
		unsigned int TXMO           : 8;	/* Transmit Message Object */
		unsigned int STRT           : 1;	/* Timer Start */
		unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} CAN_NTATTR0_type;
#define CAN_NTATTR0	(*( CAN_NTATTR0_type *) 0xf0018224u)	/* Node 0 Timer A Transmit Trigger Register */
#define CAN_NTATTR1	(*( CAN_NTATTR0_type *) 0xf0018324u)	/* Node 1 Timer A Transmit Trigger Register */
#define CAN_NTATTR2	(*( CAN_NTATTR0_type *) 0xf0018424u)	/* Node 2 Timer A Transmit Trigger Register */
#define CAN_NTATTR3	(*( CAN_NTATTR0_type *) 0xf0018524u)	/* Node 3 Timer A Transmit Trigger Register */
#define CAN_NTATTR4	(*( CAN_NTATTR0_type *) 0xf0018624u)	/* Node 4 Timer A Transmit Trigger Register */
#define CAN_NTATTR5	(*( CAN_NTATTR0_type *) 0xf0018724u)	/* Node 5 Timer A Transmit Trigger Register */
#define CAN_NTATTR6	(*( CAN_NTATTR0_type *) 0xf0018824u)	/* Node 6 Timer A Transmit Trigger Register */
#define CAN_NTATTR7	(*( CAN_NTATTR0_type *) 0xf0018924u)	/* Node 7 Timer A Transmit Trigger Register */
#define CAN_NTBTTR0	(*( CAN_NTATTR0_type *) 0xf0018228u)	/* Node 0 Timer B Transmit Trigger Register */
#define CAN_NTBTTR1	(*( CAN_NTATTR0_type *) 0xf0018328u)	/* Node 1 Timer B Transmit Trigger Register */
#define CAN_NTBTTR2	(*( CAN_NTATTR0_type *) 0xf0018428u)	/* Node 2 Timer B Transmit Trigger Register */
#define CAN_NTBTTR3	(*( CAN_NTATTR0_type *) 0xf0018528u)	/* Node 3 Timer B Transmit Trigger Register */
#define CAN_NTBTTR4	(*( CAN_NTATTR0_type *) 0xf0018628u)	/* Node 4 Timer B Transmit Trigger Register */
#define CAN_NTBTTR5	(*( CAN_NTATTR0_type *) 0xf0018728u)	/* Node 5 Timer B Transmit Trigger Register */
#define CAN_NTBTTR6	(*( CAN_NTATTR0_type *) 0xf0018828u)	/* Node 6 Timer B Transmit Trigger Register */
#define CAN_NTBTTR7	(*( CAN_NTATTR0_type *) 0xf0018928u)	/* Node 7 Timer B Transmit Trigger Register */
#define CAN_NTCTTR0	(*( CAN_NTATTR0_type *) 0xf001822cu)	/* Node 0 Timer C Transmit Trigger Register */
#define CAN_NTCTTR1	(*( CAN_NTATTR0_type *) 0xf001832cu)	/* Node 1 Timer C Transmit Trigger Register */
#define CAN_NTCTTR2	(*( CAN_NTATTR0_type *) 0xf001842cu)	/* Node 2 Timer C Transmit Trigger Register */
#define CAN_NTCTTR3	(*( CAN_NTATTR0_type *) 0xf001852cu)	/* Node 3 Timer C Transmit Trigger Register */
#define CAN_NTCTTR4	(*( CAN_NTATTR0_type *) 0xf001862cu)	/* Node 4 Timer C Transmit Trigger Register */
#define CAN_NTCTTR5	(*( CAN_NTATTR0_type *) 0xf001872cu)	/* Node 5 Timer C Transmit Trigger Register */
#define CAN_NTCTTR6	(*( CAN_NTATTR0_type *) 0xf001882cu)	/* Node 6 Timer C Transmit Trigger Register */
#define CAN_NTCTTR7	(*( CAN_NTATTR0_type *) 0xf001892cu)	/* Node 7 Timer C Transmit Trigger Register */

