svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 8;
		unsigned int TPSC           : 4;	/* Timer Prescaler */
		unsigned int                : 6;
		unsigned int TRIGSRC        : 3;	/* Trigger Source */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} CAN_NTCCR0_type;
#define CAN_NTCCR0	(*( CAN_NTCCR0_type *) 0xf001821cu)	/* Node 0 Timer Clock Control Register */
#define CAN_NTCCR1	(*( CAN_NTCCR0_type *) 0xf001831cu)	/* Node 1 Timer Clock Control Register */
#define CAN_NTCCR2	(*( CAN_NTCCR0_type *) 0xf001841cu)	/* Node 2 Timer Clock Control Register */
#define CAN_NTCCR3	(*( CAN_NTCCR0_type *) 0xf001851cu)	/* Node 3 Timer Clock Control Register */
#define CAN_NTCCR4	(*( CAN_NTCCR0_type *) 0xf001861cu)	/* Node 4 Timer Clock Control Register */
#define CAN_NTCCR5	(*( CAN_NTCCR0_type *) 0xf001871cu)	/* Node 5 Timer Clock Control Register */
#define CAN_NTCCR6	(*( CAN_NTCCR0_type *) 0xf001881cu)	/* Node 6 Timer Clock Control Register */
#define CAN_NTCCR7	(*( CAN_NTCCR0_type *) 0xf001891cu)	/* Node 7 Timer Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RELOAD         : 16;	/* Reload Value */
		unsigned int                : 6;
		unsigned int TEIE           : 1;	/* Timer Event Interrupt Enable */
		unsigned int TE             : 1;	/* Timer Event */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CAN_NTRTR0_type;
#define CAN_NTRTR0	(*( CAN_NTRTR0_type *) 0xf0018220u)	/* Node 0 Timer Receive Timeout Register */
#define CAN_NTRTR1	(*( CAN_NTRTR0_type *) 0xf0018320u)	/* Node 1 Timer Receive Timeout Register */
#define CAN_NTRTR2	(*( CAN_NTRTR0_type *) 0xf0018420u)	/* Node 2 Timer Receive Timeout Register */
#define CAN_NTRTR3	(*( CAN_NTRTR0_type *) 0xf0018520u)	/* Node 3 Timer Receive Timeout Register */
#define CAN_NTRTR4	(*( CAN_NTRTR0_type *) 0xf0018620u)	/* Node 4 Timer Receive Timeout Register */
#define CAN_NTRTR5	(*( CAN_NTRTR0_type *) 0xf0018720u)	/* Node 5 Timer Receive Timeout Register */
#define CAN_NTRTR6	(*( CAN_NTRTR0_type *) 0xf0018820u)	/* Node 6 Timer Receive Timeout Register */
#define CAN_NTRTR7	(*( CAN_NTRTR0_type *) 0xf0018920u)	/* Node 7 Timer Receive Timeout Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} CAN_OCS_type;
#define CAN_OCS	(*( CAN_OCS_type *) 0xf00180e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int PANCMD         : 8;	/* Panel Command */
		/* const */ unsigned int BUSY           : 1;	/* Panel Busy Flag */
		/* const */ unsigned int RBUSY          : 1;	/* Result Busy Flag */
		unsigned int                : 6;
		unsigned int PANAR1         : 8;	/* Panel Argument 1 */
		unsigned int PANAR2         : 8;	/* Panel Argument 2 */
	} B;
	int I;
	unsigned int U;

} CAN_PANCTR_type;
#define CAN_PANCTR	(*( CAN_PANCTR_type *) 0xf00181c4u)	/* Panel Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 9;
		/* const */ unsigned int REFMFR         : 7;	/* Reference Mark Fraction */
		/* const */ unsigned int REFM           : 16;	/* Reference Mark */
	} B;
	int I;
	unsigned int U;

} CAN_REFMR_type;
#define CAN_REFMR	(*( CAN_REFMR_type *) 0xf0018288u)	/* Reference Mark Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int INP            : 4;	/* Interrupt Node Pointer */
		/* const */ unsigned int IENTRAF0       : 1;	/* Interrupt Enable if TRAF=0 */
		/* const */ unsigned int IENTRAF1       : 1;	/* Interrupt Enable if TRAF=1 */
		/* const */ unsigned int IENRECF0       : 1;	/* Interrupt Enable if RECF=0 */
		/* const */ unsigned int IENRECF1       : 1;	/* Interrupt Enable if RECF=1 */
		/* const */ unsigned int CHEN           : 1;	/* Check Enable */
		/* const */ unsigned int TREN           : 1;	/* Transmit Enable */
		/* const */ unsigned int ALTMSG         : 2;	/* Alternative Message */
		/* const */ unsigned int ARBM           : 2;	/* Arbitration Mode */
		/* const */ unsigned int GM             : 1;	/* Gap Mode */
		/* const */ unsigned int ICF            : 1;	/* Instruction Collection Finished */
		/* const */ unsigned int RCEV           : 1;	/* Receive Control Entry Valid */
		/* const */ unsigned int TCEV           : 1;	/* Transmit Control Entry Valid */
		/* const */ unsigned int ICEV           : 1;	/* Interrupt Control Entry Valid */
		/* const */ unsigned int ARBV           : 1;	/* Arbitration Entry Valid */
		/* const */ unsigned int TMEV           : 1;	/* Time Mark Entry Valid */
		/* const */ unsigned int RMEV           : 1;	/* Reference Mark Entry Valid */
		/* const */ unsigned int BCEV           : 1;	/* Basic Cycle End Entry Valid */
		/* const */ unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} CAN_SISR_type;
#define CAN_SISR	(*( CAN_SISR_type *) 0xf00182f8u)	/* Scheduler Instruction Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STPTR          : 7;	/* Start Pointer */
		/* const */ unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

} CAN_STPTR0_type;
#define CAN_STPTR0	(*( CAN_STPTR0_type *) 0xf001bffcu)	/* Scheduler Start Pointer Node 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TMETMV         : 16;	/* Time Mark Value from TME */
		/* const */ unsigned int RCEMSGNR       : 8;	/* Receive Control Entry Message Number */
		/* const */ unsigned int TCEMSGNR       : 8;	/* Transmit Control Entry Message Number */
	} B;
	int I;
	unsigned int U;

