svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} CAN_STSRH_type;
#define CAN_STSRH	(*( CAN_STSRH_type *) 0xf00182f4u)	/* Scheduler Timing Status Register High */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RMETMV         : 16;	/* Time Mark Value from RME */
		/* const */ unsigned int BCETMV         : 16;	/* Time Mark Value from BCE */
	} B;
	int I;
	unsigned int U;

} CAN_STSRL_type;
#define CAN_STSRL	(*( CAN_STSRL_type *) 0xf00182f0u)	/* Scheduler Timing Status Register Low */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 9;
		/* const */ unsigned int SYNMFR         : 7;	/* Synchronization Mark Fraction */
		/* const */ unsigned int SYNM           : 16;	/* Synchronization Mark */
	} B;
	int I;
	unsigned int U;

} CAN_SYNMR_type;
#define CAN_SYNMR	(*( CAN_SYNMR_type *) 0xf0018284u)	/* Synchronization Mark Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IRO            : 7;	/* Initial Reference Offset */
		unsigned int                : 1;
		unsigned int EXPTT          : 8;	/* Expected Transmit Triggers */
		/* const */ unsigned int RTO            : 8;	/* Reference Trigger Offset */
		/* const */ unsigned int TTCNT          : 8;	/* Transmit Trigger Counter */
	} B;
	int I;
	unsigned int U;

} CAN_TTCFGR_type;
#define CAN_TTCFGR	(*( CAN_TTCFGR_type *) 0xf00182c4u)	/* Time Trigger Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TTM            : 2;	/* Time Trigger Mode */
		unsigned int ETESEL         : 2;	/* External Trigger Event Selection */
		unsigned int ETSSEL         : 3;	/* External Trigger Source Selection */
		unsigned int ETM            : 1;	/* External Trigger Mode */
		unsigned int TTLVL          : 1;	/* Time Trigger Level */
		unsigned int LTCTSS         : 3;	/* Local Time Capture Trigger Source Select */
		unsigned int TMPRIO         : 3;	/* Time Master Priority */
		unsigned int ETSSEX         : 1;	/* External Trigger Source Select Extension */
		unsigned int CYCLE          : 6;	/* Basic Cycle Number */
		unsigned int                : 2;
		unsigned int TENW           : 4;	/* Transmit Enable Window */
		unsigned int RMDLC          : 4;	/* Reference Message DLC */
	} B;
	int I;
	unsigned int U;

} CAN_TTCR_type;
#define CAN_TTCR	(*( CAN_TTCR_type *) 0xf00182c0u)	/* Time Trigger Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CFGMEL         : 2;	/* Configuration Mode Enter/Leave */
		unsigned int NIGSR          : 2;	/* Next Is Gap Flag Set/Reset */
		unsigned int STE            : 1;	/* Software Trigger Event */
		unsigned int ETREVR         : 1;	/* Reset External Trigger Event */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CAN_TTFMR_type;
#define CAN_TTFMR	(*( CAN_TTFMR_type *) 0xf00182ccu)	/* Time Trigger Flag Modification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NBCIE          : 2;	/* New Basic Cycle Interrupt Enable */
		unsigned int TENWERIE       : 1;	/* Transmit Enable Window Error Interrupt Enable */
		unsigned int TTERIE         : 1;	/* Transmit Trigger Error Interrupt Enable */
		unsigned int                : 2;
		unsigned int WTEIE          : 1;	/* Watch Trigger Event Interrupt Enable */
		unsigned int AWDIE          : 1;	/* Application Watchdog Interrupt Enable */
		unsigned int ERRSCIE        : 1;	/* Error State Change Interrupt Enable */
		unsigned int MSRCIE         : 1;	/* Master Slave Relation Change Interrupt Enable */
		unsigned int SYNCSCIE       : 1;	/* Synchronization State Change Interrupt Enable */
		unsigned int SEIE           : 1;	/* Scheduler Error Interrupt Enable */
		unsigned int NOTIFIE        : 1;	/* Notification Interrupt Enable */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CAN_TTIER_type;
#define CAN_TTIER	(*( CAN_TTIER_type *) 0xf00182d4u)	/* Time Trigger Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ERRINP         : 4;	/* Error Interrupt Node Pointer */
		unsigned int NBCINP         : 4;	/* New Basic Cycle Interrupt Node Pointer */
		unsigned int NOTIFINP       : 4;	/* Notification Interrupt Node Pointer */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CAN_TTINPR_type;
#define CAN_TTINPR	(*( CAN_TTINPR_type *) 0xf00182d8u)	/* Time Trigger Interrupt Node Pointer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NMC            : 1;	/* New Matrix Cycle */
		unsigned int NBC            : 1;	/* New Basic Cycle */
		unsigned int TENWER         : 1;	/* Transmit Enable Window Error */
		unsigned int TTUF           : 1;	/* Transmit Trigger Underflow */
		unsigned int TTOF           : 1;	/* Transmit Trigger Overflow */
		unsigned int WTE            : 1;	/* Watch Trigger EventThe WTE can be generated only after the first message has been transferred on the bus. */
		unsigned int IWTE           : 1;	/* Init Watch Trigger EventThe IWTE can be generated only until the first message has been transferred on the bus. */
		unsigned int AWDERR         : 1;	/* Application Watchdog Error */
		unsigned int ERRSC          : 1;	/* Error State Change */
		unsigned int MSRC           : 1;	/* Master-Slave Relation Change */
		unsigned int SYNCSC         : 1;	/* Synchronization State Change */
		unsigned int EOS            : 1;	/* End Of Scheduler Entry Flag */
		unsigned int WFE            : 1;	/* Wait For Event Flag */
		unsigned int DISC           : 1;	/* Discontinuity Flag */
		unsigned int SERR1          : 1;	/* Scheduler Error 1 Flag */
		unsigned int SERR2          : 1;	/* Scheduler Error 2 Flag */
		unsigned int CFGERR         : 1;	/* Configuration Error */
		unsigned int TURERR         : 1;	/* TUR Adjust Error */
		unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} CAN_TTIRR_type;
#define CAN_TTIRR	(*( CAN_TTIRR_type *) 0xf00182d0u)	/* Time Trigger Interrupt Request Register */

