svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ERRS           : 2;	/* Error State */
		/* const */ unsigned int MSR            : 2;	/* Master-Slave Relation */
		/* const */ unsigned int SYNCS          : 2;	/* Synchronization State */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int EFI            : 1;	/* Error Frame Indication */
		/* const */ unsigned int EFF            : 1;	/* Error Frame Flag */
		/* const */ unsigned int REFTRG         : 1;	/* Reference Trigger Flag */
		/* const */ unsigned int ARB            : 1;	/* Arbitration Window Flag */
		/* const */ unsigned int CFGM           : 1;	/* Configuration Mode Flag */
		/* const */ unsigned int TMPC           : 1;	/* Time Master Priority Conflict */
		/* const */ unsigned int TRAF           : 1;	/* Transmission Finished Flag */
		/* const */ unsigned int RECF           : 1;	/* Reception Finished Flag */
		/* const */ unsigned int MSCMIN         : 3;	/* Minimum of MSC Bit Fields */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int MSCMAX         : 3;	/* Maximum of MSC Bit Fields */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int NIG            : 1;	/* Next Is Gap */
		/* const */ unsigned int ETR            : 1;	/* External Trigger Request */
		/* const */ unsigned int ETREV          : 1;	/* External Trigger Event */
		/* const */ unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} CAN_TTSR_type;
#define CAN_TTSR	(*( CAN_TTSR_type *) 0xf00182c8u)	/* Time Trigger Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADJEN          : 1;	/* Adjust Enable */
		unsigned int                : 5;
		unsigned int TURADJ         : 10;	/* Time Unit Ratio Adjust */
		/* const */ unsigned int VAL            : 1;	/* Valid */
		unsigned int LTCS           : 1;	/* Local Time Clock Source */
		unsigned int LTDIV          : 3;	/* Local Time Divider */
		unsigned int                : 1;
		/* const */ unsigned int TUR            : 10;	/* TUR */
	} B;
	int I;
	unsigned int U;

} CAN_TURR_type;
#define CAN_TURR	(*( CAN_TURR_type *) 0xf0018290u)	/* Time Unit Ratio Register */


/* DMA */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} DMA_ACCEN00_type;
#define DMA_ACCEN00	(*( DMA_ACCEN00_type *) 0xf00148fcu)	/* DMA Sub-block 0 Access Enable Register 0 */
#define DMA_ACCEN10	(*( DMA_ACCEN00_type *) 0xf00158fcu)	/* DMA Sub-block 1 Access Enable Register 0 */
#define SDMA_ACCEN00	(*( DMA_ACCEN00_type *) 0xf00108fcu)	/* SDMA Sub-block 0 Access Enable Register 0 */
#define SDMA_ACCEN10	(*( DMA_ACCEN00_type *) 0xf00118fcu)	/* SDMA Sub-block 1 Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_ACCEN01_type;
#define DMA_ACCEN01	(*( DMA_ACCEN01_type *) 0xf00148f8u)	/* DMA Sub-block 0 Access Enable Register 1 */
#define DMA_ACCEN11	(*( DMA_ACCEN01_type *) 0xf00158f8u)	/* DMA Sub-block 1 Access Enable Register 1 */
#define SDMA_ACCEN01	(*( DMA_ACCEN01_type *) 0xf00108f8u)	/* SDMA Sub-block 0 Access Enable Register 1 */
#define SDMA_ACCEN11	(*( DMA_ACCEN01_type *) 0xf00118f8u)	/* SDMA Sub-block 1 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int SMF            : 3;	/* Source Address Modification Factor */
		unsigned int INCS           : 1;	/* Increment of Source Address */
		unsigned int DMF            : 3;	/* Destination Address Modification Factor */
		unsigned int INCD           : 1;	/* Increment of Destination Address */
		unsigned int CBLS           : 4;	/* Circular Buffer Length Source */
		unsigned int CBLD           : 4;	/* Circular Buffer Length Destination */
		unsigned int SHCT           : 2;	/* Shadow Control */
		unsigned int SHWEN          : 1;	/* Shadow Address Register Write Enable */
		/* const */ unsigned int RES            : 13;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_ADRCR000_type;
#define DMA_ADRCR000	(*( DMA_ADRCR000_type *) 0xf001408cu)	/* DMA Channel 000 Address Control Register */
#define DMA_ADRCR001	(*( DMA_ADRCR000_type *) 0xf00140acu)	/* DMA Channel 001 Address Control Register */
#define DMA_ADRCR002	(*( DMA_ADRCR000_type *) 0xf00140ccu)	/* DMA Channel 002 Address Control Register */
#define DMA_ADRCR003	(*( DMA_ADRCR000_type *) 0xf00140ecu)	/* DMA Channel 003 Address Control Register */
#define DMA_ADRCR004	(*( DMA_ADRCR000_type *) 0xf001410cu)	/* DMA Channel 004 Address Control Register */
#define DMA_ADRCR005	(*( DMA_ADRCR000_type *) 0xf001412cu)	/* DMA Channel 005 Address Control Register */
#define DMA_ADRCR006	(*( DMA_ADRCR000_type *) 0xf001414cu)	/* DMA Channel 006 Address Control Register */
#define DMA_ADRCR007	(*( DMA_ADRCR000_type *) 0xf001416cu)	/* DMA Channel 007 Address Control Register */
#define DMA_ADRCR008	(*( DMA_ADRCR000_type *) 0xf001418cu)	/* DMA Channel 008 Address Control Register */
#define DMA_ADRCR009	(*( DMA_ADRCR000_type *) 0xf00141acu)	/* DMA Channel 009 Address Control Register */
#define DMA_ADRCR010	(*( DMA_ADRCR000_type *) 0xf00141ccu)	/* DMA Channel 010 Address Control Register */
#define DMA_ADRCR011	(*( DMA_ADRCR000_type *) 0xf00141ecu)	/* DMA Channel 011 Address Control Register */
#define DMA_ADRCR012	(*( DMA_ADRCR000_type *) 0xf001420cu)	/* DMA Channel 012 Address Control Register */
#define DMA_ADRCR013	(*( DMA_ADRCR000_type *) 0xf001422cu)	/* DMA Channel 013 Address Control Register */
#define DMA_ADRCR014	(*( DMA_ADRCR000_type *) 0xf001424cu)	/* DMA Channel 014 Address Control Register */
#define DMA_ADRCR015	(*( DMA_ADRCR000_type *) 0xf001426cu)	/* DMA Channel 015 Address Control Register */
#define DMA_ADRCR016	(*( DMA_ADRCR000_type *) 0xf001428cu)	/* DMA Channel 016 Address Control Register */
#define DMA_ADRCR017	(*( DMA_ADRCR000_type *) 0xf00142acu)	/* DMA Channel 017 Address Control Register */
#define DMA_ADRCR018	(*( DMA_ADRCR000_type *) 0xf00142ccu)	/* DMA Channel 018 Address Control Register */
#define DMA_ADRCR019	(*( DMA_ADRCR000_type *) 0xf00142ecu)	/* DMA Channel 019 Address Control Register */
#define DMA_ADRCR020	(*( DMA_ADRCR000_type *) 0xf001430cu)	/* DMA Channel 020 Address Control Register */
#define DMA_ADRCR021	(*( DMA_ADRCR000_type *) 0xf001432cu)	/* DMA Channel 021 Address Control Register */
#define DMA_ADRCR022	(*( DMA_ADRCR000_type *) 0xf001434cu)	/* DMA Channel 022 Address Control Register */
#define DMA_ADRCR023	(*( DMA_ADRCR000_type *) 0xf001436cu)	/* DMA Channel 023 Address Control Register */
#define DMA_ADRCR100	(*( DMA_ADRCR000_type *) 0xf001508cu)	/* DMA Channel 100 Address Control Register */
#define DMA_ADRCR101	(*( DMA_ADRCR000_type *) 0xf00150acu)	/* DMA Channel 101 Address Control Register */
#define DMA_ADRCR102	(*( DMA_ADRCR000_type *) 0xf00150ccu)	/* DMA Channel 102 Address Control Register */
#define DMA_ADRCR103	(*( DMA_ADRCR000_type *) 0xf00150ecu)	/* DMA Channel 103 Address Control Register */
#define DMA_ADRCR104	(*( DMA_ADRCR000_type *) 0xf001510cu)	/* DMA Channel 104 Address Control Register */
#define DMA_ADRCR105	(*( DMA_ADRCR000_type *) 0xf001512cu)	/* DMA Channel 105 Address Control Register */
#define DMA_ADRCR106	(*( DMA_ADRCR000_type *) 0xf001514cu)	/* DMA Channel 106 Address Control Register */
#define DMA_ADRCR107	(*( DMA_ADRCR000_type *) 0xf001516cu)	/* DMA Channel 107 Address Control Register */
#define DMA_ADRCR108	(*( DMA_ADRCR000_type *) 0xf001518cu)	/* DMA Channel 108 Address Control Register */
#define DMA_ADRCR109	(*( DMA_ADRCR000_type *) 0xf00151acu)	/* DMA Channel 109 Address Control Register */
#define DMA_ADRCR110	(*( DMA_ADRCR000_type *) 0xf00151ccu)	/* DMA Channel 110 Address Control Register */
#define DMA_ADRCR111	(*( DMA_ADRCR000_type *) 0xf00151ecu)	/* DMA Channel 111 Address Control Register */
#define DMA_ADRCR112	(*( DMA_ADRCR000_type *) 0xf001520cu)	/* DMA Channel 112 Address Control Register */
#define DMA_ADRCR113	(*( DMA_ADRCR000_type *) 0xf001522cu)	/* DMA Channel 113 Address Control Register */
#define DMA_ADRCR114	(*( DMA_ADRCR000_type *) 0xf001524cu)	/* DMA Channel 114 Address Control Register */
#define DMA_ADRCR115	(*( DMA_ADRCR000_type *) 0xf001526cu)	/* DMA Channel 115 Address Control Register */
#define DMA_ADRCR116	(*( DMA_ADRCR000_type *) 0xf001528cu)	/* DMA Channel 116 Address Control Register */
#define DMA_ADRCR117	(*( DMA_ADRCR000_type *) 0xf00152acu)	/* DMA Channel 117 Address Control Register */
#define DMA_ADRCR118	(*( DMA_ADRCR000_type *) 0xf00152ccu)	/* DMA Channel 118 Address Control Register */
#define DMA_ADRCR119	(*( DMA_ADRCR000_type *) 0xf00152ecu)	/* DMA Channel 119 Address Control Register */
#define DMA_ADRCR120	(*( DMA_ADRCR000_type *) 0xf001530cu)	/* DMA Channel 120 Address Control Register */
#define DMA_ADRCR121	(*( DMA_ADRCR000_type *) 0xf001532cu)	/* DMA Channel 121 Address Control Register */
#define DMA_ADRCR122	(*( DMA_ADRCR000_type *) 0xf001534cu)	/* DMA Channel 122 Address Control Register */
#define DMA_ADRCR123	(*( DMA_ADRCR000_type *) 0xf001536cu)	/* DMA Channel 123 Address Control Register */
#define SDMA_ADRCR000	(*( DMA_ADRCR000_type *) 0xf001008cu)	/* SDMA Channel 000 Address Control Register */
#define SDMA_ADRCR001	(*( DMA_ADRCR000_type *) 0xf00100acu)	/* SDMA Channel 001 Address Control Register */
#define SDMA_ADRCR002	(*( DMA_ADRCR000_type *) 0xf00100ccu)	/* SDMA Channel 002 Address Control Register */
#define SDMA_ADRCR003	(*( DMA_ADRCR000_type *) 0xf00100ecu)	/* SDMA Channel 003 Address Control Register */
#define SDMA_ADRCR004	(*( DMA_ADRCR000_type *) 0xf001010cu)	/* SDMA Channel 004 Address Control Register */
#define SDMA_ADRCR005	(*( DMA_ADRCR000_type *) 0xf001012cu)	/* SDMA Channel 005 Address Control Register */
#define SDMA_ADRCR006	(*( DMA_ADRCR000_type *) 0xf001014cu)	/* SDMA Channel 006 Address Control Register */
#define SDMA_ADRCR007	(*( DMA_ADRCR000_type *) 0xf001016cu)	/* SDMA Channel 007 Address Control Register */
#define SDMA_ADRCR100	(*( DMA_ADRCR000_type *) 0xf001108cu)	/* SDMA Channel 100 Address Control Register */
#define SDMA_ADRCR101	(*( DMA_ADRCR000_type *) 0xf00110acu)	/* SDMA Channel 101 Address Control Register */
#define SDMA_ADRCR102	(*( DMA_ADRCR000_type *) 0xf00110ccu)	/* SDMA Channel 102 Address Control Register */
#define SDMA_ADRCR103	(*( DMA_ADRCR000_type *) 0xf00110ecu)	/* SDMA Channel 103 Address Control Register */
#define SDMA_ADRCR104	(*( DMA_ADRCR000_type *) 0xf001110cu)	/* SDMA Channel 104 Address Control Register */
#define SDMA_ADRCR105	(*( DMA_ADRCR000_type *) 0xf001112cu)	/* SDMA Channel 105 Address Control Register */
#define SDMA_ADRCR106	(*( DMA_ADRCR000_type *) 0xf001114cu)	/* SDMA Channel 106 Address Control Register */
#define SDMA_ADRCR107	(*( DMA_ADRCR000_type *) 0xf001116cu)	/* SDMA Channel 107 Address Control Register */

