svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TREL           : 14;	/* Transfer Reload Value */
		/* const */ unsigned int RES            : 2;	/* Reserved */
		unsigned int BLKM           : 3;	/* Block Mode */
		unsigned int RROAT          : 1;	/* Reset Request Only After Transaction */
		unsigned int CHMODE         : 1;	/* Channel Operation Mode */
		unsigned int CHDW           : 2;	/* Channel Data Width */
		unsigned int                : 1;
		unsigned int PATSEL         : 2;	/* Pattern Select */
		unsigned int ECH            : 1;	/* Enable Hardware Transfer Request */
		unsigned int DCH            : 1;	/* Disable Hardware Transfer Request */
		unsigned int PRSEL          : 1;	/* Peripheral Request Select */
		unsigned int SCH            : 1;	/* Set Transaction Request for DMA Channel z */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} DMA_CHCR000_type;
#define DMA_CHCR000	(*( DMA_CHCR000_type *) 0xf0014084u)	/* DMA Channel 000 Control Register */
#define DMA_CHCR001	(*( DMA_CHCR000_type *) 0xf00140a4u)	/* DMA Channel 001 Control Register */
#define DMA_CHCR002	(*( DMA_CHCR000_type *) 0xf00140c4u)	/* DMA Channel 002 Control Register */
#define DMA_CHCR003	(*( DMA_CHCR000_type *) 0xf00140e4u)	/* DMA Channel 003 Control Register */
#define DMA_CHCR004	(*( DMA_CHCR000_type *) 0xf0014104u)	/* DMA Channel 004 Control Register */
#define DMA_CHCR005	(*( DMA_CHCR000_type *) 0xf0014124u)	/* DMA Channel 005 Control Register */
#define DMA_CHCR006	(*( DMA_CHCR000_type *) 0xf0014144u)	/* DMA Channel 006 Control Register */
#define DMA_CHCR007	(*( DMA_CHCR000_type *) 0xf0014164u)	/* DMA Channel 007 Control Register */
#define DMA_CHCR008	(*( DMA_CHCR000_type *) 0xf0014184u)	/* DMA Channel 008 Control Register */
#define DMA_CHCR009	(*( DMA_CHCR000_type *) 0xf00141a4u)	/* DMA Channel 009 Control Register */
#define DMA_CHCR010	(*( DMA_CHCR000_type *) 0xf00141c4u)	/* DMA Channel 010 Control Register */
#define DMA_CHCR011	(*( DMA_CHCR000_type *) 0xf00141e4u)	/* DMA Channel 011 Control Register */
#define DMA_CHCR012	(*( DMA_CHCR000_type *) 0xf0014204u)	/* DMA Channel 012 Control Register */
#define DMA_CHCR013	(*( DMA_CHCR000_type *) 0xf0014224u)	/* DMA Channel 013 Control Register */
#define DMA_CHCR014	(*( DMA_CHCR000_type *) 0xf0014244u)	/* DMA Channel 014 Control Register */
#define DMA_CHCR015	(*( DMA_CHCR000_type *) 0xf0014264u)	/* DMA Channel 015 Control Register */
#define DMA_CHCR016	(*( DMA_CHCR000_type *) 0xf0014284u)	/* DMA Channel 016 Control Register */
#define DMA_CHCR017	(*( DMA_CHCR000_type *) 0xf00142a4u)	/* DMA Channel 017 Control Register */
#define DMA_CHCR018	(*( DMA_CHCR000_type *) 0xf00142c4u)	/* DMA Channel 018 Control Register */
#define DMA_CHCR019	(*( DMA_CHCR000_type *) 0xf00142e4u)	/* DMA Channel 019 Control Register */
#define DMA_CHCR020	(*( DMA_CHCR000_type *) 0xf0014304u)	/* DMA Channel 020 Control Register */
#define DMA_CHCR021	(*( DMA_CHCR000_type *) 0xf0014324u)	/* DMA Channel 021 Control Register */
#define DMA_CHCR022	(*( DMA_CHCR000_type *) 0xf0014344u)	/* DMA Channel 022 Control Register */
#define DMA_CHCR023	(*( DMA_CHCR000_type *) 0xf0014364u)	/* DMA Channel 023 Control Register */
#define DMA_CHCR100	(*( DMA_CHCR000_type *) 0xf0015084u)	/* DMA Channel 100 Control Register */
#define DMA_CHCR101	(*( DMA_CHCR000_type *) 0xf00150a4u)	/* DMA Channel 101 Control Register */
#define DMA_CHCR102	(*( DMA_CHCR000_type *) 0xf00150c4u)	/* DMA Channel 102 Control Register */
#define DMA_CHCR103	(*( DMA_CHCR000_type *) 0xf00150e4u)	/* DMA Channel 103 Control Register */
#define DMA_CHCR104	(*( DMA_CHCR000_type *) 0xf0015104u)	/* DMA Channel 104 Control Register */
#define DMA_CHCR105	(*( DMA_CHCR000_type *) 0xf0015124u)	/* DMA Channel 105 Control Register */
#define DMA_CHCR106	(*( DMA_CHCR000_type *) 0xf0015144u)	/* DMA Channel 106 Control Register */
#define DMA_CHCR107	(*( DMA_CHCR000_type *) 0xf0015164u)	/* DMA Channel 107 Control Register */
#define DMA_CHCR108	(*( DMA_CHCR000_type *) 0xf0015184u)	/* DMA Channel 108 Control Register */
#define DMA_CHCR109	(*( DMA_CHCR000_type *) 0xf00151a4u)	/* DMA Channel 109 Control Register */
#define DMA_CHCR110	(*( DMA_CHCR000_type *) 0xf00151c4u)	/* DMA Channel 110 Control Register */
#define DMA_CHCR111	(*( DMA_CHCR000_type *) 0xf00151e4u)	/* DMA Channel 111 Control Register */
#define DMA_CHCR112	(*( DMA_CHCR000_type *) 0xf0015204u)	/* DMA Channel 112 Control Register */
#define DMA_CHCR113	(*( DMA_CHCR000_type *) 0xf0015224u)	/* DMA Channel 113 Control Register */
#define DMA_CHCR114	(*( DMA_CHCR000_type *) 0xf0015244u)	/* DMA Channel 114 Control Register */
#define DMA_CHCR115	(*( DMA_CHCR000_type *) 0xf0015264u)	/* DMA Channel 115 Control Register */
#define DMA_CHCR116	(*( DMA_CHCR000_type *) 0xf0015284u)	/* DMA Channel 116 Control Register */
#define DMA_CHCR117	(*( DMA_CHCR000_type *) 0xf00152a4u)	/* DMA Channel 117 Control Register */
#define DMA_CHCR118	(*( DMA_CHCR000_type *) 0xf00152c4u)	/* DMA Channel 118 Control Register */
#define DMA_CHCR119	(*( DMA_CHCR000_type *) 0xf00152e4u)	/* DMA Channel 119 Control Register */
#define DMA_CHCR120	(*( DMA_CHCR000_type *) 0xf0015304u)	/* DMA Channel 120 Control Register */
#define DMA_CHCR121	(*( DMA_CHCR000_type *) 0xf0015324u)	/* DMA Channel 121 Control Register */
#define DMA_CHCR122	(*( DMA_CHCR000_type *) 0xf0015344u)	/* DMA Channel 122 Control Register */
#define DMA_CHCR123	(*( DMA_CHCR000_type *) 0xf0015364u)	/* DMA Channel 123 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int WRPSE          : 1;	/* Wrap Source Enable */
		unsigned int WRPDE          : 1;	/* Wrap Destination Enable */
		unsigned int INTCT          : 2;	/* Interrupt Control */
		unsigned int ETRL           : 1;	/* Enable Transaction Request Lost Interrupt */
		/* const */ unsigned int RES            : 7;	/* Reserved */
		unsigned int IRDV           : 4;	/* Interrupt Raise Detect Value */
		unsigned int CWRP           : 1;	/* Clear Wrap Buffer Interrupt xz */
		unsigned int                : 1;
		unsigned int CICH           : 1;	/* Clear Interrupt for DMA Channel xz */
		unsigned int                : 1;
		unsigned int CTL            : 1;	/* Clear Transaction Request Lost for DMA Channel xz */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} DMA_CHICR000_type;
#define DMA_CHICR000	(*( DMA_CHICR000_type *) 0xf0014088u)	/* DMA Channel 000 Interrupt Control Register */
#define DMA_CHICR001	(*( DMA_CHICR000_type *) 0xf00140a8u)	/* DMA Channel 001 Interrupt Control Register */
#define DMA_CHICR002	(*( DMA_CHICR000_type *) 0xf00140c8u)	/* DMA Channel 002 Interrupt Control Register */
#define DMA_CHICR003	(*( DMA_CHICR000_type *) 0xf00140e8u)	/* DMA Channel 003 Interrupt Control Register */
#define DMA_CHICR004	(*( DMA_CHICR000_type *) 0xf0014108u)	/* DMA Channel 004 Interrupt Control Register */
#define DMA_CHICR005	(*( DMA_CHICR000_type *) 0xf0014128u)	/* DMA Channel 005 Interrupt Control Register */
#define DMA_CHICR006	(*( DMA_CHICR000_type *) 0xf0014148u)	/* DMA Channel 006 Interrupt Control Register */
#define DMA_CHICR007	(*( DMA_CHICR000_type *) 0xf0014168u)	/* DMA Channel 007 Interrupt Control Register */
#define DMA_CHICR008	(*( DMA_CHICR000_type *) 0xf0014188u)	/* DMA Channel 008 Interrupt Control Register */
#define DMA_CHICR009	(*( DMA_CHICR000_type *) 0xf00141a8u)	/* DMA Channel 009 Interrupt Control Register */
#define DMA_CHICR010	(*( DMA_CHICR000_type *) 0xf00141c8u)	/* DMA Channel 010 Interrupt Control Register */
#define DMA_CHICR011	(*( DMA_CHICR000_type *) 0xf00141e8u)	/* DMA Channel 011 Interrupt Control Register */
#define DMA_CHICR012	(*( DMA_CHICR000_type *) 0xf0014208u)	/* DMA Channel 012 Interrupt Control Register */
#define DMA_CHICR013	(*( DMA_CHICR000_type *) 0xf0014228u)	/* DMA Channel 013 Interrupt Control Register */
#define DMA_CHICR014	(*( DMA_CHICR000_type *) 0xf0014248u)	/* DMA Channel 014 Interrupt Control Register */
#define DMA_CHICR015	(*( DMA_CHICR000_type *) 0xf0014268u)	/* DMA Channel 015 Interrupt Control Register */
#define DMA_CHICR016	(*( DMA_CHICR000_type *) 0xf0014288u)	/* DMA Channel 016 Interrupt Control Register */
#define DMA_CHICR017	(*( DMA_CHICR000_type *) 0xf00142a8u)	/* DMA Channel 017 Interrupt Control Register */
#define DMA_CHICR018	(*( DMA_CHICR000_type *) 0xf00142c8u)	/* DMA Channel 018 Interrupt Control Register */
#define DMA_CHICR019	(*( DMA_CHICR000_type *) 0xf00142e8u)	/* DMA Channel 019 Interrupt Control Register */
#define DMA_CHICR020	(*( DMA_CHICR000_type *) 0xf0014308u)	/* DMA Channel 020 Interrupt Control Register */
#define DMA_CHICR021	(*( DMA_CHICR000_type *) 0xf0014328u)	/* DMA Channel 021 Interrupt Control Register */
#define DMA_CHICR022	(*( DMA_CHICR000_type *) 0xf0014348u)	/* DMA Channel 022 Interrupt Control Register */
#define DMA_CHICR023	(*( DMA_CHICR000_type *) 0xf0014368u)	/* DMA Channel 023 Interrupt Control Register */
#define DMA_CHICR100	(*( DMA_CHICR000_type *) 0xf0015088u)	/* DMA Channel 100 Interrupt Control Register */
#define DMA_CHICR101	(*( DMA_CHICR000_type *) 0xf00150a8u)	/* DMA Channel 101 Interrupt Control Register */
#define DMA_CHICR102	(*( DMA_CHICR000_type *) 0xf00150c8u)	/* DMA Channel 102 Interrupt Control Register */
#define DMA_CHICR103	(*( DMA_CHICR000_type *) 0xf00150e8u)	/* DMA Channel 103 Interrupt Control Register */
#define DMA_CHICR104	(*( DMA_CHICR000_type *) 0xf0015108u)	/* DMA Channel 104 Interrupt Control Register */
#define DMA_CHICR105	(*( DMA_CHICR000_type *) 0xf0015128u)	/* DMA Channel 105 Interrupt Control Register */
#define DMA_CHICR106	(*( DMA_CHICR000_type *) 0xf0015148u)	/* DMA Channel 106 Interrupt Control Register */
#define DMA_CHICR107	(*( DMA_CHICR000_type *) 0xf0015168u)	/* DMA Channel 107 Interrupt Control Register */
#define DMA_CHICR108	(*( DMA_CHICR000_type *) 0xf0015188u)	/* DMA Channel 108 Interrupt Control Register */
#define DMA_CHICR109	(*( DMA_CHICR000_type *) 0xf00151a8u)	/* DMA Channel 109 Interrupt Control Register */
#define DMA_CHICR110	(*( DMA_CHICR000_type *) 0xf00151c8u)	/* DMA Channel 110 Interrupt Control Register */
#define DMA_CHICR111	(*( DMA_CHICR000_type *) 0xf00151e8u)	/* DMA Channel 111 Interrupt Control Register */
#define DMA_CHICR112	(*( DMA_CHICR000_type *) 0xf0015208u)	/* DMA Channel 112 Interrupt Control Register */
#define DMA_CHICR113	(*( DMA_CHICR000_type *) 0xf0015228u)	/* DMA Channel 113 Interrupt Control Register */
#define DMA_CHICR114	(*( DMA_CHICR000_type *) 0xf0015248u)	/* DMA Channel 114 Interrupt Control Register */
#define DMA_CHICR115	(*( DMA_CHICR000_type *) 0xf0015268u)	/* DMA Channel 115 Interrupt Control Register */
#define DMA_CHICR116	(*( DMA_CHICR000_type *) 0xf0015288u)	/* DMA Channel 116 Interrupt Control Register */
#define DMA_CHICR117	(*( DMA_CHICR000_type *) 0xf00152a8u)	/* DMA Channel 117 Interrupt Control Register */
#define DMA_CHICR118	(*( DMA_CHICR000_type *) 0xf00152c8u)	/* DMA Channel 118 Interrupt Control Register */
#define DMA_CHICR119	(*( DMA_CHICR000_type *) 0xf00152e8u)	/* DMA Channel 119 Interrupt Control Register */
#define DMA_CHICR120	(*( DMA_CHICR000_type *) 0xf0015308u)	/* DMA Channel 120 Interrupt Control Register */
#define DMA_CHICR121	(*( DMA_CHICR000_type *) 0xf0015328u)	/* DMA Channel 121 Interrupt Control Register */
#define DMA_CHICR122	(*( DMA_CHICR000_type *) 0xf0015348u)	/* DMA Channel 122 Interrupt Control Register */
#define DMA_CHICR123	(*( DMA_CHICR000_type *) 0xf0015368u)	/* DMA Channel 123 Interrupt Control Register */

