svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SIT0           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT1           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT2           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT3           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT4           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT5           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT6           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT7           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT8           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT9           : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT10          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT11          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT12          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT13          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT14          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT15          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT16          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT17          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT18          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT19          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT20          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT21          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT22          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		unsigned int SIT23          : 1;	/* Set Interrupt Trigger for DMA Channel z */
		/* const */ unsigned int RES            : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_CHINTR00_type;
#define DMA_CHINTR00	(*( DMA_CHINTR00_type *) 0xf0014070u)	/* DMA Channel Interrupt Set Register 00 */
#define DMA_CHINTR10	(*( DMA_CHINTR00_type *) 0xf0015070u)	/* DMA Channel Interrupt Set Register 10 */

typedef volatile union
{
	struct
	{ 
		unsigned int CH0            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH1            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH2            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH3            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH4            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH5            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH6            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH7            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH8            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH9            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH10           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH11           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH12           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH13           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH14           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH15           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH16           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH17           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH18           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH19           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH20           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH21           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH22           : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH23           : 1;	/* DMA Sub-block x Channel z Reset */
		/* const */ unsigned int RES            : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_CHRSTR00_type;
#define DMA_CHRSTR00	(*( DMA_CHRSTR00_type *) 0xf0014040u)	/* DMA Channel Reset Request Register 00 */
#define DMA_CHRSTR10	(*( DMA_CHRSTR00_type *) 0xf0015040u)	/* DMA Channel Reset Request Register 10 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TCOUNT         : 14;	/* Transfer Count Status */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int LXO            : 1;	/* Old Value of Pattern Detection */
		/* const */ unsigned int WRPS           : 1;	/* Wrap Source Buffer */
		/* const */ unsigned int WRPD           : 1;	/* Wrap Destination Buffer */
		/* const */ unsigned int ICH            : 1;	/* Interrupt from Channel */
		/* const */ unsigned int IPM            : 1;	/* Pattern Detection from Channel */
		/* const */ unsigned int TRL            : 1;	/* Transaction/Transfer Request Lost of DMA Channel */
		/* const */ unsigned int RES            : 3;	/* Reserved */
		/* const */ unsigned int CH             : 1;	/* Transaction Request State */
		/* const */ unsigned int HTRE           : 1;	/* Hardware Transaction Request Enable State */
		/* const */ unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} DMA_CHSR000_type;
#define DMA_CHSR000	(*( DMA_CHSR000_type *) 0xf0014080u)	/* DMA Channel 000 Status Register */
#define DMA_CHSR001	(*( DMA_CHSR000_type *) 0xf00140a0u)	/* DMA Channel 001 Status Register */
#define DMA_CHSR002	(*( DMA_CHSR000_type *) 0xf00140c0u)	/* DMA Channel 002 Status Register */
#define DMA_CHSR003	(*( DMA_CHSR000_type *) 0xf00140e0u)	/* DMA Channel 003 Status Register */
#define DMA_CHSR004	(*( DMA_CHSR000_type *) 0xf0014100u)	/* DMA Channel 004 Status Register */
#define DMA_CHSR005	(*( DMA_CHSR000_type *) 0xf0014120u)	/* DMA Channel 005 Status Register */
#define DMA_CHSR006	(*( DMA_CHSR000_type *) 0xf0014140u)	/* DMA Channel 006 Status Register */
#define DMA_CHSR007	(*( DMA_CHSR000_type *) 0xf0014160u)	/* DMA Channel 007 Status Register */
#define DMA_CHSR008	(*( DMA_CHSR000_type *) 0xf0014180u)	/* DMA Channel 008 Status Register */
#define DMA_CHSR009	(*( DMA_CHSR000_type *) 0xf00141a0u)	/* DMA Channel 009 Status Register */
#define DMA_CHSR010	(*( DMA_CHSR000_type *) 0xf00141c0u)	/* DMA Channel 010 Status Register */
#define DMA_CHSR011	(*( DMA_CHSR000_type *) 0xf00141e0u)	/* DMA Channel 011 Status Register */
#define DMA_CHSR012	(*( DMA_CHSR000_type *) 0xf0014200u)	/* DMA Channel 012 Status Register */
#define DMA_CHSR013	(*( DMA_CHSR000_type *) 0xf0014220u)	/* DMA Channel 013 Status Register */
#define DMA_CHSR014	(*( DMA_CHSR000_type *) 0xf0014240u)	/* DMA Channel 014 Status Register */
#define DMA_CHSR015	(*( DMA_CHSR000_type *) 0xf0014260u)	/* DMA Channel 015 Status Register */
#define DMA_CHSR016	(*( DMA_CHSR000_type *) 0xf0014280u)	/* DMA Channel 016 Status Register */
#define DMA_CHSR017	(*( DMA_CHSR000_type *) 0xf00142a0u)	/* DMA Channel 017 Status Register */
#define DMA_CHSR018	(*( DMA_CHSR000_type *) 0xf00142c0u)	/* DMA Channel 018 Status Register */
#define DMA_CHSR019	(*( DMA_CHSR000_type *) 0xf00142e0u)	/* DMA Channel 019 Status Register */
#define DMA_CHSR020	(*( DMA_CHSR000_type *) 0xf0014300u)	/* DMA Channel 020 Status Register */
#define DMA_CHSR021	(*( DMA_CHSR000_type *) 0xf0014320u)	/* DMA Channel 021 Status Register */
#define DMA_CHSR022	(*( DMA_CHSR000_type *) 0xf0014340u)	/* DMA Channel 022 Status Register */
#define DMA_CHSR023	(*( DMA_CHSR000_type *) 0xf0014360u)	/* DMA Channel 023 Status Register */
#define DMA_CHSR100	(*( DMA_CHSR000_type *) 0xf0015080u)	/* DMA Channel 100 Status Register */
#define DMA_CHSR101	(*( DMA_CHSR000_type *) 0xf00150a0u)	/* DMA Channel 101 Status Register */
#define DMA_CHSR102	(*( DMA_CHSR000_type *) 0xf00150c0u)	/* DMA Channel 102 Status Register */
#define DMA_CHSR103	(*( DMA_CHSR000_type *) 0xf00150e0u)	/* DMA Channel 103 Status Register */
#define DMA_CHSR104	(*( DMA_CHSR000_type *) 0xf0015100u)	/* DMA Channel 104 Status Register */
#define DMA_CHSR105	(*( DMA_CHSR000_type *) 0xf0015120u)	/* DMA Channel 105 Status Register */
#define DMA_CHSR106	(*( DMA_CHSR000_type *) 0xf0015140u)	/* DMA Channel 106 Status Register */
#define DMA_CHSR107	(*( DMA_CHSR000_type *) 0xf0015160u)	/* DMA Channel 107 Status Register */
#define DMA_CHSR108	(*( DMA_CHSR000_type *) 0xf0015180u)	/* DMA Channel 108 Status Register */
#define DMA_CHSR109	(*( DMA_CHSR000_type *) 0xf00151a0u)	/* DMA Channel 109 Status Register */
#define DMA_CHSR110	(*( DMA_CHSR000_type *) 0xf00151c0u)	/* DMA Channel 110 Status Register */
#define DMA_CHSR111	(*( DMA_CHSR000_type *) 0xf00151e0u)	/* DMA Channel 111 Status Register */
#define DMA_CHSR112	(*( DMA_CHSR000_type *) 0xf0015200u)	/* DMA Channel 112 Status Register */
#define DMA_CHSR113	(*( DMA_CHSR000_type *) 0xf0015220u)	/* DMA Channel 113 Status Register */
#define DMA_CHSR114	(*( DMA_CHSR000_type *) 0xf0015240u)	/* DMA Channel 114 Status Register */
#define DMA_CHSR115	(*( DMA_CHSR000_type *) 0xf0015260u)	/* DMA Channel 115 Status Register */
#define DMA_CHSR116	(*( DMA_CHSR000_type *) 0xf0015280u)	/* DMA Channel 116 Status Register */
#define DMA_CHSR117	(*( DMA_CHSR000_type *) 0xf00152a0u)	/* DMA Channel 117 Status Register */
#define DMA_CHSR118	(*( DMA_CHSR000_type *) 0xf00152c0u)	/* DMA Channel 118 Status Register */
#define DMA_CHSR119	(*( DMA_CHSR000_type *) 0xf00152e0u)	/* DMA Channel 119 Status Register */
#define DMA_CHSR120	(*( DMA_CHSR000_type *) 0xf0015300u)	/* DMA Channel 120 Status Register */
#define DMA_CHSR121	(*( DMA_CHSR000_type *) 0xf0015320u)	/* DMA Channel 121 Status Register */
#define DMA_CHSR122	(*( DMA_CHSR000_type *) 0xf0015340u)	/* DMA Channel 122 Status Register */
#define DMA_CHSR123	(*( DMA_CHSR000_type *) 0xf0015360u)	/* DMA Channel 123 Status Register */
#define SDMA_CHSR000	(*( DMA_CHSR000_type *) 0xf0010080u)	/* SDMA Channel 000 Status Register */
#define SDMA_CHSR001	(*( DMA_CHSR000_type *) 0xf00100a0u)	/* SDMA Channel 001 Status Register */
#define SDMA_CHSR002	(*( DMA_CHSR000_type *) 0xf00100c0u)	/* SDMA Channel 002 Status Register */
#define SDMA_CHSR003	(*( DMA_CHSR000_type *) 0xf00100e0u)	/* SDMA Channel 003 Status Register */
#define SDMA_CHSR004	(*( DMA_CHSR000_type *) 0xf0010100u)	/* SDMA Channel 004 Status Register */
#define SDMA_CHSR005	(*( DMA_CHSR000_type *) 0xf0010120u)	/* SDMA Channel 005 Status Register */
#define SDMA_CHSR006	(*( DMA_CHSR000_type *) 0xf0010140u)	/* SDMA Channel 006 Status Register */
#define SDMA_CHSR007	(*( DMA_CHSR000_type *) 0xf0010160u)	/* SDMA Channel 007 Status Register */
#define SDMA_CHSR100	(*( DMA_CHSR000_type *) 0xf0011080u)	/* SDMA Channel 100 Status Register */
#define SDMA_CHSR101	(*( DMA_CHSR000_type *) 0xf00110a0u)	/* SDMA Channel 101 Status Register */
#define SDMA_CHSR102	(*( DMA_CHSR000_type *) 0xf00110c0u)	/* SDMA Channel 102 Status Register */
#define SDMA_CHSR103	(*( DMA_CHSR000_type *) 0xf00110e0u)	/* SDMA Channel 103 Status Register */
#define SDMA_CHSR104	(*( DMA_CHSR000_type *) 0xf0011100u)	/* SDMA Channel 104 Status Register */
#define SDMA_CHSR105	(*( DMA_CHSR000_type *) 0xf0011120u)	/* SDMA Channel 105 Status Register */
#define SDMA_CHSR106	(*( DMA_CHSR000_type *) 0xf0011140u)	/* SDMA Channel 106 Status Register */
#define SDMA_CHSR107	(*( DMA_CHSR000_type *) 0xf0011160u)	/* SDMA Channel 107 Status Register */

