svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		/* const */ unsigned int RES            : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_CLC0_type;
#define DMA_CLC0	(*( DMA_CLC0_type *) 0xf0014000u)	/* DMA Sub-block 0 Clock Control Register */
#define DMA_CLC1	(*( DMA_CLC0_type *) 0xf0015000u)	/* DMA Sub-block 1 Clock Control Register */
#define SDMA_CLC0	(*( DMA_CLC0_type *) 0xf0010000u)	/* SDMA Sub-block 0 Clock Control Register */
#define SDMA_CLC1	(*( DMA_CLC0_type *) 0xf0011000u)	/* SDMA Sub-block 1 Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 16;	/* Reserved */
		unsigned int CMExSER        : 1;	/* Clear Move Engine x Source Error */
		unsigned int CMExDER        : 1;	/* Clear Move Engine x Destination Error */
		unsigned int                : 2;
		unsigned int CFPIER         : 1;	/* Clear FPI Error */
		unsigned int CSRIER         : 1;	/* Clear SRI Error */
		unsigned int CPERER         : 1;	/* Clear Peripheral Error */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} DMA_CLRE0_type;
#define DMA_CLRE0	(*( DMA_CLRE0_type *) 0xf0014028u)	/* DMA Clear Error Register 0 */
#define DMA_CLRE1	(*( DMA_CLRE0_type *) 0xf0015028u)	/* DMA Clear Error Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DADR           : 32;	/* Destination Address */
	} B;
	int I;
	unsigned int U;

} DMA_DADR000_type;
#define DMA_DADR000	(*( DMA_DADR000_type *) 0xf0014094u)	/* DMA Channel 000 Destination Address Register */
#define DMA_DADR001	(*( DMA_DADR000_type *) 0xf00140b4u)	/* DMA Channel 001 Destination Address Register */
#define DMA_DADR002	(*( DMA_DADR000_type *) 0xf00140d4u)	/* DMA Channel 002 Destination Address Register */
#define DMA_DADR003	(*( DMA_DADR000_type *) 0xf00140f4u)	/* DMA Channel 003 Destination Address Register */
#define DMA_DADR004	(*( DMA_DADR000_type *) 0xf0014114u)	/* DMA Channel 004 Destination Address Register */
#define DMA_DADR005	(*( DMA_DADR000_type *) 0xf0014134u)	/* DMA Channel 005 Destination Address Register */
#define DMA_DADR006	(*( DMA_DADR000_type *) 0xf0014154u)	/* DMA Channel 006 Destination Address Register */
#define DMA_DADR007	(*( DMA_DADR000_type *) 0xf0014174u)	/* DMA Channel 007 Destination Address Register */
#define DMA_DADR008	(*( DMA_DADR000_type *) 0xf0014194u)	/* DMA Channel 008 Destination Address Register */
#define DMA_DADR009	(*( DMA_DADR000_type *) 0xf00141b4u)	/* DMA Channel 009 Destination Address Register */
#define DMA_DADR010	(*( DMA_DADR000_type *) 0xf00141d4u)	/* DMA Channel 010 Destination Address Register */
#define DMA_DADR011	(*( DMA_DADR000_type *) 0xf00141f4u)	/* DMA Channel 011 Destination Address Register */
#define DMA_DADR012	(*( DMA_DADR000_type *) 0xf0014214u)	/* DMA Channel 012 Destination Address Register */
#define DMA_DADR013	(*( DMA_DADR000_type *) 0xf0014234u)	/* DMA Channel 013 Destination Address Register */
#define DMA_DADR014	(*( DMA_DADR000_type *) 0xf0014254u)	/* DMA Channel 014 Destination Address Register */
#define DMA_DADR015	(*( DMA_DADR000_type *) 0xf0014274u)	/* DMA Channel 015 Destination Address Register */
#define DMA_DADR016	(*( DMA_DADR000_type *) 0xf0014294u)	/* DMA Channel 016 Destination Address Register */
#define DMA_DADR017	(*( DMA_DADR000_type *) 0xf00142b4u)	/* DMA Channel 017 Destination Address Register */
#define DMA_DADR018	(*( DMA_DADR000_type *) 0xf00142d4u)	/* DMA Channel 018 Destination Address Register */
#define DMA_DADR019	(*( DMA_DADR000_type *) 0xf00142f4u)	/* DMA Channel 019 Destination Address Register */
#define DMA_DADR020	(*( DMA_DADR000_type *) 0xf0014314u)	/* DMA Channel 020 Destination Address Register */
#define DMA_DADR021	(*( DMA_DADR000_type *) 0xf0014334u)	/* DMA Channel 021 Destination Address Register */
#define DMA_DADR022	(*( DMA_DADR000_type *) 0xf0014354u)	/* DMA Channel 022 Destination Address Register */
#define DMA_DADR023	(*( DMA_DADR000_type *) 0xf0014374u)	/* DMA Channel 023 Destination Address Register */
#define DMA_DADR100	(*( DMA_DADR000_type *) 0xf0015094u)	/* DMA Channel 100 Destination Address Register */
#define DMA_DADR101	(*( DMA_DADR000_type *) 0xf00150b4u)	/* DMA Channel 101 Destination Address Register */
#define DMA_DADR102	(*( DMA_DADR000_type *) 0xf00150d4u)	/* DMA Channel 102 Destination Address Register */
#define DMA_DADR103	(*( DMA_DADR000_type *) 0xf00150f4u)	/* DMA Channel 103 Destination Address Register */
#define DMA_DADR104	(*( DMA_DADR000_type *) 0xf0015114u)	/* DMA Channel 104 Destination Address Register */
#define DMA_DADR105	(*( DMA_DADR000_type *) 0xf0015134u)	/* DMA Channel 105 Destination Address Register */
#define DMA_DADR106	(*( DMA_DADR000_type *) 0xf0015154u)	/* DMA Channel 106 Destination Address Register */
#define DMA_DADR107	(*( DMA_DADR000_type *) 0xf0015174u)	/* DMA Channel 107 Destination Address Register */
#define DMA_DADR108	(*( DMA_DADR000_type *) 0xf0015194u)	/* DMA Channel 108 Destination Address Register */
#define DMA_DADR109	(*( DMA_DADR000_type *) 0xf00151b4u)	/* DMA Channel 109 Destination Address Register */
#define DMA_DADR110	(*( DMA_DADR000_type *) 0xf00151d4u)	/* DMA Channel 110 Destination Address Register */
#define DMA_DADR111	(*( DMA_DADR000_type *) 0xf00151f4u)	/* DMA Channel 111 Destination Address Register */
#define DMA_DADR112	(*( DMA_DADR000_type *) 0xf0015214u)	/* DMA Channel 112 Destination Address Register */
#define DMA_DADR113	(*( DMA_DADR000_type *) 0xf0015234u)	/* DMA Channel 113 Destination Address Register */
#define DMA_DADR114	(*( DMA_DADR000_type *) 0xf0015254u)	/* DMA Channel 114 Destination Address Register */
#define DMA_DADR115	(*( DMA_DADR000_type *) 0xf0015274u)	/* DMA Channel 115 Destination Address Register */
#define DMA_DADR116	(*( DMA_DADR000_type *) 0xf0015294u)	/* DMA Channel 116 Destination Address Register */
#define DMA_DADR117	(*( DMA_DADR000_type *) 0xf00152b4u)	/* DMA Channel 117 Destination Address Register */
#define DMA_DADR118	(*( DMA_DADR000_type *) 0xf00152d4u)	/* DMA Channel 118 Destination Address Register */
#define DMA_DADR119	(*( DMA_DADR000_type *) 0xf00152f4u)	/* DMA Channel 119 Destination Address Register */
#define DMA_DADR120	(*( DMA_DADR000_type *) 0xf0015314u)	/* DMA Channel 120 Destination Address Register */
#define DMA_DADR121	(*( DMA_DADR000_type *) 0xf0015334u)	/* DMA Channel 121 Destination Address Register */
#define DMA_DADR122	(*( DMA_DADR000_type *) 0xf0015354u)	/* DMA Channel 122 Destination Address Register */
#define DMA_DADR123	(*( DMA_DADR000_type *) 0xf0015374u)	/* DMA Channel 123 Destination Address Register */
#define SDMA_DADR000	(*( DMA_DADR000_type *) 0xf0010094u)	/* SDMA Channel 000 Destination Address Register */
#define SDMA_DADR001	(*( DMA_DADR000_type *) 0xf00100b4u)	/* SDMA Channel 001 Destination Address Register */
#define SDMA_DADR002	(*( DMA_DADR000_type *) 0xf00100d4u)	/* SDMA Channel 002 Destination Address Register */
#define SDMA_DADR003	(*( DMA_DADR000_type *) 0xf00100f4u)	/* SDMA Channel 003 Destination Address Register */
#define SDMA_DADR004	(*( DMA_DADR000_type *) 0xf0010114u)	/* SDMA Channel 004 Destination Address Register */
#define SDMA_DADR005	(*( DMA_DADR000_type *) 0xf0010134u)	/* SDMA Channel 005 Destination Address Register */
#define SDMA_DADR006	(*( DMA_DADR000_type *) 0xf0010154u)	/* SDMA Channel 006 Destination Address Register */
#define SDMA_DADR007	(*( DMA_DADR000_type *) 0xf0010174u)	/* SDMA Channel 007 Destination Address Register */
#define SDMA_DADR100	(*( DMA_DADR000_type *) 0xf0011094u)	/* SDMA Channel 100 Destination Address Register */
#define SDMA_DADR101	(*( DMA_DADR000_type *) 0xf00110b4u)	/* SDMA Channel 101 Destination Address Register */
#define SDMA_DADR102	(*( DMA_DADR000_type *) 0xf00110d4u)	/* SDMA Channel 102 Destination Address Register */
#define SDMA_DADR103	(*( DMA_DADR000_type *) 0xf00110f4u)	/* SDMA Channel 103 Destination Address Register */
#define SDMA_DADR104	(*( DMA_DADR000_type *) 0xf0011114u)	/* SDMA Channel 104 Destination Address Register */
#define SDMA_DADR105	(*( DMA_DADR000_type *) 0xf0011134u)	/* SDMA Channel 105 Destination Address Register */
#define SDMA_DADR106	(*( DMA_DADR000_type *) 0xf0011154u)	/* SDMA Channel 106 Destination Address Register */
#define SDMA_DADR107	(*( DMA_DADR000_type *) 0xf0011174u)	/* SDMA Channel 107 Destination Address Register */

