svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 16;	/* Reserved */
		unsigned int ESER           : 1;	/* Enable Move Engine x Source Error */
		unsigned int EDER           : 1;	/* Enable Move Engine x Destination Error */
		unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} DMA_EER0_type;
#define DMA_EER0	(*( DMA_EER0_type *) 0xf0014020u)	/* DMA Enable Error Register 0 */
#define DMA_EER1	(*( DMA_EER0_type *) 0xf0015020u)	/* DMA Enable Error Register 1 */
#define SDMA_EER0	(*( DMA_EER0_type *) 0xf0010020u)	/* SDMA Enable Error Register 0 */
#define SDMA_EER1	(*( DMA_EER0_type *) 0xf0011020u)	/* SDMA Enable Error Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LEC            : 6;	/* Move Engine x Last Error Channel */
		/* const */ unsigned int RES            : 10;	/* Reserved */
		/* const */ unsigned int SER            : 1;	/* Move Engine x Source Error */
		/* const */ unsigned int DER            : 1;	/* Move Engine x Destination Error */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int FPIER          : 1;	/* Move Engine x FPI Bus Error */
		/* const */ unsigned int SRIER          : 1;	/* Move Engine x SRI Bus Error */
		/* const */ unsigned int PERER          : 1;	/* Move Engine x Peripheral Error */
		/* const */ unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} DMA_ERRSR0_type;
#define DMA_ERRSR0	(*( DMA_ERRSR0_type *) 0xf0014024u)	/* DMA Error Status Register 0 */
#define DMA_ERRSR1	(*( DMA_ERRSR0_type *) 0xf0015024u)	/* DMA Error Status Register 1 */
#define SDMA_ERRSR0	(*( DMA_ERRSR0_type *) 0xf0010024u)	/* SDMA Error Status Register 0 */
#define SDMA_ERRSR1	(*( DMA_ERRSR0_type *) 0xf0011024u)	/* SDMA Error Status Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} DMA_ID_type;
#define DMA_ID	(*( DMA_ID_type *) 0xf0014008u)	/* Module Identification Register */
#define SDMA_ID	(*( DMA_ID_type *) 0xf0010008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SIT            : 1;	/* Set Interrupt Trigger for DMA Move Engine x */
		/* const */ unsigned int RES            : 31;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_ME0INTR_type;
#define DMA_ME0INTR	(*( DMA_ME0INTR_type *) 0xf0014038u)	/* DMA Move Engine 0 Interrupt Set Register */
#define DMA_ME1INTR	(*( DMA_ME0INTR_type *) 0xf0015038u)	/* DMA Move Engine 1 Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PAT00          : 8;	/* Pattern for Move Engine x */
		unsigned int PAT01          : 8;	/* Pattern for Move Engine x */
		unsigned int PAT02          : 8;	/* Pattern for Move Engine x */
		unsigned int PAT03          : 8;	/* Pattern for Move Engine x */
	} B;
	int I;
	unsigned int U;

} DMA_ME0PR_type;
#define DMA_ME0PR	(*( DMA_ME0PR_type *) 0xf001403cu)	/* DMA Move Engine 0 Pattern Read Register */
#define DMA_ME1PR	(*( DMA_ME0PR_type *) 0xf001503cu)	/* DMA Move Engine 1 Pattern Read Register */
#define SDMA_ME0PR	(*( DMA_ME0PR_type *) 0xf001003cu)	/* SDMA Move Engine 0 Pattern Read Register */
#define SDMA_ME1PR	(*( DMA_ME0PR_type *) 0xf001103cu)	/* SDMA Move Engine 1 Pattern Read Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RD00           : 8;	/* Read Value for Move Engine x */
		/* const */ unsigned int RD01           : 8;	/* Read Value for Move Engine x */
		/* const */ unsigned int RD02           : 8;	/* Read Value for Move Engine x */
		/* const */ unsigned int RD03           : 8;	/* Read Value for Move Engine x */
	} B;
	int I;
	unsigned int U;

} DMA_ME0R_type;
#define DMA_ME0R	(*( DMA_ME0R_type *) 0xf0014034u)	/* DMA Move Engine 0 Read Register */
#define DMA_ME1R	(*( DMA_ME0R_type *) 0xf0015034u)	/* DMA Move Engine 1 Read Register */
#define SDMA_ME0R	(*( DMA_ME0R_type *) 0xf0010034u)	/* SDMA Move Engine 0 Read Register */
#define SDMA_ME1R	(*( DMA_ME0R_type *) 0xf0011034u)	/* SDMA Move Engine 1 Read Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RS             : 1;	/* Move Engine x Read Status */
		/* const */ unsigned int RES            : 3;	/* Reserved */
		/* const */ unsigned int WS             : 1;	/* Move Engine x Write Status */
		/* const */ unsigned int                : 11;
		/* const */ unsigned int CH             : 6;	/* Reading Channel in Move Engine x */
		/* const */ unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} DMA_ME0SR_type;
#define DMA_ME0SR	(*( DMA_ME0SR_type *) 0xf0014030u)	/* DMA Move Engine 0 Status Register */
#define DMA_ME1SR	(*( DMA_ME0SR_type *) 0xf0015030u)	/* DMA Move Engine 1 Status Register */
#define SDMA_ME0SR	(*( DMA_ME0SR_type *) 0xf0010030u)	/* SDMA Move Engine 0 Status Register */
#define SDMA_ME1SR	(*( DMA_ME0SR_type *) 0xf0011030u)	/* SDMA Move Engine 1 Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 4;	/* Trigger Set () for OTGB0/1 */
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int BS             : 1;	/* OTGB0/1 Bus Select */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} DMA_OTSS_type;
#define DMA_OTSS	(*( DMA_OTSS_type *) 0xf001400cu)	/* DMA OCDS Trigger Set Select */

typedef volatile union
{
	struct
	{ 
		unsigned int SADR           : 32;	/* Source Start Address */
	} B;
	int I;
	unsigned int U;

} DMA_SADR000_type;
#define DMA_SADR000	(*( DMA_SADR000_type *) 0xf0014090u)	/* DMA Channel 000 Source Address Register */
#define DMA_SADR001	(*( DMA_SADR000_type *) 0xf00140b0u)	/* DMA Channel 001 Source Address Register */
#define DMA_SADR002	(*( DMA_SADR000_type *) 0xf00140d0u)	/* DMA Channel 002 Source Address Register */
#define DMA_SADR003	(*( DMA_SADR000_type *) 0xf00140f0u)	/* DMA Channel 003 Source Address Register */
#define DMA_SADR004	(*( DMA_SADR000_type *) 0xf0014110u)	/* DMA Channel 004 Source Address Register */
#define DMA_SADR005	(*( DMA_SADR000_type *) 0xf0014130u)	/* DMA Channel 005 Source Address Register */
#define DMA_SADR006	(*( DMA_SADR000_type *) 0xf0014150u)	/* DMA Channel 006 Source Address Register */
#define DMA_SADR007	(*( DMA_SADR000_type *) 0xf0014170u)	/* DMA Channel 007 Source Address Register */
#define DMA_SADR008	(*( DMA_SADR000_type *) 0xf0014190u)	/* DMA Channel 008 Source Address Register */
#define DMA_SADR009	(*( DMA_SADR000_type *) 0xf00141b0u)	/* DMA Channel 009 Source Address Register */
#define DMA_SADR010	(*( DMA_SADR000_type *) 0xf00141d0u)	/* DMA Channel 010 Source Address Register */
#define DMA_SADR011	(*( DMA_SADR000_type *) 0xf00141f0u)	/* DMA Channel 011 Source Address Register */
#define DMA_SADR012	(*( DMA_SADR000_type *) 0xf0014210u)	/* DMA Channel 012 Source Address Register */
#define DMA_SADR013	(*( DMA_SADR000_type *) 0xf0014230u)	/* DMA Channel 013 Source Address Register */
#define DMA_SADR014	(*( DMA_SADR000_type *) 0xf0014250u)	/* DMA Channel 014 Source Address Register */
#define DMA_SADR015	(*( DMA_SADR000_type *) 0xf0014270u)	/* DMA Channel 015 Source Address Register */
#define DMA_SADR016	(*( DMA_SADR000_type *) 0xf0014290u)	/* DMA Channel 016 Source Address Register */
#define DMA_SADR017	(*( DMA_SADR000_type *) 0xf00142b0u)	/* DMA Channel 017 Source Address Register */
#define DMA_SADR018	(*( DMA_SADR000_type *) 0xf00142d0u)	/* DMA Channel 018 Source Address Register */
#define DMA_SADR019	(*( DMA_SADR000_type *) 0xf00142f0u)	/* DMA Channel 019 Source Address Register */
#define DMA_SADR020	(*( DMA_SADR000_type *) 0xf0014310u)	/* DMA Channel 020 Source Address Register */
#define DMA_SADR021	(*( DMA_SADR000_type *) 0xf0014330u)	/* DMA Channel 021 Source Address Register */
#define DMA_SADR022	(*( DMA_SADR000_type *) 0xf0014350u)	/* DMA Channel 022 Source Address Register */
#define DMA_SADR023	(*( DMA_SADR000_type *) 0xf0014370u)	/* DMA Channel 023 Source Address Register */
#define DMA_SADR100	(*( DMA_SADR000_type *) 0xf0015090u)	/* DMA Channel 100 Source Address Register */
#define DMA_SADR101	(*( DMA_SADR000_type *) 0xf00150b0u)	/* DMA Channel 101 Source Address Register */
#define DMA_SADR102	(*( DMA_SADR000_type *) 0xf00150d0u)	/* DMA Channel 102 Source Address Register */
#define DMA_SADR103	(*( DMA_SADR000_type *) 0xf00150f0u)	/* DMA Channel 103 Source Address Register */
#define DMA_SADR104	(*( DMA_SADR000_type *) 0xf0015110u)	/* DMA Channel 104 Source Address Register */
#define DMA_SADR105	(*( DMA_SADR000_type *) 0xf0015130u)	/* DMA Channel 105 Source Address Register */
#define DMA_SADR106	(*( DMA_SADR000_type *) 0xf0015150u)	/* DMA Channel 106 Source Address Register */
#define DMA_SADR107	(*( DMA_SADR000_type *) 0xf0015170u)	/* DMA Channel 107 Source Address Register */
#define DMA_SADR108	(*( DMA_SADR000_type *) 0xf0015190u)	/* DMA Channel 108 Source Address Register */
#define DMA_SADR109	(*( DMA_SADR000_type *) 0xf00151b0u)	/* DMA Channel 109 Source Address Register */
#define DMA_SADR110	(*( DMA_SADR000_type *) 0xf00151d0u)	/* DMA Channel 110 Source Address Register */
#define DMA_SADR111	(*( DMA_SADR000_type *) 0xf00151f0u)	/* DMA Channel 111 Source Address Register */
#define DMA_SADR112	(*( DMA_SADR000_type *) 0xf0015210u)	/* DMA Channel 112 Source Address Register */
#define DMA_SADR113	(*( DMA_SADR000_type *) 0xf0015230u)	/* DMA Channel 113 Source Address Register */
#define DMA_SADR114	(*( DMA_SADR000_type *) 0xf0015250u)	/* DMA Channel 114 Source Address Register */
#define DMA_SADR115	(*( DMA_SADR000_type *) 0xf0015270u)	/* DMA Channel 115 Source Address Register */
#define DMA_SADR116	(*( DMA_SADR000_type *) 0xf0015290u)	/* DMA Channel 116 Source Address Register */
#define DMA_SADR117	(*( DMA_SADR000_type *) 0xf00152b0u)	/* DMA Channel 117 Source Address Register */
#define DMA_SADR118	(*( DMA_SADR000_type *) 0xf00152d0u)	/* DMA Channel 118 Source Address Register */
#define DMA_SADR119	(*( DMA_SADR000_type *) 0xf00152f0u)	/* DMA Channel 119 Source Address Register */
#define DMA_SADR120	(*( DMA_SADR000_type *) 0xf0015310u)	/* DMA Channel 120 Source Address Register */
#define DMA_SADR121	(*( DMA_SADR000_type *) 0xf0015330u)	/* DMA Channel 121 Source Address Register */
#define DMA_SADR122	(*( DMA_SADR000_type *) 0xf0015350u)	/* DMA Channel 122 Source Address Register */
#define DMA_SADR123	(*( DMA_SADR000_type *) 0xf0015370u)	/* DMA Channel 123 Source Address Register */
#define SDMA_SADR000	(*( DMA_SADR000_type *) 0xf0010090u)	/* SDMA Channel 000 Source Address Register */
#define SDMA_SADR001	(*( DMA_SADR000_type *) 0xf00100b0u)	/* SDMA Channel 001 Source Address Register */
#define SDMA_SADR002	(*( DMA_SADR000_type *) 0xf00100d0u)	/* SDMA Channel 002 Source Address Register */
#define SDMA_SADR003	(*( DMA_SADR000_type *) 0xf00100f0u)	/* SDMA Channel 003 Source Address Register */
#define SDMA_SADR004	(*( DMA_SADR000_type *) 0xf0010110u)	/* SDMA Channel 004 Source Address Register */
#define SDMA_SADR005	(*( DMA_SADR000_type *) 0xf0010130u)	/* SDMA Channel 005 Source Address Register */
#define SDMA_SADR006	(*( DMA_SADR000_type *) 0xf0010150u)	/* SDMA Channel 006 Source Address Register */
#define SDMA_SADR007	(*( DMA_SADR000_type *) 0xf0010170u)	/* SDMA Channel 007 Source Address Register */
#define SDMA_SADR100	(*( DMA_SADR000_type *) 0xf0011090u)	/* SDMA Channel 100 Source Address Register */
#define SDMA_SADR101	(*( DMA_SADR000_type *) 0xf00110b0u)	/* SDMA Channel 101 Source Address Register */
#define SDMA_SADR102	(*( DMA_SADR000_type *) 0xf00110d0u)	/* SDMA Channel 102 Source Address Register */
#define SDMA_SADR103	(*( DMA_SADR000_type *) 0xf00110f0u)	/* SDMA Channel 103 Source Address Register */
#define SDMA_SADR104	(*( DMA_SADR000_type *) 0xf0011110u)	/* SDMA Channel 104 Source Address Register */
#define SDMA_SADR105	(*( DMA_SADR000_type *) 0xf0011130u)	/* SDMA Channel 105 Source Address Register */
#define SDMA_SADR106	(*( DMA_SADR000_type *) 0xf0011150u)	/* SDMA Channel 106 Source Address Register */
#define SDMA_SADR107	(*( DMA_SADR000_type *) 0xf0011170u)	/* SDMA Channel 107 Source Address Register */

