svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SHADR          : 32;	/* Shadowed Address */
	} B;
	int I;
	unsigned int U;

} DMA_SHADR000_type;
#define DMA_SHADR000	(*( DMA_SHADR000_type *) 0xf0014098u)	/* DMA Channel 000 Shadow Address Register */
#define DMA_SHADR001	(*( DMA_SHADR000_type *) 0xf00140b8u)	/* DMA Channel 001 Shadow Address Register */
#define DMA_SHADR002	(*( DMA_SHADR000_type *) 0xf00140d8u)	/* DMA Channel 002 Shadow Address Register */
#define DMA_SHADR003	(*( DMA_SHADR000_type *) 0xf00140f8u)	/* DMA Channel 003 Shadow Address Register */
#define DMA_SHADR004	(*( DMA_SHADR000_type *) 0xf0014118u)	/* DMA Channel 004 Shadow Address Register */
#define DMA_SHADR005	(*( DMA_SHADR000_type *) 0xf0014138u)	/* DMA Channel 005 Shadow Address Register */
#define DMA_SHADR006	(*( DMA_SHADR000_type *) 0xf0014158u)	/* DMA Channel 006 Shadow Address Register */
#define DMA_SHADR007	(*( DMA_SHADR000_type *) 0xf0014178u)	/* DMA Channel 007 Shadow Address Register */
#define DMA_SHADR008	(*( DMA_SHADR000_type *) 0xf0014198u)	/* DMA Channel 008 Shadow Address Register */
#define DMA_SHADR009	(*( DMA_SHADR000_type *) 0xf00141b8u)	/* DMA Channel 009 Shadow Address Register */
#define DMA_SHADR010	(*( DMA_SHADR000_type *) 0xf00141d8u)	/* DMA Channel 010 Shadow Address Register */
#define DMA_SHADR011	(*( DMA_SHADR000_type *) 0xf00141f8u)	/* DMA Channel 011 Shadow Address Register */
#define DMA_SHADR012	(*( DMA_SHADR000_type *) 0xf0014218u)	/* DMA Channel 012 Shadow Address Register */
#define DMA_SHADR013	(*( DMA_SHADR000_type *) 0xf0014238u)	/* DMA Channel 013 Shadow Address Register */
#define DMA_SHADR014	(*( DMA_SHADR000_type *) 0xf0014258u)	/* DMA Channel 014 Shadow Address Register */
#define DMA_SHADR015	(*( DMA_SHADR000_type *) 0xf0014278u)	/* DMA Channel 015 Shadow Address Register */
#define DMA_SHADR016	(*( DMA_SHADR000_type *) 0xf0014298u)	/* DMA Channel 016 Shadow Address Register */
#define DMA_SHADR017	(*( DMA_SHADR000_type *) 0xf00142b8u)	/* DMA Channel 017 Shadow Address Register */
#define DMA_SHADR018	(*( DMA_SHADR000_type *) 0xf00142d8u)	/* DMA Channel 018 Shadow Address Register */
#define DMA_SHADR019	(*( DMA_SHADR000_type *) 0xf00142f8u)	/* DMA Channel 019 Shadow Address Register */
#define DMA_SHADR020	(*( DMA_SHADR000_type *) 0xf0014318u)	/* DMA Channel 020 Shadow Address Register */
#define DMA_SHADR021	(*( DMA_SHADR000_type *) 0xf0014338u)	/* DMA Channel 021 Shadow Address Register */
#define DMA_SHADR022	(*( DMA_SHADR000_type *) 0xf0014358u)	/* DMA Channel 022 Shadow Address Register */
#define DMA_SHADR023	(*( DMA_SHADR000_type *) 0xf0014378u)	/* DMA Channel 023 Shadow Address Register */
#define DMA_SHADR100	(*( DMA_SHADR000_type *) 0xf0015098u)	/* DMA Channel 100 Shadow Address Register */
#define DMA_SHADR101	(*( DMA_SHADR000_type *) 0xf00150b8u)	/* DMA Channel 101 Shadow Address Register */
#define DMA_SHADR102	(*( DMA_SHADR000_type *) 0xf00150d8u)	/* DMA Channel 102 Shadow Address Register */
#define DMA_SHADR103	(*( DMA_SHADR000_type *) 0xf00150f8u)	/* DMA Channel 103 Shadow Address Register */
#define DMA_SHADR104	(*( DMA_SHADR000_type *) 0xf0015118u)	/* DMA Channel 104 Shadow Address Register */
#define DMA_SHADR105	(*( DMA_SHADR000_type *) 0xf0015138u)	/* DMA Channel 105 Shadow Address Register */
#define DMA_SHADR106	(*( DMA_SHADR000_type *) 0xf0015158u)	/* DMA Channel 106 Shadow Address Register */
#define DMA_SHADR107	(*( DMA_SHADR000_type *) 0xf0015178u)	/* DMA Channel 107 Shadow Address Register */
#define DMA_SHADR108	(*( DMA_SHADR000_type *) 0xf0015198u)	/* DMA Channel 108 Shadow Address Register */
#define DMA_SHADR109	(*( DMA_SHADR000_type *) 0xf00151b8u)	/* DMA Channel 109 Shadow Address Register */
#define DMA_SHADR110	(*( DMA_SHADR000_type *) 0xf00151d8u)	/* DMA Channel 110 Shadow Address Register */
#define DMA_SHADR111	(*( DMA_SHADR000_type *) 0xf00151f8u)	/* DMA Channel 111 Shadow Address Register */
#define DMA_SHADR112	(*( DMA_SHADR000_type *) 0xf0015218u)	/* DMA Channel 112 Shadow Address Register */
#define DMA_SHADR113	(*( DMA_SHADR000_type *) 0xf0015238u)	/* DMA Channel 113 Shadow Address Register */
#define DMA_SHADR114	(*( DMA_SHADR000_type *) 0xf0015258u)	/* DMA Channel 114 Shadow Address Register */
#define DMA_SHADR115	(*( DMA_SHADR000_type *) 0xf0015278u)	/* DMA Channel 115 Shadow Address Register */
#define DMA_SHADR116	(*( DMA_SHADR000_type *) 0xf0015298u)	/* DMA Channel 116 Shadow Address Register */
#define DMA_SHADR117	(*( DMA_SHADR000_type *) 0xf00152b8u)	/* DMA Channel 117 Shadow Address Register */
#define DMA_SHADR118	(*( DMA_SHADR000_type *) 0xf00152d8u)	/* DMA Channel 118 Shadow Address Register */
#define DMA_SHADR119	(*( DMA_SHADR000_type *) 0xf00152f8u)	/* DMA Channel 119 Shadow Address Register */
#define DMA_SHADR120	(*( DMA_SHADR000_type *) 0xf0015318u)	/* DMA Channel 120 Shadow Address Register */
#define DMA_SHADR121	(*( DMA_SHADR000_type *) 0xf0015338u)	/* DMA Channel 121 Shadow Address Register */
#define DMA_SHADR122	(*( DMA_SHADR000_type *) 0xf0015358u)	/* DMA Channel 122 Shadow Address Register */
#define DMA_SHADR123	(*( DMA_SHADR000_type *) 0xf0015378u)	/* DMA Channel 123 Shadow Address Register */
#define SDMA_SHADR000	(*( DMA_SHADR000_type *) 0xf0010098u)	/* SDMA Channel 000 Shadow Address Register */
#define SDMA_SHADR001	(*( DMA_SHADR000_type *) 0xf00100b8u)	/* SDMA Channel 001 Shadow Address Register */
#define SDMA_SHADR002	(*( DMA_SHADR000_type *) 0xf00100d8u)	/* SDMA Channel 002 Shadow Address Register */
#define SDMA_SHADR003	(*( DMA_SHADR000_type *) 0xf00100f8u)	/* SDMA Channel 003 Shadow Address Register */
#define SDMA_SHADR004	(*( DMA_SHADR000_type *) 0xf0010118u)	/* SDMA Channel 004 Shadow Address Register */
#define SDMA_SHADR005	(*( DMA_SHADR000_type *) 0xf0010138u)	/* SDMA Channel 005 Shadow Address Register */
#define SDMA_SHADR006	(*( DMA_SHADR000_type *) 0xf0010158u)	/* SDMA Channel 006 Shadow Address Register */
#define SDMA_SHADR007	(*( DMA_SHADR000_type *) 0xf0010178u)	/* SDMA Channel 007 Shadow Address Register */
#define SDMA_SHADR100	(*( DMA_SHADR000_type *) 0xf0011098u)	/* SDMA Channel 100 Shadow Address Register */
#define SDMA_SHADR101	(*( DMA_SHADR000_type *) 0xf00110b8u)	/* SDMA Channel 101 Shadow Address Register */
#define SDMA_SHADR102	(*( DMA_SHADR000_type *) 0xf00110d8u)	/* SDMA Channel 102 Shadow Address Register */
#define SDMA_SHADR103	(*( DMA_SHADR000_type *) 0xf00110f8u)	/* SDMA Channel 103 Shadow Address Register */
#define SDMA_SHADR104	(*( DMA_SHADR000_type *) 0xf0011118u)	/* SDMA Channel 104 Shadow Address Register */
#define SDMA_SHADR105	(*( DMA_SHADR000_type *) 0xf0011138u)	/* SDMA Channel 105 Shadow Address Register */
#define SDMA_SHADR106	(*( DMA_SHADR000_type *) 0xf0011158u)	/* SDMA Channel 106 Shadow Address Register */
#define SDMA_SHADR107	(*( DMA_SHADR000_type *) 0xf0011178u)	/* SDMA Channel 107 Shadow Address Register */

