svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SUSAC0         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC1         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC2         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC3         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC4         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC5         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC6         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC7         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC8         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC9         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC10        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC11        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC12        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC13        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC14        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC15        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC16        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC17        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC18        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC19        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC20        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC21        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC22        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC23        : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int RES            : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_SUSACR00_type;
#define DMA_SUSACR00	(*( DMA_SUSACR00_type *) 0xf0014068u)	/* DMA Suspend Acknowledge Register 00 */
#define DMA_SUSACR10	(*( DMA_SUSACR00_type *) 0xf0015068u)	/* DMA Suspend Acknowledge Register 10 */

typedef volatile union
{
	struct
	{ 
		unsigned int SUSEN0         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN1         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN2         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN3         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN4         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN5         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN6         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN7         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN8         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN9         : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN10        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN11        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN12        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN13        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN14        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN15        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN16        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN17        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN18        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN19        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN20        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN21        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN22        : 1;	/* Channel Suspend Enable for DMA Channel z */
		unsigned int SUSEN23        : 1;	/* Channel Suspend Enable for DMA Channel z */
		/* const */ unsigned int RES            : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} DMA_SUSENR00_type;
#define DMA_SUSENR00	(*( DMA_SUSENR00_type *) 0xf0014060u)	/* DMA Suspend Enable Register 00 */
#define DMA_SUSENR10	(*( DMA_SUSENR00_type *) 0xf0015060u)	/* DMA Suspend Enable Register 10 */

typedef volatile union
{
	struct
	{ 
		unsigned int TREL           : 14;	/* Transfer Reload Value */
		/* const */ unsigned int RES            : 2;	/* Reserved */
		unsigned int BLKM           : 3;	/* Block Mode */
		unsigned int RROAT          : 1;	/* Reset Request Only After Transaction */
		unsigned int CHMODE         : 1;	/* Channel Operation Mode */
		unsigned int CHDW           : 2;	/* Channel Data Width */
		unsigned int                : 1;
		unsigned int PATSEL         : 2;	/* Pattern Select */
		unsigned int ECH            : 1;	/* Enable Hardware Transfer Request */
		unsigned int DCH            : 1;	/* Disable Hardware Transfer Request */
		unsigned int PRSEL          : 1;	/* Peripheral Request Select */
		unsigned int SCH            : 1;	/* Set Transaction Request for DMA Channel z */
		unsigned int DMAPRIO        : 2;	/* DMA Priority */
	} B;
	int I;
	unsigned int U;

} SDMA_CHCR000_type;
#define SDMA_CHCR000	(*( SDMA_CHCR000_type *) 0xf0010084u)	/* SDMA Channel 000 Control Register */
#define SDMA_CHCR001	(*( SDMA_CHCR000_type *) 0xf00100a4u)	/* SDMA Channel 001 Control Register */
#define SDMA_CHCR002	(*( SDMA_CHCR000_type *) 0xf00100c4u)	/* SDMA Channel 002 Control Register */
#define SDMA_CHCR003	(*( SDMA_CHCR000_type *) 0xf00100e4u)	/* SDMA Channel 003 Control Register */
#define SDMA_CHCR004	(*( SDMA_CHCR000_type *) 0xf0010104u)	/* SDMA Channel 004 Control Register */
#define SDMA_CHCR005	(*( SDMA_CHCR000_type *) 0xf0010124u)	/* SDMA Channel 005 Control Register */
#define SDMA_CHCR006	(*( SDMA_CHCR000_type *) 0xf0010144u)	/* SDMA Channel 006 Control Register */
#define SDMA_CHCR007	(*( SDMA_CHCR000_type *) 0xf0010164u)	/* SDMA Channel 007 Control Register */
#define SDMA_CHCR100	(*( SDMA_CHCR000_type *) 0xf0011084u)	/* SDMA Channel 100 Control Register */
#define SDMA_CHCR101	(*( SDMA_CHCR000_type *) 0xf00110a4u)	/* SDMA Channel 101 Control Register */
#define SDMA_CHCR102	(*( SDMA_CHCR000_type *) 0xf00110c4u)	/* SDMA Channel 102 Control Register */
#define SDMA_CHCR103	(*( SDMA_CHCR000_type *) 0xf00110e4u)	/* SDMA Channel 103 Control Register */
#define SDMA_CHCR104	(*( SDMA_CHCR000_type *) 0xf0011104u)	/* SDMA Channel 104 Control Register */
#define SDMA_CHCR105	(*( SDMA_CHCR000_type *) 0xf0011124u)	/* SDMA Channel 105 Control Register */
#define SDMA_CHCR106	(*( SDMA_CHCR000_type *) 0xf0011144u)	/* SDMA Channel 106 Control Register */
#define SDMA_CHCR107	(*( SDMA_CHCR000_type *) 0xf0011164u)	/* SDMA Channel 107 Control Register */

