svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int WRPSE          : 1;	/* Wrap Source Enable */
		unsigned int WRPDE          : 1;	/* Wrap Destination Enable */
		unsigned int INTCT          : 2;	/* Interrupt Control */
		unsigned int ETRL           : 1;	/* Enable Transaction Request Lost Interrupt */
		/* const */ unsigned int RES            : 7;	/* Reserved */
		unsigned int IRDV           : 4;	/* Interrupt Raise Detect Value */
		unsigned int CWRP           : 1;	/* Clear Wrap Buffer Interrupt xz */
		unsigned int                : 1;
		unsigned int CICH           : 1;	/* Clear Interrupt for DMA Channel xz */
		unsigned int                : 1;
		unsigned int CTL            : 1;	/* Clear Transaction Request Lost for DMA Channel xz */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} SDMA_CHICR000_type;
#define SDMA_CHICR000	(*( SDMA_CHICR000_type *) 0xf0010088u)	/* SDMA Channel 000 Interrupt Control Register */
#define SDMA_CHICR001	(*( SDMA_CHICR000_type *) 0xf00100a8u)	/* SDMA Channel 001 Interrupt Control Register */
#define SDMA_CHICR002	(*( SDMA_CHICR000_type *) 0xf00100c8u)	/* SDMA Channel 002 Interrupt Control Register */
#define SDMA_CHICR003	(*( SDMA_CHICR000_type *) 0xf00100e8u)	/* SDMA Channel 003 Interrupt Control Register */
#define SDMA_CHICR004	(*( SDMA_CHICR000_type *) 0xf0010108u)	/* SDMA Channel 004 Interrupt Control Register */
#define SDMA_CHICR005	(*( SDMA_CHICR000_type *) 0xf0010128u)	/* SDMA Channel 005 Interrupt Control Register */
#define SDMA_CHICR006	(*( SDMA_CHICR000_type *) 0xf0010148u)	/* SDMA Channel 006 Interrupt Control Register */
#define SDMA_CHICR007	(*( SDMA_CHICR000_type *) 0xf0010168u)	/* SDMA Channel 007 Interrupt Control Register */
#define SDMA_CHICR100	(*( SDMA_CHICR000_type *) 0xf0011088u)	/* SDMA Channel 100 Interrupt Control Register */
#define SDMA_CHICR101	(*( SDMA_CHICR000_type *) 0xf00110a8u)	/* SDMA Channel 101 Interrupt Control Register */
#define SDMA_CHICR102	(*( SDMA_CHICR000_type *) 0xf00110c8u)	/* SDMA Channel 102 Interrupt Control Register */
#define SDMA_CHICR103	(*( SDMA_CHICR000_type *) 0xf00110e8u)	/* SDMA Channel 103 Interrupt Control Register */
#define SDMA_CHICR104	(*( SDMA_CHICR000_type *) 0xf0011108u)	/* SDMA Channel 104 Interrupt Control Register */
#define SDMA_CHICR105	(*( SDMA_CHICR000_type *) 0xf0011128u)	/* SDMA Channel 105 Interrupt Control Register */
#define SDMA_CHICR106	(*( SDMA_CHICR000_type *) 0xf0011148u)	/* SDMA Channel 106 Interrupt Control Register */
#define SDMA_CHICR107	(*( SDMA_CHICR000_type *) 0xf0011168u)	/* SDMA Channel 107 Interrupt Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SIT0           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT1           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT2           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT3           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT4           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT5           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT6           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		unsigned int SIT7           : 1;	/* Set Interrupt Trigger for SDMA Channel z */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SDMA_CHINTR00_type;
#define SDMA_CHINTR00	(*( SDMA_CHINTR00_type *) 0xf0010070u)	/* SDMA Channel Interrupt Set Register 00 */
#define SDMA_CHINTR10	(*( SDMA_CHINTR00_type *) 0xf0011070u)	/* SDMA Channel Interrupt Set Register 10 */

typedef volatile union
{
	struct
	{ 
		unsigned int CH0            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH1            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH2            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH3            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH4            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH5            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH6            : 1;	/* DMA Sub-block x Channel z Reset */
		unsigned int CH7            : 1;	/* DMA Sub-block x Channel z Reset */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SDMA_CHRSTR00_type;
#define SDMA_CHRSTR00	(*( SDMA_CHRSTR00_type *) 0xf0010040u)	/* SDMA Channel Reset Request Register 00 */
#define SDMA_CHRSTR10	(*( SDMA_CHRSTR00_type *) 0xf0011040u)	/* SDMA Channel Reset Request Register 10 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 16;	/* Reserved */
		unsigned int CMExSER        : 1;	/* Clear Move Engine x Source Error */
		unsigned int CMExDER        : 1;	/* Clear Move Engine x Destination Error */
		unsigned int                : 2;
		unsigned int CFPIER         : 1;	/* Clear FPI Error */
		unsigned int CSRIER         : 1;	/* Clear SRI Error */
		unsigned int CPERER         : 1;	/* Clear Peripheral Error */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} SDMA_CLRE0_type;
#define SDMA_CLRE0	(*( SDMA_CLRE0_type *) 0xf0010028u)	/* SDMA Clear Error Register 0 */
#define SDMA_CLRE1	(*( SDMA_CLRE0_type *) 0xf0011028u)	/* SDMA Clear Error Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int SIT            : 1;	/* Set Interrupt Trigger for SDMA Move Engine x */
		/* const */ unsigned int RES            : 31;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SDMA_ME0INTR_type;
#define SDMA_ME0INTR	(*( SDMA_ME0INTR_type *) 0xf0010038u)	/* SDMA Move Engine 0 Interrupt Set Register */
#define SDMA_ME1INTR	(*( SDMA_ME0INTR_type *) 0xf0011038u)	/* SDMA Move Engine 1 Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 4;	/* Trigger Set () for OTGB0/1 */
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int BS             : 1;	/* OTGB0/1 Bus Select */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} SDMA_OTSS_type;
#define SDMA_OTSS	(*( SDMA_OTSS_type *) 0xf001000cu)	/* SDMA OCDS Trigger Set Select */

