svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RDCRC          : 32;	/* Read Data CRC */
	} B;
	int I;
	unsigned int U;

} SDMA_RDCRC000_type;
#define SDMA_RDCRC000	(*( SDMA_RDCRC000_type *) 0xf0012018u)	/* SDMA Channel 000 Read Data CRC Register */
#define SDMA_RDCRC001	(*( SDMA_RDCRC000_type *) 0xf0012038u)	/* SDMA Channel 001 Read Data CRC Register */
#define SDMA_RDCRC002	(*( SDMA_RDCRC000_type *) 0xf0012058u)	/* SDMA Channel 002 Read Data CRC Register */
#define SDMA_RDCRC003	(*( SDMA_RDCRC000_type *) 0xf0012078u)	/* SDMA Channel 003 Read Data CRC Register */
#define SDMA_RDCRC004	(*( SDMA_RDCRC000_type *) 0xf0012098u)	/* SDMA Channel 004 Read Data CRC Register */
#define SDMA_RDCRC005	(*( SDMA_RDCRC000_type *) 0xf00120b8u)	/* SDMA Channel 005 Read Data CRC Register */
#define SDMA_RDCRC006	(*( SDMA_RDCRC000_type *) 0xf00120d8u)	/* SDMA Channel 006 Read Data CRC Register */
#define SDMA_RDCRC007	(*( SDMA_RDCRC000_type *) 0xf00120f8u)	/* SDMA Channel 007 Read Data CRC Register */
#define SDMA_RDCRC100	(*( SDMA_RDCRC000_type *) 0xf0012818u)	/* SDMA Channel 100 Read Data CRC Register */
#define SDMA_RDCRC101	(*( SDMA_RDCRC000_type *) 0xf0012838u)	/* SDMA Channel 101 Read Data CRC Register */
#define SDMA_RDCRC102	(*( SDMA_RDCRC000_type *) 0xf0012858u)	/* SDMA Channel 102 Read Data CRC Register */
#define SDMA_RDCRC103	(*( SDMA_RDCRC000_type *) 0xf0012878u)	/* SDMA Channel 103 Read Data CRC Register */
#define SDMA_RDCRC104	(*( SDMA_RDCRC000_type *) 0xf0012898u)	/* SDMA Channel 104 Read Data CRC Register */
#define SDMA_RDCRC105	(*( SDMA_RDCRC000_type *) 0xf00128b8u)	/* SDMA Channel 105 Read Data CRC Register */
#define SDMA_RDCRC106	(*( SDMA_RDCRC000_type *) 0xf00128d8u)	/* SDMA Channel 106 Read Data CRC Register */
#define SDMA_RDCRC107	(*( SDMA_RDCRC000_type *) 0xf00128f8u)	/* SDMA Channel 107 Read Data CRC Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SDCRC          : 32;	/* Source and Destination Address CRC */
	} B;
	int I;
	unsigned int U;

} SDMA_SDCRC000_type;
#define SDMA_SDCRC000	(*( SDMA_SDCRC000_type *) 0xf001201cu)	/* SDMA Channel 000 Source and Destination Address CRC Register */
#define SDMA_SDCRC001	(*( SDMA_SDCRC000_type *) 0xf001203cu)	/* SDMA Channel 001 Source and Destination Address CRC Register */
#define SDMA_SDCRC002	(*( SDMA_SDCRC000_type *) 0xf001205cu)	/* SDMA Channel 002 Source and Destination Address CRC Register */
#define SDMA_SDCRC003	(*( SDMA_SDCRC000_type *) 0xf001207cu)	/* SDMA Channel 003 Source and Destination Address CRC Register */
#define SDMA_SDCRC004	(*( SDMA_SDCRC000_type *) 0xf001209cu)	/* SDMA Channel 004 Source and Destination Address CRC Register */
#define SDMA_SDCRC005	(*( SDMA_SDCRC000_type *) 0xf00120bcu)	/* SDMA Channel 005 Source and Destination Address CRC Register */
#define SDMA_SDCRC006	(*( SDMA_SDCRC000_type *) 0xf00120dcu)	/* SDMA Channel 006 Source and Destination Address CRC Register */
#define SDMA_SDCRC007	(*( SDMA_SDCRC000_type *) 0xf00120fcu)	/* SDMA Channel 007 Source and Destination Address CRC Register */
#define SDMA_SDCRC100	(*( SDMA_SDCRC000_type *) 0xf001281cu)	/* SDMA Channel 100 Source and Destination Address CRC Register */
#define SDMA_SDCRC101	(*( SDMA_SDCRC000_type *) 0xf001283cu)	/* SDMA Channel 101 Source and Destination Address CRC Register */
#define SDMA_SDCRC102	(*( SDMA_SDCRC000_type *) 0xf001285cu)	/* SDMA Channel 102 Source and Destination Address CRC Register */
#define SDMA_SDCRC103	(*( SDMA_SDCRC000_type *) 0xf001287cu)	/* SDMA Channel 103 Source and Destination Address CRC Register */
#define SDMA_SDCRC104	(*( SDMA_SDCRC000_type *) 0xf001289cu)	/* SDMA Channel 104 Source and Destination Address CRC Register */
#define SDMA_SDCRC105	(*( SDMA_SDCRC000_type *) 0xf00128bcu)	/* SDMA Channel 105 Source and Destination Address CRC Register */
#define SDMA_SDCRC106	(*( SDMA_SDCRC000_type *) 0xf00128dcu)	/* SDMA Channel 106 Source and Destination Address CRC Register */
#define SDMA_SDCRC107	(*( SDMA_SDCRC000_type *) 0xf00128fcu)	/* SDMA Channel 107 Source and Destination Address CRC Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SUSAC0         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC1         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC2         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC3         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC4         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC5         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC6         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int SUSAC7         : 1;	/* Channel Suspend Active for SDMA Channel z */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SDMA_SUSACR00_type;
#define SDMA_SUSACR00	(*( SDMA_SUSACR00_type *) 0xf0010068u)	/* SDMA Suspend Acknowledge Register 00 */
#define SDMA_SUSACR10	(*( SDMA_SUSACR00_type *) 0xf0011068u)	/* SDMA Suspend Acknowledge Register 10 */

typedef volatile union
{
	struct
	{ 
		unsigned int SUSEN0         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN1         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN2         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN3         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN4         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN5         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN6         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		unsigned int SUSEN7         : 1;	/* Channel Suspend Enable for SDMA Channel z */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SDMA_SUSENR00_type;
#define SDMA_SUSENR00	(*( SDMA_SUSENR00_type *) 0xf0010060u)	/* SDMA Suspend Enable Register 00 */
#define SDMA_SUSENR10	(*( SDMA_SUSENR00_type *) 0xf0011060u)	/* SDMA Suspend Enable Register 10 */


/* INT */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} INT_ACCEN00_type;
#define INT_ACCEN00	(*( INT_ACCEN00_type *) 0xf00370f4u)	/* Access Enable Register 0 */
#define INT_ACCEN10	(*( INT_ACCEN00_type *) 0xf00370fcu)	/* Kernel 1 Access Enable Register 0 */

