svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} INT_ACCEN01_type;
#define INT_ACCEN01	(*( INT_ACCEN01_type *) 0xf00370f0u)	/* Kernel 0 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} INT_ACCEN11_type;
#define INT_ACCEN11	(*( INT_ACCEN11_type *) 0xf00370f8u)	/* Kernel 1 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PN             : 8;	/* Service Request Priority Number */
		unsigned int                : 2;
		unsigned int ECC            : 6;	/* Service Request ECC */
		unsigned int ID             : 10;	/* Service Request Node ID */
		unsigned int                : 4;
		unsigned int EOV            : 1;	/* Error Overflow Bit */
		unsigned int STAT           : 1;	/* Error Status Bit */
	} B;
	int I;
	unsigned int U;

} INT_ECR0_type;
#define INT_ECR0	(*( INT_ECR0_type *) 0xf0037108u)	/* Error Capture Register 0 */
#define INT_ECR1	(*( INT_ECR0_type *) 0xf0037118u)	/* Error Capture Register 1 */
#define INT_ECR2	(*( INT_ECR0_type *) 0xf0037128u)	/* Error Capture Register 2 */
#define INT_ECR3	(*( INT_ECR0_type *) 0xf0037138u)	/* Error Capture Register 3 */
#define INT_ECR4	(*( INT_ECR0_type *) 0xf0037148u)	/* Error Capture Register 4 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} INT_ID_type;
#define INT_ID	(*( INT_ID_type *) 0xf0037008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PN             : 8;	/* Last Acknowledged Service Request Priority Number */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int ECC            : 6;	/* Last Acknowledged Interrupt ECC */
		/* const */ unsigned int ID             : 10;	/* Last Acknowledged Interrupt SRN ID */
		/* const */ unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} INT_LASR0_type;
#define INT_LASR0	(*( INT_LASR0_type *) 0xf0037104u)	/* Last Acknowledged Service Request Register 0 */
#define INT_LASR1	(*( INT_LASR0_type *) 0xf0037114u)	/* Last Acknowledged Service Request Register 1 */
#define INT_LASR2	(*( INT_LASR0_type *) 0xf0037124u)	/* Last Acknowledged Service Request Register 2 */
#define INT_LASR3	(*( INT_LASR0_type *) 0xf0037134u)	/* Last Acknowledged Service Request Register 3 */
#define INT_LASR4	(*( INT_LASR0_type *) 0xf0037144u)	/* Last Acknowledged Service Request Register 4 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PN             : 8;	/* Latest Winner Priority Number */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int ECC            : 6;	/* Latest Winner ECC */
		/* const */ unsigned int ID             : 10;	/* Latest Winner ID */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int STAT           : 1;	/* LWI Register Status */
	} B;
	int I;
	unsigned int U;

} INT_LWSR0_type;
#define INT_LWSR0	(*( INT_LWSR0_type *) 0xf0037100u)	/* Latest Winning Service Request Register 0 */
#define INT_LWSR1	(*( INT_LWSR0_type *) 0xf0037110u)	/* Latest Winning Service Request Register 1 */
#define INT_LWSR2	(*( INT_LWSR0_type *) 0xf0037120u)	/* Latest Winning Service Request Register 2 */
#define INT_LWSR3	(*( INT_LWSR0_type *) 0xf0037130u)	/* Latest Winning Service Request Register 3 */
#define INT_LWSR4	(*( INT_LWSR0_type *) 0xf0037140u)	/* Latest Winning Service Request Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int TOS0           : 4;	/* Type of Service for Observation on OTGB0 */
		unsigned int                : 3;
		unsigned int OE0            : 1;	/* Output Enable for OTGB0 */
		unsigned int TOS1           : 4;	/* Type of Service for Observation on OTGB1 */
		unsigned int                : 3;
		unsigned int OE1            : 1;	/* Output Enable for OTGB1 */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} INT_OIT_type;
#define INT_OIT	(*( INT_OIT_type *) 0xf00370a0u)	/* OTGM IRQ Trace */

typedef volatile union
{
	struct
	{ 
		unsigned int MIRQ           : 10;	/* SRN Index for Missed Interrupt Trigger */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} INT_OIXMS_type;
#define INT_OIXMS	(*( INT_OIXMS_type *) 0xf003708cu)	/* OTGM IRQ MUX Missed IRQ Select */

typedef volatile union
{
	struct
	{ 
		unsigned int IRQ0           : 10;	/* SRN Index for Interrupt Trigger 0 */
		unsigned int                : 6;
		unsigned int IRQ1           : 10;	/* SRN Index for Interrupt Trigger 1 */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} INT_OIXS0_type;
#define INT_OIXS0	(*( INT_OIXS0_type *) 0xf0037090u)	/* OTGM IRQ MUX Select 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int IRQ2           : 10;	/* SRN Index for Interrupt Trigger 2 */
		unsigned int                : 6;
		unsigned int IRQ3           : 10;	/* SRN Index for Interrupt Trigger 3 */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} INT_OIXS1_type;
#define INT_OIXS1	(*( INT_OIXS1_type *) 0xf0037094u)	/* OTGM IRQ MUX Select 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set Select for OTGB0/1 Overlay */
		unsigned int                : 6;
		unsigned int OBS            : 2;	/* Overlay Byte Select */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} INT_OIXTS_type;
#define INT_OIXTS	(*( INT_OIXTS_type *) 0xf0037088u)	/* OTGM IRQ MUX Trigger Set Select */

typedef volatile union
{
	struct
	{ 
		unsigned int OTGB0          : 16;	/* Bitwise Negedge Sensitivity for OTGB0 */
		unsigned int OTGB1          : 16;	/* Bitwise Negedge Sensitivity for OTGB1 */
	} B;
	int I;
	unsigned int U;

} INT_OMISN_type;
