svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define INT_OMISN	(*( INT_OMISN_type *) 0xf00370a8u)	/* OTGM MCDS I/F Sensitivity Negedge */

typedef volatile union
{
	struct
	{ 
		unsigned int OTGB0          : 16;	/* Bitwise Posedge Sensitivity for OTGB0 */
		unsigned int OTGB1          : 16;	/* Bitwise Posedge Sensitivity for OTGB1 */
	} B;
	int I;
	unsigned int U;

} INT_OMISP_type;
#define INT_OMISP	(*( INT_OMISP_type *) 0xf00370a4u)	/* OTGM MCDS I/F Sensitivity Posedge */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OTGB0          : 16;	/* Status of OTGB0 */
		/* const */ unsigned int OTGB1          : 16;	/* Status of OTGB1 */
	} B;
	int I;
	unsigned int U;

} INT_OOBS_type;
#define INT_OOBS	(*( INT_OOBS_type *) 0xf0037080u)	/* OTGM OTGB0/1 Status */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} INT_OSSIC_type;
#define INT_OSSIC	(*( INT_OSSIC_type *) 0xf0037084u)	/* OTGM SSI Control */

typedef volatile union
{
	struct
	{ 
		unsigned int TRIG0          : 1;	/* General Purpose Service Request Trigger 0 */
		unsigned int TRIG1          : 1;	/* General Purpose Service Request Trigger 1 */
		unsigned int TRIG2          : 1;	/* General Purpose Service Request Trigger 2 */
		unsigned int TRIG3          : 1;	/* General Purpose Service Request Trigger 3 */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} INT_SRB0_type;
#define INT_SRB0	(*( INT_SRB0_type *) 0xf0037010u)	/* Service Request Broadcast Register 0 */
#define INT_SRB1	(*( INT_SRB0_type *) 0xf0037014u)	/* Service Request Broadcast Register 1 */
#define INT_SRB2	(*( INT_SRB0_type *) 0xf0037018u)	/* Service Request Broadcast Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int SRPN           : 8;	/* Service Request Priority Number */
		unsigned int                : 2;
		unsigned int SRE            : 1;	/* Service Request Enable */
		unsigned int TOS            : 3;	/* Type of Service Control */
		unsigned int                : 2;
		unsigned int ECC            : 6;	/* ECC */
		unsigned int                : 2;
		/* const */ unsigned int SRR            : 1;	/* Service Request Flag */
		unsigned int CLRR           : 1;	/* Request Clear Bit */
		unsigned int SETR           : 1;	/* Request Set Bit */
		/* const */ unsigned int IOV            : 1;	/* Interrupt Trigger Overflow Bit */
		unsigned int IOVCLR         : 1;	/* Interrupt Trigger Overflow Clear Bit */
		/* const */ unsigned int SWS            : 1;	/* SW Sticky Bit */
		unsigned int SWSCLR         : 1;	/* SW Sticky Clear Bit */
		/* const */ unsigned int BUSY           : 1;	/* Busy Bit */
	} B;
	int I;
	unsigned int U;

} SRC_AGBT_type;
#define SRC_AGBT	(*( SRC_AGBT_type *) 0xf0038024u)	/* AGBT Service Request */
#define SRC_ASCLIN0ERR	(*( SRC_AGBT_type *) 0xf0038088u)	/* ASCLIN 0 Error Service Request */
#define SRC_ASCLIN0RX	(*( SRC_AGBT_type *) 0xf0038084u)	/* ASCLIN 0 Receive Service Request */
#define SRC_ASCLIN0TX	(*( SRC_AGBT_type *) 0xf0038080u)	/* ASCLIN 0 Transmit Service Request */
#define SRC_ASCLIN1ERR	(*( SRC_AGBT_type *) 0xf0038094u)	/* ASCLIN 1 Error Service Request */
#define SRC_ASCLIN1RX	(*( SRC_AGBT_type *) 0xf0038090u)	/* ASCLIN 1 Receive Service Request */
#define SRC_ASCLIN1TX	(*( SRC_AGBT_type *) 0xf003808cu)	/* ASCLIN 1 Transmit Service Request */
#define SRC_ASCLIN2ERR	(*( SRC_AGBT_type *) 0xf00380a0u)	/* ASCLIN 2 Error Service Request */
#define SRC_ASCLIN2RX	(*( SRC_AGBT_type *) 0xf003809cu)	/* ASCLIN 2 Receive Service Request */
#define SRC_ASCLIN2TX	(*( SRC_AGBT_type *) 0xf0038098u)	/* ASCLIN 2 Transmit Service Request */
#define SRC_ASCLIN3ERR	(*( SRC_AGBT_type *) 0xf00380acu)	/* ASCLIN 3 Error Service Request */
#define SRC_ASCLIN3RX	(*( SRC_AGBT_type *) 0xf00380a8u)	/* ASCLIN 3 Receive Service Request */
#define SRC_ASCLIN3TX	(*( SRC_AGBT_type *) 0xf00380a4u)	/* ASCLIN 3 Transmit Service Request */
#define SRC_BCUSPBSBSRC	(*( SRC_AGBT_type *) 0xf0038040u)	/* Bus Control Unit SPB Service Request */
#define SRC_BMU	(*( SRC_AGBT_type *) 0xf0038c80u)	/* Bus Monitor Unit Service Request */
#define SRC_CANINT0	(*( SRC_AGBT_type *) 0xf0038900u)	/* MULTICAN+ Service Request 0 */
#define SRC_CANINT1	(*( SRC_AGBT_type *) 0xf0038904u)	/* MULTICAN+ Service Request 1 */
#define SRC_CANINT10	(*( SRC_AGBT_type *) 0xf0038928u)	/* MULTICAN+ Service Request 10 */
#define SRC_CANINT11	(*( SRC_AGBT_type *) 0xf003892cu)	/* MULTICAN+ Service Request 11 */
#define SRC_CANINT12	(*( SRC_AGBT_type *) 0xf0038930u)	/* MULTICAN+ Service Request 12 */
#define SRC_CANINT13	(*( SRC_AGBT_type *) 0xf0038934u)	/* MULTICAN+ Service Request 13 */
#define SRC_CANINT14	(*( SRC_AGBT_type *) 0xf0038938u)	/* MULTICAN+ Service Request 14 */
#define SRC_CANINT15	(*( SRC_AGBT_type *) 0xf003893cu)	/* MULTICAN+ Service Request 15 */
#define SRC_CANINT2	(*( SRC_AGBT_type *) 0xf0038908u)	/* MULTICAN+ Service Request 2 */
#define SRC_CANINT3	(*( SRC_AGBT_type *) 0xf003890cu)	/* MULTICAN+ Service Request 3 */
#define SRC_CANINT4	(*( SRC_AGBT_type *) 0xf0038910u)	/* MULTICAN+ Service Request 4 */
#define SRC_CANINT5	(*( SRC_AGBT_type *) 0xf0038914u)	/* MULTICAN+ Service Request 5 */
#define SRC_CANINT6	(*( SRC_AGBT_type *) 0xf0038918u)	/* MULTICAN+ Service Request 6 */
#define SRC_CANINT7	(*( SRC_AGBT_type *) 0xf003891cu)	/* MULTICAN+ Service Request 7 */
#define SRC_CANINT8	(*( SRC_AGBT_type *) 0xf0038920u)	/* MULTICAN+ Service Request 8 */
#define SRC_CANINT9	(*( SRC_AGBT_type *) 0xf0038924u)	/* MULTICAN+ Service Request 9 */
#define SRC_CCU60SR0	(*( SRC_AGBT_type *) 0xf0038420u)	/* CCU6 0 Service Request 0 */
#define SRC_CCU60SR1	(*( SRC_AGBT_type *) 0xf0038424u)	/* CCU6 0 Service Request 1 */
#define SRC_CCU60SR2	(*( SRC_AGBT_type *) 0xf0038428u)	/* CCU6 0 Service Request 2 */
#define SRC_CCU60SR3	(*( SRC_AGBT_type *) 0xf003842cu)	/* CCU6 0 Service Request 3 */
#define SRC_CCU61SR0	(*( SRC_AGBT_type *) 0xf0038430u)	/* CCU6 1 Service Request 0 */
#define SRC_CCU61SR1	(*( SRC_AGBT_type *) 0xf0038434u)	/* CCU6 1 Service Request 1 */
#define SRC_CCU61SR2	(*( SRC_AGBT_type *) 0xf0038438u)	/* CCU6 1 Service Request 2 */
#define SRC_CCU61SR3	(*( SRC_AGBT_type *) 0xf003843cu)	/* CCU6 1 Service Request 3 */
#define SRC_CCU62SR0	(*( SRC_AGBT_type *) 0xf0038440u)	/* CCU6 2 Service Request 0 */
#define SRC_CCU62SR1	(*( SRC_AGBT_type *) 0xf0038444u)	/* CCU6 2 Service Request 1 */
#define SRC_CCU62SR2	(*( SRC_AGBT_type *) 0xf0038448u)	/* CCU6 2 Service Request 2 */
#define SRC_CCU62SR3	(*( SRC_AGBT_type *) 0xf003844cu)	/* CCU6 2 Service Request 3 */
#define SRC_CCU63SR0	(*( SRC_AGBT_type *) 0xf0038450u)	/* CCU6 3 Service Request 0 */
#define SRC_CCU63SR1	(*( SRC_AGBT_type *) 0xf0038454u)	/* CCU6 3 Service Request 1 */
#define SRC_CCU63SR2	(*( SRC_AGBT_type *) 0xf0038458u)	/* CCU6 3 Service Request 2 */
#define SRC_CCU63SR3	(*( SRC_AGBT_type *) 0xf003845cu)	/* CCU6 3 Service Request 3 */
#define SRC_CERBERUS0	(*( SRC_AGBT_type *) 0xf0038050u)	/* Cerberus Service Request 0 */
#define SRC_CERBERUS1	(*( SRC_AGBT_type *) 0xf0038054u)	/* Cerberus Service Request 1 */
#define SRC_CIFISP	(*( SRC_AGBT_type *) 0xf0038da8u)	/* CIF ISP Service Request */
#define SRC_CIFMI	(*( SRC_AGBT_type *) 0xf0038da0u)	/* CIF MI Service Request */
#define SRC_CIFMIEP	(*( SRC_AGBT_type *) 0xf0038da4u)	/* CIF MI EP Service Request */
#define SRC_CIFMJPEG	(*( SRC_AGBT_type *) 0xf0038dacu)	/* CIF MJPEG Service Request */
#define SRC_CPU0SBSRC	(*( SRC_AGBT_type *) 0xf0038000u)	/* CPU 0 Software Breakpoint Service Request */
#define SRC_CPU1SBSRC	(*( SRC_AGBT_type *) 0xf0038004u)	/* CPU 1 Software Breakpoint Service Request */
#define SRC_CPU2SBSRC	(*( SRC_AGBT_type *) 0xf0038008u)	/* CPU 2 Software Breakpoint Service Request */
#define SRC_DAM0	(*( SRC_AGBT_type *) 0xf0038d70u)	/* DAM Service Request 0 */
#define SRC_DAM1	(*( SRC_AGBT_type *) 0xf0038d74u)	/* DAM Service Request 1 */
#define SRC_DAM2	(*( SRC_AGBT_type *) 0xf0038d78u)	/* DAM Service Request 2 */
#define SRC_DAM3	(*( SRC_AGBT_type *) 0xf0038d7cu)	/* DAM Service Request 3 */
#define SRC_DAM4	(*( SRC_AGBT_type *) 0xf0038d80u)	/* DAM Service Request 4 */
#define SRC_DAM5	(*( SRC_AGBT_type *) 0xf0038d84u)	/* DAM Service Request 5 */
#define SRC_DMAME0	(*( SRC_AGBT_type *) 0xf00384d8u)	/* DMA Move Engine 0 Service Request */
#define SRC_DMAME0CH0	(*( SRC_AGBT_type *) 0xf00386f0u)	/* DMA Move Engine 0 Channel 0 Service Request */
#define SRC_DMAME0CH1	(*( SRC_AGBT_type *) 0xf00386f4u)	/* DMA Move Engine 0 Channel 1 Service Request */
#define SRC_DMAME0CH10	(*( SRC_AGBT_type *) 0xf0038718u)	/* DMA Move Engine 0 Channel 10 Service Request */
#define SRC_DMAME0CH11	(*( SRC_AGBT_type *) 0xf003871cu)	/* DMA Move Engine 0 Channel 11 Service Request */
#define SRC_DMAME0CH12	(*( SRC_AGBT_type *) 0xf0038720u)	/* DMA Move Engine 0 Channel 12 Service Request */
#define SRC_DMAME0CH13	(*( SRC_AGBT_type *) 0xf0038724u)	/* DMA Move Engine 0 Channel 13 Service Request */
#define SRC_DMAME0CH14	(*( SRC_AGBT_type *) 0xf0038728u)	/* DMA Move Engine 0 Channel 14 Service Request */
#define SRC_DMAME0CH15	(*( SRC_AGBT_type *) 0xf003872cu)	/* DMA Move Engine 0 Channel 15 Service Request */
#define SRC_DMAME0CH16	(*( SRC_AGBT_type *) 0xf0038730u)	/* DMA Move Engine 0 Channel 16 Service Request */
#define SRC_DMAME0CH17	(*( SRC_AGBT_type *) 0xf0038734u)	/* DMA Move Engine 0 Channel 17 Service Request */
#define SRC_DMAME0CH18	(*( SRC_AGBT_type *) 0xf0038738u)	/* DMA Move Engine 0 Channel 18 Service Request */
#define SRC_DMAME0CH19	(*( SRC_AGBT_type *) 0xf003873cu)	/* DMA Move Engine 0 Channel 19 Service Request */
#define SRC_DMAME0CH2	(*( SRC_AGBT_type *) 0xf00386f8u)	/* DMA Move Engine 0 Channel 2 Service Request */
#define SRC_DMAME0CH20	(*( SRC_AGBT_type *) 0xf0038740u)	/* DMA Move Engine 0 Channel 20 Service Request */
#define SRC_DMAME0CH21	(*( SRC_AGBT_type *) 0xf0038744u)	/* DMA Move Engine 0 Channel 21 Service Request */
#define SRC_DMAME0CH22	(*( SRC_AGBT_type *) 0xf0038748u)	/* DMA Move Engine 0 Channel 22 Service Request */
#define SRC_DMAME0CH23	(*( SRC_AGBT_type *) 0xf003874cu)	/* DMA Move Engine 0 Channel 23 Service Request */
#define SRC_DMAME0CH3	(*( SRC_AGBT_type *) 0xf00386fcu)	/* DMA Move Engine 0 Channel 3 Service Request */
#define SRC_DMAME0CH4	(*( SRC_AGBT_type *) 0xf0038700u)	/* DMA Move Engine 0 Channel 4 Service Request */
#define SRC_DMAME0CH5	(*( SRC_AGBT_type *) 0xf0038704u)	/* DMA Move Engine 0 Channel 5 Service Request */
#define SRC_DMAME0CH6	(*( SRC_AGBT_type *) 0xf0038708u)	/* DMA Move Engine 0 Channel 6 Service Request */
#define SRC_DMAME0CH7	(*( SRC_AGBT_type *) 0xf003870cu)	/* DMA Move Engine 0 Channel 7 Service Request */
#define SRC_DMAME0CH8	(*( SRC_AGBT_type *) 0xf0038710u)	/* DMA Move Engine 0 Channel 8 Service Request */
#define SRC_DMAME0CH9	(*( SRC_AGBT_type *) 0xf0038714u)	/* DMA Move Engine 0 Channel 9 Service Request */
#define SRC_DMAME1	(*( SRC_AGBT_type *) 0xf00384dcu)	/* DMA Move Engine 1 Service Request */
#define SRC_DMAME1CH0	(*( SRC_AGBT_type *) 0xf00387f0u)	/* DMA Move Engine 1 Channel 0 Service Request */
#define SRC_DMAME1CH1	(*( SRC_AGBT_type *) 0xf00387f4u)	/* DMA Move Engine 1 Channel 1 Service Request */
#define SRC_DMAME1CH10	(*( SRC_AGBT_type *) 0xf0038818u)	/* DMA Move Engine 1 Channel 10 Service Request */
#define SRC_DMAME1CH11	(*( SRC_AGBT_type *) 0xf003881cu)	/* DMA Move Engine 1 Channel 11 Service Request */
#define SRC_DMAME1CH12	(*( SRC_AGBT_type *) 0xf0038820u)	/* DMA Move Engine 1 Channel 12 Service Request */
#define SRC_DMAME1CH13	(*( SRC_AGBT_type *) 0xf0038824u)	/* DMA Move Engine 1 Channel 13 Service Request */
#define SRC_DMAME1CH14	(*( SRC_AGBT_type *) 0xf0038828u)	/* DMA Move Engine 1 Channel 14 Service Request */
#define SRC_DMAME1CH15	(*( SRC_AGBT_type *) 0xf003882cu)	/* DMA Move Engine 1 Channel 15 Service Request */
#define SRC_DMAME1CH16	(*( SRC_AGBT_type *) 0xf0038830u)	/* DMA Move Engine 1 Channel 16 Service Request */
#define SRC_DMAME1CH17	(*( SRC_AGBT_type *) 0xf0038834u)	/* DMA Move Engine 1 Channel 17 Service Request */
#define SRC_DMAME1CH18	(*( SRC_AGBT_type *) 0xf0038838u)	/* DMA Move Engine 1 Channel 18 Service Request */
#define SRC_DMAME1CH19	(*( SRC_AGBT_type *) 0xf003883cu)	/* DMA Move Engine 1 Channel 19 Service Request */
#define SRC_DMAME1CH2	(*( SRC_AGBT_type *) 0xf00387f8u)	/* DMA Move Engine 1 Channel 2 Service Request */
#define SRC_DMAME1CH20	(*( SRC_AGBT_type *) 0xf0038840u)	/* DMA Move Engine 1 Channel 20 Service Request */
#define SRC_DMAME1CH21	(*( SRC_AGBT_type *) 0xf0038844u)	/* DMA Move Engine 1 Channel 21 Service Request */
#define SRC_DMAME1CH22	(*( SRC_AGBT_type *) 0xf0038848u)	/* DMA Move Engine 1 Channel 22 Service Request */
#define SRC_DMAME1CH23	(*( SRC_AGBT_type *) 0xf003884cu)	/* DMA Move Engine 1 Channel 23 Service Request */
#define SRC_DMAME1CH3	(*( SRC_AGBT_type *) 0xf00387fcu)	/* DMA Move Engine 1 Channel 3 Service Request */
#define SRC_DMAME1CH4	(*( SRC_AGBT_type *) 0xf0038800u)	/* DMA Move Engine 1 Channel 4 Service Request */
#define SRC_DMAME1CH5	(*( SRC_AGBT_type *) 0xf0038804u)	/* DMA Move Engine 1 Channel 5 Service Request */
#define SRC_DMAME1CH6	(*( SRC_AGBT_type *) 0xf0038808u)	/* DMA Move Engine 1 Channel 6 Service Request */
#define SRC_DMAME1CH7	(*( SRC_AGBT_type *) 0xf003880cu)	/* DMA Move Engine 1 Channel 7 Service Request */
#define SRC_DMAME1CH8	(*( SRC_AGBT_type *) 0xf0038810u)	/* DMA Move Engine 1 Channel 8 Service Request */
#define SRC_DMAME1CH9	(*( SRC_AGBT_type *) 0xf0038814u)	/* DMA Move Engine 1 Channel 9 Service Request */
#define SRC_DSADCSRA0	(*( SRC_AGBT_type *) 0xf0038b94u)	/* DSADC SRA0 Service Request */
#define SRC_DSADCSRA1	(*( SRC_AGBT_type *) 0xf0038b9cu)	/* DSADC SRA1 Service Request */
#define SRC_DSADCSRA2	(*( SRC_AGBT_type *) 0xf0038ba4u)	/* DSADC SRA2 Service Request */
#define SRC_DSADCSRA3	(*( SRC_AGBT_type *) 0xf0038bacu)	/* DSADC SRA3 Service Request */
#define SRC_DSADCSRA4	(*( SRC_AGBT_type *) 0xf0038bb4u)	/* DSADC SRA4 Service Request */
#define SRC_DSADCSRA5	(*( SRC_AGBT_type *) 0xf0038bbcu)	/* DSADC SRA5 Service Request */
#define SRC_DSADCSRM0	(*( SRC_AGBT_type *) 0xf0038b90u)	/* DSADC SRM0 Service Request */
#define SRC_DSADCSRM1	(*( SRC_AGBT_type *) 0xf0038b98u)	/* DSADC SRM1 Service Request */
#define SRC_DSADCSRM2	(*( SRC_AGBT_type *) 0xf0038ba0u)	/* DSADC SRM2 Service Request */
#define SRC_DSADCSRM3	(*( SRC_AGBT_type *) 0xf0038ba8u)	/* DSADC SRM3 Service Request */
#define SRC_DSADCSRM4	(*( SRC_AGBT_type *) 0xf0038bb0u)	/* DSADC SRM4 Service Request */
#define SRC_DSADCSRM5	(*( SRC_AGBT_type *) 0xf0038bb8u)	/* DSADC SRM5 Service Request */
#define SRC_EMEM	(*( SRC_AGBT_type *) 0xf0038020u)	/* Emulation Memory Service Request */
#define SRC_ERAYIBUSY	(*( SRC_AGBT_type *) 0xf0038c04u)	/* E-RAY Input Buffer Busy Service Request */
#define SRC_ERAYINT0	(*( SRC_AGBT_type *) 0xf0038be0u)	/* E-RAY Service Request 0 */
#define SRC_ERAYINT1	(*( SRC_AGBT_type *) 0xf0038be4u)	/* E-RAY Service Request 1 */
#define SRC_ERAYMBSC0	(*( SRC_AGBT_type *) 0xf0038bf8u)	/* E-RAY Message Buffer Status Changed 0 Service Request */
#define SRC_ERAYMBSC1	(*( SRC_AGBT_type *) 0xf0038bfcu)	/* E-RAY Message Buffer Status Changed 1 Service Request */
#define SRC_ERAYNDAT0	(*( SRC_AGBT_type *) 0xf0038bf0u)	/* E-RAY New Data 0 Service Request */
#define SRC_ERAYNDAT1	(*( SRC_AGBT_type *) 0xf0038bf4u)	/* E-RAY New Data 1 Service Request */
#define SRC_ERAYOBUSY	(*( SRC_AGBT_type *) 0xf0038c00u)	/* E-RAY Output Buffer Busy Service Request */
#define SRC_ERAYTINT0	(*( SRC_AGBT_type *) 0xf0038be8u)	/* E-RAY Timer Interrupt 0 Service Request */
#define SRC_ERAYTINT1	(*( SRC_AGBT_type *) 0xf0038becu)	/* E-RAY Timer Interrupt 1 Service Request */
#define SRC_ETH	(*( SRC_AGBT_type *) 0xf00388f0u)	/* Ethernet Service Request */
#define SRC_FCE	(*( SRC_AGBT_type *) 0xf00384b0u)	/* FCE Error Service Request */
#define SRC_GPSR00	(*( SRC_AGBT_type *) 0xf0039000u)	/* General Purpose Service Request 00 */
#define SRC_GPSR01	(*( SRC_AGBT_type *) 0xf0039004u)	/* General Purpose Service Request 01 */
#define SRC_GPSR02	(*( SRC_AGBT_type *) 0xf0039008u)	/* General Purpose Service Request 02 */
#define SRC_GPSR03	(*( SRC_AGBT_type *) 0xf003900cu)	/* General Purpose Service Request 03 */
#define SRC_GPSR10	(*( SRC_AGBT_type *) 0xf0039020u)	/* General Purpose Service Request 10 */
#define SRC_GPSR11	(*( SRC_AGBT_type *) 0xf0039024u)	/* General Purpose Service Request 11 */
#define SRC_GPSR12	(*( SRC_AGBT_type *) 0xf0039028u)	/* General Purpose Service Request 12 */
#define SRC_GPSR13	(*( SRC_AGBT_type *) 0xf003902cu)	/* General Purpose Service Request 13 */
#define SRC_GPSR20	(*( SRC_AGBT_type *) 0xf0039040u)	/* General Purpose Service Request 20 */
#define SRC_GPSR21	(*( SRC_AGBT_type *) 0xf0039044u)	/* General Purpose Service Request 21 */
#define SRC_GPSR22	(*( SRC_AGBT_type *) 0xf0039048u)	/* General Purpose Service Request 22 */
#define SRC_GPSR23	(*( SRC_AGBT_type *) 0xf003904cu)	/* General Purpose Service Request 23 */
#define SRC_GPT120CIRQ	(*( SRC_AGBT_type *) 0xf0038460u)	/* GPT120 CAPREL Service Request */
#define SRC_GPT120T2	(*( SRC_AGBT_type *) 0xf0038464u)	/* GPT120 T2 Overflow/Underflow Service Request */
#define SRC_GPT120T3	(*( SRC_AGBT_type *) 0xf0038468u)	/* GPT120 T3 Overflow/Underflow Service Request */
#define SRC_GPT120T4	(*( SRC_AGBT_type *) 0xf003846cu)	/* GPT120 T4 Overflow/Underflow Service Request */
#define SRC_GPT120T5	(*( SRC_AGBT_type *) 0xf0038470u)	/* GPT120 T5 Overflow/Underflow Service Request */
#define SRC_GPT120T6	(*( SRC_AGBT_type *) 0xf0038474u)	/* GPT120 T6 Overflow/Underflow Service Request */
#define SRC_GPT121CIRQ	(*( SRC_AGBT_type *) 0xf0038478u)	/* GPT121 CAPREL Service Request */
#define SRC_GPT121T2	(*( SRC_AGBT_type *) 0xf003847cu)	/* GPT121 T2 Overflow/Underflow Service Request */
#define SRC_GPT121T3	(*( SRC_AGBT_type *) 0xf0038480u)	/* GPT121 T3 Overflow/Underflow Service Request */
#define SRC_GPT121T4	(*( SRC_AGBT_type *) 0xf0038484u)	/* GPT121 T4 Overflow/Underflow Service Request */
#define SRC_GPT121T5	(*( SRC_AGBT_type *) 0xf0038488u)	/* GPT121 T5 Overflow/Underflow Service Request */
#define SRC_GPT121T6	(*( SRC_AGBT_type *) 0xf003848cu)	/* GPT121 T6 Overflow/Underflow Service Request */
#define SRC_GTMAEIIRQ	(*( SRC_AGBT_type *) 0xf0039600u)	/* GTM AEI Shared Service Request */
#define SRC_GTMARUIRQ0	(*( SRC_AGBT_type *) 0xf0039604u)	/* GTM ARU Shared Service Request 0 */
#define SRC_GTMARUIRQ1	(*( SRC_AGBT_type *) 0xf0039608u)	/* GTM ARU Shared Service Request 1 */
#define SRC_GTMARUIRQ2	(*( SRC_AGBT_type *) 0xf003960cu)	/* GTM ARU Shared Service Request 2 */
#define SRC_GTMATOM00	(*( SRC_AGBT_type *) 0xf0039d80u)	/* GTM ATOM0 Shared Service Request 0 */
#define SRC_GTMATOM01	(*( SRC_AGBT_type *) 0xf0039d84u)	/* GTM ATOM0 Shared Service Request 1 */
#define SRC_GTMATOM02	(*( SRC_AGBT_type *) 0xf0039d88u)	/* GTM ATOM0 Shared Service Request 2 */
#define SRC_GTMATOM03	(*( SRC_AGBT_type *) 0xf0039d8cu)	/* GTM ATOM0 Shared Service Request 3 */
#define SRC_GTMATOM10	(*( SRC_AGBT_type *) 0xf0039d90u)	/* GTM ATOM1 Shared Service Request 0 */
#define SRC_GTMATOM11	(*( SRC_AGBT_type *) 0xf0039d94u)	/* GTM ATOM1 Shared Service Request 1 */
#define SRC_GTMATOM12	(*( SRC_AGBT_type *) 0xf0039d98u)	/* GTM ATOM1 Shared Service Request 2 */
#define SRC_GTMATOM13	(*( SRC_AGBT_type *) 0xf0039d9cu)	/* GTM ATOM1 Shared Service Request 3 */
#define SRC_GTMATOM20	(*( SRC_AGBT_type *) 0xf0039da0u)	/* GTM ATOM2 Shared Service Request 0 */
#define SRC_GTMATOM21	(*( SRC_AGBT_type *) 0xf0039da4u)	/* GTM ATOM2 Shared Service Request 1 */
#define SRC_GTMATOM22	(*( SRC_AGBT_type *) 0xf0039da8u)	/* GTM ATOM2 Shared Service Request 2 */
#define SRC_GTMATOM23	(*( SRC_AGBT_type *) 0xf0039dacu)	/* GTM ATOM2 Shared Service Request 3 */
#define SRC_GTMATOM30	(*( SRC_AGBT_type *) 0xf0039db0u)	/* GTM ATOM3 Shared Service Request 0 */
#define SRC_GTMATOM31	(*( SRC_AGBT_type *) 0xf0039db4u)	/* GTM ATOM3 Shared Service Request 1 */
#define SRC_GTMATOM32	(*( SRC_AGBT_type *) 0xf0039db8u)	/* GTM ATOM3 Shared Service Request 2 */
#define SRC_GTMATOM33	(*( SRC_AGBT_type *) 0xf0039dbcu)	/* GTM ATOM3 Shared Service Request 3 */
#define SRC_GTMATOM40	(*( SRC_AGBT_type *) 0xf0039dc0u)	/* GTM ATOM4 Shared Service Request 0 */
#define SRC_GTMATOM41	(*( SRC_AGBT_type *) 0xf0039dc4u)	/* GTM ATOM4 Shared Service Request 1 */
#define SRC_GTMATOM42	(*( SRC_AGBT_type *) 0xf0039dc8u)	/* GTM ATOM4 Shared Service Request 2 */
#define SRC_GTMATOM43	(*( SRC_AGBT_type *) 0xf0039dccu)	/* GTM ATOM4 Shared Service Request 3 */
#define SRC_GTMBRCIRQ	(*( SRC_AGBT_type *) 0xf0039614u)	/* GTM BRC Shared Service Request */
#define SRC_GTMCMPIRQ	(*( SRC_AGBT_type *) 0xf0039618u)	/* GTM CMP Shared Service Request */
#define SRC_GTMDPLL0	(*( SRC_AGBT_type *) 0xf00396a4u)	/* GTM DPLL Service Request 0 */
#define SRC_GTMDPLL1	(*( SRC_AGBT_type *) 0xf00396a8u)	/* GTM DPLL Service Request 1 */
#define SRC_GTMDPLL10	(*( SRC_AGBT_type *) 0xf00396ccu)	/* GTM DPLL Service Request 10 */
#define SRC_GTMDPLL11	(*( SRC_AGBT_type *) 0xf00396d0u)	/* GTM DPLL Service Request 11 */
#define SRC_GTMDPLL12	(*( SRC_AGBT_type *) 0xf00396d4u)	/* GTM DPLL Service Request 12 */
#define SRC_GTMDPLL13	(*( SRC_AGBT_type *) 0xf00396d8u)	/* GTM DPLL Service Request 13 */
#define SRC_GTMDPLL14	(*( SRC_AGBT_type *) 0xf00396dcu)	/* GTM DPLL Service Request 14 */
#define SRC_GTMDPLL15	(*( SRC_AGBT_type *) 0xf00396e0u)	/* GTM DPLL Service Request 15 */
#define SRC_GTMDPLL16	(*( SRC_AGBT_type *) 0xf00396e4u)	/* GTM DPLL Service Request 16 */
#define SRC_GTMDPLL17	(*( SRC_AGBT_type *) 0xf00396e8u)	/* GTM DPLL Service Request 17 */
#define SRC_GTMDPLL18	(*( SRC_AGBT_type *) 0xf00396ecu)	/* GTM DPLL Service Request 18 */
#define SRC_GTMDPLL19	(*( SRC_AGBT_type *) 0xf00396f0u)	/* GTM DPLL Service Request 19 */
#define SRC_GTMDPLL2	(*( SRC_AGBT_type *) 0xf00396acu)	/* GTM DPLL Service Request 2 */
#define SRC_GTMDPLL20	(*( SRC_AGBT_type *) 0xf00396f4u)	/* GTM DPLL Service Request 20 */
#define SRC_GTMDPLL21	(*( SRC_AGBT_type *) 0xf00396f8u)	/* GTM DPLL Service Request 21 */
#define SRC_GTMDPLL22	(*( SRC_AGBT_type *) 0xf00396fcu)	/* GTM DPLL Service Request 22 */
#define SRC_GTMDPLL23	(*( SRC_AGBT_type *) 0xf0039700u)	/* GTM DPLL Service Request 23 */
#define SRC_GTMDPLL24	(*( SRC_AGBT_type *) 0xf0039704u)	/* GTM DPLL Service Request 24 */
#define SRC_GTMDPLL25	(*( SRC_AGBT_type *) 0xf0039708u)	/* GTM DPLL Service Request 25 */
#define SRC_GTMDPLL26	(*( SRC_AGBT_type *) 0xf003970cu)	/* GTM DPLL Service Request 26 */
#define SRC_GTMDPLL3	(*( SRC_AGBT_type *) 0xf00396b0u)	/* GTM DPLL Service Request 3 */
#define SRC_GTMDPLL4	(*( SRC_AGBT_type *) 0xf00396b4u)	/* GTM DPLL Service Request 4 */
#define SRC_GTMDPLL5	(*( SRC_AGBT_type *) 0xf00396b8u)	/* GTM DPLL Service Request 5 */
#define SRC_GTMDPLL6	(*( SRC_AGBT_type *) 0xf00396bcu)	/* GTM DPLL Service Request 6 */
#define SRC_GTMDPLL7	(*( SRC_AGBT_type *) 0xf00396c0u)	/* GTM DPLL Service Request 7 */
#define SRC_GTMDPLL8	(*( SRC_AGBT_type *) 0xf00396c4u)	/* GTM DPLL Service Request 8 */
#define SRC_GTMDPLL9	(*( SRC_AGBT_type *) 0xf00396c8u)	/* GTM DPLL Service Request 9 */
#define SRC_GTMMCS00	(*( SRC_AGBT_type *) 0xf0039980u)	/* GTM MCS0 Shared Service Request 0 */
#define SRC_GTMMCS01	(*( SRC_AGBT_type *) 0xf0039984u)	/* GTM MCS0 Shared Service Request 1 */
#define SRC_GTMMCS02	(*( SRC_AGBT_type *) 0xf0039988u)	/* GTM MCS0 Shared Service Request 2 */
#define SRC_GTMMCS03	(*( SRC_AGBT_type *) 0xf003998cu)	/* GTM MCS0 Shared Service Request 3 */
