svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SRC_GTMMCS04	(*( SRC_AGBT_type *) 0xf0039990u)	/* GTM MCS0 Shared Service Request 4 */
#define SRC_GTMMCS05	(*( SRC_AGBT_type *) 0xf0039994u)	/* GTM MCS0 Shared Service Request 5 */
#define SRC_GTMMCS06	(*( SRC_AGBT_type *) 0xf0039998u)	/* GTM MCS0 Shared Service Request 6 */
#define SRC_GTMMCS07	(*( SRC_AGBT_type *) 0xf003999cu)	/* GTM MCS0 Shared Service Request 7 */
#define SRC_GTMMCS10	(*( SRC_AGBT_type *) 0xf00399a0u)	/* GTM MCS1 Shared Service Request 0 */
#define SRC_GTMMCS11	(*( SRC_AGBT_type *) 0xf00399a4u)	/* GTM MCS1 Shared Service Request 1 */
#define SRC_GTMMCS12	(*( SRC_AGBT_type *) 0xf00399a8u)	/* GTM MCS1 Shared Service Request 2 */
#define SRC_GTMMCS13	(*( SRC_AGBT_type *) 0xf00399acu)	/* GTM MCS1 Shared Service Request 3 */
#define SRC_GTMMCS14	(*( SRC_AGBT_type *) 0xf00399b0u)	/* GTM MCS1 Shared Service Request 4 */
#define SRC_GTMMCS15	(*( SRC_AGBT_type *) 0xf00399b4u)	/* GTM MCS1 Shared Service Request 5 */
#define SRC_GTMMCS16	(*( SRC_AGBT_type *) 0xf00399b8u)	/* GTM MCS1 Shared Service Request 6 */
#define SRC_GTMMCS17	(*( SRC_AGBT_type *) 0xf00399bcu)	/* GTM MCS1 Shared Service Request 7 */
#define SRC_GTMMCS20	(*( SRC_AGBT_type *) 0xf00399c0u)	/* GTM MCS2 Shared Service Request 0 */
#define SRC_GTMMCS21	(*( SRC_AGBT_type *) 0xf00399c4u)	/* GTM MCS2 Shared Service Request 1 */
#define SRC_GTMMCS22	(*( SRC_AGBT_type *) 0xf00399c8u)	/* GTM MCS2 Shared Service Request 2 */
#define SRC_GTMMCS23	(*( SRC_AGBT_type *) 0xf00399ccu)	/* GTM MCS2 Shared Service Request 3 */
#define SRC_GTMMCS24	(*( SRC_AGBT_type *) 0xf00399d0u)	/* GTM MCS2 Shared Service Request 4 */
#define SRC_GTMMCS25	(*( SRC_AGBT_type *) 0xf00399d4u)	/* GTM MCS2 Shared Service Request 5 */
#define SRC_GTMMCS26	(*( SRC_AGBT_type *) 0xf00399d8u)	/* GTM MCS2 Shared Service Request 6 */
#define SRC_GTMMCS27	(*( SRC_AGBT_type *) 0xf00399dcu)	/* GTM MCS2 Shared Service Request 7 */
#define SRC_GTMMCS30	(*( SRC_AGBT_type *) 0xf00399e0u)	/* GTM MCS3 Shared Service Request 0 */
#define SRC_GTMMCS31	(*( SRC_AGBT_type *) 0xf00399e4u)	/* GTM MCS3 Shared Service Request 1 */
#define SRC_GTMMCS32	(*( SRC_AGBT_type *) 0xf00399e8u)	/* GTM MCS3 Shared Service Request 2 */
#define SRC_GTMMCS33	(*( SRC_AGBT_type *) 0xf00399ecu)	/* GTM MCS3 Shared Service Request 3 */
#define SRC_GTMMCS34	(*( SRC_AGBT_type *) 0xf00399f0u)	/* GTM MCS3 Shared Service Request 4 */
#define SRC_GTMMCS35	(*( SRC_AGBT_type *) 0xf00399f4u)	/* GTM MCS3 Shared Service Request 5 */
#define SRC_GTMMCS36	(*( SRC_AGBT_type *) 0xf00399f8u)	/* GTM MCS3 Shared Service Request 6 */
#define SRC_GTMMCS37	(*( SRC_AGBT_type *) 0xf00399fcu)	/* GTM MCS3 Shared Service Request 7 */
#define SRC_GTMMCSW00	(*( SRC_AGBT_type *) 0xf0039f00u)	/* GTM Multi Channel Sequencer 0 Service Request 0 */
#define SRC_GTMMCSW01	(*( SRC_AGBT_type *) 0xf0039f04u)	/* GTM Multi Channel Sequencer 0 Service Request 1 */
#define SRC_GTMMCSW10	(*( SRC_AGBT_type *) 0xf0039f08u)	/* GTM Multi Channel Sequencer 1 Service Request 0 */
#define SRC_GTMMCSW11	(*( SRC_AGBT_type *) 0xf0039f0cu)	/* GTM Multi Channel Sequencer 1 Service Request 1 */
#define SRC_GTMMCSW20	(*( SRC_AGBT_type *) 0xf0039f10u)	/* GTM Multi Channel Sequencer 2 Service Request 0 */
#define SRC_GTMMCSW21	(*( SRC_AGBT_type *) 0xf0039f14u)	/* GTM Multi Channel Sequencer 2 Service Request 1 */
#define SRC_GTMMCSW30	(*( SRC_AGBT_type *) 0xf0039f18u)	/* GTM Multi Channel Sequencer 2 Service Request 0 */
#define SRC_GTMMCSW31	(*( SRC_AGBT_type *) 0xf0039f1cu)	/* GTM Multi Channel Sequencer 2 Service Request 1 */
#define SRC_GTMPSM00	(*( SRC_AGBT_type *) 0xf0039624u)	/* GTM PSM0 Shared Service Request 0 */
#define SRC_GTMPSM01	(*( SRC_AGBT_type *) 0xf0039628u)	/* GTM PSM0 Shared Service Request 1 */
#define SRC_GTMPSM02	(*( SRC_AGBT_type *) 0xf003962cu)	/* GTM PSM0 Shared Service Request 2 */
#define SRC_GTMPSM03	(*( SRC_AGBT_type *) 0xf0039630u)	/* GTM PSM0 Shared Service Request 3 */
#define SRC_GTMPSM04	(*( SRC_AGBT_type *) 0xf0039634u)	/* GTM PSM0 Shared Service Request 4 */
#define SRC_GTMPSM05	(*( SRC_AGBT_type *) 0xf0039638u)	/* GTM PSM0 Shared Service Request 5 */
#define SRC_GTMPSM06	(*( SRC_AGBT_type *) 0xf003963cu)	/* GTM PSM0 Shared Service Request 6 */
#define SRC_GTMPSM07	(*( SRC_AGBT_type *) 0xf0039640u)	/* GTM PSM0 Shared Service Request 7 */
#define SRC_GTMSPE0IRQ	(*( SRC_AGBT_type *) 0xf003961cu)	/* GTM SPE0 Shared Service Request */
#define SRC_GTMSPE1IRQ	(*( SRC_AGBT_type *) 0xf0039620u)	/* GTM SPE1 Shared Service Request */
#define SRC_GTMTIM00	(*( SRC_AGBT_type *) 0xf0039780u)	/* GTM TIM0 Shared Service Request 0 */
#define SRC_GTMTIM01	(*( SRC_AGBT_type *) 0xf0039784u)	/* GTM TIM0 Shared Service Request 1 */
#define SRC_GTMTIM02	(*( SRC_AGBT_type *) 0xf0039788u)	/* GTM TIM0 Shared Service Request 2 */
#define SRC_GTMTIM03	(*( SRC_AGBT_type *) 0xf003978cu)	/* GTM TIM0 Shared Service Request 3 */
#define SRC_GTMTIM04	(*( SRC_AGBT_type *) 0xf0039790u)	/* GTM TIM0 Shared Service Request 4 */
#define SRC_GTMTIM05	(*( SRC_AGBT_type *) 0xf0039794u)	/* GTM TIM0 Shared Service Request 5 */
#define SRC_GTMTIM06	(*( SRC_AGBT_type *) 0xf0039798u)	/* GTM TIM0 Shared Service Request 6 */
#define SRC_GTMTIM07	(*( SRC_AGBT_type *) 0xf003979cu)	/* GTM TIM0 Shared Service Request 7 */
#define SRC_GTMTIM10	(*( SRC_AGBT_type *) 0xf00397a0u)	/* GTM TIM1 Shared Service Request 0 */
#define SRC_GTMTIM11	(*( SRC_AGBT_type *) 0xf00397a4u)	/* GTM TIM1 Shared Service Request 1 */
#define SRC_GTMTIM12	(*( SRC_AGBT_type *) 0xf00397a8u)	/* GTM TIM1 Shared Service Request 2 */
#define SRC_GTMTIM13	(*( SRC_AGBT_type *) 0xf00397acu)	/* GTM TIM1 Shared Service Request 3 */
#define SRC_GTMTIM14	(*( SRC_AGBT_type *) 0xf00397b0u)	/* GTM TIM1 Shared Service Request 4 */
#define SRC_GTMTIM15	(*( SRC_AGBT_type *) 0xf00397b4u)	/* GTM TIM1 Shared Service Request 5 */
#define SRC_GTMTIM16	(*( SRC_AGBT_type *) 0xf00397b8u)	/* GTM TIM1 Shared Service Request 6 */
#define SRC_GTMTIM17	(*( SRC_AGBT_type *) 0xf00397bcu)	/* GTM TIM1 Shared Service Request 7 */
#define SRC_GTMTIM20	(*( SRC_AGBT_type *) 0xf00397c0u)	/* GTM TIM2 Shared Service Request 0 */
#define SRC_GTMTIM21	(*( SRC_AGBT_type *) 0xf00397c4u)	/* GTM TIM2 Shared Service Request 1 */
#define SRC_GTMTIM22	(*( SRC_AGBT_type *) 0xf00397c8u)	/* GTM TIM2 Shared Service Request 2 */
#define SRC_GTMTIM23	(*( SRC_AGBT_type *) 0xf00397ccu)	/* GTM TIM2 Shared Service Request 3 */
#define SRC_GTMTIM24	(*( SRC_AGBT_type *) 0xf00397d0u)	/* GTM TIM2 Shared Service Request 4 */
#define SRC_GTMTIM25	(*( SRC_AGBT_type *) 0xf00397d4u)	/* GTM TIM2 Shared Service Request 5 */
#define SRC_GTMTIM26	(*( SRC_AGBT_type *) 0xf00397d8u)	/* GTM TIM2 Shared Service Request 6 */
#define SRC_GTMTIM27	(*( SRC_AGBT_type *) 0xf00397dcu)	/* GTM TIM2 Shared Service Request 7 */
#define SRC_GTMTIM30	(*( SRC_AGBT_type *) 0xf00397e0u)	/* GTM TIM3 Shared Service Request 0 */
#define SRC_GTMTIM31	(*( SRC_AGBT_type *) 0xf00397e4u)	/* GTM TIM3 Shared Service Request 1 */
#define SRC_GTMTIM32	(*( SRC_AGBT_type *) 0xf00397e8u)	/* GTM TIM3 Shared Service Request 2 */
#define SRC_GTMTIM33	(*( SRC_AGBT_type *) 0xf00397ecu)	/* GTM TIM3 Shared Service Request 3 */
#define SRC_GTMTIM34	(*( SRC_AGBT_type *) 0xf00397f0u)	/* GTM TIM3 Shared Service Request 4 */
#define SRC_GTMTIM35	(*( SRC_AGBT_type *) 0xf00397f4u)	/* GTM TIM3 Shared Service Request 5 */
#define SRC_GTMTIM36	(*( SRC_AGBT_type *) 0xf00397f8u)	/* GTM TIM3 Shared Service Request 6 */
#define SRC_GTMTIM37	(*( SRC_AGBT_type *) 0xf00397fcu)	/* GTM TIM3 Shared Service Request 7 */
#define SRC_GTMTOM00	(*( SRC_AGBT_type *) 0xf0039b80u)	/* GTM TOM0 Shared Service Request 0 */
#define SRC_GTMTOM01	(*( SRC_AGBT_type *) 0xf0039b84u)	/* GTM TOM0 Shared Service Request 1 */
#define SRC_GTMTOM02	(*( SRC_AGBT_type *) 0xf0039b88u)	/* GTM TOM0 Shared Service Request 2 */
#define SRC_GTMTOM03	(*( SRC_AGBT_type *) 0xf0039b8cu)	/* GTM TOM0 Shared Service Request 3 */
#define SRC_GTMTOM04	(*( SRC_AGBT_type *) 0xf0039b90u)	/* GTM TOM0 Shared Service Request 4 */
#define SRC_GTMTOM05	(*( SRC_AGBT_type *) 0xf0039b94u)	/* GTM TOM0 Shared Service Request 5 */
#define SRC_GTMTOM06	(*( SRC_AGBT_type *) 0xf0039b98u)	/* GTM TOM0 Shared Service Request 6 */
#define SRC_GTMTOM07	(*( SRC_AGBT_type *) 0xf0039b9cu)	/* GTM TOM0 Shared Service Request 7 */
#define SRC_GTMTOM10	(*( SRC_AGBT_type *) 0xf0039ba0u)	/* GTM TOM1 Shared Service Request 0 */
#define SRC_GTMTOM11	(*( SRC_AGBT_type *) 0xf0039ba4u)	/* GTM TOM1 Shared Service Request 1 */
#define SRC_GTMTOM12	(*( SRC_AGBT_type *) 0xf0039ba8u)	/* GTM TOM1 Shared Service Request 2 */
#define SRC_GTMTOM13	(*( SRC_AGBT_type *) 0xf0039bacu)	/* GTM TOM1 Shared Service Request 3 */
#define SRC_GTMTOM14	(*( SRC_AGBT_type *) 0xf0039bb0u)	/* GTM TOM1 Shared Service Request 4 */
#define SRC_GTMTOM15	(*( SRC_AGBT_type *) 0xf0039bb4u)	/* GTM TOM1 Shared Service Request 5 */
#define SRC_GTMTOM16	(*( SRC_AGBT_type *) 0xf0039bb8u)	/* GTM TOM1 Shared Service Request 6 */
#define SRC_GTMTOM17	(*( SRC_AGBT_type *) 0xf0039bbcu)	/* GTM TOM1 Shared Service Request 7 */
#define SRC_GTMTOM20	(*( SRC_AGBT_type *) 0xf0039bc0u)	/* GTM TOM2 Shared Service Request 0 */
#define SRC_GTMTOM21	(*( SRC_AGBT_type *) 0xf0039bc4u)	/* GTM TOM2 Shared Service Request 1 */
#define SRC_GTMTOM22	(*( SRC_AGBT_type *) 0xf0039bc8u)	/* GTM TOM2 Shared Service Request 2 */
#define SRC_GTMTOM23	(*( SRC_AGBT_type *) 0xf0039bccu)	/* GTM TOM2 Shared Service Request 3 */
#define SRC_GTMTOM24	(*( SRC_AGBT_type *) 0xf0039bd0u)	/* GTM TOM2 Shared Service Request 4 */
#define SRC_GTMTOM25	(*( SRC_AGBT_type *) 0xf0039bd4u)	/* GTM TOM2 Shared Service Request 5 */
#define SRC_GTMTOM26	(*( SRC_AGBT_type *) 0xf0039bd8u)	/* GTM TOM2 Shared Service Request 6 */
#define SRC_GTMTOM27	(*( SRC_AGBT_type *) 0xf0039bdcu)	/* GTM TOM2 Shared Service Request 7 */
#define SRC_HSCT	(*( SRC_AGBT_type *) 0xf0038290u)	/* HSCT Service Request */
#define SRC_HSM0	(*( SRC_AGBT_type *) 0xf0038cc0u)	/* HSM Service Request 0 */
#define SRC_HSM1	(*( SRC_AGBT_type *) 0xf0038cc4u)	/* HSM Service Request 1 */
#define SRC_HSSLCOK0	(*( SRC_AGBT_type *) 0xf00382a0u)	/* Channel 0 OK Service Request m */
#define SRC_HSSLCOK1	(*( SRC_AGBT_type *) 0xf00382b0u)	/* Channel 1 OK Service Request m */
#define SRC_HSSLCOK2	(*( SRC_AGBT_type *) 0xf00382c0u)	/* Channel 2 OK Service Request m */
#define SRC_HSSLCOK3	(*( SRC_AGBT_type *) 0xf00382d0u)	/* Channel 3 OK Service Request m */
#define SRC_HSSLERR0	(*( SRC_AGBT_type *) 0xf00382a8u)	/* Channel 0 Error ServiceRequest m */
#define SRC_HSSLERR1	(*( SRC_AGBT_type *) 0xf00382b8u)	/* Channel 1 Error ServiceRequest m */
#define SRC_HSSLERR2	(*( SRC_AGBT_type *) 0xf00382c8u)	/* Channel 2 Error ServiceRequest m */
#define SRC_HSSLERR3	(*( SRC_AGBT_type *) 0xf00382d8u)	/* Channel 3 Error ServiceRequest m */
#define SRC_HSSLEXI	(*( SRC_AGBT_type *) 0xf00382e0u)	/* Exception Service Request */
#define SRC_HSSLRDI0	(*( SRC_AGBT_type *) 0xf00382a4u)	/* Channel 0 Read Data Service Request m */
#define SRC_HSSLRDI1	(*( SRC_AGBT_type *) 0xf00382b4u)	/* Channel 1 Read Data Service Request m */
#define SRC_HSSLRDI2	(*( SRC_AGBT_type *) 0xf00382c4u)	/* Channel 2 Read Data Service Request m */
#define SRC_HSSLRDI3	(*( SRC_AGBT_type *) 0xf00382d4u)	/* Channel 3 Read Data Service Request m */
#define SRC_HSSLTRG0	(*( SRC_AGBT_type *) 0xf00382acu)	/* Channel 0 Trigger Service Request m */
#define SRC_HSSLTRG1	(*( SRC_AGBT_type *) 0xf00382bcu)	/* Channel 1 Trigger Service Request m */
#define SRC_HSSLTRG2	(*( SRC_AGBT_type *) 0xf00382ccu)	/* Channel 2 Trigger Service Request m */
#define SRC_HSSLTRG3	(*( SRC_AGBT_type *) 0xf00382dcu)	/* Channel 3 Trigger Service Request m */
#define SRC_I2C0BREQ	(*( SRC_AGBT_type *) 0xf0038300u)	/* I2C 0 Burst Data Transfer Request */
#define SRC_I2C0ERR	(*( SRC_AGBT_type *) 0xf0038310u)	/* I2C 0 Error Service Request */
#define SRC_I2C0LBREQ	(*( SRC_AGBT_type *) 0xf0038304u)	/* I2C 0 Last Burst Data Transfer Service Request */
#define SRC_I2C0LSREQ	(*( SRC_AGBT_type *) 0xf003830cu)	/* I2C 0 Last Single Data Transfer Service Request */
#define SRC_I2C0P	(*( SRC_AGBT_type *) 0xf0038314u)	/* I2C 0 Kernel Service Request */
#define SRC_I2C0SREQ	(*( SRC_AGBT_type *) 0xf0038308u)	/* I2C 0 Single Data Transfer Service Request */
#define SRC_LMU	(*( SRC_AGBT_type *) 0xf0038de0u)	/* LMU Service Request */
#define SRC_MSC0SR0	(*( SRC_AGBT_type *) 0xf00383e0u)	/* MSC 0 Service Request 0 */
#define SRC_MSC0SR1	(*( SRC_AGBT_type *) 0xf00383e4u)	/* MSC 0 Service Request 1 */
#define SRC_MSC0SR2	(*( SRC_AGBT_type *) 0xf00383e8u)	/* MSC 0 Service Request 2 */
#define SRC_MSC0SR3	(*( SRC_AGBT_type *) 0xf00383ecu)	/* MSC 0 Service Request 3 */
#define SRC_MSC1SR0	(*( SRC_AGBT_type *) 0xf00383f0u)	/* MSC 1 Service Request 0 */
#define SRC_MSC1SR1	(*( SRC_AGBT_type *) 0xf00383f4u)	/* MSC 1 Service Request 1 */
#define SRC_MSC1SR2	(*( SRC_AGBT_type *) 0xf00383f8u)	/* MSC 1 Service Request 2 */
#define SRC_MSC1SR3	(*( SRC_AGBT_type *) 0xf00383fcu)	/* MSC 1 Service Request 3 */
#define SRC_PMU00	(*( SRC_AGBT_type *) 0xf0038c30u)	/* PMU 0 Service Request 0 */
#define SRC_PMU01	(*( SRC_AGBT_type *) 0xf0038c34u)	/* PMU 0 Service Request 1 */
#define SRC_PSI50	(*( SRC_AGBT_type *) 0xf0038d30u)	/* PSI5 Service Request 0 */
#define SRC_PSI51	(*( SRC_AGBT_type *) 0xf0038d34u)	/* PSI5 Service Request 1 */
#define SRC_PSI52	(*( SRC_AGBT_type *) 0xf0038d38u)	/* PSI5 Service Request 2 */
#define SRC_PSI53	(*( SRC_AGBT_type *) 0xf0038d3cu)	/* PSI5 Service Request 3 */
#define SRC_PSI54	(*( SRC_AGBT_type *) 0xf0038d40u)	/* PSI5 Service Request 4 */
#define SRC_PSI55	(*( SRC_AGBT_type *) 0xf0038d44u)	/* PSI5 Service Request 5 */
#define SRC_PSI56	(*( SRC_AGBT_type *) 0xf0038d48u)	/* PSI5 Service Request 6 */
#define SRC_PSI57	(*( SRC_AGBT_type *) 0xf0038d4cu)	/* PSI5 Service Request 7 */
#define SRC_QSPI0ERR	(*( SRC_AGBT_type *) 0xf0038198u)	/* QSPI 0 Error Service Request */
#define SRC_QSPI0HC	(*( SRC_AGBT_type *) 0xf00381a0u)	/* QSPI 0 Half Cycle Service Request */
#define SRC_QSPI0PT	(*( SRC_AGBT_type *) 0xf003819cu)	/* QSPI 0 Phase Transition Service Request */
#define SRC_QSPI0RX	(*( SRC_AGBT_type *) 0xf0038194u)	/* QSPI 0 Receive Service Request */
#define SRC_QSPI0TX	(*( SRC_AGBT_type *) 0xf0038190u)	/* QSPI 0 Transmit Service Request */
#define SRC_QSPI0U	(*( SRC_AGBT_type *) 0xf00381a4u)	/* QSPI 0 User Defined Service Request */
#define SRC_QSPI1ERR	(*( SRC_AGBT_type *) 0xf00381b0u)	/* QSPI 1 Error Service Request */
#define SRC_QSPI1HC	(*( SRC_AGBT_type *) 0xf00381b8u)	/* QSPI 1 Half Cycle Service Request */
#define SRC_QSPI1PT	(*( SRC_AGBT_type *) 0xf00381b4u)	/* QSPI 1 Phase Transition Service Request */
#define SRC_QSPI1RX	(*( SRC_AGBT_type *) 0xf00381acu)	/* QSPI 1 Receive Service Request */
#define SRC_QSPI1TX	(*( SRC_AGBT_type *) 0xf00381a8u)	/* QSPI 1 Transmit Service Request */
#define SRC_QSPI1U	(*( SRC_AGBT_type *) 0xf00381bcu)	/* QSPI 1 User Defined Service Request */
#define SRC_QSPI2ERR	(*( SRC_AGBT_type *) 0xf00381c8u)	/* QSPI 2 Error Service Request */
#define SRC_QSPI2HC	(*( SRC_AGBT_type *) 0xf00381d0u)	/* QSPI 2 Half Cycle Service Request */
#define SRC_QSPI2PT	(*( SRC_AGBT_type *) 0xf00381ccu)	/* QSPI 2 Phase Transition Service Request */
#define SRC_QSPI2RX	(*( SRC_AGBT_type *) 0xf00381c4u)	/* QSPI 2 Receive Service Request */
#define SRC_QSPI2TX	(*( SRC_AGBT_type *) 0xf00381c0u)	/* QSPI 2 Transmit Service Request */
#define SRC_QSPI2U	(*( SRC_AGBT_type *) 0xf00381d4u)	/* QSPI 2 User Defined Service Request */
#define SRC_QSPI3ERR	(*( SRC_AGBT_type *) 0xf00381e0u)	/* QSPI 3 Error Service Request */
#define SRC_QSPI3HC	(*( SRC_AGBT_type *) 0xf00381e8u)	/* QSPI 3 Half Cycle Service Request */
#define SRC_QSPI3PT	(*( SRC_AGBT_type *) 0xf00381e4u)	/* QSPI 3 Phase Transition Service Request */
#define SRC_QSPI3RX	(*( SRC_AGBT_type *) 0xf00381dcu)	/* QSPI 3 Receive Service Request */
#define SRC_QSPI3TX	(*( SRC_AGBT_type *) 0xf00381d8u)	/* QSPI 3 Transmit Service Request */
#define SRC_QSPI3U	(*( SRC_AGBT_type *) 0xf00381ecu)	/* QSPI 3 User Defined Service Request */
#define SRC_QSPI4ERR	(*( SRC_AGBT_type *) 0xf00381f8u)	/* QSPI 4 Error Service Request */
#define SRC_QSPI4HC	(*( SRC_AGBT_type *) 0xf0038200u)	/* QSPI 4 Half Cycle Service Request */
#define SRC_QSPI4PT	(*( SRC_AGBT_type *) 0xf00381fcu)	/* QSPI 4 Phase Transition Service Request */
#define SRC_QSPI4RX	(*( SRC_AGBT_type *) 0xf00381f4u)	/* QSPI 4 Receive Service Request */
#define SRC_QSPI4TX	(*( SRC_AGBT_type *) 0xf00381f0u)	/* QSPI 4 Transmit Service Request */
#define SRC_QSPI4U	(*( SRC_AGBT_type *) 0xf0038204u)	/* QSPI 4 User Defined Service Request */
#define SRC_SCUDTS	(*( SRC_AGBT_type *) 0xf0038cd0u)	/* SCU DTS Busy Service Request */
#define SRC_SCUERU0	(*( SRC_AGBT_type *) 0xf0038cd4u)	/* SCU ERU Service Request 0 */
#define SRC_SCUERU1	(*( SRC_AGBT_type *) 0xf0038cd8u)	/* SCU ERU Service Request 1 */
#define SRC_SCUERU2	(*( SRC_AGBT_type *) 0xf0038cdcu)	/* SCU ERU Service Request 2 */
#define SRC_SCUERU3	(*( SRC_AGBT_type *) 0xf0038ce0u)	/* SCU ERU Service Request 3 */
#define SRC_SDMAME0	(*( SRC_AGBT_type *) 0xf00384d0u)	/* SDMA Move Engine 0 Service Request */
#define SRC_SDMAME0CH0	(*( SRC_AGBT_type *) 0xf00384f0u)	/* SDMA Move Engine 0 Channel 0 Service Request */
#define SRC_SDMAME0CH1	(*( SRC_AGBT_type *) 0xf00384f4u)	/* SDMA Move Engine 0 Channel 1 Service Request */
#define SRC_SDMAME0CH2	(*( SRC_AGBT_type *) 0xf00384f8u)	/* SDMA Move Engine 0 Channel 2 Service Request */
#define SRC_SDMAME0CH3	(*( SRC_AGBT_type *) 0xf00384fcu)	/* SDMA Move Engine 0 Channel 3 Service Request */
#define SRC_SDMAME0CH4	(*( SRC_AGBT_type *) 0xf0038500u)	/* SDMA Move Engine 0 Channel 4 Service Request */
#define SRC_SDMAME0CH5	(*( SRC_AGBT_type *) 0xf0038504u)	/* SDMA Move Engine 0 Channel 5 Service Request */
#define SRC_SDMAME0CH6	(*( SRC_AGBT_type *) 0xf0038508u)	/* SDMA Move Engine 0 Channel 6 Service Request */
#define SRC_SDMAME0CH7	(*( SRC_AGBT_type *) 0xf003850cu)	/* SDMA Move Engine 0 Channel 7 Service Request */
#define SRC_SDMAME1	(*( SRC_AGBT_type *) 0xf00384d4u)	/* SDMA Move Engine 1 Service Request */
#define SRC_SDMAME1CH0	(*( SRC_AGBT_type *) 0xf00385f0u)	/* SDMA Move Engine 1 Channel 0 Service Request */
#define SRC_SDMAME1CH1	(*( SRC_AGBT_type *) 0xf00385f4u)	/* SDMA Move Engine 1 Channel 1 Service Request */
#define SRC_SDMAME1CH2	(*( SRC_AGBT_type *) 0xf00385f8u)	/* SDMA Move Engine 1 Channel 2 Service Request */
#define SRC_SDMAME1CH3	(*( SRC_AGBT_type *) 0xf00385fcu)	/* SDMA Move Engine 1 Channel 3 Service Request */
#define SRC_SDMAME1CH4	(*( SRC_AGBT_type *) 0xf0038600u)	/* SDMA Move Engine 1 Channel 4 Service Request */
#define SRC_SDMAME1CH5	(*( SRC_AGBT_type *) 0xf0038604u)	/* SDMA Move Engine 1 Channel 5 Service Request */
#define SRC_SDMAME1CH6	(*( SRC_AGBT_type *) 0xf0038608u)	/* SDMA Move Engine 1 Channel 6 Service Request */
#define SRC_SDMAME1CH7	(*( SRC_AGBT_type *) 0xf003860cu)	/* SDMA Move Engine 1 Channel 7 Service Request */
#define SRC_SENT0	(*( SRC_AGBT_type *) 0xf0038350u)	/* SENT TRIG0 Service Request */
#define SRC_SENT1	(*( SRC_AGBT_type *) 0xf0038354u)	/* SENT TRIG1 Service Request */
#define SRC_SENT2	(*( SRC_AGBT_type *) 0xf0038358u)	/* SENT TRIG2 Service Request */
#define SRC_SENT3	(*( SRC_AGBT_type *) 0xf003835cu)	/* SENT TRIG3 Service Request */
#define SRC_SENT4	(*( SRC_AGBT_type *) 0xf0038360u)	/* SENT TRIG4 Service Request */
#define SRC_SENT5	(*( SRC_AGBT_type *) 0xf0038364u)	/* SENT TRIG5 Service Request */
#define SRC_SENT6	(*( SRC_AGBT_type *) 0xf0038368u)	/* SENT TRIG6 Service Request */
#define SRC_SENT7	(*( SRC_AGBT_type *) 0xf003836cu)	/* SENT TRIG7 Service Request */
#define SRC_SENT8	(*( SRC_AGBT_type *) 0xf0038370u)	/* SENT TRIG8 Service Request */
#define SRC_SENT9	(*( SRC_AGBT_type *) 0xf0038374u)	/* SENT TRIG9 Service Request */
#define SRC_SMU0	(*( SRC_AGBT_type *) 0xf0038d10u)	/* SMU Service Request 0 */
#define SRC_SMU1	(*( SRC_AGBT_type *) 0xf0038d14u)	/* SMU Service Request 1 */
#define SRC_SMU2	(*( SRC_AGBT_type *) 0xf0038d18u)	/* SMU Service Request 2 */
#define SRC_STM0SR0	(*( SRC_AGBT_type *) 0xf0038490u)	/* System Timer 0 Service Request 0 */
#define SRC_STM0SR1	(*( SRC_AGBT_type *) 0xf0038494u)	/* System Timer 0 Service Request 1 */
#define SRC_STM1SR0	(*( SRC_AGBT_type *) 0xf0038498u)	/* System Timer 1 Service Request 0 */
#define SRC_STM1SR1	(*( SRC_AGBT_type *) 0xf003849cu)	/* System Timer 1 Service Request 1 */
#define SRC_STM2SR0	(*( SRC_AGBT_type *) 0xf00384a0u)	/* System Timer 2 Service Request 0 */
#define SRC_STM2SR1	(*( SRC_AGBT_type *) 0xf00384a4u)	/* System Timer 2 Service Request 1 */
#define SRC_VADCCG0SR0	(*( SRC_AGBT_type *) 0xf0038aa0u)	/* VADC Common Group 0 Service Request 0 */
#define SRC_VADCCG0SR1	(*( SRC_AGBT_type *) 0xf0038aa4u)	/* VADC Common Group 0 Service Request 1 */
#define SRC_VADCCG0SR2	(*( SRC_AGBT_type *) 0xf0038aa8u)	/* VADC Common Group 0 Service Request 2 */
#define SRC_VADCCG0SR3	(*( SRC_AGBT_type *) 0xf0038aacu)	/* VADC Common Group 0 Service Request 3 */
#define SRC_VADCCG1SR0	(*( SRC_AGBT_type *) 0xf0038ab0u)	/* VADC Common Group 1 Service Request 0 */
#define SRC_VADCCG1SR1	(*( SRC_AGBT_type *) 0xf0038ab4u)	/* VADC Common Group 1 Service Request 1 */
#define SRC_VADCCG1SR2	(*( SRC_AGBT_type *) 0xf0038ab8u)	/* VADC Common Group 1 Service Request 2 */
#define SRC_VADCCG1SR3	(*( SRC_AGBT_type *) 0xf0038abcu)	/* VADC Common Group 1 Service Request 3 */
#define SRC_VADCG0SR0	(*( SRC_AGBT_type *) 0xf0038980u)	/* VADC Group 0 Service Request 0 */
#define SRC_VADCG0SR1	(*( SRC_AGBT_type *) 0xf0038984u)	/* VADC Group 0 Service Request 1 */
#define SRC_VADCG0SR2	(*( SRC_AGBT_type *) 0xf0038988u)	/* VADC Group 0 Service Request 2 */
#define SRC_VADCG0SR3	(*( SRC_AGBT_type *) 0xf003898cu)	/* VADC Group 0 Service Request 3 */
#define SRC_VADCG1SR0	(*( SRC_AGBT_type *) 0xf0038990u)	/* VADC Group 1 Service Request 0 */
#define SRC_VADCG1SR1	(*( SRC_AGBT_type *) 0xf0038994u)	/* VADC Group 1 Service Request 1 */
#define SRC_VADCG1SR2	(*( SRC_AGBT_type *) 0xf0038998u)	/* VADC Group 1 Service Request 2 */
#define SRC_VADCG1SR3	(*( SRC_AGBT_type *) 0xf003899cu)	/* VADC Group 1 Service Request 3 */
#define SRC_VADCG2SR0	(*( SRC_AGBT_type *) 0xf00389a0u)	/* VADC Group 2 Service Request 0 */
#define SRC_VADCG2SR1	(*( SRC_AGBT_type *) 0xf00389a4u)	/* VADC Group 2 Service Request 1 */
#define SRC_VADCG2SR2	(*( SRC_AGBT_type *) 0xf00389a8u)	/* VADC Group 2 Service Request 2 */
#define SRC_VADCG2SR3	(*( SRC_AGBT_type *) 0xf00389acu)	/* VADC Group 2 Service Request 3 */
#define SRC_VADCG3SR0	(*( SRC_AGBT_type *) 0xf00389b0u)	/* VADC Group 3 Service Request 0 */
#define SRC_VADCG3SR1	(*( SRC_AGBT_type *) 0xf00389b4u)	/* VADC Group 3 Service Request 1 */
#define SRC_VADCG3SR2	(*( SRC_AGBT_type *) 0xf00389b8u)	/* VADC Group 3 Service Request 2 */
#define SRC_VADCG3SR3	(*( SRC_AGBT_type *) 0xf00389bcu)	/* VADC Group 3 Service Request 3 */
#define SRC_VADCG4SR0	(*( SRC_AGBT_type *) 0xf00389c0u)	/* VADC Group 4 Service Request 0 */
#define SRC_VADCG4SR1	(*( SRC_AGBT_type *) 0xf00389c4u)	/* VADC Group 4 Service Request 1 */
#define SRC_VADCG4SR2	(*( SRC_AGBT_type *) 0xf00389c8u)	/* VADC Group 4 Service Request 2 */
#define SRC_VADCG4SR3	(*( SRC_AGBT_type *) 0xf00389ccu)	/* VADC Group 4 Service Request 3 */
#define SRC_VADCG5SR0	(*( SRC_AGBT_type *) 0xf00389d0u)	/* VADC Group 5 Service Request 0 */
#define SRC_VADCG5SR1	(*( SRC_AGBT_type *) 0xf00389d4u)	/* VADC Group 5 Service Request 1 */
#define SRC_VADCG5SR2	(*( SRC_AGBT_type *) 0xf00389d8u)	/* VADC Group 5 Service Request 2 */
#define SRC_VADCG5SR3	(*( SRC_AGBT_type *) 0xf00389dcu)	/* VADC Group 5 Service Request 3 */
