svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SRC_VADCG6SR0	(*( SRC_AGBT_type *) 0xf00389e0u)	/* VADC Group 6 Service Request 0 */
#define SRC_VADCG6SR1	(*( SRC_AGBT_type *) 0xf00389e4u)	/* VADC Group 6 Service Request 1 */
#define SRC_VADCG6SR2	(*( SRC_AGBT_type *) 0xf00389e8u)	/* VADC Group 6 Service Request 2 */
#define SRC_VADCG6SR3	(*( SRC_AGBT_type *) 0xf00389ecu)	/* VADC Group 6 Service Request 3 */
#define SRC_VADCG7SR0	(*( SRC_AGBT_type *) 0xf00389f0u)	/* VADC Group 7 Service Request 0 */
#define SRC_VADCG7SR1	(*( SRC_AGBT_type *) 0xf00389f4u)	/* VADC Group 7 Service Request 1 */
#define SRC_VADCG7SR2	(*( SRC_AGBT_type *) 0xf00389f8u)	/* VADC Group 7 Service Request 2 */
#define SRC_VADCG7SR3	(*( SRC_AGBT_type *) 0xf00389fcu)	/* VADC Group 7 Service Request 3 */
#define SRC_XBARSRC	(*( SRC_AGBT_type *) 0xf0038048u)	/* XBAR_SRI Service Request */


/* GPT12 */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} GPT120_ACCEN0_type;
#define GPT120_ACCEN0	(*( GPT120_ACCEN0_type *) 0xf0002efcu)	/* Access Enable Register 0 */
#define GPT121_ACCEN0	(*( GPT120_ACCEN0_type *) 0xf0002ffcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GPT120_ACCEN1_type;
#define GPT120_ACCEN1	(*( GPT120_ACCEN1_type *) 0xf0002ef8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CAPREL         : 16;	/* Current reload value or Captured value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_CAPREL_type;
#define GPT120_CAPREL	(*( GPT120_CAPREL_type *) 0xf0002e30u)	/* Capture and Reload Register */
#define GPT121_CAPREL	(*( GPT120_CAPREL_type *) 0xf0002f30u)	/* Capture and Reload Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} GPT120_CLC_type;
#define GPT120_CLC	(*( GPT120_CLC_type *) 0xf0002e00u)	/* Clock Control Register */
#define GPT121_CLC	(*( GPT120_CLC_type *) 0xf0002f00u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} GPT120_ID_type;
#define GPT120_ID	(*( GPT120_ID_type *) 0xf0002e08u)	/* Identification Register */
#define GPT121_ID	(*( GPT120_ID_type *) 0xf0002f08u)	/* Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} GPT120_KRST0_type;
#define GPT120_KRST0	(*( GPT120_KRST0_type *) 0xf0002ef4u)	/* Kernel Reset Register 0 */
#define GPT121_KRST0	(*( GPT120_KRST0_type *) 0xf0002ff4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} GPT120_KRST1_type;
#define GPT120_KRST1	(*( GPT120_KRST1_type *) 0xf0002ef0u)	/* Kernel Reset Register 1 */
#define GPT121_KRST1	(*( GPT120_KRST1_type *) 0xf0002ff0u)	/* Kernel Reset Register 1 */

