svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} GPT120_KRSTCLR_type;
#define GPT120_KRSTCLR	(*( GPT120_KRSTCLR_type *) 0xf0002eecu)	/* Kernel Reset Status Clear Register */
#define GPT121_KRSTCLR	(*( GPT120_KRSTCLR_type *) 0xf0002fecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} GPT120_OCS_type;
#define GPT120_OCS	(*( GPT120_OCS_type *) 0xf0002ee8u)	/* OCDS Control and Status Register */
#define GPT121_OCS	(*( GPT120_OCS_type *) 0xf0002fe8u)	/* OCDS Control and Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IST2IN         : 1;	/* Input Select for T2IN */
		unsigned int IST2EUD        : 1;	/* Input Select for T2EUD */
		unsigned int IST3IN         : 2;	/* Input Select for T3IN */
		unsigned int IST3EUD        : 2;	/* Input Select for T3EUD */
		unsigned int IST4IN         : 2;	/* Input Select for T4IN */
		unsigned int IST4EUD        : 2;	/* Input Select for T4EUD */
		unsigned int IST5IN         : 1;	/* Input Select for T5IN */
		unsigned int IST5EUD        : 1;	/* Input Select for T5EUD */
		unsigned int IST6IN         : 1;	/* Input Select for T6IN */
		unsigned int IST6EUD        : 1;	/* Input Select for T6EUD */
		unsigned int ISCAPIN        : 2;	/* Input Select for CAPIN */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_PISEL_type;
#define GPT120_PISEL	(*( GPT120_PISEL_type *) 0xf0002e04u)	/* Port Input Select Register */
#define GPT121_PISEL	(*( GPT120_PISEL_type *) 0xf0002f04u)	/* Port Input Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T2             : 16;	/* Timer T2 */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T2_type;
#define GPT120_T2	(*( GPT120_T2_type *) 0xf0002e34u)	/* Timer T2 Register */
#define GPT121_T2	(*( GPT120_T2_type *) 0xf0002f34u)	/* Timer T2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T2I            : 3;	/* Timer T2 Input Parameter Selection */
		unsigned int T2M            : 3;	/* Timer T2 Mode Control (Basic Operating Mode) */
		unsigned int T2R            : 1;	/* Timer T2 Run Bit */
		unsigned int T2UD           : 1;	/* Timer T2 Up/Down ControlSee for encoding of bits T2UD and T2UDE. */
		unsigned int T2UDE          : 1;	/* Timer T2 External Up/Down Enable */
		unsigned int T2RC           : 1;	/* Timer T2 Remote Control */
		unsigned int                : 2;
		unsigned int T2IRDIS        : 1;	/* Timer T2 Interrupt Disable */
		unsigned int T2EDGE         : 1;	/* Timer T2 Edge Detection */
		unsigned int T2CHDIR        : 1;	/* Timer T2 Count Direction Change */
		/* const */ unsigned int T2RDIR         : 1;	/* Timer T2 Rotation Direction */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T2CON_type;
#define GPT120_T2CON	(*( GPT120_T2CON_type *) 0xf0002e10u)	/* Timer T2 Control Register */
#define GPT121_T2CON	(*( GPT120_T2CON_type *) 0xf0002f10u)	/* Timer T2 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T3             : 16;	/* Timer T3 */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T3_type;
#define GPT120_T3	(*( GPT120_T3_type *) 0xf0002e38u)	/* Timer T3 Register */
#define GPT121_T3	(*( GPT120_T3_type *) 0xf0002f38u)	/* Timer T3 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T3I            : 3;	/* Timer T3 Input Parameter Selection */
		unsigned int T3M            : 3;	/* Timer T3 Mode Control */
		unsigned int T3R            : 1;	/* Timer T3 Run Bit */
		unsigned int T3UD           : 1;	/* Timer T3 Up/Down Control */
		unsigned int T3UDE          : 1;	/* Timer T3 External Up/Down EnableSee for encoding of bits T3UD and T3UDE. */
		unsigned int T3OE           : 1;	/* Overflow/Underflow Output Enable */
		unsigned int T3OTL          : 1;	/* Timer T3 Overflow Toggle Latch */
		unsigned int BPS1           : 2;	/* GPT1 Block Prescaler Control */
		unsigned int T3EDGE         : 1;	/* Timer T3 Edge Detection Flag */
		unsigned int T3CHDIR        : 1;	/* Timer T3 Count Direction Change Flag */
		/* const */ unsigned int T3RDIR         : 1;	/* Timer T3 Rotation Direction Flag */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T3CON_type;
#define GPT120_T3CON	(*( GPT120_T3CON_type *) 0xf0002e14u)	/* Timer T3 Control Register */
#define GPT121_T3CON	(*( GPT120_T3CON_type *) 0xf0002f14u)	/* Timer T3 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T4             : 16;	/* Timer T4 */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T4_type;
#define GPT120_T4	(*( GPT120_T4_type *) 0xf0002e3cu)	/* Timer T4 Register */
#define GPT121_T4	(*( GPT120_T4_type *) 0xf0002f3cu)	/* Timer T4 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T4I            : 3;	/* Timer T4 Input Parameter Selection */
		unsigned int T4M            : 3;	/* Timer T4 Mode Control (Basic Operating Mode) */
		unsigned int T4R            : 1;	/* Timer T4 Run Bit */
		unsigned int T4UD           : 1;	/* Timer T4 Up/Down ControlSee for encoding of bits T4UD and T4UDE. */
		unsigned int T4UDE          : 1;	/* Timer T4 External Up/Down Enable */
		unsigned int T4RC           : 1;	/* Timer T4 Remote Control */
		unsigned int CLRT2EN        : 1;	/* Clear Timer T2 Enable */
		unsigned int CLRT3EN        : 1;	/* Clear Timer T3 Enable */
		unsigned int T4IRDIS        : 1;	/* Timer T4 Interrupt Disable */
		unsigned int T4EDGE         : 1;	/* Timer T4 Edge Detection */
		unsigned int T4CHDIR        : 1;	/* Timer T4 Count Direction Change */
		/* const */ unsigned int T4RDIR         : 1;	/* Timer T4 Rotation Direction */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T4CON_type;
#define GPT120_T4CON	(*( GPT120_T4CON_type *) 0xf0002e18u)	/* Timer T4 Control Register */
#define GPT121_T4CON	(*( GPT120_T4CON_type *) 0xf0002f18u)	/* Timer T4 Control Register */

