svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int T5             : 16;	/* Timer T5 */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T5_type;
#define GPT120_T5	(*( GPT120_T5_type *) 0xf0002e40u)	/* Timer T5 Register */
#define GPT121_T5	(*( GPT120_T5_type *) 0xf0002f40u)	/* Timer T5 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T5I            : 3;	/* Timer T5 Input Parameter Selection */
		unsigned int T5M            : 3;	/* Timer T5 Mode Control (Basic Operating Mode) */
		unsigned int T5R            : 1;	/* Timer T5 Run Bit */
		unsigned int T5UD           : 1;	/* Timer T5 Up/Down Control */
		unsigned int T5UDE          : 1;	/* Timer T5 External Up/Down EnableSee for encoding of bits T5UD and T5UDE. */
		unsigned int T5RC           : 1;	/* Timer T5 Remote Control */
		unsigned int CT3            : 1;	/* Timer T3 Capture Trigger Enable */
		unsigned int T5CC           : 1;	/* Timer T5 Capture Correction */
		unsigned int CI             : 2;	/* Register CAPREL Capture Trigger SelectionTo define the respective trigger source signal, also bit CT3 must be regarded (see ). */
		unsigned int T5CLR          : 1;	/* Timer T5 Clear Enable Bit */
		unsigned int T5SC           : 1;	/* Timer T5 Capture Mode Enable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T5CON_type;
#define GPT120_T5CON	(*( GPT120_T5CON_type *) 0xf0002e1cu)	/* Timer T5 Control Register */
#define GPT121_T5CON	(*( GPT120_T5CON_type *) 0xf0002f1cu)	/* Timer T5 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T6             : 16;	/* Timer T6 */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T6_type;
#define GPT120_T6	(*( GPT120_T6_type *) 0xf0002e44u)	/* Timer T6 Register */
#define GPT121_T6	(*( GPT120_T6_type *) 0xf0002f44u)	/* Timer T6 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T6I            : 3;	/* Timer T6 Input Parameter Selection */
		unsigned int T6M            : 3;	/* Timer T6 Mode Control (Basic Operating Mode) */
		unsigned int T6R            : 1;	/* Timer T6 Run Bit */
		unsigned int T6UD           : 1;	/* Timer T6 Up/Down ControlSee for coding of bits T6UD and T6UDE */
		unsigned int T6UDE          : 1;	/* Timer T6 External Up/Down Enable */
		unsigned int T6OE           : 1;	/* Overflow/Underflow Output Enable */
		unsigned int T6OTL          : 1;	/* Timer T6 Overflow Toggle Latch */
		unsigned int BPS2           : 2;	/* GPT2 Block Prescaler Control */
		unsigned int                : 1;
		unsigned int T6CLR          : 1;	/* Timer T6 Clear Enable Bit */
		unsigned int T6SR           : 1;	/* Timer T6 Reload Mode Enable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} GPT120_T6CON_type;
#define GPT120_T6CON	(*( GPT120_T6CON_type *) 0xf0002e20u)	/* Timer T6 Control Register */
#define GPT121_T6CON	(*( GPT120_T6CON_type *) 0xf0002f20u)	/* Timer T6 Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GPT121_ACCEN1_type;
#define GPT121_ACCEN1	(*( GPT121_ACCEN1_type *) 0xf0002ff8u)	/* Access Enable Register 1 */


/* CIF */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access E0able for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access E1able for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access E2able for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access E3able for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access E4able for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access E5able for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access E6able for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access E7able for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access E8able for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access E9able for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access E10able for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access E11able for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access E12able for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access E13able for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access E14able for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access E15able for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access E16able for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access E17able for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access E18able for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access E19able for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access E20able for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access E21able for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access E22able for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access E23able for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access E24able for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access E25able for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access E26able for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access E27able for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access E28able for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access E29able for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access E30able for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access E31able for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} CIF_BBB_ACCEN0_type;
#define CIF_BBB_ACCEN0	(*( CIF_BBB_ACCEN0_type *) 0xf00e1f0cu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CIF_BBB_ACCEN1_type;
#define CIF_BBB_ACCEN1	(*( CIF_BBB_ACCEN1_type *) 0xf00e1f10u)	/* Access Enable Register 1 */

