svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CIF_BBB_CLC_type;
#define CIF_BBB_CLC	(*( CIF_BBB_CLC_type *) 0xf00e1f00u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CIF_BBB_GPCTL_type;
#define CIF_BBB_GPCTL	(*( CIF_BBB_GPCTL_type *) 0xf00e1f08u)	/* General Purpose Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CIF_BBB_KRST0_type;
#define CIF_BBB_KRST0	(*( CIF_BBB_KRST0_type *) 0xf00e1f14u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_BBB_KRST1_type;
#define CIF_BBB_KRST1	(*( CIF_BBB_KRST1_type *) 0xf00e1f18u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_BBB_KRSTCLR_type;
#define CIF_BBB_KRSTCLR	(*( CIF_BBB_KRSTCLR_type *) 0xf00e1f1cu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} CIF_BBB_MODID_type;
#define CIF_BBB_MODID	(*( CIF_BBB_MODID_type *) 0xf00e1f04u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		/* const */ unsigned int cif_ccldiss    : 1;	/* Status of cif_ccl[2] bit */
		unsigned int cif_cclfdis    : 1;	/* Clock Control Logic disable */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_CCL_type;
#define CIF_CCL	(*( CIF_CCL_type *) 0xf00e2000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int cif_mp_mux     : 2;	/* Data path selector for main path */
		unsigned int cif_chan_mode  : 2;	/* Y/C splitter channel mode */
		unsigned int                : 4;
		unsigned int if_select      : 2;	/* Selects input interface */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} CIF_DPCL_type;
#define CIF_DPCL	(*( CIF_DPCL_type *) 0xf00e2018u)	/* CIF Data Path Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int dp_en          : 1;	/* Debug Path Enable */
		unsigned int dp_sel         : 3;	/* Select Source Path which will be transfered over the Debug Interface */
		unsigned int                : 4;
		unsigned int rst_fnc        : 1;	/* Reset Frame Number Counter */
		unsigned int rst_lnc        : 1;	/* Reset Line Number Counter */
		unsigned int rst_tsc        : 1;	/* Reset Timestamp Counter */
		unsigned int rst_pd         : 1;	/* Reset Predivider Counter */
		unsigned int                : 1;
		unsigned int fnc_en         : 1;	/* Enable/disable Frame Number Counter */
		unsigned int lnc_en         : 1;	/* Enable/disable Line Number Counter */
		unsigned int tsc_en         : 1;	/* Enable/disable Timestamp Counter */
		unsigned int uds1           : 1;	/* Enable/disable sending of User Defined Symbol 1 */
		unsigned int uds2           : 1;	/* Enable/disable sending of User Defined Symbol 2 */
		unsigned int uds3           : 1;	/* Enable/disable sending of User Defined Symbol 3 */
		unsigned int uds4           : 1;	/* Enable/disable sending of User Defined Symbol 4 */
		unsigned int uds5           : 1;	/* Enable/disable sending of User Defined Symbol 5 */
		unsigned int uds6           : 1;	/* Enable/disable sending of User Defined Symbol 6 */
		unsigned int uds7           : 1;	/* Enable/disable sending of User Defined Symbol 7 */
		unsigned int uds8           : 1;	/* Enable/disable sending of User Defined Symbol 8 */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_DP_CTRL_type;
#define CIF_DP_CTRL	(*( CIF_DP_CTRL_type *) 0xf00e4700u)	/* Debug Path Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fnc_val        : 15;	/* Returns the current value of the Frame Number Counter */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int lnc_val        : 15;	/* Returns the current value of the Line Number Counter */
		/* const */ unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} CIF_DP_FLC_STAT_type;
#define CIF_DP_FLC_STAT	(*( CIF_DP_FLC_STAT_type *) 0xf00e4708u)	/* Debug Path Frame/Line Counter Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int pdiv_val       : 32;	/* If the Debug Path and the Timestamp Counter are enabled, the timestamp counter will be increased with every pdiv_val+1 CIF module clock cycle. */
	} B;
	int I;
	unsigned int U;

} CIF_DP_PDIV_CTRL_type;
#define CIF_DP_PDIV_CTRL	(*( CIF_DP_PDIV_CTRL_type *) 0xf00e4704u)	/* Debug Path Predivider Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int pdiv_val       : 32;	/* Returns the current value of the Predivider Counter. */
	} B;
	int I;
	unsigned int U;

} CIF_DP_PDIV_STAT_type;
#define CIF_DP_PDIV_STAT	(*( CIF_DP_PDIV_STAT_type *) 0xf00e470cu)	/* Debug Path Predivider Counter Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int tsc_val        : 30;	/* Returns the current value of the Timestamp Counter. */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} CIF_DP_TSC_STAT_type;
