svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CIF_DP_TSC_STAT	(*( CIF_DP_TSC_STAT_type *) 0xf00e4710u)	/* Debug Path Timestamp Counter Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int UDS            : 15;	/* User Defined Symbol which may be inserted into debug stream */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} CIF_DP_UDS_1_type;
#define CIF_DP_UDS_1	(*( CIF_DP_UDS_1_type *) 0xf00e4714u)	/* Debug Path User Defined Symbol 1 Register */
#define CIF_DP_UDS_2	(*( CIF_DP_UDS_1_type *) 0xf00e4718u)	/* Debug Path User Defined Symbol 2 Register */
#define CIF_DP_UDS_3	(*( CIF_DP_UDS_1_type *) 0xf00e471cu)	/* Debug Path User Defined Symbol 3 Register */
#define CIF_DP_UDS_4	(*( CIF_DP_UDS_1_type *) 0xf00e4720u)	/* Debug Path User Defined Symbol 4 Register */
#define CIF_DP_UDS_5	(*( CIF_DP_UDS_1_type *) 0xf00e4724u)	/* Debug Path User Defined Symbol 5 Register */
#define CIF_DP_UDS_6	(*( CIF_DP_UDS_1_type *) 0xf00e4728u)	/* Debug Path User Defined Symbol 6 Register */
#define CIF_DP_UDS_7	(*( CIF_DP_UDS_1_type *) 0xf00e472cu)	/* Debug Path User Defined Symbol 7 Register */
#define CIF_DP_UDS_8	(*( CIF_DP_UDS_1_type *) 0xf00e4730u)	/* Debug Path User Defined Symbol 8 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ic_en          : 1;	/* Image Cropping Enable */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_CTRL_type;
#define CIF_EP_1_IC_CTRL	(*( CIF_EP_1_IC_CTRL_type *) 0xf00e4900u)	/* Extra Path 1 Image Cropping Control Register */
#define CIF_EP_2_IC_CTRL	(*( CIF_EP_1_IC_CTRL_type *) 0xf00e4a00u)	/* Extra Path 2 Image Cropping Control Register */
#define CIF_EP_3_IC_CTRL	(*( CIF_EP_1_IC_CTRL_type *) 0xf00e4b00u)	/* Extra Path 3 Image Cropping Control Register */
#define CIF_EP_4_IC_CTRL	(*( CIF_EP_1_IC_CTRL_type *) 0xf00e4c00u)	/* Extra Path 4 Image Cropping Control Register */
#define CIF_EP_5_IC_CTRL	(*( CIF_EP_1_IC_CTRL_type *) 0xf00e4d00u)	/* Extra Path 5 Image Cropping Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int dx             : 12;	/* Camera Displacement */
		unsigned int                : 4;
		unsigned int dy             : 12;	/* Camera Displacement */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_DISPLACE_type;
#define CIF_EP_1_IC_DISPLACE	(*( CIF_EP_1_IC_DISPLACE_type *) 0xf00e4920u)	/* Extra Path 1 Image Cropping Camera Displacement Register */
#define CIF_EP_2_IC_DISPLACE	(*( CIF_EP_1_IC_DISPLACE_type *) 0xf00e4a20u)	/* Extra Path 2 Image Cropping Camera Displacement Register */
#define CIF_EP_3_IC_DISPLACE	(*( CIF_EP_1_IC_DISPLACE_type *) 0xf00e4b20u)	/* Extra Path 3 Image Cropping Camera Displacement Register */
#define CIF_EP_4_IC_DISPLACE	(*( CIF_EP_1_IC_DISPLACE_type *) 0xf00e4c20u)	/* Extra Path 4 Image Cropping Camera Displacement Register */
#define CIF_EP_5_IC_DISPLACE	(*( CIF_EP_1_IC_DISPLACE_type *) 0xf00e4d20u)	/* Extra Path 5 Image Cropping Camera Displacement Register */
#define CIF_ISPIS_DISPLACE	(*( CIF_EP_1_IC_DISPLACE_type *) 0xf00e4320u)	/* ISP Image Stabilization Camera Displacement Register */

typedef volatile union
{
	struct
	{ 
		unsigned int h_offs         : 12;	/* Horizontal Picture Offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_H_OFFS_type;
#define CIF_EP_1_IC_H_OFFS	(*( CIF_EP_1_IC_H_OFFS_type *) 0xf00e4908u)	/* Extra Path 1 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_2_IC_H_OFFS	(*( CIF_EP_1_IC_H_OFFS_type *) 0xf00e4a08u)	/* Extra Path 2 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_3_IC_H_OFFS	(*( CIF_EP_1_IC_H_OFFS_type *) 0xf00e4b08u)	/* Extra Path 3 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_4_IC_H_OFFS	(*( CIF_EP_1_IC_H_OFFS_type *) 0xf00e4c08u)	/* Extra Path 4 Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_5_IC_H_OFFS	(*( CIF_EP_1_IC_H_OFFS_type *) 0xf00e4d08u)	/* Extra Path 5 Image Cropping Horizontal Offset of Output Window Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int h_offs_shd     : 13;	/* Horizontal Picture Offset */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_H_OFFS_SHD_type;
#define CIF_EP_1_IC_H_OFFS_SHD	(*( CIF_EP_1_IC_H_OFFS_SHD_type *) 0xf00e4924u)	/* Extra Path 1 Image Current Horizontal Offset Of Output Window Shadow Register */
#define CIF_EP_2_IC_H_OFFS_SHD	(*( CIF_EP_1_IC_H_OFFS_SHD_type *) 0xf00e4a24u)	/* Extra Path 2 Image Current Horizontal Offset Of Output Window Shadow Register */
#define CIF_EP_3_IC_H_OFFS_SHD	(*( CIF_EP_1_IC_H_OFFS_SHD_type *) 0xf00e4b24u)	/* Extra Path 3 Image Current Horizontal Offset Of Output Window Shadow Register */
#define CIF_EP_4_IC_H_OFFS_SHD	(*( CIF_EP_1_IC_H_OFFS_SHD_type *) 0xf00e4c24u)	/* Extra Path 4 Image Current Horizontal Offset Of Output Window Shadow Register */
#define CIF_EP_5_IC_H_OFFS_SHD	(*( CIF_EP_1_IC_H_OFFS_SHD_type *) 0xf00e4d24u)	/* Extra Path 5 Image Current Horizontal Offset Of Output Window Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int h_size         : 12;	/* Horizontal Picture Size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_H_SIZE_type;
#define CIF_EP_1_IC_H_SIZE	(*( CIF_EP_1_IC_H_SIZE_type *) 0xf00e4910u)	/* Extra Path 1 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_2_IC_H_SIZE	(*( CIF_EP_1_IC_H_SIZE_type *) 0xf00e4a10u)	/* Extra Path 2 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_3_IC_H_SIZE	(*( CIF_EP_1_IC_H_SIZE_type *) 0xf00e4b10u)	/* Extra Path 3 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_4_IC_H_SIZE	(*( CIF_EP_1_IC_H_SIZE_type *) 0xf00e4c10u)	/* Extra Path 4 Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_5_IC_H_SIZE	(*( CIF_EP_1_IC_H_SIZE_type *) 0xf00e4d10u)	/* Extra Path 5 Image Cropping Output Horizontal Picture Size Register */

