svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int h_size_shd     : 13;	/* Horizontal Picture Size */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_H_SIZE_SHD_type;
#define CIF_EP_1_IC_H_SIZE_SHD	(*( CIF_EP_1_IC_H_SIZE_SHD_type *) 0xf00e492cu)	/* Extra Path 1 Image Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_2_IC_H_SIZE_SHD	(*( CIF_EP_1_IC_H_SIZE_SHD_type *) 0xf00e4a2cu)	/* Extra Path 2 Image Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_3_IC_H_SIZE_SHD	(*( CIF_EP_1_IC_H_SIZE_SHD_type *) 0xf00e4b2cu)	/* Extra Path 3 Image Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_4_IC_H_SIZE_SHD	(*( CIF_EP_1_IC_H_SIZE_SHD_type *) 0xf00e4c2cu)	/* Extra Path 4 Image Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_5_IC_H_SIZE_SHD	(*( CIF_EP_1_IC_H_SIZE_SHD_type *) 0xf00e4d2cu)	/* Extra Path 5 Image Current Output Horizontal Picture Size Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int max_dx         : 12;	/* Maximum Horizontal Displacement */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_MAX_DX_type;
#define CIF_EP_1_IC_MAX_DX	(*( CIF_EP_1_IC_MAX_DX_type *) 0xf00e4918u)	/* Extra Path 1 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_2_IC_MAX_DX	(*( CIF_EP_1_IC_MAX_DX_type *) 0xf00e4a18u)	/* Extra Path 2 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_3_IC_MAX_DX	(*( CIF_EP_1_IC_MAX_DX_type *) 0xf00e4b18u)	/* Extra Path 3 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_4_IC_MAX_DX	(*( CIF_EP_1_IC_MAX_DX_type *) 0xf00e4c18u)	/* Extra Path 4 Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_5_IC_MAX_DX	(*( CIF_EP_1_IC_MAX_DX_type *) 0xf00e4d18u)	/* Extra Path 5 Image Cropping Maximum Horizontal Displacement Register */

typedef volatile union
{
	struct
	{ 
		unsigned int max_dy         : 12;	/* Maximum Vertical Displacement */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_MAX_DY_type;
#define CIF_EP_1_IC_MAX_DY	(*( CIF_EP_1_IC_MAX_DY_type *) 0xf00e491cu)	/* Extra Path 1 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_2_IC_MAX_DY	(*( CIF_EP_1_IC_MAX_DY_type *) 0xf00e4a1cu)	/* Extra Path 2 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_3_IC_MAX_DY	(*( CIF_EP_1_IC_MAX_DY_type *) 0xf00e4b1cu)	/* Extra Path 3 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_4_IC_MAX_DY	(*( CIF_EP_1_IC_MAX_DY_type *) 0xf00e4c1cu)	/* Extra Path 4 Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_5_IC_MAX_DY	(*( CIF_EP_1_IC_MAX_DY_type *) 0xf00e4d1cu)	/* Extra Path 5 Image Cropping Maximum Vertical Displacement Register */

typedef volatile union
{
	struct
	{ 
		unsigned int recenter       : 3;	/* Recenter */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_RECENTER_type;
#define CIF_EP_1_IC_RECENTER	(*( CIF_EP_1_IC_RECENTER_type *) 0xf00e4904u)	/* Extra Path 1 Image Cropping Recenter Register */
#define CIF_EP_2_IC_RECENTER	(*( CIF_EP_1_IC_RECENTER_type *) 0xf00e4a04u)	/* Extra Path 2 Image Cropping Recenter Register */
#define CIF_EP_3_IC_RECENTER	(*( CIF_EP_1_IC_RECENTER_type *) 0xf00e4b04u)	/* Extra Path 3 Image Cropping Recenter Register */
#define CIF_EP_4_IC_RECENTER	(*( CIF_EP_1_IC_RECENTER_type *) 0xf00e4c04u)	/* Extra Path 4 Image Cropping Recenter Register */
#define CIF_EP_5_IC_RECENTER	(*( CIF_EP_1_IC_RECENTER_type *) 0xf00e4d04u)	/* Extra Path 5 Image Cropping Recenter Register */
#define CIF_ISPIS_RECENTER	(*( CIF_EP_1_IC_RECENTER_type *) 0xf00e4304u)	/* ISP Image Stabilization Recenter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int v_offs         : 12;	/* Vertical Picture Offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_V_OFFS_type;
#define CIF_EP_1_IC_V_OFFS	(*( CIF_EP_1_IC_V_OFFS_type *) 0xf00e490cu)	/* Extra Path 1 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_2_IC_V_OFFS	(*( CIF_EP_1_IC_V_OFFS_type *) 0xf00e4a0cu)	/* Extra Path 2 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_3_IC_V_OFFS	(*( CIF_EP_1_IC_V_OFFS_type *) 0xf00e4b0cu)	/* Extra Path 3 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_4_IC_V_OFFS	(*( CIF_EP_1_IC_V_OFFS_type *) 0xf00e4c0cu)	/* Extra Path 4 Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_5_IC_V_OFFS	(*( CIF_EP_1_IC_V_OFFS_type *) 0xf00e4d0cu)	/* Extra Path 5 Image Cropping Vertical Offset Of Output Window Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int v_offs_shd     : 12;	/* Vertical Picture Offset */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_V_OFFS_SHD_type;
#define CIF_EP_1_IC_V_OFFS_SHD	(*( CIF_EP_1_IC_V_OFFS_SHD_type *) 0xf00e4928u)	/* Extra Path 1 Image Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_2_IC_V_OFFS_SHD	(*( CIF_EP_1_IC_V_OFFS_SHD_type *) 0xf00e4a28u)	/* Extra Path 2 Image Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_3_IC_V_OFFS_SHD	(*( CIF_EP_1_IC_V_OFFS_SHD_type *) 0xf00e4b28u)	/* Extra Path 3 Image Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_4_IC_V_OFFS_SHD	(*( CIF_EP_1_IC_V_OFFS_SHD_type *) 0xf00e4c28u)	/* Extra Path 4 Image Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_5_IC_V_OFFS_SHD	(*( CIF_EP_1_IC_V_OFFS_SHD_type *) 0xf00e4d28u)	/* Extra Path 5 Image Current Vertical Offset Of Output Window Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int v_size         : 12;	/* Vertical Picture Size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_V_SIZE_type;
