svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CIF_EP_1_IC_V_SIZE	(*( CIF_EP_1_IC_V_SIZE_type *) 0xf00e4914u)	/* Extra Path 1 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_2_IC_V_SIZE	(*( CIF_EP_1_IC_V_SIZE_type *) 0xf00e4a14u)	/* Extra Path 2 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_3_IC_V_SIZE	(*( CIF_EP_1_IC_V_SIZE_type *) 0xf00e4b14u)	/* Extra Path 3 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_4_IC_V_SIZE	(*( CIF_EP_1_IC_V_SIZE_type *) 0xf00e4c14u)	/* Extra Path 4 Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_5_IC_V_SIZE	(*( CIF_EP_1_IC_V_SIZE_type *) 0xf00e4d14u)	/* Extra Path 5 Image Cropping Output Vertical Picture Size Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int v_size_shd     : 12;	/* Vertical Picture Size */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_EP_1_IC_V_SIZE_SHD_type;
#define CIF_EP_1_IC_V_SIZE_SHD	(*( CIF_EP_1_IC_V_SIZE_SHD_type *) 0xf00e4930u)	/* Extra Path 1 Image Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_2_IC_V_SIZE_SHD	(*( CIF_EP_1_IC_V_SIZE_SHD_type *) 0xf00e4a30u)	/* Extra Path 2 Image Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_3_IC_V_SIZE_SHD	(*( CIF_EP_1_IC_V_SIZE_SHD_type *) 0xf00e4b30u)	/* Extra Path 3 Image Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_4_IC_V_SIZE_SHD	(*( CIF_EP_1_IC_V_SIZE_SHD_type *) 0xf00e4c30u)	/* Extra Path 4 Image Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_5_IC_V_SIZE_SHD	(*( CIF_EP_1_IC_V_SIZE_SHD_type *) 0xf00e4d30u)	/* Extra Path 5 Image Current Output Vertical Picture Size Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int cif_isp_clk_enable: 1;	/* ISP processing clock enable */
		unsigned int                : 4;
		unsigned int cif_jpeg_clk_enable: 1;	/* JPEG encoder clock enable */
		unsigned int cif_mi_clk_enable: 1;	/* Memory interface clock enable */
		unsigned int                : 9;
		unsigned int cif_watchdog_clk_enable: 1;	/* Security Watchdog clock enable */
		unsigned int cif_lin_dscaler_clk_enable: 1;	/* Linear Downscaler clock enable */
		unsigned int cif_extra_paths_clk_enable: 1;	/* Extra Paths clock enable */
		unsigned int cif_debug_path_clk_en: 1;	/* Debug Path clock enable */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_ICCL_type;
#define CIF_ICCL	(*( CIF_ICCL_type *) 0xf00e2010u)	/* CIF Internal Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int modrev         : 8;	/* Module Revision Number */
		/* const */ unsigned int modtype        : 8;	/* Module Type */
		/* const */ unsigned int modnum         : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} CIF_ID_type;
#define CIF_ID	(*( CIF_ID_type *) 0xf00e2008u)	/* CIF Revision Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int cif_isp_soft_rst: 1;	/* Isp software reset */
		unsigned int                : 1;
		unsigned int cif_ycs_soft_rst: 1;	/* Y/C splitter software reset */
		unsigned int                : 2;
		unsigned int cif_jpeg_soft_rst: 1;	/* JPEG encoder software reset */
		unsigned int cif_mi_soft_rst: 1;	/* Memory interface software reset */
		unsigned int cif_global_rst : 1;	/* Soft reset of entire CIF */
		unsigned int                : 8;
		unsigned int cif_watchdog_rst: 1;	/* Securtiy Watchdog software reset */
		unsigned int cif_lin_dscaler_rst: 1;	/* Linear Downscaler software reset */
		unsigned int cif_extra_paths_rst: 1;	/* Extra Paths software reset */
		unsigned int cif_debug_path_rst: 1;	/* Debug Path software reset */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_IRCL_type;
#define CIF_IRCL	(*( CIF_IRCL_type *) 0xf00e2014u)	/* CIF Internal Reset Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int is_en          : 1;	/* Image Stabilization Enable */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_CTRL_type;
#define CIF_ISPIS_CTRL	(*( CIF_ISPIS_CTRL_type *) 0xf00e4300u)	/* ISP Image Stabilization Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int is_h_offs      : 12;	/* Horizontal Picture Offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_H_OFFS_type;
#define CIF_ISPIS_H_OFFS	(*( CIF_ISPIS_H_OFFS_type *) 0xf00e4308u)	/* ISP Image Stabilization Horizontal Offset Of Output Window Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int is_h_offs_shd  : 13;	/* Horizontal Picture Offset */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_H_OFFS_SHD_type;
#define CIF_ISPIS_H_OFFS_SHD	(*( CIF_ISPIS_H_OFFS_SHD_type *) 0xf00e4324u)	/* SP Image Current Horizontal Offset Of Output Window Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int is_h_size      : 12;	/* Horizontal Picture Size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_H_SIZE_type;
#define CIF_ISPIS_H_SIZE	(*( CIF_ISPIS_H_SIZE_type *) 0xf00e4310u)	/* ISP Image Stabilization Output Horizontal Picture Size Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_h_size_shd : 13;	/* Horizontal Picture Size */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_H_SIZE_SHD_type;
#define CIF_ISPIS_H_SIZE_SHD	(*( CIF_ISPIS_H_SIZE_SHD_type *) 0xf00e432cu)	/* ISP Image Current Output Horizontal Picture Size Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int Is_max_dx      : 12;	/* Maximum Horizontal Displacement */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_MAX_DX_type;
#define CIF_ISPIS_MAX_DX	(*( CIF_ISPIS_MAX_DX_type *) 0xf00e4318u)	/* ISP Image Stabilization Maximum Horizontal Displacement Register */

