svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int is_max_dy      : 12;	/* Maximum Vertical Displacement */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_MAX_DY_type;
#define CIF_ISPIS_MAX_DY	(*( CIF_ISPIS_MAX_DY_type *) 0xf00e431cu)	/* ISP Image Stabilization Maximum Vertical Displacement Register */

typedef volatile union
{
	struct
	{ 
		unsigned int is_v_offs      : 12;	/* Vertical Picture Offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_V_OFFS_type;
#define CIF_ISPIS_V_OFFS	(*( CIF_ISPIS_V_OFFS_type *) 0xf00e430cu)	/* ISP Image Stabilization Vertical Offset Of Output Window Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int is_v_offs_shd  : 12;	/* Vertical Picture Offset */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_V_OFFS_SHD_type;
#define CIF_ISPIS_V_OFFS_SHD	(*( CIF_ISPIS_V_OFFS_SHD_type *) 0xf00e4328u)	/* ISP Image Current Vertical Offset Of Output Window Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int is_v_size      : 12;	/* Vertical Picture Size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_V_SIZE_type;
#define CIF_ISPIS_V_SIZE	(*( CIF_ISPIS_V_SIZE_type *) 0xf00e4314u)	/* ISP Image Stabilization Output Vertical Picture Size Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_v_size_shd : 12;	/* Vertical Picture Size */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISPIS_V_SIZE_SHD_type;
#define CIF_ISPIS_V_SIZE_SHD	(*( CIF_ISPIS_V_SIZE_SHD_type *) 0xf00e4330u)	/* ISP Image Current Output Vertical Picture Size Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int acq_h_offs     : 13;	/* Horizontal sample offset */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ACQ_H_OFFS_type;
#define CIF_ISP_ACQ_H_OFFS	(*( CIF_ISP_ACQ_H_OFFS_type *) 0xf00e2408u)	/* ISP Acquisition Horizontal Offset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int acq_h_size     : 13;	/* Horizontal sample size */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ACQ_H_SIZE_type;
#define CIF_ISP_ACQ_H_SIZE	(*( CIF_ISP_ACQ_H_SIZE_type *) 0xf00e2410u)	/* ISP Acquisition Horizontal Size Register */

typedef volatile union
{
	struct
	{ 
		unsigned int acq_nr_frames  : 10;	/* Number of Input Frames */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ACQ_NR_FRAMES_type;
#define CIF_ISP_ACQ_NR_FRAMES	(*( CIF_ISP_ACQ_NR_FRAMES_type *) 0xf00e2418u)	/* ISP Acquisition Number of Frames Register */

typedef volatile union
{
	struct
	{ 
		unsigned int sample_edge    : 1;	/* Sample Edge */
		unsigned int hsync_pol      : 1;	/* Horizontal sync polarity */
		unsigned int vsync_pol      : 1;	/* Vertical sync polarity */
		unsigned int                : 4;
		unsigned int ccir_seq       : 2;	/* CCIR Sequence */
		unsigned int field_selection: 2;	/* Field Selection */
		unsigned int field_invert   : 1;	/* Field Invert */
		unsigned int input_selection: 4;	/* Input Selection */
		unsigned int                : 4;
		unsigned int input_selection_no_app: 1;	/* Input Selection No Append */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ACQ_PROP_type;
#define CIF_ISP_ACQ_PROP	(*( CIF_ISP_ACQ_PROP_type *) 0xf00e2404u)	/* ISP Acquisition Properties Register */

typedef volatile union
{
	struct
	{ 
		unsigned int acq_v_offs     : 12;	/* Vertical sample offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ACQ_V_OFFS_type;
#define CIF_ISP_ACQ_V_OFFS	(*( CIF_ISP_ACQ_V_OFFS_type *) 0xf00e240cu)	/* ISP Acquistion Vertical Offset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int acq_v_size     : 12;	/* Vertical sample size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ACQ_V_SIZE_type;
#define CIF_ISP_ACQ_V_SIZE	(*( CIF_ISP_ACQ_V_SIZE_type *) 0xf00e2414u)	/* ISP Acquisition Vertical Size Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isp_enable     : 1;	/* ISP output enable */
		unsigned int isp_mode       : 3;	/* ISP Mode */
		unsigned int isp_inform_enable: 1;	/* ISP Input Formater Enable */
		unsigned int                : 4;
		unsigned int isp_cfg_upd    : 1;	/* ISP Config Update */
		unsigned int isp_gen_cfg_upd: 1;	/* ISP Generate Config Update */
		unsigned int                : 2;
		unsigned int isp_csm_y_range: 1;	/* Color Space Matrix luminance clipping range for ISP output */
		unsigned int isp_csm_c_range: 1;	/* Color Space Matrix chrominance clipping range for ISP output */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_CTRL_type;
#define CIF_ISP_CTRL	(*( CIF_ISP_CTRL_type *) 0xf00e2400u)	/* ISP Global Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int inform_size_err: 1;	/* Size error is generated in inform submodule */
		/* const */ unsigned int is_size_err    : 1;	/* Size error is generated in image stabilization submodule */
		/* const */ unsigned int outform_size_err: 1;	/* Size error is generated in outmux submodule */
		/* const */ unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ERR_type;
#define CIF_ISP_ERR	(*( CIF_ISP_ERR_type *) 0xf00e263cu)	/* ISP Error Register */

typedef volatile union
{
	struct
	{ 
		unsigned int inform_size_err_clr: 1;	/* Size error is cleared */
		unsigned int is_size_err_clr: 1;	/* Size error is cleared */
		unsigned int outform_size_err_clr: 1;	/* Size error is cleared */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ERR_CLR_type;
#define CIF_ISP_ERR_CLR	(*( CIF_ISP_ERR_CLR_type *) 0xf00e2640u)	/* ISP Error Clear Register */

