svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_enable_shd : 1;	/* ISP enable shadow register */
		/* const */ unsigned int isp_inform_enable_shd: 1;	/* Input formatter enable shadow register */
		/* const */ unsigned int inform_field   : 1;	/* Current field information */
		/* const */ unsigned int                : 11;
		/* const */ unsigned int s_data         : 16;	/* State of ISP input port s_data */
		/* const */ unsigned int s_vsync        : 1;	/* State of ISP input port s_vsync */
		/* const */ unsigned int s_hsync        : 1;	/* State of ISP input port s_hsync */
	} B;
	int I;
	unsigned int U;

} CIF_ISP_FLAGS_SHD_type;
#define CIF_ISP_FLAGS_SHD	(*( CIF_ISP_FLAGS_SHD_type *) 0xf00e25a8u)	/* ISP Shadow Flags Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int frame_counter  : 10;	/* Current Frame Count of Processing */
		/* const */ unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_FRAME_COUNT_type;
#define CIF_ISP_FRAME_COUNT	(*( CIF_ISP_FRAME_COUNT_type *) 0xf00e2644u)	/* ISP Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int icr_isp_off    : 1;	/* Isp was Turned Off (vsynced) */
		unsigned int icr_frame      : 1;	/* Frame was Completely Put Out */
		unsigned int icr_data_loss  : 1;	/* Loss of Data */
		unsigned int icr_pic_size_err: 1;	/* Pic Size Violation Occurred */
		unsigned int                : 1;
		unsigned int icr_frame_in   : 1;	/* Sampled Input Frame is Complete */
		unsigned int icr_v_start    : 1;	/* Start Edge of v_sync */
		unsigned int icr_h_start    : 1;	/* Start Edge of h_sync */
		unsigned int                : 11;
		unsigned int icr_wd_trig    : 1;	/* A watchdog timeout was triggered at the ISP input */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ICR_type;
#define CIF_ISP_ICR	(*( CIF_ISP_ICR_type *) 0xf00e25c8u)	/* ISP Interrupt Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int imsc_isp_off   : 1;	/* Isp was Turned Off (vsynced) */
		unsigned int imsc_frame     : 1;	/* Frame was Completely Put Out */
		unsigned int imsc_data_loss : 1;	/* Loss of Data */
		unsigned int imsc_pic_size_err: 1;	/* Pic Size Violation Occurred */
		unsigned int                : 1;
		unsigned int imsc_frame_in  : 1;	/* Sampled Input Frame is Complete */
		unsigned int imsc_v_start   : 1;	/* Start Edge of v_sync */
		unsigned int imsc_h_start   : 1;	/* Start Edge of h_sync */
		unsigned int                : 11;
		unsigned int imsc_wd_trig   : 1;	/* A watchdog timeout was triggered at the ISP input */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_IMSC_type;
#define CIF_ISP_IMSC	(*( CIF_ISP_IMSC_type *) 0xf00e25bcu)	/* ISP Interrupt Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isr_isp_off    : 1;	/* Isp was Turned Off (vsynced) */
		unsigned int isr_frame      : 1;	/* Frame was Completely Put Out */
		unsigned int isr_data_loss  : 1;	/* Loss of Data */
		unsigned int isr_pic_size_err: 1;	/* Pic Size Violation Occurred */
		unsigned int                : 1;
		unsigned int isr_frame_in   : 1;	/* Sampled Input Frame is Complete */
		unsigned int isr_v_start    : 1;	/* Start Edge of v_sync */
		unsigned int isr_h_start    : 1;	/* Start Edge of h_sync */
		unsigned int                : 11;
		unsigned int isr_wd_trig    : 1;	/* A watchdog timeout was triggered at the ISP input */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_ISR_type;
#define CIF_ISP_ISR	(*( CIF_ISP_ISR_type *) 0xf00e25ccu)	/* ISP Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int mis_isp_off    : 1;	/* Isp was Turned Off (vsynced) */
		/* const */ unsigned int mis_frame      : 1;	/* Frame was Completely Put Out */
		/* const */ unsigned int mis_data_loss  : 1;	/* Loss of Data */
		/* const */ unsigned int mis_pic_size_err: 1;	/* Pic Size Violation Occurred */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int mis_frame_in   : 1;	/* Sampled Input Frame is Complete */
		/* const */ unsigned int mis_v_start    : 1;	/* Start Edge of v_sync */
		/* const */ unsigned int mis_h_start    : 1;	/* Start Edge of h_sync */
		/* const */ unsigned int                : 11;
		/* const */ unsigned int mis_wd_trig    : 1;	/* A watchdog timeout was triggered at the ISP input */
		/* const */ unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_MIS_type;
#define CIF_ISP_MIS	(*( CIF_ISP_MIS_type *) 0xf00e25c4u)	/* ISP Masked Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isp_out_h_offs : 12;	/* Horizontal Picture Offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_H_OFFS_type;
#define CIF_ISP_OUT_H_OFFS	(*( CIF_ISP_OUT_H_OFFS_type *) 0xf00e2594u)	/* ISP Output Window Horizontal Offset Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_out_h_offs_shd: 12;	/* Current horizontal picture offset */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_H_OFFS_SHD_type;
#define CIF_ISP_OUT_H_OFFS_SHD	(*( CIF_ISP_OUT_H_OFFS_SHD_type *) 0xf00e25acu)	/* ISP Output Window Horizontal Offset Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isp_out_h_size : 12;	/* Horizontal picture size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_H_SIZE_type;
#define CIF_ISP_OUT_H_SIZE	(*( CIF_ISP_OUT_H_SIZE_type *) 0xf00e259cu)	/* ISP Output Horizontal Picture Size Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_out_h_size_shd: 13;	/* Current horizontal picture size */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_H_SIZE_SHD_type;
