svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CIF_ISP_OUT_H_SIZE_SHD	(*( CIF_ISP_OUT_H_SIZE_SHD_type *) 0xf00e25b4u)	/* ISP Output Horizontal Picture Size Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isp_out_v_offs : 12;	/* Vertical Picture Offset */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_V_OFFS_type;
#define CIF_ISP_OUT_V_OFFS	(*( CIF_ISP_OUT_V_OFFS_type *) 0xf00e2598u)	/* ISP Output Window Vertical Offset Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_out_v_offs_shd: 12;	/* Current vertical picture offset */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_V_OFFS_SHD_type;
#define CIF_ISP_OUT_V_OFFS_SHD	(*( CIF_ISP_OUT_V_OFFS_SHD_type *) 0xf00e25b0u)	/* ISP Output Window Vertical Offset Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isp_out_v_size : 12;	/* Vertical picture size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_V_SIZE_type;
#define CIF_ISP_OUT_V_SIZE	(*( CIF_ISP_OUT_V_SIZE_type *) 0xf00e25a0u)	/* ISP Output Vertical Picture Size Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int isp_out_v_size_shd: 12;	/* Current vertical pic size */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_OUT_V_SIZE_SHD_type;
#define CIF_ISP_OUT_V_SIZE_SHD	(*( CIF_ISP_OUT_V_SIZE_SHD_type *) 0xf00e25b8u)	/* ISP Output Vertical Picture Size Shadow Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ris_isp_off    : 1;	/* Isp was Turned Off (vsynced) */
		/* const */ unsigned int ris_frame      : 1;	/* Frame was Completely Put Out */
		/* const */ unsigned int ris_data_loss  : 1;	/* Loss of Data */
		/* const */ unsigned int ris_pic_size_err: 1;	/* Pic Size Violation Occurred */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int ris_frame_in   : 1;	/* Sampled Input Frame is Complete */
		/* const */ unsigned int ris_v_start    : 1;	/* Start Edge of v_sync */
		/* const */ unsigned int ris_h_start    : 1;	/* Start Edge of h_sync */
		/* const */ unsigned int                : 11;
		/* const */ unsigned int ris_wd_trig    : 1;	/* A watchdog timeout was triggered at the ISP input */
		/* const */ unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_ISP_RIS_type;
#define CIF_ISP_RIS	(*( CIF_ISP_RIS_type *) 0xf00e25c0u)	/* ISP Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ac_table_select: 3;	/* AC Table Selector */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_AC_TABLE_SELECT_type;
#define CIF_JPE_AC_TABLE_SELECT	(*( CIF_JPE_AC_TABLE_SELECT_type *) 0xf00e3838u)	/* JPE Huffman Table Selector For AC Values Register */

typedef volatile union
{
	struct
	{ 
		unsigned int cbcr_scale_en  : 1;	/* Cb/Cr scale flag */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_CBCR_SCALE_EN_type;
#define CIF_JPE_CBCR_SCALE_EN	(*( CIF_JPE_CBCR_SCALE_EN_type *) 0xf00e3810u)	/* JPE Cb/Cr Value Scaling Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int dc_table_select: 3;	/* DC Table Selector */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_DC_TABLE_SELECT_type;
#define CIF_JPE_DC_TABLE_SELECT	(*( CIF_JPE_DC_TABLE_SELECT_type *) 0xf00e3834u)	/* JPE Huffman Table Selector For DC Values Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 2;
		/* const */ unsigned int deb_qiq_table_acc: 1;	/* QIQ Table Access */
		/* const */ unsigned int deb_vlc_encode_busy: 1;	/* VLC Encode Busy */
		/* const */ unsigned int deb_r2b_memory_full: 1;	/* R2B Memory Full */
		/* const */ unsigned int deb_vlc_table_busy: 1;	/* Debug VLC Table Busy */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int deb_bad_table_access: 1;	/* Debug Bad Table Access */
		/* const */ unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_DEBUG_type;
#define CIF_JPE_DEBUG	(*( CIF_JPE_DEBUG_type *) 0xf00e3864u)	/* JPE Debug Information Register */

typedef volatile union
{
	struct
	{ 
		unsigned int encode         : 1;	/* Encode */
		unsigned int                : 3;
		unsigned int cont_mode      : 2;	/* Encoder continuous mode */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ENCODE_type;
#define CIF_JPE_ENCODE	(*( CIF_JPE_ENCODE_type *) 0xf00e3804u)	/* JPE Start Command To Start JFIF Stream Encoding Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int codec_busy     : 1;	/* Codec Busy */
		/* const */ unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ENCODER_BUSY_type;
#define CIF_JPE_ENCODER_BUSY	(*( CIF_JPE_ENCODER_BUSY_type *) 0xf00e3858u)	/* JPE Encoder Status Flag Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int encode_mode    : 1;	/* Encode Mode */
		/* const */ unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ENCODE_MODE_type;
#define CIF_JPE_ENCODE_MODE	(*( CIF_JPE_ENCODE_MODE_type *) 0xf00e3860u)	/* JPE Encode Mode Register */

typedef volatile union
{
	struct
	{ 
		unsigned int enc_hsize      : 12;	/* Horizontal Size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ENC_HSIZE_type;
#define CIF_JPE_ENC_HSIZE	(*( CIF_JPE_ENC_HSIZE_type *) 0xf00e3818u)	/* JPEG Codec Horizontal Image Size For Encoding Register */

typedef volatile union
{
	struct
	{ 
		unsigned int enc_vsize      : 12;	/* Vertical Size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ENC_VSIZE_type;
#define CIF_JPE_ENC_VSIZE	(*( CIF_JPE_ENC_VSIZE_type *) 0xf00e381cu)	/* JPEG Codec Vertical Image Size For Encoding Register */

