svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int vlc_symbol_err : 1;	/* VLC Symbol Error */
		unsigned int                : 2;
		unsigned int dct_err        : 1;	/* DC Table Error */
		unsigned int                : 1;
		unsigned int r2b_img_size_err: 1;	/* R2B Image Size Error */
		unsigned int vlc_table_err  : 1;	/* VLC Table Error */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ERROR_ICR_type;
#define CIF_JPE_ERROR_ICR	(*( CIF_JPE_ERROR_ICR_type *) 0xf00e3874u)	/* JPE Error Interrupt Clear Register */
#define CIF_JPE_ERROR_ISR	(*( CIF_JPE_ERROR_ICR_type *) 0xf00e3878u)	/* JPE Error Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int vlc_symbol_err : 1;	/* VLC Symbol Error */
		unsigned int                : 2;
		unsigned int dct_err        : 1;	/* DC Table Error */
		unsigned int                : 1;
		unsigned int r2b_img_size_err: 1;	/* R2B Image Size Error */
		unsigned int vlc_table_err  : 1;	/* VLC Table Error */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ERROR_IMR_type;
#define CIF_JPE_ERROR_IMR	(*( CIF_JPE_ERROR_IMR_type *) 0xf00e3868u)	/* JPE Error Interrupt Mask Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 4;
		/* const */ unsigned int vlc_symbol_err : 1;	/* VLC Symbol Error */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int dct_err        : 1;	/* DC Table Error */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int r2b_img_size_err: 1;	/* R2B Image Size Error */
		/* const */ unsigned int vlc_table_err  : 1;	/* VLC Table Error */
		/* const */ unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_ERROR_MIS_type;
#define CIF_JPE_ERROR_MIS	(*( CIF_JPE_ERROR_MIS_type *) 0xf00e3870u)	/* JPE Error Masked Interrupt Status Register */
#define CIF_JPE_ERROR_RIS	(*( CIF_JPE_ERROR_MIS_type *) 0xf00e386cu)	/* JPE Error Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int gen_header     : 1;	/* Generate Header */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_GEN_HEADER_type;
#define CIF_JPE_GEN_HEADER	(*( CIF_JPE_GEN_HEADER_type *) 0xf00e3800u)	/* JPE Command To Start Stream Header Generation Register */

typedef volatile union
{
	struct
	{ 
		unsigned int header_mode    : 2;	/* Header Mode */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_HEADER_MODE_type;
#define CIF_JPE_HEADER_MODE	(*( CIF_JPE_HEADER_MODE_type *) 0xf00e385cu)	/* JPE Header Mode Definition Register */

typedef volatile union
{
	struct
	{ 
		unsigned int JP_INIT        : 1;	/* JPEG Init */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_INIT_type;
#define CIF_JPE_INIT	(*( CIF_JPE_INIT_type *) 0xf00e3808u)	/* JPE Automatic Configuration Update Register */

typedef volatile union
{
	struct
	{ 
		unsigned int enc_pic_format : 3;	/* Picture Encoding Format */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_PIC_FORMAT_type;
#define CIF_JPE_PIC_FORMAT	(*( CIF_JPE_PIC_FORMAT_type *) 0xf00e3820u)	/* JPEG Picture Encoding Format Register */

typedef volatile union
{
	struct
	{ 
		unsigned int restart_interval: 16;	/* Restart Interval */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_RESTART_INTERVAL_type;
#define CIF_JPE_RESTART_INTERVAL	(*( CIF_JPE_RESTART_INTERVAL_type *) 0xf00e3824u)	/* JPE Restart Marker Insertion Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int encode_done    : 1;	/* Encoding Complete */
		unsigned int gen_header_done: 1;	/* Header Generation Complete */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_STATUS_ICR_type;
#define CIF_JPE_STATUS_ICR	(*( CIF_JPE_STATUS_ICR_type *) 0xf00e3888u)	/* JPEG Status Interrupt Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int encode_done    : 1;	/* Encoding Complete */
		unsigned int gen_header_done: 1;	/* Header Generation Complete */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_STATUS_IMR_type;
#define CIF_JPE_STATUS_IMR	(*( CIF_JPE_STATUS_IMR_type *) 0xf00e387cu)	/* JPEG Status Interrupt Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int encode_done    : 1;	/* Encoding Complete */
		unsigned int gen_header_done: 1;	/* Header Generation Complete */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_STATUS_ISR_type;
#define CIF_JPE_STATUS_ISR	(*( CIF_JPE_STATUS_ISR_type *) 0xf00e388cu)	/* JPEG Status Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 4;
		/* const */ unsigned int encode_done    : 1;	/* Encoding Complete */
		/* const */ unsigned int gen_header_done: 1;	/* Header Generation Complete */
		/* const */ unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_STATUS_MIS_type;
#define CIF_JPE_STATUS_MIS	(*( CIF_JPE_STATUS_MIS_type *) 0xf00e3884u)	/* JPEG Status Masked Interrupt Status Register */
#define CIF_JPE_STATUS_RIS	(*( CIF_JPE_STATUS_MIS_type *) 0xf00e3880u)	/* JPEG Status Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int table_wdata_l  : 8;	/* Table data LSB */
		unsigned int table_wdata_h  : 8;	/* Table data MSB */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TABLE_DATA_type;
#define CIF_JPE_TABLE_DATA	(*( CIF_JPE_TABLE_DATA_type *) 0xf00e383cu)	/* JPE Table Programming Register */

typedef volatile union
{
	struct
	{ 
		unsigned int table_flush    : 1;	/* Header generation debug control flag */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TABLE_FLUSH_type;
