svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define CIF_JPE_TABLE_FLUSH	(*( CIF_JPE_TABLE_FLUSH_type *) 0xf00e3814u)	/* JPE Header Generation Debug Register */

typedef volatile union
{
	struct
	{ 
		unsigned int table_id       : 4;	/* JPE Table ID */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TABLE_ID_type;
#define CIF_JPE_TABLE_ID	(*( CIF_JPE_TABLE_ID_type *) 0xf00e3840u)	/* JPE Table Programming Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int tac0_len       : 8;	/* AC Table 0 Length */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TAC0_LEN_type;
#define CIF_JPE_TAC0_LEN	(*( CIF_JPE_TAC0_LEN_type *) 0xf00e3844u)	/* JPE Huffman AC Table 0 Length Register */

typedef volatile union
{
	struct
	{ 
		unsigned int tac1_len       : 8;	/* AC Table 1 Length */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TAC1_LEN_type;
#define CIF_JPE_TAC1_LEN	(*( CIF_JPE_TAC1_LEN_type *) 0xf00e384cu)	/* JPE Huffman AC Table 1 Length Register */

typedef volatile union
{
	struct
	{ 
		unsigned int tdc0_len       : 8;	/* DC Table 0 Length */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TDC0_LEN_type;
#define CIF_JPE_TDC0_LEN	(*( CIF_JPE_TDC0_LEN_type *) 0xf00e3848u)	/* JPE Huffman DC Table 0 Length Register */

typedef volatile union
{
	struct
	{ 
		unsigned int tdc1_len       : 8;	/* DC Table 1 Length */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TDC1_LEN_type;
#define CIF_JPE_TDC1_LEN	(*( CIF_JPE_TDC1_LEN_type *) 0xf00e3850u)	/* JPE Huffman DC Table 1 Length Register */

typedef volatile union
{
	struct
	{ 
		unsigned int tq1_select     : 2;	/* Q-Table Selector U */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TQ_U_SELECT_type;
#define CIF_JPE_TQ_U_SELECT	(*( CIF_JPE_TQ_U_SELECT_type *) 0xf00e382cu)	/* Q- table Selector 1, Quant. Table For U Component */

typedef volatile union
{
	struct
	{ 
		unsigned int tq2_select     : 2;	/* Q-Table Selector V */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TQ_V_SELECT_type;
#define CIF_JPE_TQ_V_SELECT	(*( CIF_JPE_TQ_V_SELECT_type *) 0xf00e3830u)	/* Q- table Selector 2 Quant Table For V Component */

typedef volatile union
{
	struct
	{ 
		unsigned int tq0_select     : 2;	/* Q-Table Selector Y */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_TQ_Y_SELECT_type;
#define CIF_JPE_TQ_Y_SELECT	(*( CIF_JPE_TQ_Y_SELECT_type *) 0xf00e3828u)	/* Q- table Selector 0 Quant Table For Y Component */

typedef volatile union
{
	struct
	{ 
		unsigned int y_scale_en     : 1;	/* Y scale flag */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CIF_JPE_Y_SCALE_EN_type;
#define CIF_JPE_Y_SCALE_EN	(*( CIF_JPE_Y_SCALE_EN_type *) 0xf00e380cu)	/* JPE Y Value Scaling Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int lds_v_en       : 1;	/* Vertical scaling enable */
		unsigned int lds_h_en       : 1;	/* Horizontal scaling enable */
		unsigned int                : 2;
		unsigned int lds_v_mode     : 2;	/* Vertical scaling mode */
		unsigned int                : 2;
		unsigned int lds_h_mode     : 2;	/* Horizontal scaling mode */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} CIF_LDS_CTRL_type;
#define CIF_LDS_CTRL	(*( CIF_LDS_CTRL_type *) 0xf00e4500u)	/* Linear Downscaler Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int lds_v_fac      : 8;	/* Vertical scaling factor */
		unsigned int                : 8;
		unsigned int lds_h_fac      : 8;	/* Horizontal scaling factor */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_LDS_FAC_type;
#define CIF_LDS_FAC	(*( CIF_LDS_FAC_type *) 0xf00e4504u)	/* Linear Downscaler Factor Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int ep_base_ad_init: 30;	/* Extra Path Base Address Init */
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_BASE_AD_INIT_type;
#define CIF_MIEP_1_BASE_AD_INIT	(*( CIF_MIEP_1_BASE_AD_INIT_type *) 0xf00e5508u)	/* Memory Interface Base Address For Extra Path 1 Data Buffer Register */
#define CIF_MIEP_2_BASE_AD_INIT	(*( CIF_MIEP_1_BASE_AD_INIT_type *) 0xf00e5608u)	/* Memory Interface Base Address For Extra Path 2 Data Buffer Register */
#define CIF_MIEP_3_BASE_AD_INIT	(*( CIF_MIEP_1_BASE_AD_INIT_type *) 0xf00e5708u)	/* Memory Interface Base Address For Extra Path 3 Data Buffer Register */
#define CIF_MIEP_4_BASE_AD_INIT	(*( CIF_MIEP_1_BASE_AD_INIT_type *) 0xf00e5808u)	/* Memory Interface Base Address For Extra Path 4 Data Buffer Register */
#define CIF_MIEP_5_BASE_AD_INIT	(*( CIF_MIEP_1_BASE_AD_INIT_type *) 0xf00e5908u)	/* Memory Interface Base Address For Extra Path 5 Data Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int ep_base_ad     : 30;	/* Extra Path Base Address */
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_BASE_AD_SHD_type;
#define CIF_MIEP_1_BASE_AD_SHD	(*( CIF_MIEP_1_BASE_AD_SHD_type *) 0xf00e5520u)	/* Memory Interface Base Address Shadow Register for Extra Path 1 Buffer Register */
#define CIF_MIEP_2_BASE_AD_SHD	(*( CIF_MIEP_1_BASE_AD_SHD_type *) 0xf00e5620u)	/* Memory Interface Base Address Shadow Register for Extra Path 2 Buffer Register */
#define CIF_MIEP_3_BASE_AD_SHD	(*( CIF_MIEP_1_BASE_AD_SHD_type *) 0xf00e5720u)	/* Memory Interface Base Address Shadow Register for Extra Path 3 Buffer Register */
#define CIF_MIEP_4_BASE_AD_SHD	(*( CIF_MIEP_1_BASE_AD_SHD_type *) 0xf00e5820u)	/* Memory Interface Base Address Shadow Register for Extra Path 4 Buffer Register */
#define CIF_MIEP_5_BASE_AD_SHD	(*( CIF_MIEP_1_BASE_AD_SHD_type *) 0xf00e5920u)	/* Memory Interface Base Address Shadow Register for Extra Path 5 Buffer Register */

