svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ep_enable      : 1;	/* Enables enable ep picture data path */
		unsigned int                : 6;
		unsigned int byte_swap      : 1;	/* Byte Swap Enable */
		unsigned int                : 12;
		unsigned int init_base_en   : 1;	/* Init Base Address Enable */
		unsigned int init_offset_en : 1;	/* Init Offset Counter Enable */
		unsigned int ep_write_format: 2;	/* Extra Path Write Format */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_CTRL_type;
#define CIF_MIEP_1_CTRL	(*( CIF_MIEP_1_CTRL_type *) 0xf00e5500u)	/* Memory Interface Extra Path 1 Control Register */
#define CIF_MIEP_2_CTRL	(*( CIF_MIEP_1_CTRL_type *) 0xf00e5600u)	/* Memory Interface Extra Path 2 Control Register */
#define CIF_MIEP_3_CTRL	(*( CIF_MIEP_1_CTRL_type *) 0xf00e5700u)	/* Memory Interface Extra Path 3 Control Register */
#define CIF_MIEP_4_CTRL	(*( CIF_MIEP_1_CTRL_type *) 0xf00e5800u)	/* Memory Interface Extra Path 4 Control Register */
#define CIF_MIEP_5_CTRL	(*( CIF_MIEP_1_CTRL_type *) 0xf00e5900u)	/* Memory Interface Extra Path 5 Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ep_enable_in   : 1;	/* Extra Path In Enable */
		/* const */ unsigned int                : 15;
		/* const */ unsigned int ep_enable_out  : 1;	/* Extra Path Out Enable */
		/* const */ unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_CTRL_SHD_type;
#define CIF_MIEP_1_CTRL_SHD	(*( CIF_MIEP_1_CTRL_SHD_type *) 0xf00e551cu)	/* Memory Interface Extra Path 1 Control Internal Shadow Register */
#define CIF_MIEP_2_CTRL_SHD	(*( CIF_MIEP_1_CTRL_SHD_type *) 0xf00e561cu)	/* Memory Interface Extra Path 2 Control Internal Shadow Register */
#define CIF_MIEP_3_CTRL_SHD	(*( CIF_MIEP_1_CTRL_SHD_type *) 0xf00e571cu)	/* Memory Interface Extra Path 3 Control Internal Shadow Register */
#define CIF_MIEP_4_CTRL_SHD	(*( CIF_MIEP_1_CTRL_SHD_type *) 0xf00e581cu)	/* Memory Interface Extra Path 4 Control Internal Shadow Register */
#define CIF_MIEP_5_CTRL_SHD	(*( CIF_MIEP_1_CTRL_SHD_type *) 0xf00e591cu)	/* Memory Interface Extra Path 5 Control Internal Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int mi_ep_skip     : 1;	/* Skip Picture */
		unsigned int                : 1;
		unsigned int mi_ep_cfg_upd  : 1;	/* Forced Configuration Update */
		unsigned int                : 27;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_INIT_type;
#define CIF_MIEP_1_INIT	(*( CIF_MIEP_1_INIT_type *) 0xf00e5504u)	/* Memory Interface Extra Path 1 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_2_INIT	(*( CIF_MIEP_1_INIT_type *) 0xf00e5604u)	/* Memory Interface Extra Path 2 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_3_INIT	(*( CIF_MIEP_1_INIT_type *) 0xf00e5704u)	/* Memory Interface Extra Path 3 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_4_INIT	(*( CIF_MIEP_1_INIT_type *) 0xf00e5804u)	/* Memory Interface Extra Path 4 Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_5_INIT	(*( CIF_MIEP_1_INIT_type *) 0xf00e5904u)	/* Memory Interface Extra Path 5 Control Register For Address Init And Skip Function Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int ep_irq_offs_init: 22;	/* Extra Path Y IRQ Offset Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_IRQ_OFFS_INIT_type;
#define CIF_MIEP_1_IRQ_OFFS_INIT	(*( CIF_MIEP_1_IRQ_OFFS_INIT_type *) 0xf00e5518u)	/* Memory Interface Fill Level Interrupt Offset Value For Extra Path 1 Register */
#define CIF_MIEP_2_IRQ_OFFS_INIT	(*( CIF_MIEP_1_IRQ_OFFS_INIT_type *) 0xf00e5618u)	/* Memory Interface Fill Level Interrupt Offset Value For Extra Path 2 Register */
#define CIF_MIEP_3_IRQ_OFFS_INIT	(*( CIF_MIEP_1_IRQ_OFFS_INIT_type *) 0xf00e5718u)	/* Memory Interface Fill Level Interrupt Offset Value For Extra Path 3 Register */
#define CIF_MIEP_4_IRQ_OFFS_INIT	(*( CIF_MIEP_1_IRQ_OFFS_INIT_type *) 0xf00e5818u)	/* Memory Interface Fill Level Interrupt Offset Value For Extra Path 4 Register */
#define CIF_MIEP_5_IRQ_OFFS_INIT	(*( CIF_MIEP_1_IRQ_OFFS_INIT_type *) 0xf00e5918u)	/* Memory Interface Fill Level Interrupt Offset Value For Extra Path 5 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int ep_irq_offs    : 22;	/* Extra Path IRQ Offset */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_IRQ_OFFS_SHD_type;
#define CIF_MIEP_1_IRQ_OFFS_SHD	(*( CIF_MIEP_1_IRQ_OFFS_SHD_type *) 0xf00e552cu)	/* Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 1 Register */
#define CIF_MIEP_2_IRQ_OFFS_SHD	(*( CIF_MIEP_1_IRQ_OFFS_SHD_type *) 0xf00e562cu)	/* Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 2 Register */
#define CIF_MIEP_3_IRQ_OFFS_SHD	(*( CIF_MIEP_1_IRQ_OFFS_SHD_type *) 0xf00e572cu)	/* Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 3 Register */
#define CIF_MIEP_4_IRQ_OFFS_SHD	(*( CIF_MIEP_1_IRQ_OFFS_SHD_type *) 0xf00e582cu)	/* Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 4 Register */
#define CIF_MIEP_5_IRQ_OFFS_SHD	(*( CIF_MIEP_1_IRQ_OFFS_SHD_type *) 0xf00e592cu)	/* Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path 5 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int ep_offs_cnt_init: 22;	/* Extra Path Offset Counter Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_OFFS_CNT_INIT_type;
#define CIF_MIEP_1_OFFS_CNT_INIT	(*( CIF_MIEP_1_OFFS_CNT_INIT_type *) 0xf00e5510u)	/* Memory Interface Offset Counter Init Value For Extra Path 1 Buffer Register */
#define CIF_MIEP_2_OFFS_CNT_INIT	(*( CIF_MIEP_1_OFFS_CNT_INIT_type *) 0xf00e5610u)	/* Memory Interface Offset Counter Init Value For Extra Path 2 Buffer Register */
#define CIF_MIEP_3_OFFS_CNT_INIT	(*( CIF_MIEP_1_OFFS_CNT_INIT_type *) 0xf00e5710u)	/* Memory Interface Offset Counter Init Value For Extra Path 3 Buffer Register */
#define CIF_MIEP_4_OFFS_CNT_INIT	(*( CIF_MIEP_1_OFFS_CNT_INIT_type *) 0xf00e5810u)	/* Memory Interface Offset Counter Init Value For Extra Path 4 Buffer Register */
#define CIF_MIEP_5_OFFS_CNT_INIT	(*( CIF_MIEP_1_OFFS_CNT_INIT_type *) 0xf00e5910u)	/* Memory Interface Offset Counter Init Value For Extra Path 5 Buffer Register */

