svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int ep_offs_cnt    : 22;	/* Extra Path Y Offset Counter */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_OFFS_CNT_SHD_type;
#define CIF_MIEP_1_OFFS_CNT_SHD	(*( CIF_MIEP_1_OFFS_CNT_SHD_type *) 0xf00e5528u)	/* Memory Interface Current Offset Counter of Extra Path 1 Buffer Register */
#define CIF_MIEP_2_OFFS_CNT_SHD	(*( CIF_MIEP_1_OFFS_CNT_SHD_type *) 0xf00e5628u)	/* Memory Interface Current Offset Counter of Extra Path 2 Buffer Register */
#define CIF_MIEP_3_OFFS_CNT_SHD	(*( CIF_MIEP_1_OFFS_CNT_SHD_type *) 0xf00e5728u)	/* Memory Interface Current Offset Counter of Extra Path 3 Buffer Register */
#define CIF_MIEP_4_OFFS_CNT_SHD	(*( CIF_MIEP_1_OFFS_CNT_SHD_type *) 0xf00e5828u)	/* Memory Interface Current Offset Counter of Extra Path 4 Buffer Register */
#define CIF_MIEP_5_OFFS_CNT_SHD	(*( CIF_MIEP_1_OFFS_CNT_SHD_type *) 0xf00e5928u)	/* Memory Interface Current Offset Counter of Extra Path 5 Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int ep_offs_cnt_start: 22;	/* Extra Path Offset Counter Start */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_OFFS_CNT_START_type;
#define CIF_MIEP_1_OFFS_CNT_START	(*( CIF_MIEP_1_OFFS_CNT_START_type *) 0xf00e5514u)	/* Memory Interface Offset Counter Start Value For Extra Path 1 Register */
#define CIF_MIEP_2_OFFS_CNT_START	(*( CIF_MIEP_1_OFFS_CNT_START_type *) 0xf00e5614u)	/* Memory Interface Offset Counter Start Value For Extra Path 2 Register */
#define CIF_MIEP_3_OFFS_CNT_START	(*( CIF_MIEP_1_OFFS_CNT_START_type *) 0xf00e5714u)	/* Memory Interface Offset Counter Start Value For Extra Path 3 Register */
#define CIF_MIEP_4_OFFS_CNT_START	(*( CIF_MIEP_1_OFFS_CNT_START_type *) 0xf00e5814u)	/* Memory Interface Offset Counter Start Value For Extra Path 4 Register */
#define CIF_MIEP_5_OFFS_CNT_START	(*( CIF_MIEP_1_OFFS_CNT_START_type *) 0xf00e5914u)	/* Memory Interface Offset Counter Start Value For Extra Path 5 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int ep_size_init   : 22;	/* Extra Path Size Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_SIZE_INIT_type;
#define CIF_MIEP_1_SIZE_INIT	(*( CIF_MIEP_1_SIZE_INIT_type *) 0xf00e550cu)	/* Memory Interface Size of Extra Path 1 Data Buffer Register */
#define CIF_MIEP_2_SIZE_INIT	(*( CIF_MIEP_1_SIZE_INIT_type *) 0xf00e560cu)	/* Memory Interface Size of Extra Path 2 Data Buffer Register */
#define CIF_MIEP_3_SIZE_INIT	(*( CIF_MIEP_1_SIZE_INIT_type *) 0xf00e570cu)	/* Memory Interface Size of Extra Path 3 Data Buffer Register */
#define CIF_MIEP_4_SIZE_INIT	(*( CIF_MIEP_1_SIZE_INIT_type *) 0xf00e580cu)	/* Memory Interface Size of Extra Path 4 Data Buffer Register */
#define CIF_MIEP_5_SIZE_INIT	(*( CIF_MIEP_1_SIZE_INIT_type *) 0xf00e590cu)	/* Memory Interface Size of Extra Path 5 Data Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int ep_size        : 22;	/* Extra Path Size */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_1_SIZE_SHD_type;
#define CIF_MIEP_1_SIZE_SHD	(*( CIF_MIEP_1_SIZE_SHD_type *) 0xf00e5524u)	/* Memory Interface Size Shadow Register of Extra Path 1 Buffer Register */
#define CIF_MIEP_2_SIZE_SHD	(*( CIF_MIEP_1_SIZE_SHD_type *) 0xf00e5624u)	/* Memory Interface Size Shadow Register of Extra Path 2 Buffer Register */
#define CIF_MIEP_3_SIZE_SHD	(*( CIF_MIEP_1_SIZE_SHD_type *) 0xf00e5724u)	/* Memory Interface Size Shadow Register of Extra Path 3 Buffer Register */
#define CIF_MIEP_4_SIZE_SHD	(*( CIF_MIEP_1_SIZE_SHD_type *) 0xf00e5824u)	/* Memory Interface Size Shadow Register of Extra Path 4 Buffer Register */
#define CIF_MIEP_5_SIZE_SHD	(*( CIF_MIEP_1_SIZE_SHD_type *) 0xf00e5924u)	/* Memory Interface Size Shadow Register of Extra Path 5 Buffer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int frame_end_ep_1 : 1;	/* Extra Path 1 Frame End */
		unsigned int fill_ep_1      : 1;	/* Fill Extra Path 1 */
		unsigned int wrap_ep_1      : 1;	/* Wrap Extra Path 1 */
		unsigned int mblk_line_ep_1 : 1;	/* Macro Block Line Interrupt Extra Path 1 */
		unsigned int frame_end_ep_2 : 1;	/* Extra Path 2 Frame End */
		unsigned int fill_ep_2      : 1;	/* Fill Extra Path 2 */
		unsigned int wrap_ep_2      : 1;	/* Wrap Extra Path 2 */
		unsigned int                : 1;
		unsigned int frame_end_ep_3 : 1;	/* Extra Path 3 Frame End */
		unsigned int fill_ep_3      : 1;	/* Fill Extra Path 3 */
		unsigned int wrap_ep_3      : 1;	/* Wrap Extra Path 3 */
		unsigned int mblk_line_ep_3 : 1;	/* Macro Block Line Interrupt Extra Path 3 */
		unsigned int frame_end_ep_4 : 1;	/* Extra Path 4 Frame End */
		unsigned int fill_ep_4      : 1;	/* Fill Extra Path 4 */
		unsigned int wrap_ep_4      : 1;	/* Wrap Extra Path 4 */
		unsigned int mblk_line_ep_4 : 1;	/* Macro Block Line Interrupt Extra Path 4 */
		unsigned int frame_end_ep_5 : 1;	/* Extra Path 5 Frame End */
		unsigned int fill_ep_5      : 1;	/* Fill Extra Path 5 */
		unsigned int wrap_ep_5      : 1;	/* Wrap Extra Path 5 */
		unsigned int mblk_line_ep_5 : 1;	/* Macro Block Line Interrupt Extra Path 5 */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_ICR_type;
#define CIF_MIEP_ICR	(*( CIF_MIEP_ICR_type *) 0xf00e5414u)	/* MI Extra Path Interrupt Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int frame_end_ep_1 : 1;	/* Extra Path 1 Frame End */
		unsigned int fill_ep_1      : 1;	/* Fill Extra Path 1 */
		unsigned int wrap_ep_1      : 1;	/* Wrap Extra Path 1 */
		unsigned int mblk_line_ep_1 : 1;	/* Macro Block Line Interrupt Extra Path 1 */
		unsigned int frame_end_ep_2 : 1;	/* Extra Path 2 Frame End */
		unsigned int fill_ep_2      : 1;	/* Fill Extra Path 2 */
		unsigned int wrap_ep_2      : 1;	/* Wrap Extra Path 2 */
		unsigned int mblk_line_ep_2 : 1;	/* Macro Block Line Interrupt Extra Path 2 */
		unsigned int frame_end_ep_3 : 1;	/* Extra Path 3 Frame End */
		unsigned int fill_ep_3      : 1;	/* Fill Extra Path 3 */
		unsigned int wrap_ep_3      : 1;	/* Wrap Extra Path 3 */
		unsigned int mblk_line_ep_3 : 1;	/* Macro Block Line Interrupt Extra Path 3 */
		unsigned int frame_end_ep_4 : 1;	/* Extra Path 4 Frame End */
		unsigned int fill_ep_4      : 1;	/* Fill Extra Path 4 */
		unsigned int wrap_ep_4      : 1;	/* Wrap Extra Path 4 */
		unsigned int mblk_line_ep_4 : 1;	/* Macro Block Line Interrupt Extra Path 4 */
		unsigned int frame_end_ep_5 : 1;	/* Extra Path 5 Frame End */
		unsigned int fill_ep_5      : 1;	/* Fill Extra Path 5 */
		unsigned int wrap_ep_5      : 1;	/* Wrap Extra Path 5 */
		unsigned int mblk_line_ep_5 : 1;	/* Macro Block Line Interrupt Extra Path 5 */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

