svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} CIF_MIEP_IMSC_type;
#define CIF_MIEP_IMSC	(*( CIF_MIEP_IMSC_type *) 0xf00e5408u)	/* MI Extra Path Interrupt Mask ?1?: interrupt active, ?0?: interrupt masked */

typedef volatile union
{
	struct
	{ 
		unsigned int frame_end_ep_1 : 1;	/* Extra Path 1 Frame End */
		unsigned int fill_ep_1      : 1;	/* Fill Extra Path 1 */
		unsigned int wrap_ep_1      : 1;	/* Wrap Extra Path 1 */
		unsigned int mblk_line_ep_1 : 1;	/* Macro Block Line Interrupt Extra Path 1 */
		unsigned int frame_end_ep_2 : 1;	/* Extra Path 2 Frame End */
		unsigned int fill_ep_2      : 1;	/* Fill Extra Path 2 */
		unsigned int wrap_ep_2      : 1;	/* Wrap Extra Path 2 */
		unsigned int mblk_line_ep_2 : 1;	/* Macro Block Line Interrupt Extra Path 2 */
		unsigned int frame_end_ep_3 : 1;	/* Extra Path 3 Frame End */
		unsigned int fill_ep_3      : 1;	/* Fill Extra Path 3 */
		unsigned int wrap_ep_3      : 1;	/* Wrap Extra Path 3 */
		unsigned int mblk_line_ep_3 : 1;	/* Macro Block Line Interrupt Extra Path 3 */
		unsigned int frame_end_ep_4 : 1;	/* Extra Path 4 Frame End */
		unsigned int fill_ep_4      : 1;	/* Fill Extra Path 4 */
		unsigned int wrap_ep_4      : 1;	/* Wrap Extra Path 4 */
		unsigned int mblk_line_ep_4 : 1;	/* Macro Block Line Interrupt Extra Path 4 */
		unsigned int frame_end_ep_5 : 1;	/* Extra Path 5 Frame End */
		unsigned int fill_ep_5      : 1;	/* Fill Extra Path 5 */
		unsigned int wrap_ep_5      : 1;	/* Wrap Extra Path 5 */
		unsigned int mblk_line_ep_5 : 1;	/* Macro Block Line Interrupt Extra Path 5 */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_ISR_type;
#define CIF_MIEP_ISR	(*( CIF_MIEP_ISR_type *) 0xf00e5418u)	/* MI Extra Path Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int frame_end_ep_1 : 1;	/* Extra Path 1 Frame End */
		/* const */ unsigned int fill_ep_1      : 1;	/* Fill Extra Path 1 */
		/* const */ unsigned int wrap_ep_1      : 1;	/* Wrap Extra Path 1 */
		/* const */ unsigned int mblk_line_ep_1 : 1;	/* Macro Block Line Interrupt Extra Path 1 */
		/* const */ unsigned int frame_end_ep_2 : 1;	/* Extra Path 2 Frame End */
		/* const */ unsigned int fill_ep_2      : 1;	/* Fill Extra Path 2 */
		/* const */ unsigned int wrap_ep_2      : 1;	/* Wrap Extra Path 2 */
		/* const */ unsigned int mblk_line_ep_2 : 1;	/* Macro Block Line Interrupt Extra Path 2 */
		/* const */ unsigned int frame_end_ep_3 : 1;	/* Extra Path 3 Frame End */
		/* const */ unsigned int fill_ep_3      : 1;	/* Fill Extra Path 3 */
		/* const */ unsigned int wrap_ep_3      : 1;	/* Wrap Extra Path 3 */
		/* const */ unsigned int mblk_line_ep_3 : 1;	/* Macro Block Line Interrupt Extra Path 3 */
		/* const */ unsigned int frame_end_ep_4 : 1;	/* Extra Path 4 Frame End */
		/* const */ unsigned int fill_ep_4      : 1;	/* Fill Extra Path 4 */
		/* const */ unsigned int wrap_ep_4      : 1;	/* Wrap Extra Path 4 */
		/* const */ unsigned int mblk_line_ep_4 : 1;	/* Macro Block Line Interrupt Extra Path 4 */
		/* const */ unsigned int frame_end_ep_5 : 1;	/* Extra Path 5 Frame End */
		/* const */ unsigned int fill_ep_5      : 1;	/* Fill Extra Path 5 */
		/* const */ unsigned int wrap_ep_5      : 1;	/* Wrap Extra Path 5 */
		/* const */ unsigned int mblk_line_ep_5 : 1;	/* Macro Block Line Interrupt Extra Path 5 */
		/* const */ unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_MIS_type;
#define CIF_MIEP_MIS	(*( CIF_MIEP_MIS_type *) 0xf00e5410u)	/* MI Extra Path Masked Interrupt Status Register */
#define CIF_MIEP_RIS	(*( CIF_MIEP_MIS_type *) 0xf00e540cu)	/* MI Extra Path Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 1;
		/* const */ unsigned int ep_1_ic_size_err: 1;	/* Size error is generated in Extra Path 1 image cropping submodule */
		/* const */ unsigned int ep_2_ic_size_err: 1;	/* Size error is generated in Extra Path 2 image cropping submodule */
		/* const */ unsigned int ep_3_ic_size_err: 1;	/* Size error is generated in Extra Path 3 image cropping submodule */
		/* const */ unsigned int ep_4_ic_size_err: 1;	/* Size error is generated in Extra Path 4 image cropping submodule */
		/* const */ unsigned int ep_5_ic_size_err: 1;	/* Size error is generated in Extra Path 5 image cropping submodule */
		/* const */ unsigned int                : 11;
		/* const */ unsigned int ep_1_fifo_full : 1;	/* Extra Path 1 FIFO Full */
		/* const */ unsigned int ep_2_fifo_full : 1;	/* Extra Path 2 FIFO Full */
		/* const */ unsigned int ep_3_fifo_full : 1;	/* Extra Path 3 FIFO Full */
		/* const */ unsigned int ep_4_fifo_full : 1;	/* Extra Path 4 FIFO Full */
		/* const */ unsigned int ep_5_fifo_full : 1;	/* Extra Path 5 FIFO Full */
		/* const */ unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_STA_ERR_type;
#define CIF_MIEP_STA_ERR	(*( CIF_MIEP_STA_ERR_type *) 0xf00e5400u)	/* Extra Path Error Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int ep_1_ic_size_err_clr: 1;	/* Size error is cleared */
		unsigned int ep_2_ic_size_err_clr: 1;	/* Size error is cleared */
		unsigned int ep_3_ic_size_err_clr: 1;	/* Size error is cleared */
		unsigned int ep_4_ic_size_err_clr: 1;	/* Size error is cleared */
		unsigned int ep_5_ic_size_err_clr: 1;	/* Size error is cleared */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} CIF_MIEP_STA_ERR_CLR_type;
#define CIF_MIEP_STA_ERR_CLR	(*( CIF_MIEP_STA_ERR_CLR_type *) 0xf00e5404u)	/* Extra Path Error Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int byte_cnt       : 24;	/* Byte Count */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_BYTE_CNT_type;
#define CIF_MI_BYTE_CNT	(*( CIF_MI_BYTE_CNT_type *) 0xf00e3470u)	/* Memory Interface Counter Value of JPEG or RAW Data Bytes Register */

