svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int mp_enable      : 1;	/* Enables main picture data path */
		unsigned int                : 1;
		unsigned int jpeg_enable    : 1;	/* Enables JPEG data */
		unsigned int raw_enable     : 1;	/* Enables RAW data */
		unsigned int                : 3;
		unsigned int byte_swap      : 1;	/* Byte Swap Enable */
		unsigned int                : 8;
		unsigned int burst_len_lum  : 1;	/* Luminance Burst Length */
		unsigned int                : 1;
		unsigned int burst_len_chrom: 1;	/* Chrominance Burst Length */
		unsigned int                : 1;
		unsigned int init_base_en   : 1;	/* Init Base Address Enable */
		unsigned int init_offset_en : 1;	/* Init Offset Counter Enable */
		unsigned int mp_write_format: 2;	/* Main Picture YCbCr Write Format */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_CTRL_type;
#define CIF_MI_CTRL	(*( CIF_MI_CTRL_type *) 0xf00e3400u)	/* Memory Interface Global Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int mp_enable_in   : 1;	/* Main Picture In Enable */
		/* const */ unsigned int                : 3;
		/* const */ unsigned int jpeg_enable_in : 1;	/* JPEG In Enable */
		/* const */ unsigned int raw_enable_in  : 1;	/* RAW In Enable */
		/* const */ unsigned int                : 10;
		/* const */ unsigned int mp_enable_out  : 1;	/* Main Picture Out Enable */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int jpeg_enable_out: 1;	/* JPEG Out Enable */
		/* const */ unsigned int raw_enable_out : 1;	/* RAW Out Enable */
		/* const */ unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CIF_MI_CTRL_SHD_type;
#define CIF_MI_CTRL_SHD	(*( CIF_MI_CTRL_SHD_type *) 0xf00e3474u)	/* Memory Interface Global Control Internal Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int mp_frame_end   : 1;	/* Main Picture Frame End */
		unsigned int                : 1;
		unsigned int mblk_line      : 1;	/* Macro Block Line Interrupt */
		unsigned int fill_mpy       : 1;	/* Fill Main Picture Y */
		unsigned int wrap_mp_y      : 1;	/* Wrap Main Picture Y */
		unsigned int wrap_mp_cb     : 1;	/* Wrap Main Picture Cb */
		unsigned int wrap_mp_cr     : 1;	/* Wrap Main Picture Cr */
		unsigned int                : 3;
		unsigned int Bus_error      : 1;	/* Bus Error */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_MI_ICR_type;
#define CIF_MI_ICR	(*( CIF_MI_ICR_type *) 0xf00e3504u)	/* MI Interrupt Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int mp_frame_end   : 1;	/* Main Picture Frame End */
		unsigned int                : 1;
		unsigned int mblk_line      : 1;	/* Macro Block Line Interrupt */
		unsigned int fill_mp_y      : 1;	/* Fill Main Picture Y */
		unsigned int wrap_mp_y      : 1;	/* Wrap Main Picture Y */
		unsigned int wrap_mp_cb     : 1;	/* Wrap Main Picture Cb */
		unsigned int wrap_mp_cr     : 1;	/* Wrap Main Picture Cr */
		unsigned int                : 3;
		unsigned int Bus_error      : 1;	/* Bus Error */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_MI_IMSC_type;
#define CIF_MI_IMSC	(*( CIF_MI_IMSC_type *) 0xf00e34f8u)	/* MI Interrupt Mask ?1? interrupt active ?0? interrupt masked */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int mi_skip        : 1;	/* Skip Picture */
		unsigned int                : 1;
		unsigned int mi_cfg_upd     : 1;	/* Forced Configuration Update */
		unsigned int                : 27;
	} B;
	int I;
	unsigned int U;

} CIF_MI_INIT_type;
#define CIF_MI_INIT	(*( CIF_MI_INIT_type *) 0xf00e3404u)	/* Memory Interface Control Register For Address Init And Skip Function Register */

typedef volatile union
{
	struct
	{ 
		unsigned int mp_frame_end   : 1;	/* Main Picture Frame End */
		unsigned int                : 1;
		unsigned int mblk_line      : 1;	/* Macro Block Line Interrupt */
		unsigned int fill_mp_y      : 1;	/* Fill Main Picture Y */
		unsigned int wrap_mp_y      : 1;	/* Wrap Main Picture Y */
		unsigned int wrap_mp_cb     : 1;	/* Wrap Main Picture Cb */
		unsigned int wrap_mp_cr     : 1;	/* Wrap Main Picture Cr */
		unsigned int                : 3;
		unsigned int Bus_error      : 1;	/* Bus Error */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_MI_ISR_type;
#define CIF_MI_ISR	(*( CIF_MI_ISR_type *) 0xf00e3508u)	/* MI Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int mp_frame_end   : 1;	/* Main Picture Frame End */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int mblk_line      : 1;	/* Macro Block Line Interrupt */
		/* const */ unsigned int fill_mp_y      : 1;	/* Fill Main Picture Y */
		/* const */ unsigned int wrap_mp_y      : 1;	/* Wrap Main Picture Y */
		/* const */ unsigned int wrap_mp_cb     : 1;	/* Wrap Main Picture Cb */
		/* const */ unsigned int wrap_mp_cr     : 1;	/* Wrap Main Picture Cr */
		/* const */ unsigned int                : 3;
		/* const */ unsigned int Bus_error      : 1;	/* Bus Error */
		/* const */ unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MIS_type;
#define CIF_MI_MIS	(*( CIF_MI_MIS_type *) 0xf00e3500u)	/* MI Masked Interrupt Status Registe */
#define CIF_MI_RIS	(*( CIF_MI_MIS_type *) 0xf00e34fcu)	/* MI Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_cb_basead_init: 30;	/* Main Picture Cb Base Address Init */
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_BASE_AD_INIT_type;
#define CIF_MI_MP_CB_BASE_AD_INIT	(*( CIF_MI_MP_CB_BASE_AD_INIT_type *) 0xf00e341cu)	/* Memory Interface Base Address For Main Picture Cb Component Ring Buffer Register */

