svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cb_base_ad  : 30;	/* Main Picture Cb Base Address */
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_BASE_AD_SHD_type;
#define CIF_MI_MP_CB_BASE_AD_SHD	(*( CIF_MI_MP_CB_BASE_AD_SHD_type *) 0xf00e3488u)	/* Memory Interface Base Address Shadow Register For Main Picture Cb Component Ring Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_cb_offs_cnt_init: 22;	/* Main Picture Cb Offset Counter Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_OFFS_CNT_INIT_type;
#define CIF_MI_MP_CB_OFFS_CNT_INIT	(*( CIF_MI_MP_CB_OFFS_CNT_INIT_type *) 0xf00e3424u)	/* Memory Interface Offset Counter Init Value For Main Picture Cb Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cb_offs_cnt : 22;	/* Main Picture Cb Offset Counter */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_OFFS_CNT_SHD_type;
#define CIF_MI_MP_CB_OFFS_CNT_SHD	(*( CIF_MI_MP_CB_OFFS_CNT_SHD_type *) 0xf00e3490u)	/* Memory Interface Current Offset Counter Of Main Picture Cb Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cb_offs_cnt_start: 22;	/* Main Picture Cb Offset Count Start */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_OFFS_CNT_START_type;
#define CIF_MI_MP_CB_OFFS_CNT_START	(*( CIF_MI_MP_CB_OFFS_CNT_START_type *) 0xf00e3428u)	/* Memory Interface Offset Counter Start Value For Main Picture Cb Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_cb_size_init: 22;	/* Main Picture Cb Size Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_SIZE_INIT_type;
#define CIF_MI_MP_CB_SIZE_INIT	(*( CIF_MI_MP_CB_SIZE_INIT_type *) 0xf00e3420u)	/* Memory Interface Size Of Main Picture Cb Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cb_size     : 22;	/* Main Picture Cb Size */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CB_SIZE_SHD_type;
#define CIF_MI_MP_CB_SIZE_SHD	(*( CIF_MI_MP_CB_SIZE_SHD_type *) 0xf00e348cu)	/* Memory Interface Size Shadow Register Of Main Picture Cb Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_cr_base_ad_init: 30;	/* Main Picture Cr Base Address Init */
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_BASE_AD_INIT_type;
#define CIF_MI_MP_CR_BASE_AD_INIT	(*( CIF_MI_MP_CR_BASE_AD_INIT_type *) 0xf00e342cu)	/* Memory Interface Base Address For Main Picture Cr Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cr_base_ad  : 30;	/* Main Picture Cr Base Address */
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_BASE_AD_SHD_type;
#define CIF_MI_MP_CR_BASE_AD_SHD	(*( CIF_MI_MP_CR_BASE_AD_SHD_type *) 0xf00e3494u)	/* Memory Interface Base Address Shadow Register For Main Picture Cr Component Ring Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_cr_offs_cnt_init: 22;	/* Main Picture Cr Offset Counter Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_OFFS_CNT_INIT_type;
#define CIF_MI_MP_CR_OFFS_CNT_INIT	(*( CIF_MI_MP_CR_OFFS_CNT_INIT_type *) 0xf00e3434u)	/* Memory Interface Offset Counter Init value For Main Picture Cr Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cr_offs_cnt : 22;	/* Main Picture Cr Offset Counter */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_OFFS_CNT_SHD_type;
#define CIF_MI_MP_CR_OFFS_CNT_SHD	(*( CIF_MI_MP_CR_OFFS_CNT_SHD_type *) 0xf00e349cu)	/* Memory Interface Current Offset Counter Of Main Picture Cr Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cr_offs_cnt_start: 22;	/* Main Picture Cr Offset Counter Start */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_OFFS_CNT_START_type;
#define CIF_MI_MP_CR_OFFS_CNT_START	(*( CIF_MI_MP_CR_OFFS_CNT_START_type *) 0xf00e3438u)	/* Memory Interface Offset Counter Start Value For Main Picture Cr Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_cr_size_init: 22;	/* Main Picture Cr Size Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_SIZE_INIT_type;
#define CIF_MI_MP_CR_SIZE_INIT	(*( CIF_MI_MP_CR_SIZE_INIT_type *) 0xf00e3430u)	/* Memory Interface Size Of Main Picture Cr Component Ring Buffer Register */

