svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_cr_size     : 22;	/* Main Picture Cr Size */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_CR_SIZE_SHD_type;
#define CIF_MI_MP_CR_SIZE_SHD	(*( CIF_MI_MP_CR_SIZE_SHD_type *) 0xf00e3498u)	/* Memory Interface Size Shadow Register Of Main Picture Cr Component Ring Buffer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_y_base_ad_init: 30;	/* Main Picture Y Base Address Init */
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_BASE_AD_INIT_type;
#define CIF_MI_MP_Y_BASE_AD_INIT	(*( CIF_MI_MP_Y_BASE_AD_INIT_type *) 0xf00e3408u)	/* Memory Interface Base Address For Main Picture Y Component, JPEG or RAW Data Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_y_base_ad   : 30;	/* Main Picture Y Base Address */
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_BASE_AD_SHD_type;
#define CIF_MI_MP_Y_BASE_AD_SHD	(*( CIF_MI_MP_Y_BASE_AD_SHD_type *) 0xf00e3478u)	/* Memory Interface Base Address Shadow Register For Main Picture Y Component, JPEG Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_y_irq_offs_init: 22;	/* Main Picture Y IRQ Offset Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_IRQ_OFFS_INIT_type;
#define CIF_MI_MP_Y_IRQ_OFFS_INIT	(*( CIF_MI_MP_Y_IRQ_OFFS_INIT_type *) 0xf00e3418u)	/* Memory Interface Fill Level Interrupt Offset Value For Main Picture Y, JPEG or RAW Data Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_y_irq_offs  : 22;	/* Main Picture Y IRQ Offset */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_IRQ_OFFS_SHD_type;
#define CIF_MI_MP_Y_IRQ_OFFS_SHD	(*( CIF_MI_MP_Y_IRQ_OFFS_SHD_type *) 0xf00e3484u)	/* Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Main Picture Y Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_y_offs_cnt_init: 22;	/* Main Picture Y Offset Counter Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_OFFS_CNT_INIT_type;
#define CIF_MI_MP_Y_OFFS_CNT_INIT	(*( CIF_MI_MP_Y_OFFS_CNT_INIT_type *) 0xf00e3410u)	/* Memory Interface Offset Counter Init Value For Main Picture Y, JPEG or RAW Data Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_y_offs_cnt  : 22;	/* Main Picture Y Offset Counter */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_OFFS_CNT_SHD_type;
#define CIF_MI_MP_Y_OFFS_CNT_SHD	(*( CIF_MI_MP_Y_OFFS_CNT_SHD_type *) 0xf00e3480u)	/* Memory Interface Current Offset Counter of Main Picture Y Component JPEG or RAW Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_y_offs_cnt_start: 22;	/* Main Picture Y Offset Counter Start */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_OFFS_CNT_START_type;
#define CIF_MI_MP_Y_OFFS_CNT_START	(*( CIF_MI_MP_Y_OFFS_CNT_START_type *) 0xf00e3414u)	/* Memory Interface Offset Counter Start Value For Main Picture Y, JPEG or RAW Data Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		unsigned int mp_y_size_init : 22;	/* Main Picture Y Size Init */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_SIZE_INIT_type;
#define CIF_MI_MP_Y_SIZE_INIT	(*( CIF_MI_MP_Y_SIZE_INIT_type *) 0xf00e340cu)	/* Memory Interface Size of main picture Y component, JPEG or RAW data Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int fixed_to_00    : 2;	/* Bits [1:0] are set to '00' (word aligned value). */
		/* const */ unsigned int mp_y_size      : 22;	/* Main Picture Y Size */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CIF_MI_MP_Y_SIZE_SHD_type;
#define CIF_MI_MP_Y_SIZE_SHD	(*( CIF_MI_MP_Y_SIZE_SHD_type *) 0xf00e347cu)	/* Memory Interface Size Shadow Register of Main Picture Y Component,JPEG or RAW Data Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int mp_y_fifo_full : 1;	/* Main Picture Y FIFO Full */
		/* const */ unsigned int mp_cb_fifo_full: 1;	/* Main Picture Cb FIFO Full */
		/* const */ unsigned int mp_cr_fifo_full: 1;	/* Main Picture Cr FIFO Full */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int Bus_write_error: 1;	/* Bus Write Error */
		/* const */ unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} CIF_MI_STATUS_type;
#define CIF_MI_STATUS	(*( CIF_MI_STATUS_type *) 0xf00e350cu)	/* MI Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int mp_y_fifo_full : 1;	/* Main Picture Y FIFO Full */
		unsigned int mp_cb_fifo_full: 1;	/* Main Picture Cb FIFO Full */
		unsigned int mp_cr_fifo_full: 1;	/* Main Picture Cr FIFO Full */
		unsigned int                : 5;
		unsigned int Bus_write_error: 1;	/* Bus Write Error */
		unsigned int                : 15;
		unsigned int ep_1_fifo_full : 1;	/* Extra Path 1 FIFO Full */
		unsigned int ep_2_fifo_full : 1;	/* Extra Path 2 FIFO Full */
		unsigned int ep_3_fifo_full : 1;	/* Extra Path 3 FIFO Full */
		unsigned int ep_4_fifo_full : 1;	/* Extra Path 4 FIFO Full */
		unsigned int ep_5_fifo_full : 1;	/* Extra Path 5 FIFO Full */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} CIF_MI_STATUS_CLR_type;
#define CIF_MI_STATUS_CLR	(*( CIF_MI_STATUS_CLR_type *) 0xf00e3510u)	/* MI Status Clear Register */

