svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int wd_en          : 1;	/* Enable Security Watchdog */
		unsigned int rst_h_cnt      : 1;	/* Reset Horizontal Counter */
		unsigned int rst_v_cnt      : 1;	/* Reset Vertical Counter */
		unsigned int rst_pd_cnt     : 1;	/* Reset Predivider Counter */
		unsigned int                : 12;
		unsigned int wd_prediv      : 16;	/* Watchdog Counter Predivider */
	} B;
	int I;
	unsigned int U;

} CIF_WD_CTRL_type;
#define CIF_WD_CTRL	(*( CIF_WD_CTRL_type *) 0xf00e4400u)	/* Watchdog Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int wd_hse_to      : 16;	/* Watchdog Horizontal Start End Timeout */
		unsigned int wd_hes_to      : 16;	/* Watchdog Horizontal End Start Timeout */
	} B;
	int I;
	unsigned int U;

} CIF_WD_H_TIMEOUT_type;
#define CIF_WD_H_TIMEOUT	(*( CIF_WD_H_TIMEOUT_type *) 0xf00e4408u)	/* Watchdog Horizontal Timeout Register */

typedef volatile union
{
	struct
	{ 
		unsigned int icr_wd_hse_to  : 1;	/* Horizontal Start End Timeout */
		unsigned int icr_wd_hes_to  : 1;	/* Horizontal End Start Timeout */
		unsigned int icr_wd_vse_to  : 1;	/* Vertical Start End Timeout */
		unsigned int icr_wd_ves_to  : 1;	/* Vertical End Start Timeout */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CIF_WD_ICR_type;
#define CIF_WD_ICR	(*( CIF_WD_ICR_type *) 0xf00e4418u)	/* Watchdog Interrupt Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int imsc_wd_hse_to : 1;	/* Horizontal Start End Timeout */
		unsigned int imsc_wd_hes_to : 1;	/* Horizontal End Start Timeout */
		unsigned int imsc_wd_vse_to : 1;	/* Vertical Start End Timeout */
		unsigned int imsc_wd_ves_to : 1;	/* Vertical End Start Timeout */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CIF_WD_IMSC_type;
#define CIF_WD_IMSC	(*( CIF_WD_IMSC_type *) 0xf00e440cu)	/* Watchdog Interrupt Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int isr_wd_hse_to  : 1;	/* Horizontal Start End Timeout */
		unsigned int isr_wd_hes_to  : 1;	/* Horizontal End Start Timeout */
		unsigned int isr_wd_vse_to  : 1;	/* Vertical Start End Timeout */
		unsigned int isr_wd_ves_to  : 1;	/* Vertical End Start Timeout */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CIF_WD_ISR_type;
#define CIF_WD_ISR	(*( CIF_WD_ISR_type *) 0xf00e441cu)	/* Watchdog Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int mis_wd_hse_to  : 1;	/* Horizontal Start End Timeout */
		/* const */ unsigned int mis_wd_hes_to  : 1;	/* Horizontal End Start Timeout */
		/* const */ unsigned int mis_wd_vse_to  : 1;	/* Vertical Start End Timeout */
		/* const */ unsigned int mis_wd_ves_to  : 1;	/* Vertical End Start Timeout */
		/* const */ unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CIF_WD_MIS_type;
#define CIF_WD_MIS	(*( CIF_WD_MIS_type *) 0xf00e4414u)	/* Watchdog Masked Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ris_wd_hse_to  : 1;	/* Horizontal Start End Timeout */
		/* const */ unsigned int ris_wd_hes_to  : 1;	/* Horizontal End Start Timeout */
		/* const */ unsigned int ris_wd_vse_to  : 1;	/* Vertical Start End Timeout */
		/* const */ unsigned int ris_wd_ves_to  : 1;	/* Vertical End Start Timeout */
		/* const */ unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CIF_WD_RIS_type;
#define CIF_WD_RIS	(*( CIF_WD_RIS_type *) 0xf00e4410u)	/* Watchdog Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int wd_vse_to      : 16;	/* Watchdog Vertical Start End Timeout */
		unsigned int wd_ves_to      : 16;	/* Watchdog Vertical End Start Timeout */
	} B;
	int I;
	unsigned int U;

} CIF_WD_V_TIMEOUT_type;
#define CIF_WD_V_TIMEOUT	(*( CIF_WD_V_TIMEOUT_type *) 0xf00e4404u)	/* Watchdog Vertical Timeout Register */


/* CCU6 */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} CCU60_ACCEN0_type;
#define CCU60_ACCEN0	(*( CCU60_ACCEN0_type *) 0xf0002afcu)	/* Access Enable Register 0 */
#define CCU61_ACCEN0	(*( CCU60_ACCEN0_type *) 0xf0002bfcu)	/* Access Enable Register 0 */
#define CCU62_ACCEN0	(*( CCU60_ACCEN0_type *) 0xf0002cfcu)	/* Access Enable Register 0 */
#define CCU63_ACCEN0	(*( CCU60_ACCEN0_type *) 0xf0002dfcu)	/* Access Enable Register 0 */

