svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CCU60_ACCEN1_type;
#define CCU60_ACCEN1	(*( CCU60_ACCEN1_type *) 0xf0002af8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CCV            : 16;	/* Capture/Compare Value */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_CC60R_type;
#define CCU60_CC60R	(*( CCU60_CC60R_type *) 0xf0002a30u)	/* Capture/Compare Register for Channel CC60 */
#define CCU60_CC61R	(*( CCU60_CC60R_type *) 0xf0002a34u)	/* Capture/Compare Register for Channel CC61 */
#define CCU60_CC62R	(*( CCU60_CC60R_type *) 0xf0002a38u)	/* Capture/Compare Register for Channel CC62 */
#define CCU61_CC60R	(*( CCU60_CC60R_type *) 0xf0002b30u)	/* Capture/Compare Register for Channel CC60 */
#define CCU61_CC61R	(*( CCU60_CC60R_type *) 0xf0002b34u)	/* Capture/Compare Register for Channel CC61 */
#define CCU61_CC62R	(*( CCU60_CC60R_type *) 0xf0002b38u)	/* Capture/Compare Register for Channel CC62 */
#define CCU62_CC60R	(*( CCU60_CC60R_type *) 0xf0002c30u)	/* Capture/Compare Register for Channel CC60 */
#define CCU62_CC61R	(*( CCU60_CC60R_type *) 0xf0002c34u)	/* Capture/Compare Register for Channel CC61 */
#define CCU62_CC62R	(*( CCU60_CC60R_type *) 0xf0002c38u)	/* Capture/Compare Register for Channel CC62 */
#define CCU63_CC60R	(*( CCU60_CC60R_type *) 0xf0002d30u)	/* Capture/Compare Register for Channel CC60 */
#define CCU63_CC61R	(*( CCU60_CC60R_type *) 0xf0002d34u)	/* Capture/Compare Register for Channel CC61 */
#define CCU63_CC62R	(*( CCU60_CC60R_type *) 0xf0002d38u)	/* Capture/Compare Register for Channel CC62 */

typedef volatile union
{
	struct
	{ 
		unsigned int CCS            : 16;	/* Shadow Register for Channel x Capture/Compare Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_CC60SR_type;
#define CCU60_CC60SR	(*( CCU60_CC60SR_type *) 0xf0002a40u)	/* Capture/Compare Shadow Reg. for Channel CC60 */
#define CCU60_CC61SR	(*( CCU60_CC60SR_type *) 0xf0002a44u)	/* Capture/Compare Shadow Reg. for Channel CC61 */
#define CCU60_CC62SR	(*( CCU60_CC60SR_type *) 0xf0002a48u)	/* Capture/Compare Shadow Reg. for Channel CC62 */
#define CCU61_CC60SR	(*( CCU60_CC60SR_type *) 0xf0002b40u)	/* Capture/Compare Shadow Reg. for Channel CC60 */
#define CCU61_CC61SR	(*( CCU60_CC60SR_type *) 0xf0002b44u)	/* Capture/Compare Shadow Reg. for Channel CC61 */
#define CCU61_CC62SR	(*( CCU60_CC60SR_type *) 0xf0002b48u)	/* Capture/Compare Shadow Reg. for Channel CC62 */
#define CCU62_CC60SR	(*( CCU60_CC60SR_type *) 0xf0002c40u)	/* Capture/Compare Shadow Reg. for Channel CC60 */
#define CCU62_CC61SR	(*( CCU60_CC60SR_type *) 0xf0002c44u)	/* Capture/Compare Shadow Reg. for Channel CC61 */
#define CCU62_CC62SR	(*( CCU60_CC60SR_type *) 0xf0002c48u)	/* Capture/Compare Shadow Reg. for Channel CC62 */
#define CCU63_CC60SR	(*( CCU60_CC60SR_type *) 0xf0002d40u)	/* Capture/Compare Shadow Reg. for Channel CC60 */
#define CCU63_CC61SR	(*( CCU60_CC60SR_type *) 0xf0002d44u)	/* Capture/Compare Shadow Reg. for Channel CC61 */
#define CCU63_CC62SR	(*( CCU60_CC60SR_type *) 0xf0002d48u)	/* Capture/Compare Shadow Reg. for Channel CC62 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CCV            : 16;	/* Channel CC63 Compare Value */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_CC63R_type;
#define CCU60_CC63R	(*( CCU60_CC63R_type *) 0xf0002a58u)	/* Compare Register for T13 */
#define CCU61_CC63R	(*( CCU60_CC63R_type *) 0xf0002b58u)	/* Compare Register for T13 */
#define CCU62_CC63R	(*( CCU60_CC63R_type *) 0xf0002c58u)	/* Compare Register for T13 */
#define CCU63_CC63R	(*( CCU60_CC63R_type *) 0xf0002d58u)	/* Compare Register for T13 */

typedef volatile union
{
	struct
	{ 
		unsigned int CCS            : 16;	/* Shadow Register for Channel CC63 Compare Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_CC63SR_type;
#define CCU60_CC63SR	(*( CCU60_CC63SR_type *) 0xf0002a5cu)	/* Compare Shadow Register for T13 */
#define CCU61_CC63SR	(*( CCU60_CC63SR_type *) 0xf0002b5cu)	/* Compare Shadow Register for T13 */
#define CCU62_CC63SR	(*( CCU60_CC63SR_type *) 0xf0002c5cu)	/* Compare Shadow Register for T13 */
#define CCU63_CC63SR	(*( CCU60_CC63SR_type *) 0xf0002d5cu)	/* Compare Shadow Register for T13 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CCU60_CLC_type;
#define CCU60_CLC	(*( CCU60_CLC_type *) 0xf0002a00u)	/* Clock Control Register */
#define CCU61_CLC	(*( CCU60_CLC_type *) 0xf0002b00u)	/* Clock Control Register */
#define CCU62_CLC	(*( CCU60_CLC_type *) 0xf0002c00u)	/* Clock Control Register */
#define CCU63_CLC	(*( CCU60_CLC_type *) 0xf0002d00u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MCC60S         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int MCC61S         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int MCC62S         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int                : 3;
		unsigned int MCC63S         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int                : 1;
		unsigned int MCC60R         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int MCC61R         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int MCC62R         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int                : 3;
		unsigned int MCC63R         : 1;	/* Capture/Compare Status Modification Bits */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} CCU60_CMPMODIF_type;
#define CCU60_CMPMODIF	(*( CCU60_CMPMODIF_type *) 0xf0002a64u)	/* Compare State Modification Register */
#define CCU61_CMPMODIF	(*( CCU60_CMPMODIF_type *) 0xf0002b64u)	/* Compare State Modification Register */
#define CCU62_CMPMODIF	(*( CCU60_CMPMODIF_type *) 0xf0002c64u)	/* Compare State Modification Register */
#define CCU63_CMPMODIF	(*( CCU60_CMPMODIF_type *) 0xf0002d64u)	/* Compare State Modification Register */

