svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CC60ST         : 1;	/* Capture/Compare State Bits */
		/* const */ unsigned int CC61ST         : 1;	/* Capture/Compare State Bits */
		/* const */ unsigned int CC62ST         : 1;	/* Capture/Compare State Bits */
		/* const */ unsigned int CCPOS60        : 1;	/* Sampled Hall Pattern Bits */
		/* const */ unsigned int CCPOS61        : 1;	/* Sampled Hall Pattern Bits */
		/* const */ unsigned int CCPOS62        : 1;	/* Sampled Hall Pattern Bits */
		/* const */ unsigned int CC63ST         : 1;	/* Capture/Compare State Bits */
		unsigned int                : 1;
		unsigned int CC60PS         : 1;	/* Passive State Select for Compare Outputs */
		unsigned int COUT60PS       : 1;	/* Passive State Select for Compare Outputs */
		unsigned int CC61PS         : 1;	/* Passive State Select for Compare Outputs */
		unsigned int COUT61PS       : 1;	/* Passive State Select for Compare Outputs */
		unsigned int CC62PS         : 1;	/* Passive State Select for Compare Outputs */
		unsigned int COUT62PS       : 1;	/* Passive State Select for Compare Outputs */
		unsigned int COUT63PS       : 1;	/* Passive State Select for Compare Outputs */
		unsigned int T13IM          : 1;	/* T13 Inverted Modulation */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_CMPSTAT_type;
#define CCU60_CMPSTAT	(*( CCU60_CMPSTAT_type *) 0xf0002a60u)	/* Compare State Register */
#define CCU61_CMPSTAT	(*( CCU60_CMPSTAT_type *) 0xf0002b60u)	/* Compare State Register */
#define CCU62_CMPSTAT	(*( CCU60_CMPSTAT_type *) 0xf0002c60u)	/* Compare State Register */
#define CCU63_CMPSTAT	(*( CCU60_CMPSTAT_type *) 0xf0002d60u)	/* Compare State Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODNUMBER      : 8;	/* Module Number Value */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_ID_type;
#define CCU60_ID	(*( CCU60_ID_type *) 0xf0002a08u)	/* Module Identification Register */
#define CCU61_ID	(*( CCU60_ID_type *) 0xf0002b08u)	/* Module Identification Register */
#define CCU62_ID	(*( CCU60_ID_type *) 0xf0002c08u)	/* Module Identification Register */
#define CCU63_ID	(*( CCU60_ID_type *) 0xf0002d08u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENCC60R        : 1;	/* Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x */
		unsigned int ENCC60F        : 1;	/* Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x */
		unsigned int ENCC61R        : 1;	/* Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x */
		unsigned int ENCC61F        : 1;	/* Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x */
		unsigned int ENCC62R        : 1;	/* Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x */
		unsigned int ENCC62F        : 1;	/* Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x */
		unsigned int ENT12OM        : 1;	/* Enable Interrupt for T12 One-Match */
		unsigned int ENT12PM        : 1;	/* Enable Interrupt for T12 Period-Match */
		unsigned int ENT13CM        : 1;	/* Enable Interrupt for T13 Compare-Match */
		unsigned int ENT13PM        : 1;	/* Enable Interrupt for T13 Period-Match */
		unsigned int ENTRPF         : 1;	/* Enable Interrupt for Trap Flag */
		unsigned int                : 1;
		unsigned int ENCHE          : 1;	/* Enable Interrupt for Correct Hall Event */
		unsigned int ENWHE          : 1;	/* Enable Interrupt for Wrong Hall Event */
		unsigned int ENIDLE         : 1;	/* Enable Idle */
		unsigned int ENSTR          : 1;	/* Enable Multi-Channel Mode Shadow Transfer Interrupt */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_IEN_type;
#define CCU60_IEN	(*( CCU60_IEN_type *) 0xf0002ab0u)	/* Interrupt Enable Register */
#define CCU61_IEN	(*( CCU60_IEN_type *) 0xf0002bb0u)	/* Interrupt Enable Register */
#define CCU62_IEN	(*( CCU60_IEN_type *) 0xf0002cb0u)	/* Interrupt Enable Register */
#define CCU63_IEN	(*( CCU60_IEN_type *) 0xf0002db0u)	/* Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LBE            : 1;	/* Lost Bit Event */
		unsigned int CCPOS0I        : 1;	/* Event indication for input signal CCPOSx */
		unsigned int CCPOS1I        : 1;	/* Event indication for input signal CCPOSx */
		unsigned int CCPOS2I        : 1;	/* Event indication for input signal CCPOSx */
		unsigned int CC60INI        : 1;	/* Event indication for input signal CC6xIN */
		unsigned int CC61INI        : 1;	/* Event indication for input signal CC6xIN */
		unsigned int CC62INI        : 1;	/* Event indication for input signal CC6xIN */
		unsigned int CTRAPI         : 1;	/* Event indication for input signal CTRAP */
		unsigned int T12HRI         : 1;	/* Event indication for input signal T12HR */
		unsigned int T13HRI         : 1;	/* Event indication for input signal T13HR */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} CCU60_IMON_type;
#define CCU60_IMON	(*( CCU60_IMON_type *) 0xf0002a98u)	/* Input Monitoring Register */
#define CCU61_IMON	(*( CCU60_IMON_type *) 0xf0002b98u)	/* Input Monitoring Register */
#define CCU62_IMON	(*( CCU60_IMON_type *) 0xf0002c98u)	/* Input Monitoring Register */
#define CCU63_IMON	(*( CCU60_IMON_type *) 0xf0002d98u)	/* Input Monitoring Register */

typedef volatile union
{
	struct
	{ 
		unsigned int INPCC60        : 2;	/* Interrupt Node Pointer for Channel CC6x Interrupts */
		unsigned int INPCC61        : 2;	/* Interrupt Node Pointer for Channel CC6x Interrupts */
		unsigned int INPCC62        : 2;	/* Interrupt Node Pointer for Channel CC6x Interrupts */
		unsigned int INPCHE         : 2;	/* Interrupt Node Pointer for the CHE Interrupt */
		unsigned int INPERR         : 2;	/* Interrupt Node Pointer for Error Interrupts */
		unsigned int INPT12         : 2;	/* Interrupt Node Pointer for Timer12 Interrupts */
		unsigned int INPT13         : 2;	/* Interrupt Node Pointer for Timer13 Interrupt */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} CCU60_INP_type;
#define CCU60_INP	(*( CCU60_INP_type *) 0xf0002aacu)	/* Interrupt Node Pointer Register */
#define CCU61_INP	(*( CCU60_INP_type *) 0xf0002bacu)	/* Interrupt Node Pointer Register */
#define CCU62_INP	(*( CCU60_INP_type *) 0xf0002cacu)	/* Interrupt Node Pointer Register */
#define CCU63_INP	(*( CCU60_INP_type *) 0xf0002dacu)	/* Interrupt Node Pointer Register */

