svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ICC60R         : 1;	/* Capture, Compare-Match Rising Edge Flag */
		/* const */ unsigned int ICC60F         : 1;	/* Capture, Compare-Match Falling Edge Flag */
		/* const */ unsigned int ICC61R         : 1;	/* Capture, Compare-Match Rising Edge Flag */
		/* const */ unsigned int ICC61F         : 1;	/* Capture, Compare-Match Falling Edge Flag */
		/* const */ unsigned int ICC62R         : 1;	/* Capture, Compare-Match Rising Edge Flag */
		/* const */ unsigned int ICC62F         : 1;	/* Capture, Compare-Match Falling Edge Flag */
		/* const */ unsigned int T12OM          : 1;	/* Timer T12 One-Match Flag */
		/* const */ unsigned int T12PM          : 1;	/* Timer T12 Period-Match Flag */
		/* const */ unsigned int T13CM          : 1;	/* Timer T13 Compare-Match Flag */
		/* const */ unsigned int T13PM          : 1;	/* Timer T13 Period-Match Flag */
		/* const */ unsigned int TRPF           : 1;	/* Trap Flag */
		/* const */ unsigned int TRPS           : 1;	/* Trap StateDuring the trap state, the selected outputs are set to the passive state. The logic level driven during the passive state is defined by the corresponding bit in register PSLR. Bits TRPS=1 and TRPF=0 can occur if the trap condition is no longer active but the selected synchronization has not yet taken place. */
		/* const */ unsigned int CHE            : 1;	/* Correct Hall Event */
		/* const */ unsigned int WHE            : 1;	/* Wrong Hall Event */
		/* const */ unsigned int IDLE           : 1;	/* IDLE State */
		/* const */ unsigned int STR            : 1;	/* Multi-Channel Mode Shadow Transfer Request */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_IS_type;
#define CCU60_IS	(*( CCU60_IS_type *) 0xf0002aa0u)	/* Interrupt Status Register */
#define CCU61_IS	(*( CCU60_IS_type *) 0xf0002ba0u)	/* Interrupt Status Register */
#define CCU62_IS	(*( CCU60_IS_type *) 0xf0002ca0u)	/* Interrupt Status Register */
#define CCU63_IS	(*( CCU60_IS_type *) 0xf0002da0u)	/* Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RCC60R         : 1;	/* Reset Capture, Compare-Match Rising Edge Flag */
		unsigned int RCC60F         : 1;	/* Reset Capture, Compare-Match Falling Edge Flag */
		unsigned int RCC61R         : 1;	/* Reset Capture, Compare-Match Rising Edge Flag */
		unsigned int RCC61F         : 1;	/* Reset Capture, Compare-Match Falling Edge Flag */
		unsigned int RCC62R         : 1;	/* Reset Capture, Compare-Match Rising Edge Flag */
		unsigned int RCC62F         : 1;	/* Reset Capture, Compare-Match Falling Edge Flag */
		unsigned int RT12OM         : 1;	/* Reset Timer T12 One-Match Flag */
		unsigned int RT12PM         : 1;	/* Reset Timer T12 Period-Match Flag */
		unsigned int RT13CM         : 1;	/* Reset Timer T13 Compare-Match Flag */
		unsigned int RT13PM         : 1;	/* Reset Timer T13 Period-Match Flag */
		unsigned int RTRPF          : 1;	/* Reset Trap Flag */
		unsigned int                : 1;
		unsigned int RCHE           : 1;	/* Reset Correct Hall Event Flag */
		unsigned int RWHE           : 1;	/* Reset Wrong Hall Event Flag */
		unsigned int RIDLE          : 1;	/* Reset IDLE Flag */
		unsigned int RSTR           : 1;	/* Reset STR Flag */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_ISR_type;
#define CCU60_ISR	(*( CCU60_ISR_type *) 0xf0002aa8u)	/* Interrupt Status Reset Register */
#define CCU61_ISR	(*( CCU60_ISR_type *) 0xf0002ba8u)	/* Interrupt Status Reset Register */
#define CCU62_ISR	(*( CCU60_ISR_type *) 0xf0002ca8u)	/* Interrupt Status Reset Register */
#define CCU63_ISR	(*( CCU60_ISR_type *) 0xf0002da8u)	/* Interrupt Status Reset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SCC60R         : 1;	/* Set Capture, Compare-Match Rising Edge Flag */
		unsigned int SCC60F         : 1;	/* Set Capture, Compare-Match Falling Edge Flag */
		unsigned int SCC61R         : 1;	/* Set Capture, Compare-Match Rising Edge Flag */
		unsigned int SCC61F         : 1;	/* Set Capture, Compare-Match Falling Edge Flag */
		unsigned int SCC62R         : 1;	/* Set Capture, Compare-Match Rising Edge Flag */
		unsigned int SCC62F         : 1;	/* Set Capture, Compare-Match Falling Edge Flag */
		unsigned int ST12OM         : 1;	/* Set Timer T12 One-Match Flag */
		unsigned int ST12PM         : 1;	/* Set Timer T12 Period-Match Flag */
		unsigned int ST13CM         : 1;	/* Set Timer T13 Compare-Match Flag */
		unsigned int ST13PM         : 1;	/* Set Timer T13 Period-Match Flag */
		unsigned int STRPF          : 1;	/* Set Trap Flag */
		unsigned int SWHC           : 1;	/* Software Hall Compare */
		unsigned int SCHE           : 1;	/* Set Correct Hall Event Flag */
		unsigned int SWHE           : 1;	/* Set Wrong Hall Event Flag */
		unsigned int SIDLE          : 1;	/* Set IDLE Flag */
		unsigned int SSTR           : 1;	/* Set STR Flag */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_ISS_type;
#define CCU60_ISS	(*( CCU60_ISS_type *) 0xf0002aa4u)	/* Interrupt Status Set Register */
#define CCU61_ISS	(*( CCU60_ISS_type *) 0xf0002ba4u)	/* Interrupt Status Set Register */
#define CCU62_ISS	(*( CCU60_ISS_type *) 0xf0002ca4u)	/* Interrupt Status Set Register */
#define CCU63_ISS	(*( CCU60_ISS_type *) 0xf0002da4u)	/* Interrupt Status Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} CCU60_KRST0_type;
#define CCU60_KRST0	(*( CCU60_KRST0_type *) 0xf0002af4u)	/* Kernel Reset Register 0 */
#define CCU61_KRST0	(*( CCU60_KRST0_type *) 0xf0002bf4u)	/* Kernel Reset Register 0 */
#define CCU62_KRST0	(*( CCU60_KRST0_type *) 0xf0002cf4u)	/* Kernel Reset Register 0 */
#define CCU63_KRST0	(*( CCU60_KRST0_type *) 0xf0002df4u)	/* Kernel Reset Register 0 */

