svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CCU60_KRST1_type;
#define CCU60_KRST1	(*( CCU60_KRST1_type *) 0xf0002af0u)	/* Kernel Reset Register 1 */
#define CCU61_KRST1	(*( CCU60_KRST1_type *) 0xf0002bf0u)	/* Kernel Reset Register 1 */
#define CCU62_KRST1	(*( CCU60_KRST1_type *) 0xf0002cf0u)	/* Kernel Reset Register 1 */
#define CCU63_KRST1	(*( CCU60_KRST1_type *) 0xf0002df0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} CCU60_KRSTCLR_type;
#define CCU60_KRSTCLR	(*( CCU60_KRSTCLR_type *) 0xf0002aecu)	/* Kernel Reset Status Clear Register */
#define CCU61_KRSTCLR	(*( CCU60_KRSTCLR_type *) 0xf0002becu)	/* Kernel Reset Status Clear Register */
#define CCU62_KRSTCLR	(*( CCU60_KRSTCLR_type *) 0xf0002cecu)	/* Kernel Reset Status Clear Register */
#define CCU63_KRSTCLR	(*( CCU60_KRSTCLR_type *) 0xf0002decu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SB0            : 1;	/* Sensitivity Block x */
		unsigned int SB1            : 1;	/* Sensitivity Block x */
		unsigned int SB2            : 1;	/* Sensitivity Block x */
		unsigned int SB3            : 1;	/* Sensitivity Block x */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CCU60_KSCSR_type;
#define CCU60_KSCSR	(*( CCU60_KSCSR_type *) 0xf0002a1cu)	/* Kernel State Control Sensitivity Register */
#define CCU61_KSCSR	(*( CCU60_KSCSR_type *) 0xf0002b1cu)	/* Kernel State Control Sensitivity Register */
#define CCU62_KSCSR	(*( CCU60_KSCSR_type *) 0xf0002c1cu)	/* Kernel State Control Sensitivity Register */
#define CCU63_KSCSR	(*( CCU60_KSCSR_type *) 0xf0002d1cu)	/* Kernel State Control Sensitivity Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int CCPOS0EN       : 1;	/* Lost Indicator Enable for input signal CCPOSx */
		unsigned int CCPOS1EN       : 1;	/* Lost Indicator Enable for input signal CCPOSx */
		unsigned int CCPOS2EN       : 1;	/* Lost Indicator Enable for input signal CCPOSx */
		unsigned int CC60INEN       : 1;	/* Lost Indicator Enable for input signal CC6xIN */
		unsigned int CC61INEN       : 1;	/* Lost Indicator Enable for input signal CC6xIN */
		unsigned int CC62INEN       : 1;	/* Lost Indicator Enable for input signal CC6xIN */
		unsigned int CTRAPEN        : 1;	/* Lost Indicator Enable for input signal CTRAP */
		unsigned int T12HREN        : 1;	/* Lost Indicator Enable for input signal T12HR */
		unsigned int T13HREN        : 1;	/* Lost Indicator Enable for input signal T13HR */
		unsigned int                : 3;
		unsigned int LBEEN          : 1;	/* Interrupt Enable for Lost Bit Event */
		unsigned int INPLBE         : 2;	/* Interrupt Node Pointer for lost bit event */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_LI_type;
#define CCU60_LI	(*( CCU60_LI_type *) 0xf0002a9cu)	/* Lost Indicator Register */
#define CCU61_LI	(*( CCU60_LI_type *) 0xf0002b9cu)	/* Lost Indicator Register */
#define CCU62_LI	(*( CCU60_LI_type *) 0xf0002c9cu)	/* Lost Indicator Register */
#define CCU63_LI	(*( CCU60_LI_type *) 0xf0002d9cu)	/* Lost Indicator Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T12            : 1;	/* T12 Available */
		unsigned int T13            : 1;	/* T13 Available */
		unsigned int MCM            : 1;	/* Multi-Channel Mode Available */
		unsigned int                : 12;
		unsigned int WREN           : 1;	/* Write Enable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_MCFG_type;
#define CCU60_MCFG	(*( CCU60_MCFG_type *) 0xf0002a04u)	/* Module Configuration Register */
#define CCU61_MCFG	(*( CCU60_MCFG_type *) 0xf0002b04u)	/* Module Configuration Register */
#define CCU62_MCFG	(*( CCU60_MCFG_type *) 0xf0002c04u)	/* Module Configuration Register */
#define CCU63_MCFG	(*( CCU60_MCFG_type *) 0xf0002d04u)	/* Module Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SWSEL          : 3;	/* Switching Selection */
		unsigned int                : 1;
		unsigned int SWSYN          : 2;	/* Switching Synchronization */
		unsigned int                : 2;
		unsigned int STE12U         : 1;	/* Shadow Transfer Enable for T12 Upcounting */
		unsigned int STE12D         : 1;	/* Shadow Transfer Enable for T12 Downcounting */
		unsigned int STE13U         : 1;	/* Shadow Transfer Enable for T13 Upcounting */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} CCU60_MCMCTR_type;
#define CCU60_MCMCTR	(*( CCU60_MCMCTR_type *) 0xf0002a94u)	/* Multi-Channel Mode Control Register */
#define CCU61_MCMCTR	(*( CCU60_MCMCTR_type *) 0xf0002b94u)	/* Multi-Channel Mode Control Register */
#define CCU62_MCMCTR	(*( CCU60_MCMCTR_type *) 0xf0002c94u)	/* Multi-Channel Mode Control Register */
#define CCU63_MCMCTR	(*( CCU60_MCMCTR_type *) 0xf0002d94u)	/* Multi-Channel Mode Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MCMP           : 6;	/* Multi-Channel PWM Pattern */
		/* const */ unsigned int R              : 1;	/* Reminder Flag */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int EXPH           : 3;	/* Expected Hall Pattern */
		/* const */ unsigned int CURH           : 3;	/* Current Hall Pattern */
		/* const */ unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} CCU60_MCMOUT_type;
#define CCU60_MCMOUT	(*( CCU60_MCMOUT_type *) 0xf0002a90u)	/* Multi-Channel Mode Output Register */
#define CCU61_MCMOUT	(*( CCU60_MCMOUT_type *) 0xf0002b90u)	/* Multi-Channel Mode Output Register */
#define CCU62_MCMOUT	(*( CCU60_MCMOUT_type *) 0xf0002c90u)	/* Multi-Channel Mode Output Register */
#define CCU63_MCMOUT	(*( CCU60_MCMOUT_type *) 0xf0002d90u)	/* Multi-Channel Mode Output Register */

