svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MCMPS          : 6;	/* Multi-Channel PWM Pattern Shadow */
		unsigned int                : 1;
		unsigned int STRMCM         : 1;	/* Shadow Transfer Request for MCMPS */
		unsigned int EXPHS          : 3;	/* Expected Hall Pattern Shadow */
		unsigned int CURHS          : 3;	/* Current Hall Pattern Shadow */
		unsigned int                : 1;
		unsigned int STRHP          : 1;	/* Shadow Transfer Request for the Hall Pattern */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_MCMOUTS_type;
#define CCU60_MCMOUTS	(*( CCU60_MCMOUTS_type *) 0xf0002a8cu)	/* Multi-Channel Mode Output Shadow Register */
#define CCU61_MCMOUTS	(*( CCU60_MCMOUTS_type *) 0xf0002b8cu)	/* Multi-Channel Mode Output Shadow Register */
#define CCU62_MCMOUTS	(*( CCU60_MCMOUTS_type *) 0xf0002c8cu)	/* Multi-Channel Mode Output Shadow Register */
#define CCU63_MCMOUTS	(*( CCU60_MCMOUTS_type *) 0xf0002d8cu)	/* Multi-Channel Mode Output Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T12MODEN       : 6;	/* T12 Modulation Enable */
		unsigned int                : 1;
		unsigned int MCMEN          : 1;	/* Multi-Channel Mode Enable */
		unsigned int T13MODEN       : 6;	/* T13 Modulation Enable */
		unsigned int                : 1;
		unsigned int ECT13O         : 1;	/* Enable Compare Timer T13 Output */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_MODCTR_type;
#define CCU60_MODCTR	(*( CCU60_MODCTR_type *) 0xf0002a80u)	/* Modulation Control Register */
#define CCU61_MODCTR	(*( CCU60_MODCTR_type *) 0xf0002b80u)	/* Modulation Control Register */
#define CCU62_MODCTR	(*( CCU60_MODCTR_type *) 0xf0002c80u)	/* Modulation Control Register */
#define CCU63_MODCTR	(*( CCU60_MODCTR_type *) 0xf0002d80u)	/* Modulation Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRIG0SEL       : 3;	/* Output Trigger Select for CCU6061 TRIG0 */
		unsigned int TRIG1SEL       : 3;	/* Output Trigger Select for CCU6061 TRIG1 */
		unsigned int TRIG2SEL       : 3;	/* Output Trigger Select for CCU6061 TRIG2 */
		unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} CCU60_MOSEL_type;
#define CCU60_MOSEL	(*( CCU60_MOSEL_type *) 0xf0002a0cu)	/* CCU60 Module Output Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} CCU60_OCS_type;
#define CCU60_OCS	(*( CCU60_OCS_type *) 0xf0002ae8u)	/* OCDS Control and Status Register */
#define CCU61_OCS	(*( CCU60_OCS_type *) 0xf0002be8u)	/* OCDS Control and Status Register */
#define CCU62_OCS	(*( CCU60_OCS_type *) 0xf0002ce8u)	/* OCDS Control and Status Register */
#define CCU63_OCS	(*( CCU60_OCS_type *) 0xf0002de8u)	/* OCDS Control and Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ISCC60         : 2;	/* Input Select for CC60 */
		unsigned int ISCC61         : 2;	/* Input Select for CC61 */
		unsigned int ISCC62         : 2;	/* Input Select for CC62 */
		unsigned int ISTRP          : 2;	/* Input Select for CTRAP */
		unsigned int ISPOS0         : 2;	/* Input Select for CCPOS0 */
		unsigned int ISPOS1         : 2;	/* Input Select for CCPOS1 */
		unsigned int ISPOS2         : 2;	/* Input Select for CCPOS2 */
		unsigned int IST12HR        : 2;	/* Input Select for T12HR */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_PISEL0_type;
#define CCU60_PISEL0	(*( CCU60_PISEL0_type *) 0xf0002a10u)	/* Port Input Select Register 0 */
#define CCU61_PISEL0	(*( CCU60_PISEL0_type *) 0xf0002b10u)	/* Port Input Select Register 0 */
#define CCU62_PISEL0	(*( CCU60_PISEL0_type *) 0xf0002c10u)	/* Port Input Select Register 0 */
#define CCU63_PISEL0	(*( CCU60_PISEL0_type *) 0xf0002d10u)	/* Port Input Select Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int IST13HR        : 2;	/* Input Select for T13HR */
		unsigned int ISCNT12        : 2;	/* Input Select for T12 Counting Input */
		unsigned int ISCNT13        : 2;	/* Input Select for T13 Counting Input */
		unsigned int T12EXT         : 1;	/* Extension for T12HR Inputs */
		unsigned int T13EXT         : 1;	/* Extension for T13HR Inputs */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CCU60_PISEL2_type;
#define CCU60_PISEL2	(*( CCU60_PISEL2_type *) 0xf0002a14u)	/* Port Input Select Register 2 */
#define CCU61_PISEL2	(*( CCU60_PISEL2_type *) 0xf0002b14u)	/* Port Input Select Register 2 */
#define CCU62_PISEL2	(*( CCU60_PISEL2_type *) 0xf0002c14u)	/* Port Input Select Register 2 */
#define CCU63_PISEL2	(*( CCU60_PISEL2_type *) 0xf0002d14u)	/* Port Input Select Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int PSL            : 6;	/* Compare Outputs Passive State Level */
		unsigned int                : 1;
		unsigned int PSL63          : 1;	/* Passive State Level of Output COUT63 */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CCU60_PSLR_type;
#define CCU60_PSLR	(*( CCU60_PSLR_type *) 0xf0002a88u)	/* Passive State Level Register */
#define CCU61_PSLR	(*( CCU60_PSLR_type *) 0xf0002b88u)	/* Passive State Level Register */
#define CCU62_PSLR	(*( CCU60_PSLR_type *) 0xf0002c88u)	/* Passive State Level Register */
#define CCU63_PSLR	(*( CCU60_PSLR_type *) 0xf0002d88u)	/* Passive State Level Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T12CV          : 16;	/* Timer 12 Counter Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_T12_type;
#define CCU60_T12	(*( CCU60_T12_type *) 0xf0002a20u)	/* Timer T12 Counter Register */
#define CCU61_T12	(*( CCU60_T12_type *) 0xf0002b20u)	/* Timer T12 Counter Register */
#define CCU62_T12	(*( CCU60_T12_type *) 0xf0002c20u)	/* Timer T12 Counter Register */
#define CCU63_T12	(*( CCU60_T12_type *) 0xf0002d20u)	/* Timer T12 Counter Register */

