svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int DTM            : 8;	/* Dead-Time */
		unsigned int DTE0           : 1;	/* Dead Time Enable Bits */
		unsigned int DTE1           : 1;	/* Dead Time Enable Bits */
		unsigned int DTE2           : 1;	/* Dead Time Enable Bits */
		unsigned int                : 1;
		/* const */ unsigned int DTR0           : 1;	/* Dead Time Run Indication Bits */
		/* const */ unsigned int DTR1           : 1;	/* Dead Time Run Indication Bits */
		/* const */ unsigned int DTR2           : 1;	/* Dead Time Run Indication Bits */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} CCU60_T12DTC_type;
#define CCU60_T12DTC	(*( CCU60_T12DTC_type *) 0xf0002a28u)	/* Dead-Time Control Register for Timer12 */
#define CCU61_T12DTC	(*( CCU60_T12DTC_type *) 0xf0002b28u)	/* Dead-Time Control Register for Timer12 */
#define CCU62_T12DTC	(*( CCU60_T12DTC_type *) 0xf0002c28u)	/* Dead-Time Control Register for Timer12 */
#define CCU63_T12DTC	(*( CCU60_T12DTC_type *) 0xf0002d28u)	/* Dead-Time Control Register for Timer12 */

typedef volatile union
{
	struct
	{ 
		unsigned int MSEL60         : 4;	/* Capture/Compare Mode Selection */
		unsigned int MSEL61         : 4;	/* Capture/Compare Mode Selection */
		unsigned int MSEL62         : 4;	/* Capture/Compare Mode Selection */
		unsigned int HSYNC          : 3;	/* Hall Synchronization */
		unsigned int DBYP           : 1;	/* Delay Bypass */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_T12MSEL_type;
#define CCU60_T12MSEL	(*( CCU60_T12MSEL_type *) 0xf0002a68u)	/* T12 Mode Select Register */
#define CCU61_T12MSEL	(*( CCU60_T12MSEL_type *) 0xf0002b68u)	/* T12 Mode Select Register */
#define CCU62_T12MSEL	(*( CCU60_T12MSEL_type *) 0xf0002c68u)	/* T12 Mode Select Register */
#define CCU63_T12MSEL	(*( CCU60_T12MSEL_type *) 0xf0002d68u)	/* T12 Mode Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T12PV          : 16;	/* T12 Period Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_T12PR_type;
#define CCU60_T12PR	(*( CCU60_T12PR_type *) 0xf0002a24u)	/* Timer 12 Period Register */
#define CCU61_T12PR	(*( CCU60_T12PR_type *) 0xf0002b24u)	/* Timer 12 Period Register */
#define CCU62_T12PR	(*( CCU60_T12PR_type *) 0xf0002c24u)	/* Timer 12 Period Register */
#define CCU63_T12PR	(*( CCU60_T12PR_type *) 0xf0002d24u)	/* Timer 12 Period Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T13CV          : 16;	/* Timer 13 Counter Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_T13_type;
#define CCU60_T13	(*( CCU60_T13_type *) 0xf0002a50u)	/* Timer T13 Counter Register */
#define CCU61_T13	(*( CCU60_T13_type *) 0xf0002b50u)	/* Timer T13 Counter Register */
#define CCU62_T13	(*( CCU60_T13_type *) 0xf0002c50u)	/* Timer T13 Counter Register */
#define CCU63_T13	(*( CCU60_T13_type *) 0xf0002d50u)	/* Timer T13 Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T13PV          : 16;	/* T13 Period Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_T13PR_type;
#define CCU60_T13PR	(*( CCU60_T13PR_type *) 0xf0002a54u)	/* Timer 13 Period Register */
#define CCU61_T13PR	(*( CCU60_T13PR_type *) 0xf0002b54u)	/* Timer 13 Period Register */
#define CCU62_T13PR	(*( CCU60_T13PR_type *) 0xf0002c54u)	/* Timer 13 Period Register */
#define CCU63_T13PR	(*( CCU60_T13PR_type *) 0xf0002d54u)	/* Timer 13 Period Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T12CLK         : 3;	/* Timer T12 Input Clock Select */
		unsigned int T12PRE         : 1;	/* Timer T12 Prescaler Bit */
		/* const */ unsigned int T12R           : 1;	/* Timer T12 Run BitA concurrent set/clear action on T12R (from T12SSC, T12RR or T12RS) will have no effect. The bit T12R will remain unchanged. */
		/* const */ unsigned int STE12          : 1;	/* Timer T12 Shadow Transfer Enable */
		/* const */ unsigned int CDIR           : 1;	/* Count Direction of Timer T12 */
		unsigned int CTM            : 1;	/* T12 Operating Mode */
		unsigned int T13CLK         : 3;	/* Timer T13 Input Clock Select */
		unsigned int T13PRE         : 1;	/* Timer T13 Prescaler Bit */
		/* const */ unsigned int T13R           : 1;	/* Timer T13 Run BitA concurrent set/cleared action on T13R (from T13SSC, T13TEC, T13RR or T13RS) will have no effect. The bit T12R will remain unchanged. */
		/* const */ unsigned int STE13          : 1;	/* Timer T13 Shadow Transfer Enable */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} CCU60_TCTR0_type;
#define CCU60_TCTR0	(*( CCU60_TCTR0_type *) 0xf0002a70u)	/* Timer Control Register 0 */
#define CCU61_TCTR0	(*( CCU60_TCTR0_type *) 0xf0002b70u)	/* Timer Control Register 0 */
#define CCU62_TCTR0	(*( CCU60_TCTR0_type *) 0xf0002c70u)	/* Timer Control Register 0 */
#define CCU63_TCTR0	(*( CCU60_TCTR0_type *) 0xf0002d70u)	/* Timer Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int T12SSC         : 1;	/* Timer T12 Single Shot Control */
		unsigned int T13SSC         : 1;	/* Timer T13 Single Shot Control */
		unsigned int T13TEC         : 3;	/* T13 Trigger Event Control */
		unsigned int T13TED         : 2;	/* Timer T13 Trigger Event DirectionExample: If the timer T13 is intended to start at any compare event on T12 (T13TEC=100) the trigger event direction can be programmed to - counting up 'gt''gt' a T12 channel 0, 1, 2 compare match triggers T13R only while T12 is counting up - counting down 'gt''gt' a T12 channel 0, 1, 2 compare match triggers T13R only while T12 is counting down - independent from bit CDIR 'gt''gt' each T12 channel 0, 1, 2 compare match triggers T13R The timer count direction is taken from the value of bit CDIR. As a result, if T12 is running in edge-aligned mode (counting up only), T13 can only be started automatically if bit field T13TED=01 or 11. */
		unsigned int                : 1;
		unsigned int T12RSEL        : 2;	/* Timer T12 External Run Selection */
		unsigned int T13RSEL        : 2;	/* Timer T13 External Run Selection */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CCU60_TCTR2_type;
#define CCU60_TCTR2	(*( CCU60_TCTR2_type *) 0xf0002a74u)	/* Timer Control Register 2 */
#define CCU61_TCTR2	(*( CCU60_TCTR2_type *) 0xf0002b74u)	/* Timer Control Register 2 */
#define CCU62_TCTR2	(*( CCU60_TCTR2_type *) 0xf0002c74u)	/* Timer Control Register 2 */
#define CCU63_TCTR2	(*( CCU60_TCTR2_type *) 0xf0002d74u)	/* Timer Control Register 2 */

