svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int T12RR          : 1;	/* Timer T12 Run Reset */
		unsigned int T12RS          : 1;	/* Timer T12 Run Set */
		unsigned int T12RES         : 1;	/* Timer T12 Reset */
		unsigned int DTRES          : 1;	/* Dead-Time Counter Reset */
		unsigned int                : 1;
		unsigned int T12CNT         : 1;	/* Timer T12 Count Event */
		unsigned int T12STR         : 1;	/* Timer T12 Shadow Transfer Request */
		unsigned int T12STD         : 1;	/* Timer T12 Shadow Transfer Disable */
		unsigned int T13RR          : 1;	/* Timer T13 Run Reset */
		unsigned int T13RS          : 1;	/* Timer T13 Run Set */
		unsigned int T13RES         : 1;	/* Timer T13 Reset */
		unsigned int                : 2;
		unsigned int T13CNT         : 1;	/* Timer T13 Count Event */
		unsigned int T13STR         : 1;	/* Timer T13 Shadow Transfer Request */
		unsigned int T13STD         : 1;	/* Timer T13 Shadow Transfer Disable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_TCTR4_type;
#define CCU60_TCTR4	(*( CCU60_TCTR4_type *) 0xf0002a78u)	/* Timer Control Register 4 */
#define CCU61_TCTR4	(*( CCU60_TCTR4_type *) 0xf0002b78u)	/* Timer Control Register 4 */
#define CCU62_TCTR4	(*( CCU60_TCTR4_type *) 0xf0002c78u)	/* Timer Control Register 4 */
#define CCU63_TCTR4	(*( CCU60_TCTR4_type *) 0xf0002d78u)	/* Timer Control Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int TRPM0          : 1;	/* Trap Mode Control Bits 1, 0 */
		unsigned int TRPM1          : 1;	/* Trap Mode Control Bits 1, 0 */
		unsigned int TRPM2          : 1;	/* Trap Mode Control Bit 2 */
		unsigned int                : 5;
		unsigned int TRPEN          : 6;	/* Trap Enable Control */
		unsigned int TRPEN13        : 1;	/* Trap Enable Control for Timer T13 */
		unsigned int TRPPEN         : 1;	/* Trap Pin Enable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CCU60_TRPCTR_type;
#define CCU60_TRPCTR	(*( CCU60_TRPCTR_type *) 0xf0002a84u)	/* Trap Control Register */
#define CCU61_TRPCTR	(*( CCU60_TRPCTR_type *) 0xf0002b84u)	/* Trap Control Register */
#define CCU62_TRPCTR	(*( CCU60_TRPCTR_type *) 0xf0002c84u)	/* Trap Control Register */
#define CCU63_TRPCTR	(*( CCU60_TRPCTR_type *) 0xf0002d84u)	/* Trap Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CCU61_ACCEN1_type;
#define CCU61_ACCEN1	(*( CCU61_ACCEN1_type *) 0xf0002bf8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CCU62_ACCEN1_type;
#define CCU62_ACCEN1	(*( CCU62_ACCEN1_type *) 0xf0002cf8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int TRIG0SEL       : 3;	/* Output Trigger Select for CCU6263 TRIG0 */
		unsigned int TRIG1SEL       : 3;	/* Output Trigger Select for CCU6263 TRIG1 */
		unsigned int TRIG2SEL       : 3;	/* Output Trigger Select for CCU6263 TRIG2 */
		unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} CCU62_MOSEL_type;
#define CCU62_MOSEL	(*( CCU62_MOSEL_type *) 0xf0002c0cu)	/* CCU62 Module Output Select Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CCU63_ACCEN1_type;
#define CCU63_ACCEN1	(*( CCU63_ACCEN1_type *) 0xf0002df8u)	/* Access Enable Register 1 */


/* EMEM */
typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} EMEM_CLC_type;
#define EMEM_CLC	(*( EMEM_CLC_type *) 0xf00e6000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} EMEM_ID_type;
#define EMEM_ID	(*( EMEM_ID_type *) 0xf00e6008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STBLOCK        : 1;	/* Standby Lock Flag */
		unsigned int STBULK         : 3;	/* Unlock Standby Lock Flag */
		unsigned int STBSLK         : 4;	/* Set Standby Lock Flag */
		unsigned int                : 4;
		unsigned int ACGEN          : 1;	/* Automatic Clock Gating Enabling */
		unsigned int                : 3;
		/* const */ unsigned int ACGST0         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST1         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST2         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST3         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST4         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST5         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST6         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST7         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST8         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST9         : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST10        : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST11        : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST12        : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST13        : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST14        : 1;	/* Automatic Clock Gating Status of Tile x */
		/* const */ unsigned int ACGST15        : 1;	/* Automatic Clock Gating Status of Tile x */
	} B;
	int I;
	unsigned int U;

} EMEM_SBRCTR_type;
