svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define EMEM_SBRCTR	(*( EMEM_SBRCTR_type *) 0xf00e6034u)	/* Standby RAM Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T0             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T1             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T2             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T3             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T4             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T5             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T6             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T7             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T8             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T9             : 1;	/* Calibration Tile x Control Bit */
		unsigned int T10            : 1;	/* Calibration Tile x Control Bit */
		unsigned int T11            : 1;	/* Calibration Tile x Control Bit */
		unsigned int T12            : 1;	/* Calibration Tile x Control Bit */
		unsigned int T13            : 1;	/* Calibration Tile x Control Bit */
		unsigned int T14            : 1;	/* Calibration Tile x Control Bit */
		unsigned int T15            : 1;	/* Calibration Tile x Control Bit */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} EMEM_TILECC_type;
#define EMEM_TILECC	(*( EMEM_TILECC_type *) 0xf00e6024u)	/* Calibration Tile Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T0             : 2;	/* Tile x Allocation */
		unsigned int T1             : 2;	/* Tile x Allocation */
		unsigned int T2             : 2;	/* Tile x Allocation */
		unsigned int T3             : 2;	/* Tile x Allocation */
		unsigned int T4             : 2;	/* Tile x Allocation */
		unsigned int T5             : 2;	/* Tile x Allocation */
		unsigned int T6             : 2;	/* Tile x Allocation */
		unsigned int T7             : 2;	/* Tile x Allocation */
		unsigned int T8             : 2;	/* Tile x Allocation */
		unsigned int T9             : 2;	/* Tile x Allocation */
		unsigned int T10            : 2;	/* Tile x Allocation */
		unsigned int T11            : 2;	/* Tile x Allocation */
		unsigned int T12            : 2;	/* Tile x Allocation */
		unsigned int T13            : 2;	/* Tile x Allocation */
		unsigned int T14            : 2;	/* Tile x Allocation */
		unsigned int T15            : 2;	/* Tile x Allocation */
	} B;
	int I;
	unsigned int U;

} EMEM_TILECONFIG_type;
#define EMEM_TILECONFIG	(*( EMEM_TILECONFIG_type *) 0xf00e6020u)	/* Tile Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int T0             : 1;	/* Trace Tile x Control Bit */
		unsigned int T1             : 1;	/* Trace Tile x Control Bit */
		unsigned int T2             : 1;	/* Trace Tile x Control Bit */
		unsigned int T3             : 1;	/* Trace Tile x Control Bit */
		unsigned int T4             : 1;	/* Trace Tile x Control Bit */
		unsigned int T5             : 1;	/* Trace Tile x Control Bit */
		unsigned int T6             : 1;	/* Trace Tile x Control Bit */
		unsigned int T7             : 1;	/* Trace Tile x Control Bit */
		unsigned int T8             : 1;	/* Trace Tile x Control Bit */
		unsigned int T9             : 1;	/* Trace Tile x Control Bit */
		unsigned int T10            : 1;	/* Trace Tile x Control Bit */
		unsigned int T11            : 1;	/* Trace Tile x Control Bit */
		unsigned int T12            : 1;	/* Trace Tile x Control Bit */
		unsigned int T13            : 1;	/* Trace Tile x Control Bit */
		unsigned int T14            : 1;	/* Trace Tile x Control Bit */
		unsigned int T15            : 1;	/* Trace Tile x Control Bit */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} EMEM_TILECT_type;
#define EMEM_TILECT	(*( EMEM_TILECT_type *) 0xf00e6028u)	/* Trace Tile Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TILE0          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE1          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE2          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE3          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE4          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE5          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE6          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE7          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE8          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE9          : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE10         : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE11         : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE12         : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE13         : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE14         : 2;	/* Usage of Tile x */
		/* const */ unsigned int TILE15         : 2;	/* Usage of Tile x */
	} B;
	int I;
	unsigned int U;

} EMEM_TILESTATE_type;
#define EMEM_TILESTATE	(*( EMEM_TILESTATE_type *) 0xf00e602cu)	/* Tile Status Register */


/* EBCU */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID x */
	} B;
	int I;
	unsigned int U;

} EBCU_ACCEN0_type;
#define EBCU_ACCEN0	(*( EBCU_ACCEN0_type *) 0xf00e01fcu)	/* Access Enable Register 0 */

