svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EN32           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN33           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN34           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN35           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN36           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN37           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN38           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN39           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN40           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN41           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN42           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN43           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN44           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN45           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN46           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN47           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN48           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN49           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN50           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN51           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN52           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN53           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN54           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN55           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN56           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN57           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN58           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN59           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN60           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN61           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN62           : 1;	/* Access Enable for Master TAG ID x */
		/* const */ unsigned int EN63           : 1;	/* Access Enable for Master TAG ID x */
	} B;
	int I;
	unsigned int U;

} EBCU_ACCEN1_type;
#define EBCU_ACCEN1	(*( EBCU_ACCEN1_type *) 0xf00e01f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int TOUT           : 16;	/* Bus Time-Out Value */
		unsigned int DBG            : 1;	/* Debug Trace Enable */
		unsigned int                : 7;
		unsigned int SPC            : 8;	/* Starvation Period Control */
	} B;
	int I;
	unsigned int U;

} EBCU_CON_type;
#define EBCU_CON	(*( EBCU_CON_type *) 0xf00e0110u)	/* EBCU Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADR1           : 32;	/* Debug Trigger Address 1 */
	} B;
	int I;
	unsigned int U;

} EBCU_DBADR1_type;
#define EBCU_DBADR1	(*( EBCU_DBADR1_type *) 0xf00e0138u)	/* Debug Address 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADR2           : 32;	/* Debug Trigger Address 2 */
	} B;
	int I;
	unsigned int U;

} EBCU_DBADR2_type;
#define EBCU_DBADR2	(*( EBCU_DBADR2_type *) 0xf00e013cu)	/* Debug Address 2 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FPIADR         : 32;	/* FPIBus Address Status */
	} B;
	int I;
	unsigned int U;

} EBCU_DBADRT_type;
#define EBCU_DBADRT	(*( EBCU_DBADRT_type *) 0xf00e0148u)	/* Debug Trapped Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OPC            : 4;	/* Opcode for Signal Status Debug Trigger */
		unsigned int SVM            : 1;	/* SVM Signal for Status Debug Trigger */
		unsigned int                : 3;
		unsigned int WR             : 1;	/* Write Signal for Status Debug Trigger */
		unsigned int                : 3;
		unsigned int RD             : 1;	/* Write Signal for Status Debug Trigger */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} EBCU_DBBOS_type;
#define EBCU_DBBOS	(*( EBCU_DBBOS_type *) 0xf00e0140u)	/* Debug Bus Operation Signals Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FPIOPC         : 4;	/* FPIBus Opcode Status */
		/* const */ unsigned int FPISVM         : 1;	/* FPIBus Supervisor Mode Status */
		/* const */ unsigned int FPIACK         : 2;	/* FPIBus Acknowledge Status */
		/* const */ unsigned int FPIRDY         : 1;	/* FPIBus Ready Status */
		/* const */ unsigned int FPIWR          : 1;	/* FPIBus Write Indication Status */
		/* const */ unsigned int FPIRST         : 2;	/* FPIBus Reset Status */
		/* const */ unsigned int FPIOPS         : 1;	/* FPIBus OCDS Suspend Status */
		/* const */ unsigned int FPIRD          : 1;	/* FPIBus Read Indication Status */
		/* const */ unsigned int FPIABORT       : 1;	/* FPIBus Abort Status */
		/* const */ unsigned int FPITOUT        : 1;	/* FPIBus Time-out Status */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int FPITAG         : 6;	/* FPIBus Master TAG Status */
		/* const */ unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} EBCU_DBBOST_type;
#define EBCU_DBBOST	(*( EBCU_DBBOST_type *) 0xf00e014cu)	/* Debug Trapped Bus Operation Signals Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EO             : 1;	/* Status of Debug Support Enable */
		/* const */ unsigned int OA             : 1;	/* Status of Breakpoint Logic */
		unsigned int                : 2;
		unsigned int RA             : 1;	/* Rearm Breakpoint Logic */
		unsigned int                : 7;
		unsigned int CONCOM0        : 1;	/* Grant and Address Trigger Relation */
		unsigned int CONCOM1        : 1;	/* Address 1 and Address 2 Trigger Relation */
		unsigned int CONCOM2        : 1;	/* Address and Signal Trigger Relation */
		unsigned int                : 1;
		unsigned int ONG            : 1;	/* Grant Trigger Enable */
		unsigned int                : 3;
		unsigned int ONA1           : 2;	/* Address 1 Trigger Control */
		unsigned int                : 2;
		unsigned int ONA2           : 2;	/* Address 2 Trigger Control */
		unsigned int                : 2;
		unsigned int ONBOS0         : 1;	/* Opcode Signal Status Trigger Condition */
		unsigned int ONBOS1         : 1;	/* Supervisor Mode Signal Trigger Condition */
		unsigned int ONBOS2         : 1;	/* Write Signal Trigger Condition */
		unsigned int ONBOS3         : 1;	/* Read Signal Trigger Condition */
	} B;
	int I;
	unsigned int U;

