svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} EBCU_DBCNTL_type;
#define EBCU_DBCNTL	(*( EBCU_DBCNTL_type *) 0xf00e0130u)	/* Debug Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FPIDATA        : 32;	/* FPIBus Data Status */
	} B;
	int I;
	unsigned int U;

} EBCU_DBDAT_type;
#define EBCU_DBDAT	(*( EBCU_DBDAT_type *) 0xf00e0150u)	/* Debug Data Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPIGNT0        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT1        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT2        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT3        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT4        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT5        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT6        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT7        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT8        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT9        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT10       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT11       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT12       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT13       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT14       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT15       : 1;	/* Master x Grant Status */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} EBCU_DBGNTT_type;
#define EBCU_DBGNTT	(*( EBCU_DBGNTT_type *) 0xf00e0144u)	/* Debug Trapped Master Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPIGNT0        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT1        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT2        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT3        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT4        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT5        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT6        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT7        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT8        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT9        : 1;	/* Master x Grant Status */
		unsigned int FPIGNT10       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT11       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT12       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT13       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT14       : 1;	/* Master x Grant Status */
		unsigned int FPIGNT15       : 1;	/* Master x Grant Status */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} EBCU_DBGRNT_type;
#define EBCU_DBGRNT	(*( EBCU_DBGRNT_type *) 0xf00e0134u)	/* Debug Grant Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPIADR         : 32;	/* Captured FPIBus Address */
	} B;
	int I;
	unsigned int U;

} EBCU_EADD_type;
#define EBCU_EADD	(*( EBCU_EADD_type *) 0xf00e0124u)	/* Error Address Capture Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ERRCNT         : 14;	/* FPIBus Error Counter */
		unsigned int TOUT           : 1;	/* State of FPIBus Time-Out Signal */
		unsigned int RDY            : 1;	/* State of FPIBus Ready Signal */
		unsigned int ABT            : 1;	/* State of FPI Bus Abort Signal */
		unsigned int ACK            : 2;	/* State of FPIBus Acknowledge Signals */
		unsigned int SVM            : 1;	/* State of FPIBus Supervisor Mode Signal */
		unsigned int WRN            : 1;	/* State of FPIBus Write Signal */
		unsigned int RDN            : 1;	/* State of FPIBus Read Signal */
		unsigned int TAG            : 6;	/* FPIBus Master Tag Number Signals */
		unsigned int OPC            : 4;	/* FPIBus Operation Code Signals */
	} B;
	int I;
	unsigned int U;

} EBCU_ECON_type;
#define EBCU_ECON	(*( EBCU_ECON_type *) 0xf00e0120u)	/* Error Control Capture Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPIDAT         : 32;	/* Captured FPIBus Address */
	} B;
	int I;
	unsigned int U;

} EBCU_EDAT_type;
#define EBCU_EDAT	(*( EBCU_EDAT_type *) 0xf00e0128u)	/* Error Data Capture Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODNUMBER      : 8;	/* Module Number Value */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} EBCU_ID_type;
#define EBCU_ID	(*( EBCU_ID_type *) 0xf00e0108u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER8        : 4;	/* Master x Priority */
		unsigned int MASTER9        : 4;	/* Master x Priority */
		unsigned int MASTER10       : 4;	/* Master x Priority */
		unsigned int MASTER11       : 4;	/* Master x Priority */
		unsigned int MASTER12       : 4;	/* Master x Priority */
		unsigned int MASTER13       : 4;	/* Master x Priority */
		unsigned int MASTER14       : 4;	/* Master x Priority */
		unsigned int MASTER15       : 4;	/* Master x Priority */
	} B;
	int I;
	unsigned int U;

} EBCU_PRIOH_type;
#define EBCU_PRIOH	(*( EBCU_PRIOH_type *) 0xf00e0114u)	/* Arbiter Priority Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MASTER0        : 4;	/* Master x Priority */
		unsigned int MASTER1        : 4;	/* Master x Priority */
		unsigned int MASTER2        : 4;	/* Master x Priority */
		unsigned int MASTER3        : 4;	/* Master x Priority */
		unsigned int MASTER4        : 4;	/* Master x Priority */
		unsigned int MASTER5        : 4;	/* Master x Priority */
		unsigned int MASTER6        : 4;	/* Master x Priority */
		unsigned int MASTER7        : 4;	/* Master x Priority */
	} B;
	int I;
	unsigned int U;

} EBCU_PRIOL_type;
#define EBCU_PRIOL	(*( EBCU_PRIOL_type *) 0xf00e0118u)	/* Arbiter Priority Register */


/* MCDS */
typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} MCDS_CLC_type;
