svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define MCDS_CLC	(*( MCDS_CLC_type *) 0xf00e8000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		/* const */ unsigned int KOK            : 1;	/* Key OK Flag */
		unsigned int CLRK           : 1;	/* Clear Key OK Flag */
		/* const */ unsigned int KAV            : 1;	/* Key Available Flag */
		unsigned int                : 5;
		/* const */ unsigned int EN             : 1;	/* MCDS Enable Flag */
		unsigned int CLRE           : 1;	/* Clear MCDS Enable Flag */
		unsigned int SETE           : 1;	/* Set MCDS Enable Flag */
		unsigned int BED            : 1;	/* Bus Error Disable Flag */
		unsigned int                : 2;
		unsigned int BED_P          : 1;	/* Bus Error Disable Protection */
		unsigned int                : 1;
		/* const */ unsigned int IRA            : 1;	/* Invalid Read Access Flag */
		unsigned int CLRI           : 1;	/* Clear Invalid Access Bits */
		/* const */ unsigned int IWA            : 1;	/* Invalid Write Access Flag */
		unsigned int                : 5;
		/* const */ unsigned int RES            : 1;	/* MCDS Reset Flag */
		unsigned int                : 1;
		unsigned int SETR           : 1;	/* MCDS Reset Request Bit */
	} B;
	int I;
	unsigned int U;

} MCDS_CT_type;
#define MCDS_CT	(*( MCDS_CT_type *) 0xf00e8010u)	/* MCDS Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 12;
		unsigned int BOTTOM         : 8;	/* Trace Buffer lower Bound */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_FIFOBOT_type;
#define MCDS_FIFOBOT	(*( MCDS_FIFOBOT_type *) 0xf00e8204u)	/* Trace Buffer Bottom Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TRG            : 1;	/* Trigger Received Flag */
		/* const */ unsigned int FFE            : 1;	/* FIFO Feeder Empty */
		/* const */ unsigned int TME            : 1;	/* Trace Buffer Access Error */
		unsigned int                : 6;
		/* const */ unsigned int TRDIS          : 1;	/* Trigger Disable Flag */
		unsigned int TRON           : 1;	/* Clear Trigger Disable Flag */
		unsigned int TROFF          : 1;	/* Set Trigger Disable Flag */
		unsigned int                : 1;
		/* const */ unsigned int FLSH           : 1;	/* Flush Flag */
		unsigned int CLR            : 1;	/* Clear Flush Flag */
		unsigned int SET            : 1;	/* Set Flush Flag */
		unsigned int NTN            : 1;	/* Next Tile Now request */
		unsigned int                : 7;
		unsigned int CTTO           : 7;	/* Continuos Trace Time Out */
		unsigned int CTTO_P         : 1;	/* CTTO write protection */
	} B;
	int I;
	unsigned int U;

} MCDS_FIFOCTL_type;
#define MCDS_FIFOCTL	(*( MCDS_FIFOCTL_type *) 0xf00e8210u)	/* Trace Buffer Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 5;
		/* const */ unsigned int NOW            : 15;	/* Trace Buffer Current Write Pointer */
		/* const */ unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_FIFONOW_type;
#define MCDS_FIFONOW	(*( MCDS_FIFONOW_type *) 0xf00e8200u)	/* Trace Buffer Write Pointer */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int PRE            : 15;	/* Trace Buffer Pre-Trigger Area Size */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_FIFOPRE_type;
#define MCDS_FIFOPRE	(*( MCDS_FIFOPRE_type *) 0xf00e8208u)	/* Trace Buffer PRE/POST Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int TOP            : 15;	/* Trace Buffer upper Bound */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_FIFOTOP_type;
#define MCDS_FIFOTOP	(*( MCDS_FIFOTOP_type *) 0xf00e820cu)	/* Trace Buffer Top Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int WARN           : 15;	/* Trace Buffer Warn Level */
		unsigned int                : 10;
		unsigned int OCDEN          : 1;	/* Enable Trigger Output */
		unsigned int EN             : 1;	/* Enable Trigger Generation */
	} B;
	int I;
	unsigned int U;

} MCDS_FIFOWARN0_type;
#define MCDS_FIFOWARN0	(*( MCDS_FIFOWARN0_type *) 0xf00e8214u)	/* Trace Buffer Comparator Register */
#define MCDS_FIFOWARN1	(*( MCDS_FIFOWARN0_type *) 0xf00e8218u)	/* Trace Buffer Comparator Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} MCDS_ID_type;
#define MCDS_ID	(*( MCDS_ID_type *) 0xf00e8008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int AIS0           : 5;	/* Action Input Selector */
		unsigned int AIQ0           : 2;	/* Action Input Qualifier */
		unsigned int LV0            : 1;	/* Action Input Level Mode */
		unsigned int AIS1           : 5;	/* Action Input Selector */
		unsigned int AIQ1           : 2;	/* Action Input Qualifier */
		unsigned int LV1            : 1;	/* Action Input Level Mode */
		unsigned int AIS2           : 5;	/* Action Input Selector */
		unsigned int AIQ2           : 2;	/* Action Input Qualifier */
		unsigned int LV2            : 1;	/* Action Input Level Mode */
		unsigned int AIS3           : 5;	/* Action Input Selector */
		unsigned int AIQ3           : 2;	/* Action Input Qualifier */
		unsigned int LV3            : 1;	/* Action Input Level Mode */
	} B;
	int I;
	unsigned int U;

} MCDS_MCXACT0_type;
#define MCDS_MCXACT0	(*( MCDS_MCXACT0_type *) 0xf00e8880u)	/* Action Definition Register 0 */
#define MCDS_MCXACT1	(*( MCDS_MCXACT0_type *) 0xf00e8884u)	/* Action Definition Register 1 */
#define MCDS_MCXACT10	(*( MCDS_MCXACT0_type *) 0xf00e88a8u)	/* Action Definition Register 10 */
#define MCDS_MCXACT11	(*( MCDS_MCXACT0_type *) 0xf00e88acu)	/* Action Definition Register 11 */
#define MCDS_MCXACT12	(*( MCDS_MCXACT0_type *) 0xf00e88b0u)	/* Action Definition Register 12 */
#define MCDS_MCXACT13	(*( MCDS_MCXACT0_type *) 0xf00e88b4u)	/* Action Definition Register 13 */
#define MCDS_MCXACT14	(*( MCDS_MCXACT0_type *) 0xf00e88b8u)	/* Action Definition Register 14 */
#define MCDS_MCXACT15	(*( MCDS_MCXACT0_type *) 0xf00e88bcu)	/* Action Definition Register 15 */
#define MCDS_MCXACT16	(*( MCDS_MCXACT0_type *) 0xf00e88c0u)	/* Action Definition Register 16 */
#define MCDS_MCXACT17	(*( MCDS_MCXACT0_type *) 0xf00e88c4u)	/* Action Definition Register 17 */
#define MCDS_MCXACT18	(*( MCDS_MCXACT0_type *) 0xf00e88c8u)	/* Action Definition Register 18 */
#define MCDS_MCXACT19	(*( MCDS_MCXACT0_type *) 0xf00e88ccu)	/* Action Definition Register 19 */
#define MCDS_MCXACT2	(*( MCDS_MCXACT0_type *) 0xf00e8888u)	/* Action Definition Register 2 */
#define MCDS_MCXACT20	(*( MCDS_MCXACT0_type *) 0xf00e88d0u)	/* Action Definition Register 20 */
#define MCDS_MCXACT21	(*( MCDS_MCXACT0_type *) 0xf00e88d4u)	/* Action Definition Register 21 */
#define MCDS_MCXACT22	(*( MCDS_MCXACT0_type *) 0xf00e88d8u)	/* Action Definition Register 22 */
#define MCDS_MCXACT23	(*( MCDS_MCXACT0_type *) 0xf00e88dcu)	/* Action Definition Register 23 */
#define MCDS_MCXACT24	(*( MCDS_MCXACT0_type *) 0xf00e88e0u)	/* Action Definition Register 24 */
#define MCDS_MCXACT25	(*( MCDS_MCXACT0_type *) 0xf00e88e4u)	/* Action Definition Register 25 */
#define MCDS_MCXACT26	(*( MCDS_MCXACT0_type *) 0xf00e88e8u)	/* Action Definition Register 26 */
#define MCDS_MCXACT27	(*( MCDS_MCXACT0_type *) 0xf00e88ecu)	/* Action Definition Register 27 */
#define MCDS_MCXACT28	(*( MCDS_MCXACT0_type *) 0xf00e88f0u)	/* Action Definition Register 28 */
#define MCDS_MCXACT29	(*( MCDS_MCXACT0_type *) 0xf00e88f4u)	/* Action Definition Register 29 */
#define MCDS_MCXACT3	(*( MCDS_MCXACT0_type *) 0xf00e888cu)	/* Action Definition Register 3 */
#define MCDS_MCXACT30	(*( MCDS_MCXACT0_type *) 0xf00e88f8u)	/* Action Definition Register 30 */
#define MCDS_MCXACT31	(*( MCDS_MCXACT0_type *) 0xf00e88fcu)	/* Action Definition Register 31 */
#define MCDS_MCXACT32	(*( MCDS_MCXACT0_type *) 0xf00e8900u)	/* Action Definition Register 32 */
#define MCDS_MCXACT33	(*( MCDS_MCXACT0_type *) 0xf00e8904u)	/* Action Definition Register 33 */
#define MCDS_MCXACT34	(*( MCDS_MCXACT0_type *) 0xf00e8908u)	/* Action Definition Register 34 */
#define MCDS_MCXACT35	(*( MCDS_MCXACT0_type *) 0xf00e890cu)	/* Action Definition Register 35 */
#define MCDS_MCXACT36	(*( MCDS_MCXACT0_type *) 0xf00e8910u)	/* Action Definition Register 36 */
#define MCDS_MCXACT37	(*( MCDS_MCXACT0_type *) 0xf00e8914u)	/* Action Definition Register 37 */
#define MCDS_MCXACT38	(*( MCDS_MCXACT0_type *) 0xf00e8918u)	/* Action Definition Register 38 */
#define MCDS_MCXACT39	(*( MCDS_MCXACT0_type *) 0xf00e891cu)	/* Action Definition Register 39 */
#define MCDS_MCXACT4	(*( MCDS_MCXACT0_type *) 0xf00e8890u)	/* Action Definition Register 4 */
#define MCDS_MCXACT40	(*( MCDS_MCXACT0_type *) 0xf00e8920u)	/* Action Definition Register 40 */
#define MCDS_MCXACT41	(*( MCDS_MCXACT0_type *) 0xf00e8924u)	/* Action Definition Register 41 */
#define MCDS_MCXACT42	(*( MCDS_MCXACT0_type *) 0xf00e8928u)	/* Action Definition Register 42 */
#define MCDS_MCXACT43	(*( MCDS_MCXACT0_type *) 0xf00e892cu)	/* Action Definition Register 43 */
#define MCDS_MCXACT44	(*( MCDS_MCXACT0_type *) 0xf00e8930u)	/* Action Definition Register 44 */
#define MCDS_MCXACT45	(*( MCDS_MCXACT0_type *) 0xf00e8934u)	/* Action Definition Register 45 */
#define MCDS_MCXACT46	(*( MCDS_MCXACT0_type *) 0xf00e8938u)	/* Action Definition Register 46 */
#define MCDS_MCXACT47	(*( MCDS_MCXACT0_type *) 0xf00e893cu)	/* Action Definition Register 47 */
#define MCDS_MCXACT48	(*( MCDS_MCXACT0_type *) 0xf00e8940u)	/* Action Definition Register 48 */
#define MCDS_MCXACT49	(*( MCDS_MCXACT0_type *) 0xf00e8944u)	/* Action Definition Register 49 */
#define MCDS_MCXACT5	(*( MCDS_MCXACT0_type *) 0xf00e8894u)	/* Action Definition Register 5 */
#define MCDS_MCXACT50	(*( MCDS_MCXACT0_type *) 0xf00e8948u)	/* Action Definition Register 50 */
#define MCDS_MCXACT51	(*( MCDS_MCXACT0_type *) 0xf00e894cu)	/* Action Definition Register 51 */
#define MCDS_MCXACT52	(*( MCDS_MCXACT0_type *) 0xf00e8950u)	/* Action Definition Register 52 */
#define MCDS_MCXACT53	(*( MCDS_MCXACT0_type *) 0xf00e8954u)	/* Action Definition Register 53 */
#define MCDS_MCXACT54	(*( MCDS_MCXACT0_type *) 0xf00e8958u)	/* Action Definition Register 54 */
#define MCDS_MCXACT55	(*( MCDS_MCXACT0_type *) 0xf00e895cu)	/* Action Definition Register 55 */
#define MCDS_MCXACT56	(*( MCDS_MCXACT0_type *) 0xf00e8960u)	/* Action Definition Register 56 */
#define MCDS_MCXACT57	(*( MCDS_MCXACT0_type *) 0xf00e8964u)	/* Action Definition Register 57 */
#define MCDS_MCXACT58	(*( MCDS_MCXACT0_type *) 0xf00e8968u)	/* Action Definition Register 58 */
#define MCDS_MCXACT59	(*( MCDS_MCXACT0_type *) 0xf00e896cu)	/* Action Definition Register 59 */
#define MCDS_MCXACT6	(*( MCDS_MCXACT0_type *) 0xf00e8898u)	/* Action Definition Register 6 */
#define MCDS_MCXACT60	(*( MCDS_MCXACT0_type *) 0xf00e8970u)	/* Action Definition Register 60 */
#define MCDS_MCXACT61	(*( MCDS_MCXACT0_type *) 0xf00e8974u)	/* Action Definition Register 61 */
#define MCDS_MCXACT62	(*( MCDS_MCXACT0_type *) 0xf00e8978u)	/* Action Definition Register 62 */
#define MCDS_MCXACT63	(*( MCDS_MCXACT0_type *) 0xf00e897cu)	/* Action Definition Register 63 */
#define MCDS_MCXACT64	(*( MCDS_MCXACT0_type *) 0xf00e8980u)	/* Action Definition Register 64 */
#define MCDS_MCXACT65	(*( MCDS_MCXACT0_type *) 0xf00e8984u)	/* Action Definition Register 65 */
#define MCDS_MCXACT66	(*( MCDS_MCXACT0_type *) 0xf00e8988u)	/* Action Definition Register 66 */
#define MCDS_MCXACT67	(*( MCDS_MCXACT0_type *) 0xf00e898cu)	/* Action Definition Register 67 */
#define MCDS_MCXACT68	(*( MCDS_MCXACT0_type *) 0xf00e8990u)	/* Action Definition Register 68 */
#define MCDS_MCXACT69	(*( MCDS_MCXACT0_type *) 0xf00e8994u)	/* Action Definition Register 69 */
#define MCDS_MCXACT7	(*( MCDS_MCXACT0_type *) 0xf00e889cu)	/* Action Definition Register 7 */
#define MCDS_MCXACT70	(*( MCDS_MCXACT0_type *) 0xf00e8998u)	/* Action Definition Register 70 */
#define MCDS_MCXACT71	(*( MCDS_MCXACT0_type *) 0xf00e899cu)	/* Action Definition Register 71 */
#define MCDS_MCXACT8	(*( MCDS_MCXACT0_type *) 0xf00e88a0u)	/* Action Definition Register 8 */
#define MCDS_MCXACT9	(*( MCDS_MCXACT0_type *) 0xf00e88a4u)	/* Action Definition Register 9 */
#define MCDS_SPBACT0	(*( MCDS_MCXACT0_type *) 0xf00ee880u)	/* Action Definition Register 0 */
#define MCDS_SPBACT1	(*( MCDS_MCXACT0_type *) 0xf00ee884u)	/* Action Definition Register 1 */
#define MCDS_SPBACT10	(*( MCDS_MCXACT0_type *) 0xf00ee8a8u)	/* Action Definition Register 10 */
#define MCDS_SPBACT11	(*( MCDS_MCXACT0_type *) 0xf00ee8acu)	/* Action Definition Register 11 */
#define MCDS_SPBACT12	(*( MCDS_MCXACT0_type *) 0xf00ee8b0u)	/* Action Definition Register 12 */
#define MCDS_SPBACT13	(*( MCDS_MCXACT0_type *) 0xf00ee8b4u)	/* Action Definition Register 13 */
#define MCDS_SPBACT14	(*( MCDS_MCXACT0_type *) 0xf00ee8b8u)	/* Action Definition Register 14 */
#define MCDS_SPBACT2	(*( MCDS_MCXACT0_type *) 0xf00ee888u)	/* Action Definition Register 2 */
#define MCDS_SPBACT3	(*( MCDS_MCXACT0_type *) 0xf00ee88cu)	/* Action Definition Register 3 */
#define MCDS_SPBACT4	(*( MCDS_MCXACT0_type *) 0xf00ee890u)	/* Action Definition Register 4 */
#define MCDS_SPBACT5	(*( MCDS_MCXACT0_type *) 0xf00ee894u)	/* Action Definition Register 5 */
#define MCDS_SPBACT6	(*( MCDS_MCXACT0_type *) 0xf00ee898u)	/* Action Definition Register 6 */
#define MCDS_SPBACT7	(*( MCDS_MCXACT0_type *) 0xf00ee89cu)	/* Action Definition Register 7 */
#define MCDS_SPBACT8	(*( MCDS_MCXACT0_type *) 0xf00ee8a0u)	/* Action Definition Register 8 */
#define MCDS_SPBACT9	(*( MCDS_MCXACT0_type *) 0xf00ee8a4u)	/* Action Definition Register 9 */
#define MCDS_SRIACT0	(*( MCDS_MCXACT0_type *) 0xf00ef880u)	/* Action Definition Register 0 */
#define MCDS_SRIACT1	(*( MCDS_MCXACT0_type *) 0xf00ef884u)	/* Action Definition Register 1 */
#define MCDS_SRIACT10	(*( MCDS_MCXACT0_type *) 0xf00ef8a8u)	/* Action Definition Register 10 */
#define MCDS_SRIACT11	(*( MCDS_MCXACT0_type *) 0xf00ef8acu)	/* Action Definition Register 11 */
#define MCDS_SRIACT12	(*( MCDS_MCXACT0_type *) 0xf00ef8b0u)	/* Action Definition Register 12 */
#define MCDS_SRIACT13	(*( MCDS_MCXACT0_type *) 0xf00ef8b4u)	/* Action Definition Register 13 */
#define MCDS_SRIACT14	(*( MCDS_MCXACT0_type *) 0xf00ef8b8u)	/* Action Definition Register 14 */
#define MCDS_SRIACT15	(*( MCDS_MCXACT0_type *) 0xf00ef8bcu)	/* Action Definition Register 15 */
#define MCDS_SRIACT16	(*( MCDS_MCXACT0_type *) 0xf00ef8c0u)	/* Action Definition Register 16 */
#define MCDS_SRIACT17	(*( MCDS_MCXACT0_type *) 0xf00ef8c4u)	/* Action Definition Register 17 */
#define MCDS_SRIACT18	(*( MCDS_MCXACT0_type *) 0xf00ef8c8u)	/* Action Definition Register 18 */
#define MCDS_SRIACT19	(*( MCDS_MCXACT0_type *) 0xf00ef8ccu)	/* Action Definition Register 19 */
#define MCDS_SRIACT2	(*( MCDS_MCXACT0_type *) 0xf00ef888u)	/* Action Definition Register 2 */
#define MCDS_SRIACT20	(*( MCDS_MCXACT0_type *) 0xf00ef8d0u)	/* Action Definition Register 20 */
#define MCDS_SRIACT21	(*( MCDS_MCXACT0_type *) 0xf00ef8d4u)	/* Action Definition Register 21 */
#define MCDS_SRIACT22	(*( MCDS_MCXACT0_type *) 0xf00ef8d8u)	/* Action Definition Register 22 */
#define MCDS_SRIACT23	(*( MCDS_MCXACT0_type *) 0xf00ef8dcu)	/* Action Definition Register 23 */
#define MCDS_SRIACT24	(*( MCDS_MCXACT0_type *) 0xf00ef8e0u)	/* Action Definition Register 24 */
#define MCDS_SRIACT25	(*( MCDS_MCXACT0_type *) 0xf00ef8e4u)	/* Action Definition Register 25 */
#define MCDS_SRIACT26	(*( MCDS_MCXACT0_type *) 0xf00ef8e8u)	/* Action Definition Register 26 */
#define MCDS_SRIACT3	(*( MCDS_MCXACT0_type *) 0xf00ef88cu)	/* Action Definition Register 3 */
#define MCDS_SRIACT4	(*( MCDS_MCXACT0_type *) 0xf00ef890u)	/* Action Definition Register 4 */
#define MCDS_SRIACT5	(*( MCDS_MCXACT0_type *) 0xf00ef894u)	/* Action Definition Register 5 */
#define MCDS_SRIACT6	(*( MCDS_MCXACT0_type *) 0xf00ef898u)	/* Action Definition Register 6 */
#define MCDS_SRIACT7	(*( MCDS_MCXACT0_type *) 0xf00ef89cu)	/* Action Definition Register 7 */
#define MCDS_SRIACT8	(*( MCDS_MCXACT0_type *) 0xf00ef8a0u)	/* Action Definition Register 8 */
#define MCDS_SRIACT9	(*( MCDS_MCXACT0_type *) 0xf00ef8a4u)	/* Action Definition Register 9 */
#define MCDS_TCXACT0	(*( MCDS_MCXACT0_type *) 0xf00ea880u)	/* Action Definition Register 0 */
#define MCDS_TCXACT1	(*( MCDS_MCXACT0_type *) 0xf00ea884u)	/* Action Definition Register 1 */
#define MCDS_TCXACT10	(*( MCDS_MCXACT0_type *) 0xf00ea8a8u)	/* Action Definition Register 10 */
#define MCDS_TCXACT11	(*( MCDS_MCXACT0_type *) 0xf00ea8acu)	/* Action Definition Register 11 */
#define MCDS_TCXACT12	(*( MCDS_MCXACT0_type *) 0xf00ea8b0u)	/* Action Definition Register 12 */
#define MCDS_TCXACT13	(*( MCDS_MCXACT0_type *) 0xf00ea8b4u)	/* Action Definition Register 13 */
#define MCDS_TCXACT14	(*( MCDS_MCXACT0_type *) 0xf00ea8b8u)	/* Action Definition Register 14 */
#define MCDS_TCXACT15	(*( MCDS_MCXACT0_type *) 0xf00ea8bcu)	/* Action Definition Register 15 */
#define MCDS_TCXACT16	(*( MCDS_MCXACT0_type *) 0xf00ea8c0u)	/* Action Definition Register 16 */
#define MCDS_TCXACT17	(*( MCDS_MCXACT0_type *) 0xf00ea8c4u)	/* Action Definition Register 17 */
#define MCDS_TCXACT18	(*( MCDS_MCXACT0_type *) 0xf00ea8c8u)	/* Action Definition Register 18 */
#define MCDS_TCXACT19	(*( MCDS_MCXACT0_type *) 0xf00ea8ccu)	/* Action Definition Register 19 */
#define MCDS_TCXACT2	(*( MCDS_MCXACT0_type *) 0xf00ea888u)	/* Action Definition Register 2 */
#define MCDS_TCXACT20	(*( MCDS_MCXACT0_type *) 0xf00ea8d0u)	/* Action Definition Register 20 */
#define MCDS_TCXACT21	(*( MCDS_MCXACT0_type *) 0xf00ea8d4u)	/* Action Definition Register 21 */
#define MCDS_TCXACT22	(*( MCDS_MCXACT0_type *) 0xf00ea8d8u)	/* Action Definition Register 22 */
#define MCDS_TCXACT3	(*( MCDS_MCXACT0_type *) 0xf00ea88cu)	/* Action Definition Register 3 */
#define MCDS_TCXACT4	(*( MCDS_MCXACT0_type *) 0xf00ea890u)	/* Action Definition Register 4 */
#define MCDS_TCXACT5	(*( MCDS_MCXACT0_type *) 0xf00ea894u)	/* Action Definition Register 5 */
#define MCDS_TCXACT6	(*( MCDS_MCXACT0_type *) 0xf00ea898u)	/* Action Definition Register 6 */
#define MCDS_TCXACT7	(*( MCDS_MCXACT0_type *) 0xf00ea89cu)	/* Action Definition Register 7 */
#define MCDS_TCXACT8	(*( MCDS_MCXACT0_type *) 0xf00ea8a0u)	/* Action Definition Register 8 */
#define MCDS_TCXACT9	(*( MCDS_MCXACT0_type *) 0xf00ea8a4u)	/* Action Definition Register 9 */
#define MCDS_TCYACT0	(*( MCDS_MCXACT0_type *) 0xf00ec880u)	/* Action Definition Register 0 */
#define MCDS_TCYACT1	(*( MCDS_MCXACT0_type *) 0xf00ec884u)	/* Action Definition Register 1 */
#define MCDS_TCYACT10	(*( MCDS_MCXACT0_type *) 0xf00ec8a8u)	/* Action Definition Register 10 */
#define MCDS_TCYACT11	(*( MCDS_MCXACT0_type *) 0xf00ec8acu)	/* Action Definition Register 11 */
#define MCDS_TCYACT12	(*( MCDS_MCXACT0_type *) 0xf00ec8b0u)	/* Action Definition Register 12 */
#define MCDS_TCYACT13	(*( MCDS_MCXACT0_type *) 0xf00ec8b4u)	/* Action Definition Register 13 */
#define MCDS_TCYACT14	(*( MCDS_MCXACT0_type *) 0xf00ec8b8u)	/* Action Definition Register 14 */
#define MCDS_TCYACT15	(*( MCDS_MCXACT0_type *) 0xf00ec8bcu)	/* Action Definition Register 15 */
#define MCDS_TCYACT16	(*( MCDS_MCXACT0_type *) 0xf00ec8c0u)	/* Action Definition Register 16 */
#define MCDS_TCYACT17	(*( MCDS_MCXACT0_type *) 0xf00ec8c4u)	/* Action Definition Register 17 */
#define MCDS_TCYACT18	(*( MCDS_MCXACT0_type *) 0xf00ec8c8u)	/* Action Definition Register 18 */
#define MCDS_TCYACT19	(*( MCDS_MCXACT0_type *) 0xf00ec8ccu)	/* Action Definition Register 19 */
#define MCDS_TCYACT2	(*( MCDS_MCXACT0_type *) 0xf00ec888u)	/* Action Definition Register 2 */
#define MCDS_TCYACT20	(*( MCDS_MCXACT0_type *) 0xf00ec8d0u)	/* Action Definition Register 20 */
#define MCDS_TCYACT21	(*( MCDS_MCXACT0_type *) 0xf00ec8d4u)	/* Action Definition Register 21 */
#define MCDS_TCYACT22	(*( MCDS_MCXACT0_type *) 0xf00ec8d8u)	/* Action Definition Register 22 */
#define MCDS_TCYACT3	(*( MCDS_MCXACT0_type *) 0xf00ec88cu)	/* Action Definition Register 3 */
#define MCDS_TCYACT4	(*( MCDS_MCXACT0_type *) 0xf00ec890u)	/* Action Definition Register 4 */
#define MCDS_TCYACT5	(*( MCDS_MCXACT0_type *) 0xf00ec894u)	/* Action Definition Register 5 */
#define MCDS_TCYACT6	(*( MCDS_MCXACT0_type *) 0xf00ec898u)	/* Action Definition Register 6 */
#define MCDS_TCYACT7	(*( MCDS_MCXACT0_type *) 0xf00ec89cu)	/* Action Definition Register 7 */
#define MCDS_TCYACT8	(*( MCDS_MCXACT0_type *) 0xf00ec8a0u)	/* Action Definition Register 8 */
#define MCDS_TCYACT9	(*( MCDS_MCXACT0_type *) 0xf00ec8a4u)	/* Action Definition Register 9 */

