svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int INC0           : 7;	/* Count Input Selector */
		unsigned int ILV0           : 1;	/* Count Input Level Mode */
		unsigned int CLR0           : 6;	/* Clear Input Selector */
		unsigned int                : 1;
		unsigned int CLV0           : 1;	/* Clear Input Level Mode */
		unsigned int INC1           : 7;	/* Count Input Selector */
		unsigned int ILV1           : 1;	/* Count Input Level Mode */
		unsigned int CLR1           : 6;	/* Clear Input Selector */
		unsigned int                : 1;
		unsigned int CLV1           : 1;	/* Clear Input Level Mode */
	} B;
	int I;
	unsigned int U;

} MCDS_MCXCCL0_type;
#define MCDS_MCXCCL0	(*( MCDS_MCXCCL0_type *) 0xf00e8a00u)	/* Counter Control Register */
#define MCDS_MCXCCL1	(*( MCDS_MCXCCL0_type *) 0xf00e8a10u)	/* Counter Control Register */
#define MCDS_MCXCCL10	(*( MCDS_MCXCCL0_type *) 0xf00e8aa0u)	/* Counter Control Register */
#define MCDS_MCXCCL11	(*( MCDS_MCXCCL0_type *) 0xf00e8ab0u)	/* Counter Control Register */
#define MCDS_MCXCCL12	(*( MCDS_MCXCCL0_type *) 0xf00e8ac0u)	/* Counter Control Register */
#define MCDS_MCXCCL13	(*( MCDS_MCXCCL0_type *) 0xf00e8ad0u)	/* Counter Control Register */
#define MCDS_MCXCCL14	(*( MCDS_MCXCCL0_type *) 0xf00e8ae0u)	/* Counter Control Register */
#define MCDS_MCXCCL15	(*( MCDS_MCXCCL0_type *) 0xf00e8af0u)	/* Counter Control Register */
#define MCDS_MCXCCL16	(*( MCDS_MCXCCL0_type *) 0xf00e8b00u)	/* Counter Control Register */
#define MCDS_MCXCCL17	(*( MCDS_MCXCCL0_type *) 0xf00e8b10u)	/* Counter Control Register */
#define MCDS_MCXCCL18	(*( MCDS_MCXCCL0_type *) 0xf00e8b20u)	/* Counter Control Register */
#define MCDS_MCXCCL19	(*( MCDS_MCXCCL0_type *) 0xf00e8b30u)	/* Counter Control Register */
#define MCDS_MCXCCL2	(*( MCDS_MCXCCL0_type *) 0xf00e8a20u)	/* Counter Control Register */
#define MCDS_MCXCCL20	(*( MCDS_MCXCCL0_type *) 0xf00e8b40u)	/* Counter Control Register */
#define MCDS_MCXCCL21	(*( MCDS_MCXCCL0_type *) 0xf00e8b50u)	/* Counter Control Register */
#define MCDS_MCXCCL22	(*( MCDS_MCXCCL0_type *) 0xf00e8b60u)	/* Counter Control Register */
#define MCDS_MCXCCL23	(*( MCDS_MCXCCL0_type *) 0xf00e8b70u)	/* Counter Control Register */
#define MCDS_MCXCCL24	(*( MCDS_MCXCCL0_type *) 0xf00e8b80u)	/* Counter Control Register */
#define MCDS_MCXCCL25	(*( MCDS_MCXCCL0_type *) 0xf00e8b90u)	/* Counter Control Register */
#define MCDS_MCXCCL26	(*( MCDS_MCXCCL0_type *) 0xf00e8ba0u)	/* Counter Control Register */
#define MCDS_MCXCCL27	(*( MCDS_MCXCCL0_type *) 0xf00e8bb0u)	/* Counter Control Register */
#define MCDS_MCXCCL28	(*( MCDS_MCXCCL0_type *) 0xf00e8bc0u)	/* Counter Control Register */
#define MCDS_MCXCCL29	(*( MCDS_MCXCCL0_type *) 0xf00e8bd0u)	/* Counter Control Register */
#define MCDS_MCXCCL3	(*( MCDS_MCXCCL0_type *) 0xf00e8a30u)	/* Counter Control Register */
#define MCDS_MCXCCL30	(*( MCDS_MCXCCL0_type *) 0xf00e8be0u)	/* Counter Control Register */
#define MCDS_MCXCCL31	(*( MCDS_MCXCCL0_type *) 0xf00e8bf0u)	/* Counter Control Register */
#define MCDS_MCXCCL4	(*( MCDS_MCXCCL0_type *) 0xf00e8a40u)	/* Counter Control Register */
#define MCDS_MCXCCL5	(*( MCDS_MCXCCL0_type *) 0xf00e8a50u)	/* Counter Control Register */
#define MCDS_MCXCCL6	(*( MCDS_MCXCCL0_type *) 0xf00e8a60u)	/* Counter Control Register */
#define MCDS_MCXCCL7	(*( MCDS_MCXCCL0_type *) 0xf00e8a70u)	/* Counter Control Register */
#define MCDS_MCXCCL8	(*( MCDS_MCXCCL0_type *) 0xf00e8a80u)	/* Counter Control Register */
#define MCDS_MCXCCL9	(*( MCDS_MCXCCL0_type *) 0xf00e8a90u)	/* Counter Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int COUNT          : 16;	/* Current Counter */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} MCDS_MCXCNT0_type;
#define MCDS_MCXCNT0	(*( MCDS_MCXCNT0_type *) 0xf00e8a08u)	/* Current Count Register */
#define MCDS_MCXCNT1	(*( MCDS_MCXCNT0_type *) 0xf00e8a18u)	/* Current Count Register */
#define MCDS_MCXCNT10	(*( MCDS_MCXCNT0_type *) 0xf00e8aa8u)	/* Current Count Register */
#define MCDS_MCXCNT11	(*( MCDS_MCXCNT0_type *) 0xf00e8ab8u)	/* Current Count Register */
#define MCDS_MCXCNT12	(*( MCDS_MCXCNT0_type *) 0xf00e8ac8u)	/* Current Count Register */
#define MCDS_MCXCNT13	(*( MCDS_MCXCNT0_type *) 0xf00e8ad8u)	/* Current Count Register */
#define MCDS_MCXCNT14	(*( MCDS_MCXCNT0_type *) 0xf00e8ae8u)	/* Current Count Register */
#define MCDS_MCXCNT15	(*( MCDS_MCXCNT0_type *) 0xf00e8af8u)	/* Current Count Register */
#define MCDS_MCXCNT16	(*( MCDS_MCXCNT0_type *) 0xf00e8b08u)	/* Current Count Register */
#define MCDS_MCXCNT17	(*( MCDS_MCXCNT0_type *) 0xf00e8b18u)	/* Current Count Register */
#define MCDS_MCXCNT18	(*( MCDS_MCXCNT0_type *) 0xf00e8b28u)	/* Current Count Register */
#define MCDS_MCXCNT19	(*( MCDS_MCXCNT0_type *) 0xf00e8b38u)	/* Current Count Register */
#define MCDS_MCXCNT2	(*( MCDS_MCXCNT0_type *) 0xf00e8a28u)	/* Current Count Register */
#define MCDS_MCXCNT20	(*( MCDS_MCXCNT0_type *) 0xf00e8b48u)	/* Current Count Register */
#define MCDS_MCXCNT21	(*( MCDS_MCXCNT0_type *) 0xf00e8b58u)	/* Current Count Register */
#define MCDS_MCXCNT22	(*( MCDS_MCXCNT0_type *) 0xf00e8b68u)	/* Current Count Register */
#define MCDS_MCXCNT23	(*( MCDS_MCXCNT0_type *) 0xf00e8b78u)	/* Current Count Register */
#define MCDS_MCXCNT24	(*( MCDS_MCXCNT0_type *) 0xf00e8b88u)	/* Current Count Register */
#define MCDS_MCXCNT25	(*( MCDS_MCXCNT0_type *) 0xf00e8b98u)	/* Current Count Register */
#define MCDS_MCXCNT26	(*( MCDS_MCXCNT0_type *) 0xf00e8ba8u)	/* Current Count Register */
#define MCDS_MCXCNT27	(*( MCDS_MCXCNT0_type *) 0xf00e8bb8u)	/* Current Count Register */
#define MCDS_MCXCNT28	(*( MCDS_MCXCNT0_type *) 0xf00e8bc8u)	/* Current Count Register */
#define MCDS_MCXCNT29	(*( MCDS_MCXCNT0_type *) 0xf00e8bd8u)	/* Current Count Register */
#define MCDS_MCXCNT3	(*( MCDS_MCXCNT0_type *) 0xf00e8a38u)	/* Current Count Register */
#define MCDS_MCXCNT30	(*( MCDS_MCXCNT0_type *) 0xf00e8be8u)	/* Current Count Register */
#define MCDS_MCXCNT31	(*( MCDS_MCXCNT0_type *) 0xf00e8bf8u)	/* Current Count Register */
#define MCDS_MCXCNT4	(*( MCDS_MCXCNT0_type *) 0xf00e8a48u)	/* Current Count Register */
#define MCDS_MCXCNT5	(*( MCDS_MCXCNT0_type *) 0xf00e8a58u)	/* Current Count Register */
#define MCDS_MCXCNT6	(*( MCDS_MCXCNT0_type *) 0xf00e8a68u)	/* Current Count Register */
#define MCDS_MCXCNT7	(*( MCDS_MCXCNT0_type *) 0xf00e8a78u)	/* Current Count Register */
#define MCDS_MCXCNT8	(*( MCDS_MCXCNT0_type *) 0xf00e8a88u)	/* Current Count Register */
#define MCDS_MCXCNT9	(*( MCDS_MCXCNT0_type *) 0xf00e8a98u)	/* Current Count Register */

