svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EIQ0           : 2;	/* Event Input Qualifier */
		unsigned int EIQ1           : 2;	/* Event Input Qualifier */
		unsigned int EIQ2           : 2;	/* Event Input Qualifier */
		unsigned int EIQ3           : 2;	/* Event Input Qualifier */
		unsigned int EIQ4           : 2;	/* Event Input Qualifier */
		unsigned int EIQ5           : 2;	/* Event Input Qualifier */
		unsigned int EIQ6           : 2;	/* Event Input Qualifier */
		unsigned int EIQ7           : 2;	/* Event Input Qualifier */
		unsigned int EIQ8           : 2;	/* Event Input Qualifier */
		unsigned int EIQ9           : 2;	/* Event Input Qualifier */
		unsigned int EIQ10          : 2;	/* Event Input Qualifier */
		unsigned int EIQ11          : 2;	/* Event Input Qualifier */
		unsigned int EIQ12          : 2;	/* Event Input Qualifier */
		unsigned int EIQ13          : 2;	/* Event Input Qualifier */
		unsigned int EIQ14          : 2;	/* Event Input Qualifier */
		unsigned int EIQ15          : 2;	/* Event Input Qualifier */
	} B;
	int I;
	unsigned int U;

} MCDS_MCXEVT0_type;
#define MCDS_MCXEVT0	(*( MCDS_MCXEVT0_type *) 0xf00e8800u)	/* Event Definition Register 0 */
#define MCDS_MCXEVT1	(*( MCDS_MCXEVT0_type *) 0xf00e8804u)	/* Event Definition Register 1 */
#define MCDS_MCXEVT10	(*( MCDS_MCXEVT0_type *) 0xf00e8828u)	/* Event Definition Register 10 */
#define MCDS_MCXEVT11	(*( MCDS_MCXEVT0_type *) 0xf00e882cu)	/* Event Definition Register 11 */
#define MCDS_MCXEVT12	(*( MCDS_MCXEVT0_type *) 0xf00e8830u)	/* Event Definition Register 12 */
#define MCDS_MCXEVT13	(*( MCDS_MCXEVT0_type *) 0xf00e8834u)	/* Event Definition Register 13 */
#define MCDS_MCXEVT14	(*( MCDS_MCXEVT0_type *) 0xf00e8838u)	/* Event Definition Register 14 */
#define MCDS_MCXEVT15	(*( MCDS_MCXEVT0_type *) 0xf00e883cu)	/* Event Definition Register 15 */
#define MCDS_MCXEVT16	(*( MCDS_MCXEVT0_type *) 0xf00e8840u)	/* Event Definition Register 16 */
#define MCDS_MCXEVT17	(*( MCDS_MCXEVT0_type *) 0xf00e8844u)	/* Event Definition Register 17 */
#define MCDS_MCXEVT18	(*( MCDS_MCXEVT0_type *) 0xf00e8848u)	/* Event Definition Register 18 */
#define MCDS_MCXEVT19	(*( MCDS_MCXEVT0_type *) 0xf00e884cu)	/* Event Definition Register 19 */
#define MCDS_MCXEVT2	(*( MCDS_MCXEVT0_type *) 0xf00e8808u)	/* Event Definition Register 2 */
#define MCDS_MCXEVT20	(*( MCDS_MCXEVT0_type *) 0xf00e8850u)	/* Event Definition Register 20 */
#define MCDS_MCXEVT21	(*( MCDS_MCXEVT0_type *) 0xf00e8854u)	/* Event Definition Register 21 */
#define MCDS_MCXEVT22	(*( MCDS_MCXEVT0_type *) 0xf00e8858u)	/* Event Definition Register 22 */
#define MCDS_MCXEVT23	(*( MCDS_MCXEVT0_type *) 0xf00e885cu)	/* Event Definition Register 23 */
#define MCDS_MCXEVT3	(*( MCDS_MCXEVT0_type *) 0xf00e880cu)	/* Event Definition Register 3 */
#define MCDS_MCXEVT4	(*( MCDS_MCXEVT0_type *) 0xf00e8810u)	/* Event Definition Register 4 */
#define MCDS_MCXEVT5	(*( MCDS_MCXEVT0_type *) 0xf00e8814u)	/* Event Definition Register 5 */
#define MCDS_MCXEVT6	(*( MCDS_MCXEVT0_type *) 0xf00e8818u)	/* Event Definition Register 6 */
#define MCDS_MCXEVT7	(*( MCDS_MCXEVT0_type *) 0xf00e881cu)	/* Event Definition Register 7 */
#define MCDS_MCXEVT8	(*( MCDS_MCXEVT0_type *) 0xf00e8820u)	/* Event Definition Register 8 */
#define MCDS_MCXEVT9	(*( MCDS_MCXEVT0_type *) 0xf00e8824u)	/* Event Definition Register 9 */
#define MCDS_SPBEVT0	(*( MCDS_MCXEVT0_type *) 0xf00ee800u)	/* Event Definition Register 0 */
#define MCDS_SPBEVT1	(*( MCDS_MCXEVT0_type *) 0xf00ee804u)	/* Event Definition Register 1 */
#define MCDS_SPBEVT10	(*( MCDS_MCXEVT0_type *) 0xf00ee828u)	/* Event Definition Register 10 */
#define MCDS_SPBEVT11	(*( MCDS_MCXEVT0_type *) 0xf00ee82cu)	/* Event Definition Register 11 */
#define MCDS_SPBEVT12	(*( MCDS_MCXEVT0_type *) 0xf00ee830u)	/* Event Definition Register 12 */
#define MCDS_SPBEVT13	(*( MCDS_MCXEVT0_type *) 0xf00ee834u)	/* Event Definition Register 13 */
#define MCDS_SPBEVT14	(*( MCDS_MCXEVT0_type *) 0xf00ee838u)	/* Event Definition Register 14 */
#define MCDS_SPBEVT15	(*( MCDS_MCXEVT0_type *) 0xf00ee83cu)	/* Event Definition Register 15 */
#define MCDS_SPBEVT2	(*( MCDS_MCXEVT0_type *) 0xf00ee808u)	/* Event Definition Register 2 */
#define MCDS_SPBEVT3	(*( MCDS_MCXEVT0_type *) 0xf00ee80cu)	/* Event Definition Register 3 */
#define MCDS_SPBEVT4	(*( MCDS_MCXEVT0_type *) 0xf00ee810u)	/* Event Definition Register 4 */
#define MCDS_SPBEVT5	(*( MCDS_MCXEVT0_type *) 0xf00ee814u)	/* Event Definition Register 5 */
#define MCDS_SPBEVT6	(*( MCDS_MCXEVT0_type *) 0xf00ee818u)	/* Event Definition Register 6 */
#define MCDS_SPBEVT7	(*( MCDS_MCXEVT0_type *) 0xf00ee81cu)	/* Event Definition Register 7 */
#define MCDS_SPBEVT8	(*( MCDS_MCXEVT0_type *) 0xf00ee820u)	/* Event Definition Register 8 */
#define MCDS_SPBEVT9	(*( MCDS_MCXEVT0_type *) 0xf00ee824u)	/* Event Definition Register 9 */
#define MCDS_SRIEVT0	(*( MCDS_MCXEVT0_type *) 0xf00ef800u)	/* Event Definition Register 0 */
#define MCDS_SRIEVT1	(*( MCDS_MCXEVT0_type *) 0xf00ef804u)	/* Event Definition Register 1 */
#define MCDS_SRIEVT10	(*( MCDS_MCXEVT0_type *) 0xf00ef828u)	/* Event Definition Register 10 */
#define MCDS_SRIEVT11	(*( MCDS_MCXEVT0_type *) 0xf00ef82cu)	/* Event Definition Register 11 */
#define MCDS_SRIEVT12	(*( MCDS_MCXEVT0_type *) 0xf00ef830u)	/* Event Definition Register 12 */
#define MCDS_SRIEVT13	(*( MCDS_MCXEVT0_type *) 0xf00ef834u)	/* Event Definition Register 13 */
#define MCDS_SRIEVT14	(*( MCDS_MCXEVT0_type *) 0xf00ef838u)	/* Event Definition Register 14 */
#define MCDS_SRIEVT15	(*( MCDS_MCXEVT0_type *) 0xf00ef83cu)	/* Event Definition Register 15 */
#define MCDS_SRIEVT2	(*( MCDS_MCXEVT0_type *) 0xf00ef808u)	/* Event Definition Register 2 */
#define MCDS_SRIEVT3	(*( MCDS_MCXEVT0_type *) 0xf00ef80cu)	/* Event Definition Register 3 */
#define MCDS_SRIEVT4	(*( MCDS_MCXEVT0_type *) 0xf00ef810u)	/* Event Definition Register 4 */
#define MCDS_SRIEVT5	(*( MCDS_MCXEVT0_type *) 0xf00ef814u)	/* Event Definition Register 5 */
#define MCDS_SRIEVT6	(*( MCDS_MCXEVT0_type *) 0xf00ef818u)	/* Event Definition Register 6 */
#define MCDS_SRIEVT7	(*( MCDS_MCXEVT0_type *) 0xf00ef81cu)	/* Event Definition Register 7 */
#define MCDS_SRIEVT8	(*( MCDS_MCXEVT0_type *) 0xf00ef820u)	/* Event Definition Register 8 */
#define MCDS_SRIEVT9	(*( MCDS_MCXEVT0_type *) 0xf00ef824u)	/* Event Definition Register 9 */
#define MCDS_TCXEVT0	(*( MCDS_MCXEVT0_type *) 0xf00ea800u)	/* Event Definition Register 0 */
#define MCDS_TCXEVT1	(*( MCDS_MCXEVT0_type *) 0xf00ea804u)	/* Event Definition Register 1 */
#define MCDS_TCXEVT10	(*( MCDS_MCXEVT0_type *) 0xf00ea828u)	/* Event Definition Register 10 */
#define MCDS_TCXEVT11	(*( MCDS_MCXEVT0_type *) 0xf00ea82cu)	/* Event Definition Register 11 */
#define MCDS_TCXEVT12	(*( MCDS_MCXEVT0_type *) 0xf00ea830u)	/* Event Definition Register 12 */
#define MCDS_TCXEVT13	(*( MCDS_MCXEVT0_type *) 0xf00ea834u)	/* Event Definition Register 13 */
#define MCDS_TCXEVT14	(*( MCDS_MCXEVT0_type *) 0xf00ea838u)	/* Event Definition Register 14 */
#define MCDS_TCXEVT15	(*( MCDS_MCXEVT0_type *) 0xf00ea83cu)	/* Event Definition Register 15 */
#define MCDS_TCXEVT2	(*( MCDS_MCXEVT0_type *) 0xf00ea808u)	/* Event Definition Register 2 */
#define MCDS_TCXEVT3	(*( MCDS_MCXEVT0_type *) 0xf00ea80cu)	/* Event Definition Register 3 */
#define MCDS_TCXEVT4	(*( MCDS_MCXEVT0_type *) 0xf00ea810u)	/* Event Definition Register 4 */
#define MCDS_TCXEVT5	(*( MCDS_MCXEVT0_type *) 0xf00ea814u)	/* Event Definition Register 5 */
#define MCDS_TCXEVT6	(*( MCDS_MCXEVT0_type *) 0xf00ea818u)	/* Event Definition Register 6 */
#define MCDS_TCXEVT7	(*( MCDS_MCXEVT0_type *) 0xf00ea81cu)	/* Event Definition Register 7 */
#define MCDS_TCXEVT8	(*( MCDS_MCXEVT0_type *) 0xf00ea820u)	/* Event Definition Register 8 */
#define MCDS_TCXEVT9	(*( MCDS_MCXEVT0_type *) 0xf00ea824u)	/* Event Definition Register 9 */
#define MCDS_TCYEVT0	(*( MCDS_MCXEVT0_type *) 0xf00ec800u)	/* Event Definition Register 0 */
#define MCDS_TCYEVT1	(*( MCDS_MCXEVT0_type *) 0xf00ec804u)	/* Event Definition Register 1 */
#define MCDS_TCYEVT10	(*( MCDS_MCXEVT0_type *) 0xf00ec828u)	/* Event Definition Register 10 */
#define MCDS_TCYEVT11	(*( MCDS_MCXEVT0_type *) 0xf00ec82cu)	/* Event Definition Register 11 */
#define MCDS_TCYEVT12	(*( MCDS_MCXEVT0_type *) 0xf00ec830u)	/* Event Definition Register 12 */
#define MCDS_TCYEVT13	(*( MCDS_MCXEVT0_type *) 0xf00ec834u)	/* Event Definition Register 13 */
#define MCDS_TCYEVT14	(*( MCDS_MCXEVT0_type *) 0xf00ec838u)	/* Event Definition Register 14 */
#define MCDS_TCYEVT15	(*( MCDS_MCXEVT0_type *) 0xf00ec83cu)	/* Event Definition Register 15 */
#define MCDS_TCYEVT2	(*( MCDS_MCXEVT0_type *) 0xf00ec808u)	/* Event Definition Register 2 */
#define MCDS_TCYEVT3	(*( MCDS_MCXEVT0_type *) 0xf00ec80cu)	/* Event Definition Register 3 */
#define MCDS_TCYEVT4	(*( MCDS_MCXEVT0_type *) 0xf00ec810u)	/* Event Definition Register 4 */
#define MCDS_TCYEVT5	(*( MCDS_MCXEVT0_type *) 0xf00ec814u)	/* Event Definition Register 5 */
#define MCDS_TCYEVT6	(*( MCDS_MCXEVT0_type *) 0xf00ec818u)	/* Event Definition Register 6 */
#define MCDS_TCYEVT7	(*( MCDS_MCXEVT0_type *) 0xf00ec81cu)	/* Event Definition Register 7 */
#define MCDS_TCYEVT8	(*( MCDS_MCXEVT0_type *) 0xf00ec820u)	/* Event Definition Register 8 */
#define MCDS_TCYEVT9	(*( MCDS_MCXEVT0_type *) 0xf00ec824u)	/* Event Definition Register 9 */

