svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int LIMIT          : 16;	/* Counter Limit */
		unsigned int                : 14;
		unsigned int MOD0           : 1;	/* Modulo Count Control */
		unsigned int MOD1           : 1;	/* Modulo Count Control */
	} B;
	int I;
	unsigned int U;

} MCDS_MCXLMT0_type;
#define MCDS_MCXLMT0	(*( MCDS_MCXLMT0_type *) 0xf00e8a04u)	/* Counter Limit Register */
#define MCDS_MCXLMT1	(*( MCDS_MCXLMT0_type *) 0xf00e8a14u)	/* Counter Limit Register */
#define MCDS_MCXLMT10	(*( MCDS_MCXLMT0_type *) 0xf00e8aa4u)	/* Counter Limit Register */
#define MCDS_MCXLMT11	(*( MCDS_MCXLMT0_type *) 0xf00e8ab4u)	/* Counter Limit Register */
#define MCDS_MCXLMT12	(*( MCDS_MCXLMT0_type *) 0xf00e8ac4u)	/* Counter Limit Register */
#define MCDS_MCXLMT13	(*( MCDS_MCXLMT0_type *) 0xf00e8ad4u)	/* Counter Limit Register */
#define MCDS_MCXLMT14	(*( MCDS_MCXLMT0_type *) 0xf00e8ae4u)	/* Counter Limit Register */
#define MCDS_MCXLMT15	(*( MCDS_MCXLMT0_type *) 0xf00e8af4u)	/* Counter Limit Register */
#define MCDS_MCXLMT16	(*( MCDS_MCXLMT0_type *) 0xf00e8b04u)	/* Counter Limit Register */
#define MCDS_MCXLMT17	(*( MCDS_MCXLMT0_type *) 0xf00e8b14u)	/* Counter Limit Register */
#define MCDS_MCXLMT18	(*( MCDS_MCXLMT0_type *) 0xf00e8b24u)	/* Counter Limit Register */
#define MCDS_MCXLMT19	(*( MCDS_MCXLMT0_type *) 0xf00e8b34u)	/* Counter Limit Register */
#define MCDS_MCXLMT2	(*( MCDS_MCXLMT0_type *) 0xf00e8a24u)	/* Counter Limit Register */
#define MCDS_MCXLMT20	(*( MCDS_MCXLMT0_type *) 0xf00e8b44u)	/* Counter Limit Register */
#define MCDS_MCXLMT21	(*( MCDS_MCXLMT0_type *) 0xf00e8b54u)	/* Counter Limit Register */
#define MCDS_MCXLMT22	(*( MCDS_MCXLMT0_type *) 0xf00e8b64u)	/* Counter Limit Register */
#define MCDS_MCXLMT23	(*( MCDS_MCXLMT0_type *) 0xf00e8b74u)	/* Counter Limit Register */
#define MCDS_MCXLMT24	(*( MCDS_MCXLMT0_type *) 0xf00e8b84u)	/* Counter Limit Register */
#define MCDS_MCXLMT25	(*( MCDS_MCXLMT0_type *) 0xf00e8b94u)	/* Counter Limit Register */
#define MCDS_MCXLMT26	(*( MCDS_MCXLMT0_type *) 0xf00e8ba4u)	/* Counter Limit Register */
#define MCDS_MCXLMT27	(*( MCDS_MCXLMT0_type *) 0xf00e8bb4u)	/* Counter Limit Register */
#define MCDS_MCXLMT28	(*( MCDS_MCXLMT0_type *) 0xf00e8bc4u)	/* Counter Limit Register */
#define MCDS_MCXLMT29	(*( MCDS_MCXLMT0_type *) 0xf00e8bd4u)	/* Counter Limit Register */
#define MCDS_MCXLMT3	(*( MCDS_MCXLMT0_type *) 0xf00e8a34u)	/* Counter Limit Register */
#define MCDS_MCXLMT30	(*( MCDS_MCXLMT0_type *) 0xf00e8be4u)	/* Counter Limit Register */
#define MCDS_MCXLMT31	(*( MCDS_MCXLMT0_type *) 0xf00e8bf4u)	/* Counter Limit Register */
#define MCDS_MCXLMT4	(*( MCDS_MCXLMT0_type *) 0xf00e8a44u)	/* Counter Limit Register */
#define MCDS_MCXLMT5	(*( MCDS_MCXLMT0_type *) 0xf00e8a54u)	/* Counter Limit Register */
#define MCDS_MCXLMT6	(*( MCDS_MCXLMT0_type *) 0xf00e8a64u)	/* Counter Limit Register */
#define MCDS_MCXLMT7	(*( MCDS_MCXLMT0_type *) 0xf00e8a74u)	/* Counter Limit Register */
#define MCDS_MCXLMT8	(*( MCDS_MCXLMT0_type *) 0xf00e8a84u)	/* Counter Limit Register */
#define MCDS_MCXLMT9	(*( MCDS_MCXLMT0_type *) 0xf00e8a94u)	/* Counter Limit Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TMUX0          : 4;	/* Trace Source Select 0 */
		unsigned int                : 3;
		unsigned int TM0_P          : 1;	/* Trace Source Select z Protection */
		unsigned int TMUX1          : 4;	/* Trace Source Select 1 */
		unsigned int                : 3;
		unsigned int TM1_P          : 1;	/* Trace Source Select z Protection */
		unsigned int TMUX2          : 3;	/* Trace Source Select 2 */
		unsigned int TM2_P          : 1;	/* Trace Source Select z Protection */
		unsigned int TMUX3          : 3;	/* Trace Source Select 3 */
		unsigned int TM3_P          : 1;	/* Trace Source Select z Protection */
		unsigned int RC             : 1;	/* Reference Clock Select */
		unsigned int                : 2;
		unsigned int RC_P           : 1;	/* Reference Clock Select Protection */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} MCDS_MUX_type;
#define MCDS_MUX	(*( MCDS_MUX_type *) 0xf00e8014u)	/* MCDS Signal Source Control */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State (inverted busy_o) */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} MCDS_OCS_type;
#define MCDS_OCS	(*( MCDS_OCS_type *) 0xf00e8004u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int KEY            : 32;	/* Key High Word (bits [63:32]) */
	} B;
	int I;
	unsigned int U;

} MCDS_SESSIDH_type;
#define MCDS_SESSIDH	(*( MCDS_SESSIDH_type *) 0xf00e801cu)	/* Session ID High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int KEY            : 32;	/* Key Low Word (bits [31:0]) */
	} B;
	int I;
	unsigned int U;

} MCDS_SESSIDL_type;
#define MCDS_SESSIDL	(*( MCDS_SESSIDL_type *) 0xf00e8018u)	/* Session ID Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUND          : 12;	/* Mode Comparator range lower bound */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} MCDS_SPBACBND0_type;
#define MCDS_SPBACBND0	(*( MCDS_SPBACBND0_type *) 0xf00ee500u)	/* Comparator Bound Register 0 */
#define MCDS_SPBACBND1	(*( MCDS_SPBACBND0_type *) 0xf00ee510u)	/* Comparator Bound Register 1 */
#define MCDS_SPBACBND2	(*( MCDS_SPBACBND0_type *) 0xf00ee520u)	/* Comparator Bound Register 2 */
#define MCDS_SPBACBND3	(*( MCDS_SPBACBND0_type *) 0xf00ee530u)	/* Comparator Bound Register 3 */
#define MCDS_SRI1ACBND0	(*( MCDS_SPBACBND0_type *) 0xf00ef500u)	/* Comparator Bound Register 0 */
#define MCDS_SRI1ACBND1	(*( MCDS_SPBACBND0_type *) 0xf00ef510u)	/* Comparator Bound Register 1 */
#define MCDS_SRI1ACBND2	(*( MCDS_SPBACBND0_type *) 0xf00ef520u)	/* Comparator Bound Register 2 */
#define MCDS_SRI1ACBND3	(*( MCDS_SPBACBND0_type *) 0xf00ef530u)	/* Comparator Bound Register 3 */
#define MCDS_SRI2ACBND0	(*( MCDS_SPBACBND0_type *) 0xf00ef700u)	/* Comparator Bound Register 0 */
#define MCDS_SRI2ACBND1	(*( MCDS_SPBACBND0_type *) 0xf00ef710u)	/* Comparator Bound Register 1 */
#define MCDS_SRI2ACBND2	(*( MCDS_SPBACBND0_type *) 0xf00ef720u)	/* Comparator Bound Register 2 */
#define MCDS_SRI2ACBND3	(*( MCDS_SPBACBND0_type *) 0xf00ef730u)	/* Comparator Bound Register 3 */

