svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SVM            : 1;	/* Comparator bit mask for Supervisor Mode */
		unsigned int MASTER         : 4;	/* Comparator bit mask for Master ID */
		unsigned int SUBCHANNEL     : 5;	/* Comparator bit mask for Sub-channel ID */
		unsigned int WR             : 1;	/* Comparator bit mask for Direction Write */
		unsigned int RD             : 1;	/* Comparator bit mask for Direction Read */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} MCDS_SPBACMSK0_type;
#define MCDS_SPBACMSK0	(*( MCDS_SPBACMSK0_type *) 0xf00ee508u)	/* Comparator Mask Register 0 */
#define MCDS_SPBACMSK1	(*( MCDS_SPBACMSK0_type *) 0xf00ee518u)	/* Comparator Mask Register 1 */
#define MCDS_SPBACMSK2	(*( MCDS_SPBACMSK0_type *) 0xf00ee528u)	/* Comparator Mask Register 2 */
#define MCDS_SPBACMSK3	(*( MCDS_SPBACMSK0_type *) 0xf00ee538u)	/* Comparator Mask Register 3 */
#define MCDS_SRI1ACMSK0	(*( MCDS_SPBACMSK0_type *) 0xf00ef508u)	/* Comparator Mask Register 0 */
#define MCDS_SRI1ACMSK1	(*( MCDS_SPBACMSK0_type *) 0xf00ef518u)	/* Comparator Mask Register 1 */
#define MCDS_SRI1ACMSK2	(*( MCDS_SPBACMSK0_type *) 0xf00ef528u)	/* Comparator Mask Register 2 */
#define MCDS_SRI1ACMSK3	(*( MCDS_SPBACMSK0_type *) 0xf00ef538u)	/* Comparator Mask Register 3 */
#define MCDS_SRI2ACMSK0	(*( MCDS_SPBACMSK0_type *) 0xf00ef708u)	/* Comparator Mask Register 0 */
#define MCDS_SRI2ACMSK1	(*( MCDS_SPBACMSK0_type *) 0xf00ef718u)	/* Comparator Mask Register 1 */
#define MCDS_SRI2ACMSK2	(*( MCDS_SPBACMSK0_type *) 0xf00ef728u)	/* Comparator Mask Register 2 */
#define MCDS_SRI2ACMSK3	(*( MCDS_SPBACMSK0_type *) 0xf00ef738u)	/* Comparator Mask Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int RANGE          : 12;	/* Mode Comparator range size */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} MCDS_SPBACRNG0_type;
#define MCDS_SPBACRNG0	(*( MCDS_SPBACRNG0_type *) 0xf00ee504u)	/* Comparator Range Register 0 */
#define MCDS_SPBACRNG1	(*( MCDS_SPBACRNG0_type *) 0xf00ee514u)	/* Comparator Range Register 1 */
#define MCDS_SPBACRNG2	(*( MCDS_SPBACRNG0_type *) 0xf00ee524u)	/* Comparator Range Register 2 */
#define MCDS_SPBACRNG3	(*( MCDS_SPBACRNG0_type *) 0xf00ee534u)	/* Comparator Range Register 3 */
#define MCDS_SRI1ACRNG0	(*( MCDS_SPBACRNG0_type *) 0xf00ef504u)	/* Comparator Range Register 0 */
#define MCDS_SRI1ACRNG1	(*( MCDS_SPBACRNG0_type *) 0xf00ef514u)	/* Comparator Range Register 1 */
#define MCDS_SRI1ACRNG2	(*( MCDS_SPBACRNG0_type *) 0xf00ef524u)	/* Comparator Range Register 2 */
#define MCDS_SRI1ACRNG3	(*( MCDS_SPBACRNG0_type *) 0xf00ef534u)	/* Comparator Range Register 3 */
#define MCDS_SRI2ACRNG0	(*( MCDS_SPBACRNG0_type *) 0xf00ef704u)	/* Comparator Range Register 0 */
#define MCDS_SRI2ACRNG1	(*( MCDS_SPBACRNG0_type *) 0xf00ef714u)	/* Comparator Range Register 1 */
#define MCDS_SRI2ACRNG2	(*( MCDS_SPBACRNG0_type *) 0xf00ef724u)	/* Comparator Range Register 2 */
#define MCDS_SRI2ACRNG3	(*( MCDS_SPBACRNG0_type *) 0xf00ef734u)	/* Comparator Range Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EI             : 1;	/* ENDINIT Protection Flag */
		/* const */ unsigned int SUS            : 1;	/* Suspended Flag */
		/* const */ unsigned int ERR            : 1;	/* Error Flag */
		/* const */ unsigned int RTY            : 1;	/* Retry Flag */
		/* const */ unsigned int SYSRES         : 1;	/* System Reset (Class 0) Flag */
		/* const */ unsigned int APPRES         : 1;	/* Application Reset (Class 3) Flag */
		/* const */ unsigned int CLKDIV         : 2;	/* Current Clock Divider */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} MCDS_SPBDCSTS_type;
#define MCDS_SPBDCSTS	(*( MCDS_SPBDCSTS_type *) 0xf00ee000u)	/* Debug Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUND          : 32;	/* Address Comparator range lower bound */
	} B;
	int I;
	unsigned int U;

} MCDS_SPBEABND0_type;
#define MCDS_SPBEABND0	(*( MCDS_SPBEABND0_type *) 0xf00ee400u)	/* Comparator Bound Register 0 */
#define MCDS_SPBEABND1	(*( MCDS_SPBEABND0_type *) 0xf00ee410u)	/* Comparator Bound Register 1 */
#define MCDS_SPBEABND2	(*( MCDS_SPBEABND0_type *) 0xf00ee420u)	/* Comparator Bound Register 2 */
#define MCDS_SPBEABND3	(*( MCDS_SPBEABND0_type *) 0xf00ee430u)	/* Comparator Bound Register 3 */
#define MCDS_SRI1EABND0	(*( MCDS_SPBEABND0_type *) 0xf00ef400u)	/* Comparator Bound Register 0 */
#define MCDS_SRI1EABND1	(*( MCDS_SPBEABND0_type *) 0xf00ef410u)	/* Comparator Bound Register 1 */
#define MCDS_SRI1EABND2	(*( MCDS_SPBEABND0_type *) 0xf00ef420u)	/* Comparator Bound Register 2 */
#define MCDS_SRI1EABND3	(*( MCDS_SPBEABND0_type *) 0xf00ef430u)	/* Comparator Bound Register 3 */
#define MCDS_SRI2EABND0	(*( MCDS_SPBEABND0_type *) 0xf00ef600u)	/* Comparator Bound Register 0 */
#define MCDS_SRI2EABND1	(*( MCDS_SPBEABND0_type *) 0xf00ef610u)	/* Comparator Bound Register 1 */
#define MCDS_SRI2EABND2	(*( MCDS_SPBEABND0_type *) 0xf00ef620u)	/* Comparator Bound Register 2 */
#define MCDS_SRI2EABND3	(*( MCDS_SPBEABND0_type *) 0xf00ef630u)	/* Comparator Bound Register 3 */
#define MCDS_TCXEABND0	(*( MCDS_SPBEABND0_type *) 0xf00ea400u)	/* Comparator Bound Register 0 */
#define MCDS_TCXEABND1	(*( MCDS_SPBEABND0_type *) 0xf00ea410u)	/* Comparator Bound Register 1 */
#define MCDS_TCXEABND2	(*( MCDS_SPBEABND0_type *) 0xf00ea420u)	/* Comparator Bound Register 2 */
#define MCDS_TCXEABND3	(*( MCDS_SPBEABND0_type *) 0xf00ea430u)	/* Comparator Bound Register 3 */
#define MCDS_TCXEABND4	(*( MCDS_SPBEABND0_type *) 0xf00ea440u)	/* Comparator Bound Register 4 */
#define MCDS_TCXEABND5	(*( MCDS_SPBEABND0_type *) 0xf00ea450u)	/* Comparator Bound Register 5 */
#define MCDS_TCXEABND6	(*( MCDS_SPBEABND0_type *) 0xf00ea460u)	/* Comparator Bound Register 6 */
#define MCDS_TCXEABND7	(*( MCDS_SPBEABND0_type *) 0xf00ea470u)	/* Comparator Bound Register 7 */
#define MCDS_TCYEABND0	(*( MCDS_SPBEABND0_type *) 0xf00ec400u)	/* Comparator Bound Register 0 */
#define MCDS_TCYEABND1	(*( MCDS_SPBEABND0_type *) 0xf00ec410u)	/* Comparator Bound Register 1 */
#define MCDS_TCYEABND2	(*( MCDS_SPBEABND0_type *) 0xf00ec420u)	/* Comparator Bound Register 2 */
#define MCDS_TCYEABND3	(*( MCDS_SPBEABND0_type *) 0xf00ec430u)	/* Comparator Bound Register 3 */
#define MCDS_TCYEABND4	(*( MCDS_SPBEABND0_type *) 0xf00ec440u)	/* Comparator Bound Register 4 */
#define MCDS_TCYEABND5	(*( MCDS_SPBEABND0_type *) 0xf00ec450u)	/* Comparator Bound Register 5 */
#define MCDS_TCYEABND6	(*( MCDS_SPBEABND0_type *) 0xf00ec460u)	/* Comparator Bound Register 6 */
#define MCDS_TCYEABND7	(*( MCDS_SPBEABND0_type *) 0xf00ec470u)	/* Comparator Bound Register 7 */

