svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RANGE          : 32;	/* Address Comparator range size */
	} B;
	int I;
	unsigned int U;

} MCDS_SPBEARNG0_type;
#define MCDS_SPBEARNG0	(*( MCDS_SPBEARNG0_type *) 0xf00ee404u)	/* Comparator Range Register 0 */
#define MCDS_SPBEARNG1	(*( MCDS_SPBEARNG0_type *) 0xf00ee414u)	/* Comparator Range Register 1 */
#define MCDS_SPBEARNG2	(*( MCDS_SPBEARNG0_type *) 0xf00ee424u)	/* Comparator Range Register 2 */
#define MCDS_SPBEARNG3	(*( MCDS_SPBEARNG0_type *) 0xf00ee434u)	/* Comparator Range Register 3 */
#define MCDS_SRI1EARNG0	(*( MCDS_SPBEARNG0_type *) 0xf00ef404u)	/* Comparator Range Register 0 */
#define MCDS_SRI1EARNG1	(*( MCDS_SPBEARNG0_type *) 0xf00ef414u)	/* Comparator Range Register 1 */
#define MCDS_SRI1EARNG2	(*( MCDS_SPBEARNG0_type *) 0xf00ef424u)	/* Comparator Range Register 2 */
#define MCDS_SRI1EARNG3	(*( MCDS_SPBEARNG0_type *) 0xf00ef434u)	/* Comparator Range Register 3 */
#define MCDS_SRI2EARNG0	(*( MCDS_SPBEARNG0_type *) 0xf00ef604u)	/* Comparator Range Register 0 */
#define MCDS_SRI2EARNG1	(*( MCDS_SPBEARNG0_type *) 0xf00ef614u)	/* Comparator Range Register 1 */
#define MCDS_SRI2EARNG2	(*( MCDS_SPBEARNG0_type *) 0xf00ef624u)	/* Comparator Range Register 2 */
#define MCDS_SRI2EARNG3	(*( MCDS_SPBEARNG0_type *) 0xf00ef634u)	/* Comparator Range Register 3 */
#define MCDS_TCXEARNG0	(*( MCDS_SPBEARNG0_type *) 0xf00ea404u)	/* Comparator Range Register 0 */
#define MCDS_TCXEARNG1	(*( MCDS_SPBEARNG0_type *) 0xf00ea414u)	/* Comparator Range Register 1 */
#define MCDS_TCXEARNG2	(*( MCDS_SPBEARNG0_type *) 0xf00ea424u)	/* Comparator Range Register 2 */
#define MCDS_TCXEARNG3	(*( MCDS_SPBEARNG0_type *) 0xf00ea434u)	/* Comparator Range Register 3 */
#define MCDS_TCXEARNG4	(*( MCDS_SPBEARNG0_type *) 0xf00ea444u)	/* Comparator Range Register 4 */
#define MCDS_TCXEARNG5	(*( MCDS_SPBEARNG0_type *) 0xf00ea454u)	/* Comparator Range Register 5 */
#define MCDS_TCXEARNG6	(*( MCDS_SPBEARNG0_type *) 0xf00ea464u)	/* Comparator Range Register 6 */
#define MCDS_TCXEARNG7	(*( MCDS_SPBEARNG0_type *) 0xf00ea474u)	/* Comparator Range Register 7 */
#define MCDS_TCYEARNG0	(*( MCDS_SPBEARNG0_type *) 0xf00ec404u)	/* Comparator Range Register 0 */
#define MCDS_TCYEARNG1	(*( MCDS_SPBEARNG0_type *) 0xf00ec414u)	/* Comparator Range Register 1 */
#define MCDS_TCYEARNG2	(*( MCDS_SPBEARNG0_type *) 0xf00ec424u)	/* Comparator Range Register 2 */
#define MCDS_TCYEARNG3	(*( MCDS_SPBEARNG0_type *) 0xf00ec434u)	/* Comparator Range Register 3 */
#define MCDS_TCYEARNG4	(*( MCDS_SPBEARNG0_type *) 0xf00ec444u)	/* Comparator Range Register 4 */
#define MCDS_TCYEARNG5	(*( MCDS_SPBEARNG0_type *) 0xf00ec454u)	/* Comparator Range Register 5 */
#define MCDS_TCYEARNG6	(*( MCDS_SPBEARNG0_type *) 0xf00ec464u)	/* Comparator Range Register 6 */
#define MCDS_TCYEARNG7	(*( MCDS_SPBEARNG0_type *) 0xf00ec474u)	/* Comparator Range Register 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUND          : 32;	/* Data Comparator range lower bound */
	} B;
	int I;
	unsigned int U;

} MCDS_SPBWDBND0_type;
#define MCDS_SPBWDBND0	(*( MCDS_SPBWDBND0_type *) 0xf00ee480u)	/* Comparator Bound Register 0 */
#define MCDS_SPBWDBND1	(*( MCDS_SPBWDBND0_type *) 0xf00ee490u)	/* Comparator Bound Register 1 */
#define MCDS_SPBWDBND2	(*( MCDS_SPBWDBND0_type *) 0xf00ee4a0u)	/* Comparator Bound Register 2 */
#define MCDS_SPBWDBND3	(*( MCDS_SPBWDBND0_type *) 0xf00ee4b0u)	/* Comparator Bound Register 3 */
#define MCDS_SRI1WDBND0	(*( MCDS_SPBWDBND0_type *) 0xf00ef480u)	/* Comparator Bound Register 0 */
#define MCDS_SRI1WDBND1	(*( MCDS_SPBWDBND0_type *) 0xf00ef4a0u)	/* Comparator Bound Register 1 */
#define MCDS_SRI1WDBND2	(*( MCDS_SPBWDBND0_type *) 0xf00ef4c0u)	/* Comparator Bound Register 2 */
#define MCDS_SRI1WDBND3	(*( MCDS_SPBWDBND0_type *) 0xf00ef4e0u)	/* Comparator Bound Register 3 */
#define MCDS_SRI2WDBND0	(*( MCDS_SPBWDBND0_type *) 0xf00ef680u)	/* Comparator Bound Register 0 */
#define MCDS_SRI2WDBND1	(*( MCDS_SPBWDBND0_type *) 0xf00ef6a0u)	/* Comparator Bound Register 1 */
#define MCDS_SRI2WDBND2	(*( MCDS_SPBWDBND0_type *) 0xf00ef6c0u)	/* Comparator Bound Register 2 */
#define MCDS_SRI2WDBND3	(*( MCDS_SPBWDBND0_type *) 0xf00ef6e0u)	/* Comparator Bound Register 3 */
#define MCDS_TCXWDBND0	(*( MCDS_SPBWDBND0_type *) 0xf00ea480u)	/* Comparator Bound Register 0 */
#define MCDS_TCXWDBND1	(*( MCDS_SPBWDBND0_type *) 0xf00ea4a0u)	/* Comparator Bound Register 1 */
#define MCDS_TCXWDBND2	(*( MCDS_SPBWDBND0_type *) 0xf00ea4c0u)	/* Comparator Bound Register 2 */
#define MCDS_TCXWDBND3	(*( MCDS_SPBWDBND0_type *) 0xf00ea4e0u)	/* Comparator Bound Register 3 */
#define MCDS_TCYWDBND0	(*( MCDS_SPBWDBND0_type *) 0xf00ec480u)	/* Comparator Bound Register 0 */
#define MCDS_TCYWDBND1	(*( MCDS_SPBWDBND0_type *) 0xf00ec4a0u)	/* Comparator Bound Register 1 */
#define MCDS_TCYWDBND2	(*( MCDS_SPBWDBND0_type *) 0xf00ec4c0u)	/* Comparator Bound Register 2 */
#define MCDS_TCYWDBND3	(*( MCDS_SPBWDBND0_type *) 0xf00ec4e0u)	/* Comparator Bound Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int MASK           : 32;	/* Data Comparator bit mask */
	} B;
	int I;
	unsigned int U;

} MCDS_SPBWDMSK0_type;
#define MCDS_SPBWDMSK0	(*( MCDS_SPBWDMSK0_type *) 0xf00ee488u)	/* Comparator Mask Register 0 */
#define MCDS_SPBWDMSK1	(*( MCDS_SPBWDMSK0_type *) 0xf00ee498u)	/* Comparator Mask Register 1 */
#define MCDS_SPBWDMSK2	(*( MCDS_SPBWDMSK0_type *) 0xf00ee4a8u)	/* Comparator Mask Register 2 */
#define MCDS_SPBWDMSK3	(*( MCDS_SPBWDMSK0_type *) 0xf00ee4b8u)	/* Comparator Mask Register 3 */
#define MCDS_SRI1WDMSK0	(*( MCDS_SPBWDMSK0_type *) 0xf00ef490u)	/* Comparator Mask Register 0 */
#define MCDS_SRI1WDMSK1	(*( MCDS_SPBWDMSK0_type *) 0xf00ef4b0u)	/* Comparator Mask Register 1 */
#define MCDS_SRI1WDMSK2	(*( MCDS_SPBWDMSK0_type *) 0xf00ef4d0u)	/* Comparator Mask Register 2 */
#define MCDS_SRI1WDMSK3	(*( MCDS_SPBWDMSK0_type *) 0xf00ef4f0u)	/* Comparator Mask Register 3 */
#define MCDS_SRI2WDMSK0	(*( MCDS_SPBWDMSK0_type *) 0xf00ef690u)	/* Comparator Mask Register 0 */
#define MCDS_SRI2WDMSK1	(*( MCDS_SPBWDMSK0_type *) 0xf00ef6b0u)	/* Comparator Mask Register 1 */
#define MCDS_SRI2WDMSK2	(*( MCDS_SPBWDMSK0_type *) 0xf00ef6d0u)	/* Comparator Mask Register 2 */
#define MCDS_SRI2WDMSK3	(*( MCDS_SPBWDMSK0_type *) 0xf00ef6f0u)	/* Comparator Mask Register 3 */
#define MCDS_TCXWDMSK0	(*( MCDS_SPBWDMSK0_type *) 0xf00ea490u)	/* Comparator Mask Register 0 */
#define MCDS_TCXWDMSK1	(*( MCDS_SPBWDMSK0_type *) 0xf00ea4b0u)	/* Comparator Mask Register 1 */
#define MCDS_TCXWDMSK2	(*( MCDS_SPBWDMSK0_type *) 0xf00ea4d0u)	/* Comparator Mask Register 2 */
#define MCDS_TCXWDMSK3	(*( MCDS_SPBWDMSK0_type *) 0xf00ea4f0u)	/* Comparator Mask Register 3 */
#define MCDS_TCYWDMSK0	(*( MCDS_SPBWDMSK0_type *) 0xf00ec490u)	/* Comparator Mask Register 0 */
#define MCDS_TCYWDMSK1	(*( MCDS_SPBWDMSK0_type *) 0xf00ec4b0u)	/* Comparator Mask Register 1 */
#define MCDS_TCYWDMSK2	(*( MCDS_SPBWDMSK0_type *) 0xf00ec4d0u)	/* Comparator Mask Register 2 */
#define MCDS_TCYWDMSK3	(*( MCDS_SPBWDMSK0_type *) 0xf00ec4f0u)	/* Comparator Mask Register 3 */

