svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RANGE          : 32;	/* Data Comparator range size */
	} B;
	int I;
	unsigned int U;

} MCDS_SPBWDRNG0_type;
#define MCDS_SPBWDRNG0	(*( MCDS_SPBWDRNG0_type *) 0xf00ee484u)	/* Comparator Range Register 0 */
#define MCDS_SPBWDRNG1	(*( MCDS_SPBWDRNG0_type *) 0xf00ee494u)	/* Comparator Range Register 1 */
#define MCDS_SPBWDRNG2	(*( MCDS_SPBWDRNG0_type *) 0xf00ee4a4u)	/* Comparator Range Register 2 */
#define MCDS_SPBWDRNG3	(*( MCDS_SPBWDRNG0_type *) 0xf00ee4b4u)	/* Comparator Range Register 3 */
#define MCDS_SRI1WDRNG0	(*( MCDS_SPBWDRNG0_type *) 0xf00ef488u)	/* Comparator Range Register 0 */
#define MCDS_SRI1WDRNG1	(*( MCDS_SPBWDRNG0_type *) 0xf00ef4a8u)	/* Comparator Range Register 1 */
#define MCDS_SRI1WDRNG2	(*( MCDS_SPBWDRNG0_type *) 0xf00ef4c8u)	/* Comparator Range Register 2 */
#define MCDS_SRI1WDRNG3	(*( MCDS_SPBWDRNG0_type *) 0xf00ef4e8u)	/* Comparator Range Register 3 */
#define MCDS_SRI2WDRNG0	(*( MCDS_SPBWDRNG0_type *) 0xf00ef688u)	/* Comparator Range Register 0 */
#define MCDS_SRI2WDRNG1	(*( MCDS_SPBWDRNG0_type *) 0xf00ef6a8u)	/* Comparator Range Register 1 */
#define MCDS_SRI2WDRNG2	(*( MCDS_SPBWDRNG0_type *) 0xf00ef6c8u)	/* Comparator Range Register 2 */
#define MCDS_SRI2WDRNG3	(*( MCDS_SPBWDRNG0_type *) 0xf00ef6e8u)	/* Comparator Range Register 3 */
#define MCDS_TCXWDRNG0	(*( MCDS_SPBWDRNG0_type *) 0xf00ea488u)	/* Comparator Range Register 0 */
#define MCDS_TCXWDRNG1	(*( MCDS_SPBWDRNG0_type *) 0xf00ea4a8u)	/* Comparator Range Register 1 */
#define MCDS_TCXWDRNG2	(*( MCDS_SPBWDRNG0_type *) 0xf00ea4c8u)	/* Comparator Range Register 2 */
#define MCDS_TCXWDRNG3	(*( MCDS_SPBWDRNG0_type *) 0xf00ea4e8u)	/* Comparator Range Register 3 */
#define MCDS_TCYWDRNG0	(*( MCDS_SPBWDRNG0_type *) 0xf00ec488u)	/* Comparator Range Register 0 */
#define MCDS_TCYWDRNG1	(*( MCDS_SPBWDRNG0_type *) 0xf00ec4a8u)	/* Comparator Range Register 1 */
#define MCDS_TCYWDRNG2	(*( MCDS_SPBWDRNG0_type *) 0xf00ec4c8u)	/* Comparator Range Register 2 */
#define MCDS_TCYWDRNG3	(*( MCDS_SPBWDRNG0_type *) 0xf00ec4e8u)	/* Comparator Range Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int SIGN           : 5;	/* Bit number (1?31) of sign bit */
		unsigned int                : 9;
		unsigned int EITHER         : 1;	/* RANGE matching either side of BOUND */
		unsigned int BELOW          : 1;	/* RANGE matching lower side of BOUND */
		unsigned int RELOAD         : 4;	/* Reload Event Selector */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_SPBWDSGN0_type;
#define MCDS_SPBWDSGN0	(*( MCDS_SPBWDSGN0_type *) 0xf00ee48cu)	/* Comparator Sign Register 0 */
#define MCDS_SPBWDSGN1	(*( MCDS_SPBWDSGN0_type *) 0xf00ee49cu)	/* Comparator Sign Register 1 */
#define MCDS_SPBWDSGN2	(*( MCDS_SPBWDSGN0_type *) 0xf00ee4acu)	/* Comparator Sign Register 2 */
#define MCDS_SPBWDSGN3	(*( MCDS_SPBWDSGN0_type *) 0xf00ee4bcu)	/* Comparator Sign Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUND          : 32;	/* Comparator range lower bound */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1BALBND0_type;
#define MCDS_SRI1BALBND0	(*( MCDS_SRI1BALBND0_type *) 0xf00ef210u)	/* Lookup Table Base Register */
#define MCDS_SRI1BALBND1	(*( MCDS_SRI1BALBND0_type *) 0xf00ef220u)	/* Lookup Table Base Register */
#define MCDS_SRI1BALBND2	(*( MCDS_SRI1BALBND0_type *) 0xf00ef230u)	/* Lookup Table Base Register */
#define MCDS_SRI1BALBND3	(*( MCDS_SRI1BALBND0_type *) 0xf00ef240u)	/* Lookup Table Base Register */
#define MCDS_SRI2BALBND0	(*( MCDS_SRI1BALBND0_type *) 0xf00ef310u)	/* Lookup Table Base Register */
#define MCDS_SRI2BALBND1	(*( MCDS_SRI1BALBND0_type *) 0xf00ef320u)	/* Lookup Table Base Register */
#define MCDS_SRI2BALBND2	(*( MCDS_SRI1BALBND0_type *) 0xf00ef330u)	/* Lookup Table Base Register */
#define MCDS_SRI2BALBND3	(*( MCDS_SRI1BALBND0_type *) 0xf00ef340u)	/* Lookup Table Base Register */
#define MCDS_TCXPALBND0	(*( MCDS_SRI1BALBND0_type *) 0xf00ea210u)	/* Lookup Table Base Register */
#define MCDS_TCXPALBND1	(*( MCDS_SRI1BALBND0_type *) 0xf00ea220u)	/* Lookup Table Base Register */
#define MCDS_TCXPALBND2	(*( MCDS_SRI1BALBND0_type *) 0xf00ea230u)	/* Lookup Table Base Register */
#define MCDS_TCXPALBND3	(*( MCDS_SRI1BALBND0_type *) 0xf00ea240u)	/* Lookup Table Base Register */
#define MCDS_TCYPALBND0	(*( MCDS_SRI1BALBND0_type *) 0xf00ec210u)	/* Lookup Table Base Register */
#define MCDS_TCYPALBND1	(*( MCDS_SRI1BALBND0_type *) 0xf00ec220u)	/* Lookup Table Base Register */
#define MCDS_TCYPALBND2	(*( MCDS_SRI1BALBND0_type *) 0xf00ec230u)	/* Lookup Table Base Register */
#define MCDS_TCYPALBND3	(*( MCDS_SRI1BALBND0_type *) 0xf00ec240u)	/* Lookup Table Base Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int ADDR           : 10;	/* Address pointer */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1BALLUTA_type;
#define MCDS_SRI1BALLUTA	(*( MCDS_SRI1BALLUTA_type *) 0xf00ef204u)	/* Lookup Table Address Register */
#define MCDS_SRI2BALLUTA	(*( MCDS_SRI1BALLUTA_type *) 0xf00ef304u)	/* Lookup Table Address Register */
#define MCDS_TCXPALLUTA	(*( MCDS_SRI1BALLUTA_type *) 0xf00ea204u)	/* Lookup Table Address Register */
#define MCDS_TCYPALLUTA	(*( MCDS_SRI1BALLUTA_type *) 0xf00ec204u)	/* Lookup Table Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 32;	/* Data transfer register */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1BALLUTD_type;
#define MCDS_SRI1BALLUTD	(*( MCDS_SRI1BALLUTD_type *) 0xf00ef200u)	/* Lookup Table Data Register */
#define MCDS_SRI2BALLUTD	(*( MCDS_SRI1BALLUTD_type *) 0xf00ef300u)	/* Lookup Table Data Register */
#define MCDS_TCXPALLUTD	(*( MCDS_SRI1BALLUTD_type *) 0xf00ea200u)	/* Lookup Table Data Register */
#define MCDS_TCYPALLUTD	(*( MCDS_SRI1BALLUTD_type *) 0xf00ec200u)	/* Lookup Table Data Register */

