svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int OFFSET         : 10;	/* Lookup table location in RAM */
		unsigned int                : 16;
		unsigned int GRAIN          : 3;	/* Lookup table granularity */
		unsigned int EN             : 1;	/* Lookup table active */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1BALMAP0_type;
#define MCDS_SRI1BALMAP0	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef218u)	/* Lookup Table Mapping Register */
#define MCDS_SRI1BALMAP1	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef228u)	/* Lookup Table Mapping Register */
#define MCDS_SRI1BALMAP2	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef238u)	/* Lookup Table Mapping Register */
#define MCDS_SRI1BALMAP3	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef248u)	/* Lookup Table Mapping Register */
#define MCDS_SRI2BALMAP0	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef318u)	/* Lookup Table Mapping Register */
#define MCDS_SRI2BALMAP1	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef328u)	/* Lookup Table Mapping Register */
#define MCDS_SRI2BALMAP2	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef338u)	/* Lookup Table Mapping Register */
#define MCDS_SRI2BALMAP3	(*( MCDS_SRI1BALMAP0_type *) 0xf00ef348u)	/* Lookup Table Mapping Register */
#define MCDS_TCXPALMAP0	(*( MCDS_SRI1BALMAP0_type *) 0xf00ea218u)	/* Lookup Table Mapping Register */
#define MCDS_TCXPALMAP1	(*( MCDS_SRI1BALMAP0_type *) 0xf00ea228u)	/* Lookup Table Mapping Register */
#define MCDS_TCXPALMAP2	(*( MCDS_SRI1BALMAP0_type *) 0xf00ea238u)	/* Lookup Table Mapping Register */
#define MCDS_TCXPALMAP3	(*( MCDS_SRI1BALMAP0_type *) 0xf00ea248u)	/* Lookup Table Mapping Register */
#define MCDS_TCYPALMAP0	(*( MCDS_SRI1BALMAP0_type *) 0xf00ec218u)	/* Lookup Table Mapping Register */
#define MCDS_TCYPALMAP1	(*( MCDS_SRI1BALMAP0_type *) 0xf00ec228u)	/* Lookup Table Mapping Register */
#define MCDS_TCYPALMAP2	(*( MCDS_SRI1BALMAP0_type *) 0xf00ec238u)	/* Lookup Table Mapping Register */
#define MCDS_TCYPALMAP3	(*( MCDS_SRI1BALMAP0_type *) 0xf00ec248u)	/* Lookup Table Mapping Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RANGE          : 32;	/* Lookup table range size */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1BALRNG0_type;
#define MCDS_SRI1BALRNG0	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef214u)	/* Lookup Table Range Register */
#define MCDS_SRI1BALRNG1	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef224u)	/* Lookup Table Range Register */
#define MCDS_SRI1BALRNG2	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef234u)	/* Lookup Table Range Register */
#define MCDS_SRI1BALRNG3	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef244u)	/* Lookup Table Range Register */
#define MCDS_SRI2BALRNG0	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef314u)	/* Lookup Table Range Register */
#define MCDS_SRI2BALRNG1	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef324u)	/* Lookup Table Range Register */
#define MCDS_SRI2BALRNG2	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef334u)	/* Lookup Table Range Register */
#define MCDS_SRI2BALRNG3	(*( MCDS_SRI1BALRNG0_type *) 0xf00ef344u)	/* Lookup Table Range Register */
#define MCDS_TCXPALRNG0	(*( MCDS_SRI1BALRNG0_type *) 0xf00ea214u)	/* Lookup Table Range Register */
#define MCDS_TCXPALRNG1	(*( MCDS_SRI1BALRNG0_type *) 0xf00ea224u)	/* Lookup Table Range Register */
#define MCDS_TCXPALRNG2	(*( MCDS_SRI1BALRNG0_type *) 0xf00ea234u)	/* Lookup Table Range Register */
#define MCDS_TCXPALRNG3	(*( MCDS_SRI1BALRNG0_type *) 0xf00ea244u)	/* Lookup Table Range Register */
#define MCDS_TCYPALRNG0	(*( MCDS_SRI1BALRNG0_type *) 0xf00ec214u)	/* Lookup Table Range Register */
#define MCDS_TCYPALRNG1	(*( MCDS_SRI1BALRNG0_type *) 0xf00ec224u)	/* Lookup Table Range Register */
#define MCDS_TCYPALRNG2	(*( MCDS_SRI1BALRNG0_type *) 0xf00ec234u)	/* Lookup Table Range Register */
#define MCDS_TCYPALRNG3	(*( MCDS_SRI1BALRNG0_type *) 0xf00ec244u)	/* Lookup Table Range Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUND          : 32;	/* Data Comparator range lower bound high word */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1WDHBND0_type;
#define MCDS_SRI1WDHBND0	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef484u)	/* Comparator Bound Register 0 */
#define MCDS_SRI1WDHBND1	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef4a4u)	/* Comparator Bound Register 1 */
#define MCDS_SRI1WDHBND2	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef4c4u)	/* Comparator Bound Register 2 */
#define MCDS_SRI1WDHBND3	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef4e4u)	/* Comparator Bound Register 3 */
#define MCDS_SRI2WDHBND0	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef684u)	/* Comparator Bound Register 0 */
#define MCDS_SRI2WDHBND1	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef6a4u)	/* Comparator Bound Register 1 */
#define MCDS_SRI2WDHBND2	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef6c4u)	/* Comparator Bound Register 2 */
#define MCDS_SRI2WDHBND3	(*( MCDS_SRI1WDHBND0_type *) 0xf00ef6e4u)	/* Comparator Bound Register 3 */
#define MCDS_TCXWDHBND0	(*( MCDS_SRI1WDHBND0_type *) 0xf00ea484u)	/* Comparator Bound Register 0 */
#define MCDS_TCXWDHBND1	(*( MCDS_SRI1WDHBND0_type *) 0xf00ea4a4u)	/* Comparator Bound Register 1 */
#define MCDS_TCXWDHBND2	(*( MCDS_SRI1WDHBND0_type *) 0xf00ea4c4u)	/* Comparator Bound Register 2 */
#define MCDS_TCXWDHBND3	(*( MCDS_SRI1WDHBND0_type *) 0xf00ea4e4u)	/* Comparator Bound Register 3 */
#define MCDS_TCYWDHBND0	(*( MCDS_SRI1WDHBND0_type *) 0xf00ec484u)	/* Comparator Bound Register 0 */
#define MCDS_TCYWDHBND1	(*( MCDS_SRI1WDHBND0_type *) 0xf00ec4a4u)	/* Comparator Bound Register 1 */
#define MCDS_TCYWDHBND2	(*( MCDS_SRI1WDHBND0_type *) 0xf00ec4c4u)	/* Comparator Bound Register 2 */
#define MCDS_TCYWDHBND3	(*( MCDS_SRI1WDHBND0_type *) 0xf00ec4e4u)	/* Comparator Bound Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int MASK           : 32;	/* Data Comparator bit mask high word */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1WDHMSK0_type;
#define MCDS_SRI1WDHMSK0	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef494u)	/* Comparator Mask Register 0 */
#define MCDS_SRI1WDHMSK1	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef4b4u)	/* Comparator Mask Register 1 */
#define MCDS_SRI1WDHMSK2	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef4d4u)	/* Comparator Mask Register 2 */
#define MCDS_SRI1WDHMSK3	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef4f4u)	/* Comparator Mask Register 3 */
#define MCDS_SRI2WDHMSK0	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef694u)	/* Comparator Mask Register 0 */
#define MCDS_SRI2WDHMSK1	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef6b4u)	/* Comparator Mask Register 1 */
#define MCDS_SRI2WDHMSK2	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef6d4u)	/* Comparator Mask Register 2 */
#define MCDS_SRI2WDHMSK3	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ef6f4u)	/* Comparator Mask Register 3 */
#define MCDS_TCXWDHMSK0	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ea494u)	/* Comparator Mask Register 0 */
#define MCDS_TCXWDHMSK1	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ea4b4u)	/* Comparator Mask Register 1 */
#define MCDS_TCXWDHMSK2	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ea4d4u)	/* Comparator Mask Register 2 */
#define MCDS_TCXWDHMSK3	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ea4f4u)	/* Comparator Mask Register 3 */
#define MCDS_TCYWDHMSK0	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ec494u)	/* Comparator Mask Register 0 */
#define MCDS_TCYWDHMSK1	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ec4b4u)	/* Comparator Mask Register 1 */
#define MCDS_TCYWDHMSK2	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ec4d4u)	/* Comparator Mask Register 2 */
#define MCDS_TCYWDHMSK3	(*( MCDS_SRI1WDHMSK0_type *) 0xf00ec4f4u)	/* Comparator Mask Register 3 */

