svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RANGE          : 32;	/* Data Comparator range size high word */
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1WDHRNG0_type;
#define MCDS_SRI1WDHRNG0	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef48cu)	/* Comparator Range Register 0 */
#define MCDS_SRI1WDHRNG1	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef4acu)	/* Comparator Range Register 1 */
#define MCDS_SRI1WDHRNG2	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef4ccu)	/* Comparator Range Register 2 */
#define MCDS_SRI1WDHRNG3	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef4ecu)	/* Comparator Range Register 3 */
#define MCDS_SRI2WDHRNG0	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef68cu)	/* Comparator Range Register 0 */
#define MCDS_SRI2WDHRNG1	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef6acu)	/* Comparator Range Register 1 */
#define MCDS_SRI2WDHRNG2	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef6ccu)	/* Comparator Range Register 2 */
#define MCDS_SRI2WDHRNG3	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ef6ecu)	/* Comparator Range Register 3 */
#define MCDS_TCXWDHRNG0	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ea48cu)	/* Comparator Range Register 0 */
#define MCDS_TCXWDHRNG1	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ea4acu)	/* Comparator Range Register 1 */
#define MCDS_TCXWDHRNG2	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ea4ccu)	/* Comparator Range Register 2 */
#define MCDS_TCXWDHRNG3	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ea4ecu)	/* Comparator Range Register 3 */
#define MCDS_TCYWDHRNG0	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ec48cu)	/* Comparator Range Register 0 */
#define MCDS_TCYWDHRNG1	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ec4acu)	/* Comparator Range Register 1 */
#define MCDS_TCYWDHRNG2	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ec4ccu)	/* Comparator Range Register 2 */
#define MCDS_TCYWDHRNG3	(*( MCDS_SRI1WDHRNG0_type *) 0xf00ec4ecu)	/* Comparator Range Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int SIGN           : 6;	/* Bit number (1?63) of sign bit */
		unsigned int                : 8;
		unsigned int EITHER         : 1;	/* RANGE matching either side of BOUND */
		unsigned int BELOW          : 1;	/* RANGE matching lower side of BOUND */
		unsigned int RELOAD         : 4;	/* Reload Event Selector */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_SRI1WDSGN0_type;
#define MCDS_SRI1WDSGN0	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef49cu)	/* Comparator Sign Register 0 */
#define MCDS_SRI1WDSGN1	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef4bcu)	/* Comparator Sign Register 1 */
#define MCDS_SRI1WDSGN2	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef4dcu)	/* Comparator Sign Register 2 */
#define MCDS_SRI1WDSGN3	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef4fcu)	/* Comparator Sign Register 3 */
#define MCDS_SRI2WDSGN0	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef69cu)	/* Comparator Sign Register 0 */
#define MCDS_SRI2WDSGN1	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef6bcu)	/* Comparator Sign Register 1 */
#define MCDS_SRI2WDSGN2	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef6dcu)	/* Comparator Sign Register 2 */
#define MCDS_SRI2WDSGN3	(*( MCDS_SRI1WDSGN0_type *) 0xf00ef6fcu)	/* Comparator Sign Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EI             : 1;	/* ENDINIT Protection Flag */
		/* const */ unsigned int SUS            : 1;	/* Suspended Flag */
		/* const */ unsigned int ERR            : 1;	/* Error Flag */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int SYSRES         : 1;	/* System Reset (Class 0) Flag */
		/* const */ unsigned int APPRES         : 1;	/* Application Reset (Class 3) Flag */
		/* const */ unsigned int CLKDIV         : 2;	/* Current Clock Divider */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} MCDS_SRIDCSTS_type;
#define MCDS_SRIDCSTS	(*( MCDS_SRIDCSTS_type *) 0xf00ef000u)	/* Debug Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CURRENT        : 2;	/* Current Process ID */
		/* const */ unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXCID_type;
#define MCDS_TCXCID	(*( MCDS_TCXCID_type *) 0xf00ea004u)	/* Current Process ID */
#define MCDS_TCYCID	(*( MCDS_TCXCID_type *) 0xf00ec004u)	/* Current Process ID */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 1;
		/* const */ unsigned int CURRENT        : 31;	/* Current Instruction Pointer */
	} B;
	int I;
	unsigned int U;

} MCDS_TCXCIP_type;
#define MCDS_TCXCIP	(*( MCDS_TCXCIP_type *) 0xf00ea008u)	/* Current Instruction Pointer */
#define MCDS_TCYCIP	(*( MCDS_TCXCIP_type *) 0xf00ec008u)	/* Current Instruction Pointer */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SUS            : 1;	/* Suspended Flag */
		/* const */ unsigned int IDLE           : 1;	/* Run Flag */
		/* const */ unsigned int HALT           : 1;	/* Halted Flag */
		/* const */ unsigned int ISR            : 1;	/* Interrupt Service Flag */
		/* const */ unsigned int HBRK           : 1;	/* Hardware Break Flag */
		/* const */ unsigned int SBRK           : 1;	/* Software Break Flag */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int IEN            : 1;	/* Interrupt Enable Flag */
		/* const */ unsigned int DBGEN          : 1;	/* Debug Enabled Flag */
		/* const */ unsigned int CLKDIV         : 2;	/* Current Clock Divider */
		/* const */ unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXDCSTS_type;
#define MCDS_TCXDCSTS	(*( MCDS_TCXDCSTS_type *) 0xf00ea000u)	/* Debug Status Register */
#define MCDS_TCYDCSTS	(*( MCDS_TCXDCSTS_type *) 0xf00ec000u)	/* Debug Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUND          : 2;	/* Process ID Comparator range lower bound */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXIDBND0_type;
#define MCDS_TCXIDBND0	(*( MCDS_TCXIDBND0_type *) 0xf00eac00u)	/* Comparator Bound Register 0 */
#define MCDS_TCXIDBND1	(*( MCDS_TCXIDBND0_type *) 0xf00eac10u)	/* Comparator Bound Register 1 */
#define MCDS_TCYIDBND0	(*( MCDS_TCXIDBND0_type *) 0xf00ecc00u)	/* Comparator Bound Register 0 */
#define MCDS_TCYIDBND1	(*( MCDS_TCXIDBND0_type *) 0xf00ecc10u)	/* Comparator Bound Register 1 */

