svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MASK           : 2;	/* Process ID Comparator bit mask */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXIDMSK0_type;
#define MCDS_TCXIDMSK0	(*( MCDS_TCXIDMSK0_type *) 0xf00eac08u)	/* Comparator Mask Register 0 */
#define MCDS_TCXIDMSK1	(*( MCDS_TCXIDMSK0_type *) 0xf00eac18u)	/* Comparator Mask Register 1 */
#define MCDS_TCYIDMSK0	(*( MCDS_TCXIDMSK0_type *) 0xf00ecc08u)	/* Comparator Mask Register 0 */
#define MCDS_TCYIDMSK1	(*( MCDS_TCXIDMSK0_type *) 0xf00ecc18u)	/* Comparator Mask Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int RANGE          : 2;	/* Process ID Comparator range size */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXIDRNG0_type;
#define MCDS_TCXIDRNG0	(*( MCDS_TCXIDRNG0_type *) 0xf00eac04u)	/* Comparator Range Register 0 */
#define MCDS_TCXIDRNG1	(*( MCDS_TCXIDRNG0_type *) 0xf00eac14u)	/* Comparator Range Register 1 */
#define MCDS_TCYIDRNG0	(*( MCDS_TCXIDRNG0_type *) 0xf00ecc04u)	/* Comparator Range Register 0 */
#define MCDS_TCYIDRNG1	(*( MCDS_TCXIDRNG0_type *) 0xf00ecc14u)	/* Comparator Range Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int SIGN           : 1;	/* Bit number (1) of sign bit */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXIDSGN0_type;
#define MCDS_TCXIDSGN0	(*( MCDS_TCXIDSGN0_type *) 0xf00eac0cu)	/* Comparator Sign Register 0 */
#define MCDS_TCXIDSGN1	(*( MCDS_TCXIDSGN0_type *) 0xf00eac1cu)	/* Comparator Sign Register 1 */
#define MCDS_TCYIDSGN0	(*( MCDS_TCXIDSGN0_type *) 0xf00ecc0cu)	/* Comparator Sign Register 0 */
#define MCDS_TCYIDSGN1	(*( MCDS_TCXIDSGN0_type *) 0xf00ecc1cu)	/* Comparator Sign Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int BOUND          : 31;	/* IP Comparator range lower bound */
	} B;
	int I;
	unsigned int U;

} MCDS_TCXIPBND0_type;
#define MCDS_TCXIPBND0	(*( MCDS_TCXIPBND0_type *) 0xf00eb000u)	/* Comparator Bound Register 0 */
#define MCDS_TCXIPBND1	(*( MCDS_TCXIPBND0_type *) 0xf00eb010u)	/* Comparator Bound Register 1 */
#define MCDS_TCXIPBND2	(*( MCDS_TCXIPBND0_type *) 0xf00eb020u)	/* Comparator Bound Register 2 */
#define MCDS_TCXIPBND3	(*( MCDS_TCXIPBND0_type *) 0xf00eb030u)	/* Comparator Bound Register 3 */
#define MCDS_TCXIPBND4	(*( MCDS_TCXIPBND0_type *) 0xf00eb040u)	/* Comparator Bound Register 4 */
#define MCDS_TCXIPBND5	(*( MCDS_TCXIPBND0_type *) 0xf00eb050u)	/* Comparator Bound Register 5 */
#define MCDS_TCYIPBND0	(*( MCDS_TCXIPBND0_type *) 0xf00ed000u)	/* Comparator Bound Register 0 */
#define MCDS_TCYIPBND1	(*( MCDS_TCXIPBND0_type *) 0xf00ed010u)	/* Comparator Bound Register 1 */
#define MCDS_TCYIPBND2	(*( MCDS_TCXIPBND0_type *) 0xf00ed020u)	/* Comparator Bound Register 2 */
#define MCDS_TCYIPBND3	(*( MCDS_TCXIPBND0_type *) 0xf00ed030u)	/* Comparator Bound Register 3 */
#define MCDS_TCYIPBND4	(*( MCDS_TCXIPBND0_type *) 0xf00ed040u)	/* Comparator Bound Register 4 */
#define MCDS_TCYIPBND5	(*( MCDS_TCXIPBND0_type *) 0xf00ed050u)	/* Comparator Bound Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int RANGE          : 31;	/* IP Comparator range size */
	} B;
	int I;
	unsigned int U;

} MCDS_TCXIPRNG0_type;
#define MCDS_TCXIPRNG0	(*( MCDS_TCXIPRNG0_type *) 0xf00eb004u)	/* Comparator Range Register 0 */
#define MCDS_TCXIPRNG1	(*( MCDS_TCXIPRNG0_type *) 0xf00eb014u)	/* Comparator Range Register 1 */
#define MCDS_TCXIPRNG2	(*( MCDS_TCXIPRNG0_type *) 0xf00eb024u)	/* Comparator Range Register 2 */
#define MCDS_TCXIPRNG3	(*( MCDS_TCXIPRNG0_type *) 0xf00eb034u)	/* Comparator Range Register 3 */
#define MCDS_TCXIPRNG4	(*( MCDS_TCXIPRNG0_type *) 0xf00eb044u)	/* Comparator Range Register 4 */
#define MCDS_TCXIPRNG5	(*( MCDS_TCXIPRNG0_type *) 0xf00eb054u)	/* Comparator Range Register 5 */
#define MCDS_TCYIPRNG0	(*( MCDS_TCXIPRNG0_type *) 0xf00ed004u)	/* Comparator Range Register 0 */
#define MCDS_TCYIPRNG1	(*( MCDS_TCXIPRNG0_type *) 0xf00ed014u)	/* Comparator Range Register 1 */
#define MCDS_TCYIPRNG2	(*( MCDS_TCXIPRNG0_type *) 0xf00ed024u)	/* Comparator Range Register 2 */
#define MCDS_TCYIPRNG3	(*( MCDS_TCXIPRNG0_type *) 0xf00ed034u)	/* Comparator Range Register 3 */
#define MCDS_TCYIPRNG4	(*( MCDS_TCXIPRNG0_type *) 0xf00ed044u)	/* Comparator Range Register 4 */
#define MCDS_TCYIPRNG5	(*( MCDS_TCXIPRNG0_type *) 0xf00ed054u)	/* Comparator Range Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int SIGN           : 6;	/* Bit number (1?63) of sign bit */
		unsigned int                : 8;
		unsigned int EITHER         : 1;	/* RANGE matching either side of BOUND */
		unsigned int BELOW          : 1;	/* RANGE matching lower side of BOUND */
		unsigned int RELOAD         : 4;	/* Reload Event Selector */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} MCDS_TCXWDSGN0_type;
#define MCDS_TCXWDSGN0	(*( MCDS_TCXWDSGN0_type *) 0xf00ea49cu)	/* Comparator Sign Register 0 */
#define MCDS_TCXWDSGN1	(*( MCDS_TCXWDSGN0_type *) 0xf00ea4bcu)	/* Comparator Sign Register 1 */
#define MCDS_TCXWDSGN2	(*( MCDS_TCXWDSGN0_type *) 0xf00ea4dcu)	/* Comparator Sign Register 2 */
#define MCDS_TCXWDSGN3	(*( MCDS_TCXWDSGN0_type *) 0xf00ea4fcu)	/* Comparator Sign Register 3 */
#define MCDS_TCYWDSGN0	(*( MCDS_TCXWDSGN0_type *) 0xf00ec49cu)	/* Comparator Sign Register 0 */
#define MCDS_TCYWDSGN1	(*( MCDS_TCXWDSGN0_type *) 0xf00ec4bcu)	/* Comparator Sign Register 1 */
#define MCDS_TCYWDSGN2	(*( MCDS_TCXWDSGN0_type *) 0xf00ec4dcu)	/* Comparator Sign Register 2 */
#define MCDS_TCYWDSGN3	(*( MCDS_TCXWDSGN0_type *) 0xf00ec4fcu)	/* Comparator Sign Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int COUNT          : 32;	/* Current Count Value */
	} B;
	int I;
	unsigned int U;

} MCDS_TSUEMUCNT_type;
#define MCDS_TSUEMUCNT	(*( MCDS_TSUEMUCNT_type *) 0xf00e8408u)	/* Clock Counter Register */
#define MCDS_TSUREFCNT	(*( MCDS_TSUEMUCNT_type *) 0xf00e8400u)	/* Clock Counter Register */

