svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RELOAD         : 32;	/* Prescaler Reload Value */
	} B;
	int I;
	unsigned int U;

} MCDS_TSUPRSCL_type;
#define MCDS_TSUPRSCL	(*( MCDS_TSUPRSCL_type *) 0xf00e8404u)	/* Clock Prescaler Register */


/* AGBT */
typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} AGBT_CLC_type;
#define AGBT_CLC	(*( AGBT_CLC_type *) 0xf00e1000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DFTREN         : 1;	/* DFT RECEIVER Enable */
		/* const */ unsigned int DFTANAAC       : 1;	/* DFT Monitor of analog test output status */
		/* const */ unsigned int DFTCIT         : 1;	/* DFT Monitor of JTAG test register status */
		unsigned int                : 1;
		unsigned int DFTPPS         : 6;	/* DFT RECEIVER Phase Select */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} AGBT_DFT1_type;
#define AGBT_DFT1	(*( AGBT_DFT1_type *) 0xf00e104cu)	/* Intro Design For Test Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CURLVL         : 8;	/* Current FIFO Fill Level */
		unsigned int MAXLVL         : 8;	/* Maximum FIFO Fill Level */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} AGBT_FBFLV_type;
#define AGBT_FBFLV	(*( AGBT_FBFLV_type *) 0xf00e1020u)	/* FIFO Block Fill Level */

typedef volatile union
{
	struct
	{ 
		unsigned int WMLVL          : 8;	/* Watermark Level */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} AGBT_FCTRL_type;
#define AGBT_FCTRL	(*( AGBT_FCTRL_type *) 0xf00e1018u)	/* FIFO Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} AGBT_ID_type;
#define AGBT_ID	(*( AGBT_ID_type *) 0xf00e1008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OFWE           : 1;	/* FIFO overflow enable */
		unsigned int WME            : 1;	/* Watermark interrupt enable */
		unsigned int HWE            : 1;	/* Hardware error indication interrupt enable */
		unsigned int FERE           : 1;	/* Truncated Frame error interrupt enable */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} AGBT_IRE_type;
#define AGBT_IRE	(*( AGBT_IRE_type *) 0xf00e1028u)	/* Intro Interrupt enable register */

typedef volatile union
{
	struct
	{ 
		unsigned int OFW            : 1;	/* FIFO overflow */
		unsigned int WM             : 1;	/* FIFO watermark interrupt */
		unsigned int HW             : 1;	/* Hardware error indication interrupt */
		unsigned int FER            : 1;	/* Truncated Frame */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} AGBT_IRS_type;
#define AGBT_IRS	(*( AGBT_IRS_type *) 0xf00e1024u)	/* Intro Interrupt status register */

typedef volatile union
{
	struct
	{ 
		unsigned int PCTR0          : 1;	/* Enable PLL to lock. */
		unsigned int PCTR1          : 1;	/* Enable PLL divider by 2 */
		unsigned int PCTR2          : 1;	/* Activate the clock for the tDC */
		unsigned int PCTR3          : 1;	/* Activate the clock for the TX */
		unsigned int PCTR4          : 1;	/* Activates the clock for the PI */
		unsigned int                : 19;
		unsigned int PCTR24         : 1;	/* Select signal for register readback */
		unsigned int PCTR25         : 1;	/* Write signal for internal PLL registers */
		unsigned int PCTRA          : 6;	/* Address of internal PLL register */
	} B;
	int I;
	unsigned int U;

} AGBT_PLC1_type;
#define AGBT_PLC1	(*( AGBT_PLC1_type *) 0xf00e1030u)	/* Intro PLL Control Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCTRL2         : 32;	/* PLL dynamic control bits [63:32] */
	} B;
	int I;
	unsigned int U;

} AGBT_PLC2_type;
#define AGBT_PLC2	(*( AGBT_PLC2_type *) 0xf00e1034u)	/* Intro PLL Control Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int PFCW           : 24;	/* PLL multiplication factor selection */
		unsigned int CBTRIMCUR      : 3;	/* Central Bias */
		unsigned int                : 4;
		unsigned int PRS            : 1;	/* PLL Ref. clock select */
	} B;
	int I;
	unsigned int U;

} AGBT_PLC3_type;
#define AGBT_PLC3	(*( AGBT_PLC3_type *) 0xf00e1038u)	/* Intro PLL Control Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCSP           : 1;	/* PCS layer bit polarity selection */
		unsigned int SEREN          : 1;	/* Enable SERIALIZER */
		unsigned int SERDEM         : 1;	/* Activate SERIALIZER De-Emphasis Mode */
		unsigned int DPNBS          : 2;	/* DATA PREDRIVER Current */
		unsigned int DPARE          : 3;	/* DATA PREDRIVER Capacity */
		unsigned int DPSRE          : 3;	/* DATA PREDRIVER High Level */
		unsigned int DPBYS          : 1;	/* DATA PROVIDER Full Swing */
		unsigned int CLKRXSCMR      : 3;	/* Clock Receiver reference voltage */
		unsigned int                : 1;
		unsigned int OCDCVS         : 4;	/* OFF-CHIP DRIVER (OCD) Current */
		unsigned int OCDRTS         : 5;	/* OFF-CHIP DRIVER (OCD) Termination */
		unsigned int PCSMSB         : 1;	/* MSB first (PCS) */
		unsigned int PCSBSW         : 1;	/* Byte Swap (PCS) */
		unsigned int CLKRXSRTER     : 4;	/* Clock Receiver Termination */
		unsigned int OCDDIFEN       : 1;	/* OCD DIFFERENTIAL OUTPUT ENABLE (OCD) */
	} B;
	int I;
	unsigned int U;

} AGBT_PLC4_type;
#define AGBT_PLC4	(*( AGBT_PLC4_type *) 0xf00e103cu)	/* Intro Physical Layer Control Register 4 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PLLREGDO       : 32;	/* Readback data from internal PLL registers and BIST status register. Register selected by PLL Address field. */
	} B;
	int I;
	unsigned int U;

} AGBT_PLC5_type;
