svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define AGBT_PLC5	(*( AGBT_PLC5_type *) 0xf00e1050u)	/* Intro Production Test Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCSDS          : 2;	/* PCS Layer Data Source */
		unsigned int PCSDPAT        : 2;	/* PCS Layer Dynamic Pattern Select */
		unsigned int PCSSPAT        : 20;	/* PCS Layer Static Pattern */
		unsigned int PCS8BE         : 1;	/* PCS Layer - Enable the 8B10B Encoder */
		unsigned int PCSPER         : 1;	/* PCS Layer - Insert error in the PRBS generation */
		/* const */ unsigned int PCSPCO         : 1;	/* PCS Layer - PRBS checker output */
		unsigned int SEREIE         : 1;	/* SERIALIZER Output Override */
		unsigned int SERSGS         : 1;	/* SERIALIZER Data Polarity */
		unsigned int SERCES         : 1;	/* SERIALIZER Clock Polarity */
		unsigned int SERDEEMPH      : 1;	/* SERIALIZER De-Emphasis Mode */
		/* const */ unsigned int SERDIV20CO     : 1;	/* SERIALIZER Clock Divider */
	} B;
	int I;
	unsigned int U;

} AGBT_PTR1_type;
#define AGBT_PTR1	(*( AGBT_PTR1_type *) 0xf00e1040u)	/* Intro Production Test Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCSPCRX        : 1;	/* PCS Layer PRBS checker enable */
		unsigned int PCSPFSM        : 1;	/* PCS Layer PRBS checker mode */
		unsigned int PCSEM          : 1;	/* PCS Layer Error Insertion Mode */
		unsigned int PCSBERCON      : 1;	/* PCS Layer BER counter mode */
		unsigned int PCSERRB        : 5;	/* PCS Layer Error Insertion Size */
		unsigned int PCSBERCRST     : 1;	/* PCS Layer BER counter reset */
		/* const */ unsigned int PCSFERCO       : 5;	/* PCS Layer - FER counter output */
		unsigned int OCDPON         : 1;	/* OFF-CHIP DRIVER (OCD) Power On */
		/* const */ unsigned int PCSPRBSFSM     : 2;	/* PCS Layer PRBS checker state */
		unsigned int                : 12;
		unsigned int CLKPEN         : 1;	/* CLOCK PREDRIVER Enable */
		unsigned int CLKPSL         : 1;	/* CLOCK PREDRIVER Clock Select */
	} B;
	int I;
	unsigned int U;

} AGBT_PTR2_type;
#define AGBT_PTR2	(*( AGBT_PTR2_type *) 0xf00e1044u)	/* Intro Production Test Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCSBERCOUT     : 32;	/* PCS Layer - BER counter output. */
	} B;
	int I;
	unsigned int U;

} AGBT_PTR3_type;
#define AGBT_PTR3	(*( AGBT_PTR3_type *) 0xf00e1048u)	/* Intro Production Test Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int ACIC           : 24;	/* Automatic Channel Initialization Counter */
		unsigned int                : 7;
		unsigned int ACIEN          : 1;	/* Automatic Channel Initialization enable */
	} B;
	int I;
	unsigned int U;

} AGBT_TACU_type;
#define AGBT_TACU	(*( AGBT_TACU_type *) 0xf00e101cu)	/* Trace Auto Channel UP */

typedef volatile union
{
	struct
	{ 
		unsigned int TE             : 1;	/* Trace Enable */
		unsigned int PLLE           : 1;	/* PLL reset */
		unsigned int TXA            : 1;	/* Initialized */
		unsigned int PON            : 1;	/* Power On */
		unsigned int TPV            : 1;	/* Trace Port Verified */
		unsigned int BD             : 3;	/* Baud rate selection/availability */
		unsigned int                : 8;
		unsigned int AGBTON         : 1;	/* Intro on */
		unsigned int CIFON          : 1;	/* CIF on */
		unsigned int CRCON          : 1;	/* CRC append at the end of a data block on. */
		unsigned int ATPMON         : 1;	/* Aurora Test Pattern Mode */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} AGBT_TCR_type;
#define AGBT_TCR	(*( AGBT_TCR_type *) 0xf00e1010u)	/* Trace Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXLNUP         : 1;	/* TX lane up */
		/* const */ unsigned int FBE            : 1;	/* FIFO Buffer empty indication */
		/* const */ unsigned int PLK            : 1;	/* PLL lock status */
		/* const */ unsigned int ATBS           : 2;	/* AGBT Trace Buffer Size */
		/* const */ unsigned int ETS            : 2;	/* EMEM Tile Size */
		/* const */ unsigned int                : 24;
		/* const */ unsigned int CHUP           : 1;	/* Channel up */
	} B;
	int I;
	unsigned int U;

} AGBT_TSR_type;
#define AGBT_TSR	(*( AGBT_TSR_type *) 0xf00e1014u)	/* Trace Status Register */


/* CPU */
typedef volatile union
{
	struct
	{ 
		unsigned int VSS            : 1;	/* Vector Spacing Select */
		unsigned int bBIV           : 31;	/* Base Address of Interrupt Vector Table */
	} B;
	int I;
	unsigned int U;

} CPU0_BIV_type;
#define CPU0_BIV	(*( CPU0_BIV_type *) 0xf881fe20u)	/* Base Interrupt Vector Table Pointer */
#define CPU1_BIV	(*( CPU0_BIV_type *) 0xf883fe20u)	/* Base Interrupt Vector Table Pointer */
#define CPU2_BIV	(*( CPU0_BIV_type *) 0xf885fe20u)	/* Base Interrupt Vector Table Pointer */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 1;	/* Reserved */
		unsigned int bBTV           : 31;	/* Base Address of Trap Vector Table */
	} B;
	int I;
	unsigned int U;

} CPU0_BTV_type;
#define CPU0_BTV	(*( CPU0_BTV_type *) 0xf881fe24u)	/* Base Trap Vector Table Pointer */
#define CPU1_BTV	(*( CPU0_BTV_type *) 0xf883fe24u)	/* Base Trap Vector Table Pointer */
#define CPU2_BTV	(*( CPU0_BTV_type *) 0xf885fe24u)	/* Base Trap Vector Table Pointer */

typedef volatile union
{
	struct
	{ 
		unsigned int CountValue     : 31;	/* Count Value */
		unsigned int SOvf           : 1;	/* Sticky Overflow Bit */
	} B;
	int I;
	unsigned int U;

} CPU0_CCNT_type;
#define CPU0_CCNT	(*( CPU0_CCNT_type *) 0xf881fc04u)	/* CPU Clock Cycle Count */
#define CPU0_ICNT	(*( CPU0_CCNT_type *) 0xf881fc08u)	/* Instruction Count */
#define CPU0_M1CNT	(*( CPU0_CCNT_type *) 0xf881fc0cu)	/* Multi-Count Register 1 */
#define CPU0_M2CNT	(*( CPU0_CCNT_type *) 0xf881fc10u)	/* Multi-Count Register 2 */
#define CPU0_M3CNT	(*( CPU0_CCNT_type *) 0xf881fc14u)	/* Multi-Count Register 3 */
#define CPU1_CCNT	(*( CPU0_CCNT_type *) 0xf883fc04u)	/* CPU Clock Cycle Count */
#define CPU1_ICNT	(*( CPU0_CCNT_type *) 0xf883fc08u)	/* Instruction Count */
#define CPU1_M1CNT	(*( CPU0_CCNT_type *) 0xf883fc0cu)	/* Multi-Count Register 1 */
#define CPU1_M2CNT	(*( CPU0_CCNT_type *) 0xf883fc10u)	/* Multi-Count Register 2 */
#define CPU1_M3CNT	(*( CPU0_CCNT_type *) 0xf883fc14u)	/* Multi-Count Register 3 */
#define CPU2_CCNT	(*( CPU0_CCNT_type *) 0xf885fc04u)	/* CPU Clock Cycle Count */
#define CPU2_ICNT	(*( CPU0_CCNT_type *) 0xf885fc08u)	/* Instruction Count */
#define CPU2_M1CNT	(*( CPU0_CCNT_type *) 0xf885fc0cu)	/* Multi-Count Register 1 */
#define CPU2_M2CNT	(*( CPU0_CCNT_type *) 0xf885fc10u)	/* Multi-Count Register 2 */
#define CPU2_M3CNT	(*( CPU0_CCNT_type *) 0xf885fc14u)	/* Multi-Count Register 3 */

