svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CM             : 1;	/* Counter Mode */
		unsigned int CE             : 1;	/* Count Enable */
		unsigned int M1             : 3;	/* M1CNT Configuration */
		unsigned int M2             : 3;	/* M2CNT Configuration */
		unsigned int M3             : 3;	/* M3CNT Configuration */
		/* const */ unsigned int RES            : 21;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_CCTRL_type;
#define CPU0_CCTRL	(*( CPU0_CCTRL_type *) 0xf881fc00u)	/* Counter Control */
#define CPU1_CCTRL	(*( CPU0_CCTRL_type *) 0xf883fc00u)	/* Counter Control */
#define CPU2_CCTRL	(*( CPU0_CCTRL_type *) 0xf885fc00u)	/* Counter Control */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int RM             : 1;	/* Rounding Mode Compatibility */
		unsigned int SP             : 1;	/* SYSCON Safety Protection Mode Compatibility */
		/* const */ unsigned int RES_4          : 27;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_COMPAT_type;
#define CPU0_COMPAT	(*( CPU0_COMPAT_type *) 0xf8819400u)	/* Compatibility Control Register */
#define CPU1_COMPAT	(*( CPU0_COMPAT_type *) 0xf8839400u)	/* Compatibility Control Register */
#define CPU2_COMPAT	(*( CPU0_COMPAT_type *) 0xf8859400u)	/* Compatibility Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int bCORE_ID       : 3;	/* Core Identification Number */
		/* const */ unsigned int RES            : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_CORE_ID_type;
#define CPU0_CORE_ID	(*( CPU0_CORE_ID_type *) 0xf881fe1cu)	/* CPU0 Core Identification Register */
#define CPU1_CORE_ID	(*( CPU0_CORE_ID_type *) 0xf883fe1cu)	/* CPU1 Core Identification Register */
#define CPU2_CORE_ID	(*( CPU0_CORE_ID_type *) 0xf885fe1cu)	/* CPU2 Core Identification Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int LOWBND         : 29;	/* CPRy Lower Boundary Address */
	} B;
	int I;
	unsigned int U;

} CPU0_CPR0_L_type;
#define CPU0_CPR0_L	(*( CPU0_CPR0_L_type *) 0xf881d000u)	/* CPU0 Code Protection Range 0 Lower Bound Register */
#define CPU0_CPR1_L	(*( CPU0_CPR0_L_type *) 0xf881d008u)	/* CPU0 Code Protection Range 1 Lower Bound Register */
#define CPU0_CPR2_L	(*( CPU0_CPR0_L_type *) 0xf881d010u)	/* CPU0 Code Protection Range 2 Lower Bound Register */
#define CPU0_CPR3_L	(*( CPU0_CPR0_L_type *) 0xf881d018u)	/* CPU0 Code Protection Range 3 Lower Bound Register */
#define CPU0_CPR4_L	(*( CPU0_CPR0_L_type *) 0xf881d020u)	/* CPU0 Code Protection Range 4 Lower Bound Register */
#define CPU0_CPR5_L	(*( CPU0_CPR0_L_type *) 0xf881d028u)	/* CPU0 Code Protection Range 5 Lower Bound Register */
#define CPU0_CPR6_L	(*( CPU0_CPR0_L_type *) 0xf881d030u)	/* CPU0 Code Protection Range 6 Lower Bound Register */
#define CPU0_CPR7_L	(*( CPU0_CPR0_L_type *) 0xf881d038u)	/* CPU0 Code Protection Range 7 Lower Bound Register */
#define CPU1_CPR0_L	(*( CPU0_CPR0_L_type *) 0xf883d000u)	/* CPU1 Code Protection Range 0 Lower Bound Register */
#define CPU1_CPR1_L	(*( CPU0_CPR0_L_type *) 0xf883d008u)	/* CPU1 Code Protection Range 1 Lower Bound Register */
#define CPU1_CPR2_L	(*( CPU0_CPR0_L_type *) 0xf883d010u)	/* CPU1 Code Protection Range 2 Lower Bound Register */
#define CPU1_CPR3_L	(*( CPU0_CPR0_L_type *) 0xf883d018u)	/* CPU1 Code Protection Range 3 Lower Bound Register */
#define CPU1_CPR4_L	(*( CPU0_CPR0_L_type *) 0xf883d020u)	/* CPU1 Code Protection Range 4 Lower Bound Register */
#define CPU1_CPR5_L	(*( CPU0_CPR0_L_type *) 0xf883d028u)	/* CPU1 Code Protection Range 5 Lower Bound Register */
#define CPU1_CPR6_L	(*( CPU0_CPR0_L_type *) 0xf883d030u)	/* CPU1 Code Protection Range 6 Lower Bound Register */
#define CPU1_CPR7_L	(*( CPU0_CPR0_L_type *) 0xf883d038u)	/* CPU1 Code Protection Range 7 Lower Bound Register */
#define CPU2_CPR0_L	(*( CPU0_CPR0_L_type *) 0xf885d000u)	/* CPU2 Code Protection Range 0 Lower Bound Register */
#define CPU2_CPR1_L	(*( CPU0_CPR0_L_type *) 0xf885d008u)	/* CPU2 Code Protection Range 1 Lower Bound Register */
#define CPU2_CPR2_L	(*( CPU0_CPR0_L_type *) 0xf885d010u)	/* CPU2 Code Protection Range 2 Lower Bound Register */
#define CPU2_CPR3_L	(*( CPU0_CPR0_L_type *) 0xf885d018u)	/* CPU2 Code Protection Range 3 Lower Bound Register */
#define CPU2_CPR4_L	(*( CPU0_CPR0_L_type *) 0xf885d020u)	/* CPU2 Code Protection Range 4 Lower Bound Register */
#define CPU2_CPR5_L	(*( CPU0_CPR0_L_type *) 0xf885d028u)	/* CPU2 Code Protection Range 5 Lower Bound Register */
#define CPU2_CPR6_L	(*( CPU0_CPR0_L_type *) 0xf885d030u)	/* CPU2 Code Protection Range 6 Lower Bound Register */
#define CPU2_CPR7_L	(*( CPU0_CPR0_L_type *) 0xf885d038u)	/* CPU2 Code Protection Range 7 Lower Bound Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int UPPBND         : 29;	/* CPR0_m Upper Boundary Address */
	} B;
	int I;
	unsigned int U;

} CPU0_CPR0_U_type;
#define CPU0_CPR0_U	(*( CPU0_CPR0_U_type *) 0xf881d004u)	/* CPU0 Code Protection Range 0 Upper Bound Register */
#define CPU0_CPR1_U	(*( CPU0_CPR0_U_type *) 0xf881d00cu)	/* CPU0 Code Protection Range 1 Upper Bound Register */
#define CPU0_CPR2_U	(*( CPU0_CPR0_U_type *) 0xf881d014u)	/* CPU0 Code Protection Range 2 Upper Bound Register */
#define CPU0_CPR3_U	(*( CPU0_CPR0_U_type *) 0xf881d01cu)	/* CPU0 Code Protection Range 3 Upper Bound Register */
#define CPU0_CPR4_U	(*( CPU0_CPR0_U_type *) 0xf881d024u)	/* CPU0 Code Protection Range 4 Upper Bound Register */
#define CPU0_CPR5_U	(*( CPU0_CPR0_U_type *) 0xf881d02cu)	/* CPU0 Code Protection Range 5 Upper Bound Register */
#define CPU0_CPR6_U	(*( CPU0_CPR0_U_type *) 0xf881d034u)	/* CPU0 Code Protection Range 6 Upper Bound Register */
#define CPU0_CPR7_U	(*( CPU0_CPR0_U_type *) 0xf881d03cu)	/* CPU0 Code Protection Range 7 Upper Bound Register */
#define CPU1_CPR0_U	(*( CPU0_CPR0_U_type *) 0xf883d004u)	/* CPU1 Code Protection Range 0 Upper Bound Register */
#define CPU1_CPR1_U	(*( CPU0_CPR0_U_type *) 0xf883d00cu)	/* CPU1 Code Protection Range 1 Upper Bound Register */
#define CPU1_CPR2_U	(*( CPU0_CPR0_U_type *) 0xf883d014u)	/* CPU1 Code Protection Range 2 Upper Bound Register */
#define CPU1_CPR3_U	(*( CPU0_CPR0_U_type *) 0xf883d01cu)	/* CPU1 Code Protection Range 3 Upper Bound Register */
#define CPU1_CPR4_U	(*( CPU0_CPR0_U_type *) 0xf883d024u)	/* CPU1 Code Protection Range 4 Upper Bound Register */
#define CPU1_CPR5_U	(*( CPU0_CPR0_U_type *) 0xf883d02cu)	/* CPU1 Code Protection Range 5 Upper Bound Register */
#define CPU1_CPR6_U	(*( CPU0_CPR0_U_type *) 0xf883d034u)	/* CPU1 Code Protection Range 6 Upper Bound Register */
#define CPU1_CPR7_U	(*( CPU0_CPR0_U_type *) 0xf883d03cu)	/* CPU1 Code Protection Range 7 Upper Bound Register */
#define CPU2_CPR0_U	(*( CPU0_CPR0_U_type *) 0xf885d004u)	/* CPU2 Code Protection Range 0 Upper Bound Register */
#define CPU2_CPR1_U	(*( CPU0_CPR0_U_type *) 0xf885d00cu)	/* CPU2 Code Protection Range 1 Upper Bound Register */
#define CPU2_CPR2_U	(*( CPU0_CPR0_U_type *) 0xf885d014u)	/* CPU2 Code Protection Range 2 Upper Bound Register */
#define CPU2_CPR3_U	(*( CPU0_CPR0_U_type *) 0xf885d01cu)	/* CPU2 Code Protection Range 3 Upper Bound Register */
#define CPU2_CPR4_U	(*( CPU0_CPR0_U_type *) 0xf885d024u)	/* CPU2 Code Protection Range 4 Upper Bound Register */
#define CPU2_CPR5_U	(*( CPU0_CPR0_U_type *) 0xf885d02cu)	/* CPU2 Code Protection Range 5 Upper Bound Register */
#define CPU2_CPR6_U	(*( CPU0_CPR0_U_type *) 0xf885d034u)	/* CPU2 Code Protection Range 6 Upper Bound Register */
#define CPU2_CPR7_U	(*( CPU0_CPR0_U_type *) 0xf885d03cu)	/* CPU2 Code Protection Range 7 Upper Bound Register */

