svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Revision Number */
		/* const */ unsigned int MOD_32B        : 8;	/* 32-Bit Module Enable */
		/* const */ unsigned int MOD            : 16;	/* Module Identification Number */
	} B;
	int I;
	unsigned int U;

} CPU0_CPU_ID_type;
#define CPU0_CPU_ID	(*( CPU0_CPU_ID_type *) 0xf881fe18u)	/* CPU0 Identification Register TC1.6P */
#define CPU1_CPU_ID	(*( CPU0_CPU_ID_type *) 0xf883fe18u)	/* CPU1 Identification Register TC1.6P */
#define CPU2_CPU_ID	(*( CPU0_CPU_ID_type *) 0xf885fe18u)	/* CPU2 Identification Register TC1.6P */

typedef volatile union
{
	struct
	{ 
		unsigned int XE             : 8;	/* Execute Enable Range select */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_CPXE_0_type;
#define CPU0_CPXE_0	(*( CPU0_CPXE_0_type *) 0xf881e000u)	/* CPU0 Code Protection Execute Enable Register Set 0 */
#define CPU0_CPXE_1	(*( CPU0_CPXE_0_type *) 0xf881e004u)	/* CPU0 Code Protection Execute Enable Register Set 1 */
#define CPU0_CPXE_2	(*( CPU0_CPXE_0_type *) 0xf881e008u)	/* CPU0 Code Protection Execute Enable Register Set 2 */
#define CPU0_CPXE_3	(*( CPU0_CPXE_0_type *) 0xf881e00cu)	/* CPU0 Code Protection Execute Enable Register Set 3 */
#define CPU1_CPXE_0	(*( CPU0_CPXE_0_type *) 0xf883e000u)	/* CPU1 Code Protection Execute Enable Register Set 0 */
#define CPU1_CPXE_1	(*( CPU0_CPXE_0_type *) 0xf883e004u)	/* CPU1 Code Protection Execute Enable Register Set 1 */
#define CPU1_CPXE_2	(*( CPU0_CPXE_0_type *) 0xf883e008u)	/* CPU1 Code Protection Execute Enable Register Set 2 */
#define CPU1_CPXE_3	(*( CPU0_CPXE_0_type *) 0xf883e00cu)	/* CPU1 Code Protection Execute Enable Register Set 3 */
#define CPU2_CPXE_0	(*( CPU0_CPXE_0_type *) 0xf885e000u)	/* CPU2 Code Protection Execute Enable Register Set 0 */
#define CPU2_CPXE_1	(*( CPU0_CPXE_0_type *) 0xf885e004u)	/* CPU2 Code Protection Execute Enable Register Set 1 */
#define CPU2_CPXE_2	(*( CPU0_CPXE_0_type *) 0xf885e008u)	/* CPU2 Code Protection Execute Enable Register Set 2 */
#define CPU2_CPXE_3	(*( CPU0_CPXE_0_type *) 0xf885e00cu)	/* CPU2 Code Protection Execute Enable Register Set 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int EVTA           : 3;	/* Event Associated */
		unsigned int BBM            : 1;	/* Break Before Make (BBM) or Break After Make (BAM) Selection */
		unsigned int BOD            : 1;	/* Breakout Disable */
		unsigned int SUSP           : 1;	/* CDC Suspend-Out Signal State */
		unsigned int CNT            : 2;	/* Counter */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_CREVT_type;
#define CPU0_CREVT	(*( CPU0_CREVT_type *) 0xf881fd0cu)	/* Core Register Access Event */
#define CPU1_CREVT	(*( CPU0_CREVT_type *) 0xf883fd0cu)	/* Core Register Access Event */
#define CPU2_CREVT	(*( CPU0_CREVT_type *) 0xf885fd0cu)	/* Core Register Access Event */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CID            : 3;	/* Customer ID */
		/* const */ unsigned int RES            : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_CUS_ID_type;
#define CPU0_CUS_ID	(*( CPU0_CUS_ID_type *) 0xf881fe50u)	/* CPU0 Customer ID register */
#define CPU1_CUS_ID	(*( CPU0_CUS_ID_type *) 0xf883fe50u)	/* CPU1 Customer ID register */
#define CPU2_CUS_ID	(*( CPU0_CUS_ID_type *) 0xf885fe50u)	/* CPU2 Customer ID register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int SBE            : 1;	/* Store Bus Error */
		/* const */ unsigned int RES_3          : 5;	/* Reserved */
		unsigned int CWE            : 1;	/* Cache Writeback Error */
		unsigned int CFE            : 1;	/* Cache Flush Error */
		/* const */ unsigned int RES_6          : 3;	/* Reserved */
		unsigned int SOE            : 1;	/* Store Overlay Error */
		unsigned int SME            : 1;	/* Store MIST Error */
		/* const */ unsigned int RES_9          : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_DATR_type;
#define CPU0_DATR	(*( CPU0_DATR_type *) 0xf8819018u)	/* Data Asynchronous Trap Register */
#define CPU1_DATR	(*( CPU0_DATR_type *) 0xf8839018u)	/* Data Asynchronous Trap Register */
#define CPU2_DATR	(*( CPU0_DATR_type *) 0xf8859018u)	/* Data Asynchronous Trap Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DE             : 1;	/* Debug Enable */
		unsigned int HALT           : 2;	/* CPU Halt Request / Status Field */
		/* const */ unsigned int SIH            : 1;	/* Suspend-in Halt */
		unsigned int SUSP           : 1;	/* Current State of the Core Suspend-Out Signal */
		/* const */ unsigned int RES            : 1;	/* Reserved */
		/* const */ unsigned int PREVSUSP       : 1;	/* Previous State of Core Suspend-Out Signal */
		unsigned int PEVT           : 1;	/* Posted Event */
		/* const */ unsigned int EVTSRC         : 5;	/* Event Source */
		/* const */ unsigned int RES_9          : 19;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_DBGSR_type;
#define CPU0_DBGSR	(*( CPU0_DBGSR_type *) 0xf881fd00u)	/* Debug Status Register */
#define CPU1_DBGSR	(*( CPU0_DBGSR_type *) 0xf883fd00u)	/* Debug Status Register */
#define CPU2_DBGSR	(*( CPU0_DBGSR_type *) 0xf885fd00u)	/* Debug Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DTA            : 1;	/* Debug Trap Active Bit */
		/* const */ unsigned int RES            : 31;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_DBGTCR_type;
#define CPU0_DBGTCR	(*( CPU0_DBGTCR_type *) 0xf881fd48u)	/* Debug Trap Control Register */
#define CPU1_DBGTCR	(*( CPU0_DBGTCR_type *) 0xf883fd48u)	/* Debug Trap Control Register */
#define CPU2_DBGTCR	(*( CPU0_DBGTCR_type *) 0xf885fd48u)	/* Debug Trap Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 1;	/* Reserved */
		unsigned int DCBYP          : 1;	/* Data Cache Bypass */
		/* const */ unsigned int RES_3          : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

