svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} CPU0_DCON0_type;
#define CPU0_DCON0	(*( CPU0_DCON0_type *) 0xf8819040u)	/* Data Memory Control Register */
#define CPU1_DCON0	(*( CPU0_DCON0_type *) 0xf8839040u)	/* Data Memory Control Register */
#define CPU2_DCON0	(*( CPU0_DCON0_type *) 0xf8859040u)	/* Data Memory Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DCACHE_SZE     : 16;	/* Data Cache Size */
		/* const */ unsigned int DSCRATCH_SZE   : 16;	/* Data Scratch Size */
	} B;
	int I;
	unsigned int U;

} CPU0_DCON2_type;
#define CPU0_DCON2	(*( CPU0_DCON2_type *) 0xf8819000u)	/* Data Control Register 2 */
#define CPU1_DCON2	(*( CPU0_DCON2_type *) 0xf8839000u)	/* Data Control Register 2 */
#define CPU2_DCON2	(*( CPU0_DCON2_type *) 0xf8859000u)	/* Data Control Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 6;	/* Reserved */
		unsigned int DCXValue       : 26;	/* Debug Context Save Area Pointer */
	} B;
	int I;
	unsigned int U;

} CPU0_DCX_type;
#define CPU0_DCX	(*( CPU0_DCX_type *) 0xf881fd44u)	/* Debug Context Save Area Pointer */
#define CPU1_DCX	(*( CPU0_DCX_type *) 0xf883fd44u)	/* Debug Context Save Area Pointer */
#define CPU2_DCX	(*( CPU0_DCX_type *) 0xf885fd44u)	/* Debug Context Save Area Pointer */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ERROR_ADDRESS  : 32;	/* Error Address */
	} B;
	int I;
	unsigned int U;

} CPU0_DEADD_type;
#define CPU0_DEADD	(*( CPU0_DEADD_type *) 0xf881901cu)	/* Data Error Address Register */
#define CPU1_DEADD	(*( CPU0_DEADD_type *) 0xf883901cu)	/* Data Error Address Register */
#define CPU2_DEADD	(*( CPU0_DEADD_type *) 0xf885901cu)	/* Data Error Address Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TA             : 32;	/* Transaction Address */
	} B;
	int I;
	unsigned int U;

} CPU0_DIEAR_type;
#define CPU0_DIEAR	(*( CPU0_DIEAR_type *) 0xf8819020u)	/* Data Integrity Error Address Register */
#define CPU0_PIEAR	(*( CPU0_DIEAR_type *) 0xf8819210u)	/* Program Integrity Error Address Register */
#define CPU1_DIEAR	(*( CPU0_DIEAR_type *) 0xf8839020u)	/* Data Integrity Error Address Register */
#define CPU1_PIEAR	(*( CPU0_DIEAR_type *) 0xf8839210u)	/* Program Integrity Error Address Register */
#define CPU2_DIEAR	(*( CPU0_DIEAR_type *) 0xf8859020u)	/* Data Integrity Error Address Register */
#define CPU2_PIEAR	(*( CPU0_DIEAR_type *) 0xf8859210u)	/* Program Integrity Error Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IED            : 1;	/* Integrity Error Detected */
		/* const */ unsigned int IE_T           : 1;	/* Integrity Error - Tag Memory */
		/* const */ unsigned int IE_C           : 1;	/* Integrity Error - Cache Memory */
		/* const */ unsigned int IE_S           : 1;	/* Integrity Error - Scratchpad Memory */
		/* const */ unsigned int IE_BI          : 1;	/* Integrity Error - Bus Integrity */
		/* const */ unsigned int E_INFO         : 6;	/* Error Information */
		/* const */ unsigned int IE_DUAL        : 1;	/* Dual Bit Error Detected */
		/* const */ unsigned int IE_SP          : 1;	/* Safety Protection Error Detected */
		/* const */ unsigned int IE_BS          : 1;	/* Bus Slave Access Indicator */
		/* const */ unsigned int RES            : 18;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_DIETR_type;
#define CPU0_DIETR	(*( CPU0_DIETR_type *) 0xf8819024u)	/* Data Integrity Error Trap Register */
#define CPU1_DIETR	(*( CPU0_DIETR_type *) 0xf8839024u)	/* Data Integrity Error Trap Register */
#define CPU2_DIETR	(*( CPU0_DIETR_type *) 0xf8859024u)	/* Data Integrity Error Trap Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 1;	/* Reserved */
		unsigned int DMSValue       : 31;	/* Debug Monitor Start Address */
	} B;
	int I;
	unsigned int U;

} CPU0_DMS_type;
#define CPU0_DMS	(*( CPU0_DMS_type *) 0xf881fd40u)	/* Debug Monitor Start Address */
#define CPU1_DMS	(*( CPU0_DMS_type *) 0xf883fd40u)	/* Debug Monitor Start Address */
#define CPU2_DMS	(*( CPU0_DMS_type *) 0xf885fd40u)	/* Debug Monitor Start Address */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int LOWBND         : 29;	/* DPRy Lower Boundary Address */
	} B;
	int I;
	unsigned int U;

} CPU0_DPR0_L_type;
#define CPU0_DPR0_L	(*( CPU0_DPR0_L_type *) 0xf881c000u)	/* CPU0 Data Protection Range 0, Lower Bound Register */
#define CPU0_DPR10_L	(*( CPU0_DPR0_L_type *) 0xf881c050u)	/* CPU0 Data Protection Range 10, Lower Bound Register */
#define CPU0_DPR11_L	(*( CPU0_DPR0_L_type *) 0xf881c058u)	/* CPU0 Data Protection Range 11, Lower Bound Register */
#define CPU0_DPR12_L	(*( CPU0_DPR0_L_type *) 0xf881c060u)	/* CPU0 Data Protection Range 12, Lower Bound Register */
#define CPU0_DPR13_L	(*( CPU0_DPR0_L_type *) 0xf881c068u)	/* CPU0 Data Protection Range 13, Lower Bound Register */
#define CPU0_DPR14_L	(*( CPU0_DPR0_L_type *) 0xf881c070u)	/* CPU0 Data Protection Range 14, Lower Bound Register */
#define CPU0_DPR15_L	(*( CPU0_DPR0_L_type *) 0xf881c078u)	/* CPU0 Data Protection Range 15, Lower Bound Register */
#define CPU0_DPR1_L	(*( CPU0_DPR0_L_type *) 0xf881c008u)	/* CPU0 Data Protection Range 1, Lower Bound Register */
#define CPU0_DPR2_L	(*( CPU0_DPR0_L_type *) 0xf881c010u)	/* CPU0 Data Protection Range 2, Lower Bound Register */
#define CPU0_DPR3_L	(*( CPU0_DPR0_L_type *) 0xf881c018u)	/* CPU0 Data Protection Range 3, Lower Bound Register */
#define CPU0_DPR4_L	(*( CPU0_DPR0_L_type *) 0xf881c020u)	/* CPU0 Data Protection Range 4, Lower Bound Register */
#define CPU0_DPR5_L	(*( CPU0_DPR0_L_type *) 0xf881c028u)	/* CPU0 Data Protection Range 5, Lower Bound Register */
#define CPU0_DPR6_L	(*( CPU0_DPR0_L_type *) 0xf881c030u)	/* CPU0 Data Protection Range 6, Lower Bound Register */
#define CPU0_DPR7_L	(*( CPU0_DPR0_L_type *) 0xf881c038u)	/* CPU0 Data Protection Range 7, Lower Bound Register */
#define CPU0_DPR8_L	(*( CPU0_DPR0_L_type *) 0xf881c040u)	/* CPU0 Data Protection Range 8, Lower Bound Register */
#define CPU0_DPR9_L	(*( CPU0_DPR0_L_type *) 0xf881c048u)	/* CPU0 Data Protection Range 9, Lower Bound Register */
#define CPU1_DPR0_L	(*( CPU0_DPR0_L_type *) 0xf883c000u)	/* CPU1 Data Protection Range 0, Lower Bound Register */
#define CPU1_DPR10_L	(*( CPU0_DPR0_L_type *) 0xf883c050u)	/* CPU1 Data Protection Range 10, Lower Bound Register */
#define CPU1_DPR11_L	(*( CPU0_DPR0_L_type *) 0xf883c058u)	/* CPU1 Data Protection Range 11, Lower Bound Register */
#define CPU1_DPR12_L	(*( CPU0_DPR0_L_type *) 0xf883c060u)	/* CPU1 Data Protection Range 12, Lower Bound Register */
#define CPU1_DPR13_L	(*( CPU0_DPR0_L_type *) 0xf883c068u)	/* CPU1 Data Protection Range 13, Lower Bound Register */
#define CPU1_DPR14_L	(*( CPU0_DPR0_L_type *) 0xf883c070u)	/* CPU1 Data Protection Range 14, Lower Bound Register */
#define CPU1_DPR15_L	(*( CPU0_DPR0_L_type *) 0xf883c078u)	/* CPU1 Data Protection Range 15, Lower Bound Register */
#define CPU1_DPR1_L	(*( CPU0_DPR0_L_type *) 0xf883c008u)	/* CPU1 Data Protection Range 1, Lower Bound Register */
#define CPU1_DPR2_L	(*( CPU0_DPR0_L_type *) 0xf883c010u)	/* CPU1 Data Protection Range 2, Lower Bound Register */
#define CPU1_DPR3_L	(*( CPU0_DPR0_L_type *) 0xf883c018u)	/* CPU1 Data Protection Range 3, Lower Bound Register */
#define CPU1_DPR4_L	(*( CPU0_DPR0_L_type *) 0xf883c020u)	/* CPU1 Data Protection Range 4, Lower Bound Register */
#define CPU1_DPR5_L	(*( CPU0_DPR0_L_type *) 0xf883c028u)	/* CPU1 Data Protection Range 5, Lower Bound Register */
#define CPU1_DPR6_L	(*( CPU0_DPR0_L_type *) 0xf883c030u)	/* CPU1 Data Protection Range 6, Lower Bound Register */
#define CPU1_DPR7_L	(*( CPU0_DPR0_L_type *) 0xf883c038u)	/* CPU1 Data Protection Range 7, Lower Bound Register */
#define CPU1_DPR8_L	(*( CPU0_DPR0_L_type *) 0xf883c040u)	/* CPU1 Data Protection Range 8, Lower Bound Register */
#define CPU1_DPR9_L	(*( CPU0_DPR0_L_type *) 0xf883c048u)	/* CPU1 Data Protection Range 9, Lower Bound Register */
#define CPU2_DPR0_L	(*( CPU0_DPR0_L_type *) 0xf885c000u)	/* CPU2 Data Protection Range 0, Lower Bound Register */
#define CPU2_DPR10_L	(*( CPU0_DPR0_L_type *) 0xf885c050u)	/* CPU2 Data Protection Range 10, Lower Bound Register */
#define CPU2_DPR11_L	(*( CPU0_DPR0_L_type *) 0xf885c058u)	/* CPU2 Data Protection Range 11, Lower Bound Register */
#define CPU2_DPR12_L	(*( CPU0_DPR0_L_type *) 0xf885c060u)	/* CPU2 Data Protection Range 12, Lower Bound Register */
#define CPU2_DPR13_L	(*( CPU0_DPR0_L_type *) 0xf885c068u)	/* CPU2 Data Protection Range 13, Lower Bound Register */
#define CPU2_DPR14_L	(*( CPU0_DPR0_L_type *) 0xf885c070u)	/* CPU2 Data Protection Range 14, Lower Bound Register */
#define CPU2_DPR15_L	(*( CPU0_DPR0_L_type *) 0xf885c078u)	/* CPU2 Data Protection Range 15, Lower Bound Register */
#define CPU2_DPR1_L	(*( CPU0_DPR0_L_type *) 0xf885c008u)	/* CPU2 Data Protection Range 1, Lower Bound Register */
#define CPU2_DPR2_L	(*( CPU0_DPR0_L_type *) 0xf885c010u)	/* CPU2 Data Protection Range 2, Lower Bound Register */
#define CPU2_DPR3_L	(*( CPU0_DPR0_L_type *) 0xf885c018u)	/* CPU2 Data Protection Range 3, Lower Bound Register */
#define CPU2_DPR4_L	(*( CPU0_DPR0_L_type *) 0xf885c020u)	/* CPU2 Data Protection Range 4, Lower Bound Register */
#define CPU2_DPR5_L	(*( CPU0_DPR0_L_type *) 0xf885c028u)	/* CPU2 Data Protection Range 5, Lower Bound Register */
#define CPU2_DPR6_L	(*( CPU0_DPR0_L_type *) 0xf885c030u)	/* CPU2 Data Protection Range 6, Lower Bound Register */
#define CPU2_DPR7_L	(*( CPU0_DPR0_L_type *) 0xf885c038u)	/* CPU2 Data Protection Range 7, Lower Bound Register */
#define CPU2_DPR8_L	(*( CPU0_DPR0_L_type *) 0xf885c040u)	/* CPU2 Data Protection Range 8, Lower Bound Register */
#define CPU2_DPR9_L	(*( CPU0_DPR0_L_type *) 0xf885c048u)	/* CPU2 Data Protection Range 9, Lower Bound Register */

