svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int WE             : 16;	/* Write Enable Range Select */
		/* const */ unsigned int RES            : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_DPWE_0_type;
#define CPU0_DPWE_0	(*( CPU0_DPWE_0_type *) 0xf881e020u)	/* CPU0 Data Protection Write Enable Register Set 0 */
#define CPU0_DPWE_1	(*( CPU0_DPWE_0_type *) 0xf881e024u)	/* CPU0 Data Protection Write Enable Register Set 1 */
#define CPU0_DPWE_2	(*( CPU0_DPWE_0_type *) 0xf881e028u)	/* CPU0 Data Protection Write Enable Register Set 2 */
#define CPU0_DPWE_3	(*( CPU0_DPWE_0_type *) 0xf881e02cu)	/* CPU0 Data Protection Write Enable Register Set 3 */
#define CPU1_DPWE_0	(*( CPU0_DPWE_0_type *) 0xf883e020u)	/* CPU1 Data Protection Write Enable Register Set 0 */
#define CPU1_DPWE_1	(*( CPU0_DPWE_0_type *) 0xf883e024u)	/* CPU1 Data Protection Write Enable Register Set 1 */
#define CPU1_DPWE_2	(*( CPU0_DPWE_0_type *) 0xf883e028u)	/* CPU1 Data Protection Write Enable Register Set 2 */
#define CPU1_DPWE_3	(*( CPU0_DPWE_0_type *) 0xf883e02cu)	/* CPU1 Data Protection Write Enable Register Set 3 */
#define CPU2_DPWE_0	(*( CPU0_DPWE_0_type *) 0xf885e020u)	/* CPU2 Data Protection Write Enable Register Set 0 */
#define CPU2_DPWE_1	(*( CPU0_DPWE_0_type *) 0xf885e024u)	/* CPU2 Data Protection Write Enable Register Set 1 */
#define CPU2_DPWE_2	(*( CPU0_DPWE_0_type *) 0xf885e028u)	/* CPU2 Data Protection Write Enable Register Set 2 */
#define CPU2_DPWE_3	(*( CPU0_DPWE_0_type *) 0xf885e02cu)	/* CPU2 Data Protection Write Enable Register Set 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int SRE            : 1;	/* Scratch Range Error */
		unsigned int GAE            : 1;	/* Global Address Error */
		unsigned int LBE            : 1;	/* Load Bus Error */
		/* const */ unsigned int RES            : 3;	/* Reserved */
		unsigned int CRE            : 1;	/* Cache Refill Error */
		/* const */ unsigned int RES_6          : 7;	/* Reserved */
		unsigned int DTME           : 1;	/* DTAG MSIST Error */
		unsigned int LOE            : 1;	/* Load Overlay Error */
		unsigned int SDE            : 1;	/* Segment Difference Error */
		unsigned int SCE            : 1;	/* Segment Crossing Error */
		unsigned int CAC            : 1;	/* CSFR Access Error */
		unsigned int MPE            : 1;	/* Memory Protection Error */
		unsigned int CLE            : 1;	/* Context Location Error */
		/* const */ unsigned int RES_14         : 3;	/* Reserved */
		unsigned int ALN            : 1;	/* Alignment Error */
		/* const */ unsigned int RES_16         : 7;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_DSTR_type;
#define CPU0_DSTR	(*( CPU0_DSTR_type *) 0xf8819010u)	/* Data Synchronous Trap Register */
#define CPU1_DSTR	(*( CPU0_DSTR_type *) 0xf8839010u)	/* Data Synchronous Trap Register */
#define CPU2_DSTR	(*( CPU0_DSTR_type *) 0xf8859010u)	/* Data Synchronous Trap Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EVTA           : 3;	/* Event Associated */
		unsigned int BBM            : 1;	/* Break Before Make (BBM) or Break After Make (BAM) Selection */
		unsigned int BOD            : 1;	/* Breakout Disable */
		unsigned int SUSP           : 1;	/* CDC Suspend-Out Signal State */
		unsigned int CNT            : 2;	/* Counter */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_EXEVT_type;
#define CPU0_EXEVT	(*( CPU0_EXEVT_type *) 0xf881fd08u)	/* External Event Register */
#define CPU1_EXEVT	(*( CPU0_EXEVT_type *) 0xf883fd08u)	/* External Event Register */
#define CPU2_EXEVT	(*( CPU0_EXEVT_type *) 0xf885fd08u)	/* External Event Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FCXO           : 16;	/* FCX Offset Address Field */
		unsigned int FCXS           : 4;	/* FCX Segment Address Field */
		/* const */ unsigned int RES            : 12;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_FCX_type;
#define CPU0_FCX	(*( CPU0_FCX_type *) 0xf881fe38u)	/* Free CSA List Head Pointer */
#define CPU1_FCX	(*( CPU0_FCX_type *) 0xf883fe38u)	/* Free CSA List Head Pointer */
#define CPU2_FCX	(*( CPU0_FCX_type *) 0xf885fe38u)	/* Free CSA List Head Pointer */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TST            : 1;	/* Trap Status */
		unsigned int TCL            : 1;	/* Trap Clear */
		/* const */ unsigned int RES            : 6;	/* Reserved */
		/* const */ unsigned int RM             : 2;	/* Captured Rounding Mode */
		/* const */ unsigned int RES_5          : 8;	/* Reserved */
		unsigned int FXE            : 1;	/* FX Trap Enable */
		unsigned int FUE            : 1;	/* FU Trap Enable */
		unsigned int FZE            : 1;	/* FZ Trap Enable */
		unsigned int FVE            : 1;	/* FV Trap Enable */
		unsigned int FIE            : 1;	/* FI Trap Enable */
		/* const */ unsigned int RES_11         : 3;	/* Reserved */
		/* const */ unsigned int FX             : 1;	/* Captured FX */
		/* const */ unsigned int FU             : 1;	/* Captured FU */
		/* const */ unsigned int FZ             : 1;	/* Captured FZ */
		/* const */ unsigned int FV             : 1;	/* Captured FV */
		/* const */ unsigned int FI             : 1;	/* Captured FI */
		/* const */ unsigned int RES_17         : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_FPU_TRAP_CON_type;
#define CPU0_FPU_TRAP_CON	(*( CPU0_FPU_TRAP_CON_type *) 0xf881a000u)	/* CPU0 Trap Control Register */
#define CPU1_FPU_TRAP_CON	(*( CPU0_FPU_TRAP_CON_type *) 0xf883a000u)	/* CPU1 Trap Control Register */
#define CPU2_FPU_TRAP_CON	(*( CPU0_FPU_TRAP_CON_type *) 0xf885a000u)	/* CPU2 Trap Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OPC            : 8;	/* Captured Opcode */
		/* const */ unsigned int FMT            : 1;	/* Captured Instruction Format */
		/* const */ unsigned int RES            : 7;	/* Reserved */
		/* const */ unsigned int DREG           : 4;	/* Captured Destination Register */
		/* const */ unsigned int RES_5          : 12;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_FPU_TRAP_OPC_type;
#define CPU0_FPU_TRAP_OPC	(*( CPU0_FPU_TRAP_OPC_type *) 0xf881a008u)	/* CPU0 Trapping Instruction Opcode Register */
#define CPU1_FPU_TRAP_OPC	(*( CPU0_FPU_TRAP_OPC_type *) 0xf883a008u)	/* CPU1 Trapping Instruction Opcode Register */
#define CPU2_FPU_TRAP_OPC	(*( CPU0_FPU_TRAP_OPC_type *) 0xf885a008u)	/* CPU2 Trapping Instruction Opcode Register */

