svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int bPC            : 32;	/* Captured Program Counter */
	} B;
	int I;
	unsigned int U;

} CPU0_FPU_TRAP_PC_type;
#define CPU0_FPU_TRAP_PC	(*( CPU0_FPU_TRAP_PC_type *) 0xf881a004u)	/* CPU0 Trapping Instruction Program Counter Register */
#define CPU1_FPU_TRAP_PC	(*( CPU0_FPU_TRAP_PC_type *) 0xf883a004u)	/* CPU1 Trapping Instruction Program Counter Register */
#define CPU2_FPU_TRAP_PC	(*( CPU0_FPU_TRAP_PC_type *) 0xf885a004u)	/* CPU2 Trapping Instruction Program Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SRC1           : 32;	/* Captured SRC1 Operand */
	} B;
	int I;
	unsigned int U;

} CPU0_FPU_TRAP_SRC1_type;
#define CPU0_FPU_TRAP_SRC1	(*( CPU0_FPU_TRAP_SRC1_type *) 0xf881a010u)	/* CPU0 Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC1	(*( CPU0_FPU_TRAP_SRC1_type *) 0xf883a010u)	/* CPU1 Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC1	(*( CPU0_FPU_TRAP_SRC1_type *) 0xf885a010u)	/* CPU2 Trapping Instruction Operand Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SRC2           : 32;	/* Captured SRC2 Operand */
	} B;
	int I;
	unsigned int U;

} CPU0_FPU_TRAP_SRC2_type;
#define CPU0_FPU_TRAP_SRC2	(*( CPU0_FPU_TRAP_SRC2_type *) 0xf881a014u)	/* CPU0 Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC2	(*( CPU0_FPU_TRAP_SRC2_type *) 0xf883a014u)	/* CPU1 Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC2	(*( CPU0_FPU_TRAP_SRC2_type *) 0xf885a014u)	/* CPU2 Trapping Instruction Operand Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SRC3           : 32;	/* Captured SRC3 Operand */
	} B;
	int I;
	unsigned int U;

} CPU0_FPU_TRAP_SRC3_type;
#define CPU0_FPU_TRAP_SRC3	(*( CPU0_FPU_TRAP_SRC3_type *) 0xf881a018u)	/* Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC3	(*( CPU0_FPU_TRAP_SRC3_type *) 0xf883a018u)	/* Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC3	(*( CPU0_FPU_TRAP_SRC3_type *) 0xf885a018u)	/* Trapping Instruction Operand Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CCPN           : 10;	/* Current CPU Priority Number */
		/* const */ unsigned int RES            : 5;	/* Reserved */
		unsigned int IE             : 1;	/* Global Interrupt Enable Bit */
		/* const */ unsigned int PIPN           : 10;	/* Pending Interrupt Priority Number */
		/* const */ unsigned int RES_5          : 6;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_ICR_type;
#define CPU0_ICR	(*( CPU0_ICR_type *) 0xf881fe2cu)	/* Interrupt Control Register */
#define CPU1_ICR	(*( CPU0_ICR_type *) 0xf883fe2cu)	/* Interrupt Control Register */
#define CPU2_ICR	(*( CPU0_ICR_type *) 0xf885fe2cu)	/* Interrupt Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int bISP           : 32;	/* Interrupt Stack Pointer */
	} B;
	int I;
	unsigned int U;

} CPU0_ISP_type;
#define CPU0_ISP	(*( CPU0_ISP_type *) 0xf881fe28u)	/* Interrupt Stack Pointer */
#define CPU1_ISP	(*( CPU0_ISP_type *) 0xf883fe28u)	/* Interrupt Stack Pointer */
#define CPU2_ISP	(*( CPU0_ISP_type *) 0xf885fe28u)	/* Interrupt Stack Pointer */

typedef volatile union
{
	struct
	{ 
		unsigned int LCXO           : 16;	/* LCX Offset Field */
		unsigned int LCXS           : 4;	/* LCX Segment Address */
		/* const */ unsigned int RES            : 12;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_LCX_type;
#define CPU0_LCX	(*( CPU0_LCX_type *) 0xf881fe3cu)	/* Free CSA List Limit Pointer */
#define CPU1_LCX	(*( CPU0_LCX_type *) 0xf883fe3cu)	/* Free CSA List Limit Pointer */
#define CPU2_LCX	(*( CPU0_LCX_type *) 0xf885fe3cu)	/* Free CSA List Limit Pointer */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 1;	/* Reserved */
		/* const */ unsigned int bPC            : 31;	/* Program Counter */
	} B;
	int I;
	unsigned int U;

} CPU0_PC_type;
#define CPU0_PC	(*( CPU0_PC_type *) 0xf881fe08u)	/* Program Counter */
#define CPU1_PC	(*( CPU0_PC_type *) 0xf883fe08u)	/* Program Counter */
#define CPU2_PC	(*( CPU0_PC_type *) 0xf885fe08u)	/* Program Counter */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 1;	/* Reserved */
		unsigned int PCBYP          : 1;	/* Program Cache Bypass */
		/* const */ unsigned int RES_3          : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PCON0_type;
#define CPU0_PCON0	(*( CPU0_PCON0_type *) 0xf881920cu)	/* Program Control 0 */
#define CPU1_PCON0	(*( CPU0_PCON0_type *) 0xf883920cu)	/* Program Control 0 */
#define CPU2_PCON0	(*( CPU0_PCON0_type *) 0xf885920cu)	/* Program Control 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCINV          : 1;	/* Program Cache Invalidate */
		unsigned int PBINV          : 1;	/* Program Buffer Invalidate */
		/* const */ unsigned int RES            : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PCON1_type;
#define CPU0_PCON1	(*( CPU0_PCON1_type *) 0xf8819204u)	/* Program Control 1 */
#define CPU1_PCON1	(*( CPU0_PCON1_type *) 0xf8839204u)	/* Program Control 1 */
#define CPU2_PCON1	(*( CPU0_PCON1_type *) 0xf8859204u)	/* Program Control 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PCACHE_SZE     : 16;	/* Program Cache Size (ICACHE) in KBytes */
		/* const */ unsigned int PSCRATCH_SZE   : 16;	/* Program Scratch Size in KBytes */
	} B;
	int I;
	unsigned int U;

} CPU0_PCON2_type;
#define CPU0_PCON2	(*( CPU0_PCON2_type *) 0xf8819208u)	/* Program Control 2 */
#define CPU1_PCON2	(*( CPU0_PCON2_type *) 0xf8839208u)	/* Program Control 2 */
#define CPU2_PCON2	(*( CPU0_PCON2_type *) 0xf8859208u)	/* Program Control 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int PCXO           : 16;	/* Previous Context Pointer Offset Field */
		unsigned int PCXS           : 4;	/* Previous Context Pointer Segment Address */
		unsigned int UL             : 1;	/* Upper or Lower Context Tag */
		unsigned int PIE            : 1;	/* Previous Interrupt Enable */
		unsigned int PCPN           : 10;	/* Previous CPU Priority Number */
	} B;
	int I;
	unsigned int U;

} CPU0_PCXI_type;
#define CPU0_PCXI	(*( CPU0_PCXI_type *) 0xf881fe00u)	/* Previous Context Information Register */
#define CPU1_PCXI	(*( CPU0_PCXI_type *) 0xf883fe00u)	/* Previous Context Information Register */
#define CPU2_PCXI	(*( CPU0_PCXI_type *) 0xf885fe00u)	/* Previous Context Information Register */

