svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int IED            : 1;	/* Integrity Error Detected */
		/* const */ unsigned int IE_T           : 1;	/* Integrity Error - Tag Memory */
		/* const */ unsigned int IE_C           : 1;	/* Integrity Error - Cache Memory */
		/* const */ unsigned int IE_S           : 1;	/* Integrity Error - Scratchpad Memory */
		/* const */ unsigned int IE_BI          : 1;	/* Integrity Error - Bus Interface */
		/* const */ unsigned int E_INFO         : 6;	/* Error Information */
		/* const */ unsigned int IE_DUAL        : 1;	/* Integrity Error - Dual Error Detected */
		/* const */ unsigned int IE_SP          : 1;	/* Safety Protection Error Detected */
		/* const */ unsigned int IE_BS          : 1;	/* Bus Slave Access Indicator */
		/* const */ unsigned int RES            : 18;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PIETR_type;
#define CPU0_PIETR	(*( CPU0_PIETR_type *) 0xf8819214u)	/* Program Integrity Error Trap Register */
#define CPU1_PIETR	(*( CPU0_PIETR_type *) 0xf8839214u)	/* Program Integrity Error Trap Register */
#define CPU2_PIETR	(*( CPU0_PIETR_type *) 0xf8859214u)	/* Program Integrity Error Trap Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DAC_0          : 10;	/* Data Access Cacheability Segments 9H-0H */
		/* const */ unsigned int DAC_A          : 1;	/* Data Access Cacheability Segments AH */
		unsigned int DAC_B          : 2;	/* Data Access Cacheability Segments CH,BH */
		/* const */ unsigned int DAC_D          : 3;	/* Data Access Cacheability Segments FH,EH,DH */
		/* const */ unsigned int RES            : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PMA0_type;
#define CPU0_PMA0	(*( CPU0_PMA0_type *) 0xf8818100u)	/* Data Access CacheabilityRegister */
#define CPU1_PMA0	(*( CPU0_PMA0_type *) 0xf8838100u)	/* Data Access CacheabilityRegister */
#define CPU2_PMA0	(*( CPU0_PMA0_type *) 0xf8858100u)	/* Data Access CacheabilityRegister */

typedef volatile union
{
	struct
	{ 
		unsigned int CAC_0          : 10;	/* Code Access Cacheability Segments 9H-0H */
		/* const */ unsigned int CAC_A          : 1;	/* Code Access Cacheability Segments AH */
		unsigned int CAC_B          : 1;	/* Code Access Cacheability Segments BH */
		/* const */ unsigned int CAC_C          : 1;	/* Code Access Cacheability Segments CH */
		unsigned int CAC_D          : 1;	/* Code Access Cacheability Segments DH */
		/* const */ unsigned int CAC_E          : 2;	/* Code Access Cacheability Segments FH,EH */
		/* const */ unsigned int RES            : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PMA1_type;
#define CPU0_PMA1	(*( CPU0_PMA1_type *) 0xf8818104u)	/* Code Access CacheabilityRegister */
#define CPU1_PMA1	(*( CPU0_PMA1_type *) 0xf8838104u)	/* Code Access CacheabilityRegister */
#define CPU2_PMA1	(*( CPU0_PMA1_type *) 0xf8858104u)	/* Code Access CacheabilityRegister */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PSI            : 16;	/* Peripheral Space Identifier Segments FH-0H */
		/* const */ unsigned int RES            : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PMA2_type;
#define CPU0_PMA2	(*( CPU0_PMA2_type *) 0xf8818108u)	/* Peripheral Space Identifier register */
#define CPU1_PMA2	(*( CPU0_PMA2_type *) 0xf8838108u)	/* Peripheral Space Identifier register */
#define CPU2_PMA2	(*( CPU0_PMA2_type *) 0xf8858108u)	/* Peripheral Space Identifier register */

typedef volatile union
{
	struct
	{ 
		unsigned int FRE            : 1;	/* Fetch Range Error */
		unsigned int FGAE           : 1;	/* Fetch Global Address Error */
		unsigned int FBE            : 1;	/* Fetch Bus Error */
		/* const */ unsigned int RES            : 9;	/* Reserved */
		unsigned int FPE            : 1;	/* Fetch Peripheral Error */
		/* const */ unsigned int RES_6          : 1;	/* Reserved */
		unsigned int FME            : 1;	/* Fetch MSIST Error */
		/* const */ unsigned int RES_8          : 17;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_PSTR_type;
#define CPU0_PSTR	(*( CPU0_PSTR_type *) 0xf8819200u)	/* Program Synchronous Trap Register */
#define CPU1_PSTR	(*( CPU0_PSTR_type *) 0xf8839200u)	/* Program Synchronous Trap Register */
#define CPU2_PSTR	(*( CPU0_PSTR_type *) 0xf8859200u)	/* Program Synchronous Trap Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CDC            : 7;	/* Call Depth Counter */
		unsigned int CDE            : 1;	/* Call Depth Count Enable */
		unsigned int GW             : 1;	/* Global Address Register Write Permission */
		unsigned int IS             : 1;	/* Interrupt Stack Control */
		unsigned int IO             : 2;	/* Access Privilege Level Control (I/O Privilege) */
		unsigned int PRS            : 2;	/* Protection Register Set */
		unsigned int S              : 1;	/* Safe Task Identifier */
		/* const */ unsigned int RES            : 12;	/* Reserved */
		unsigned int SAV            : 1;	/* Sticky Advance Overflow Flag */
		unsigned int AV             : 1;	/* Advance Overflow Flag */
		unsigned int SV             : 1;	/* Sticky Overflow Flag */
		unsigned int V              : 1;	/* Overflow Flag */
		unsigned int C              : 1;	/* Carry Flag */
	} B;
	int I;
	unsigned int U;

} CPU0_PSW_type;
#define CPU0_PSW	(*( CPU0_PSW_type *) 0xf881fe04u)	/* Program Status Word */
#define CPU1_PSW	(*( CPU0_PSW_type *) 0xf883fe04u)	/* Program Status Word */
#define CPU2_PSW	(*( CPU0_PSW_type *) 0xf885fe04u)	/* Program Status Word */

typedef volatile union
{
	struct
	{ 
		unsigned int ADFLIP         : 8;	/* Address ECC Bit Flip */
		unsigned int ADTYPE         : 2;	/* Type of error */
		/* const */ unsigned int RES            : 21;	/* Reserved */
		unsigned int AE             : 1;	/* Activate Error Enable */
	} B;
	int I;
	unsigned int U;

} CPU0_SEGEN_type;
#define CPU0_SEGEN	(*( CPU0_SEGEN_type *) 0xf8811030u)	/* SRI Error Generation Register */

