svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int bPC            : 1;	/* Instruction Cache Memory SIST Mode Access Control */
		/* const */ unsigned int RES            : 1;	/* Reserved */
		unsigned int PT             : 1;	/* Program Tag Memory SIST Mode Access Control */
		/* const */ unsigned int RES_4          : 5;	/* Reserved */
		unsigned int DC             : 1;	/* Data Cache Memory SIST Mode Access Control */
		/* const */ unsigned int RES_6          : 1;	/* Reserved */
		unsigned int DT             : 1;	/* Data Tag Memory SIST Mode Access Control */
		/* const */ unsigned int RES_8          : 5;	/* Reserved */
		/* const */ unsigned int RES_9          : 8;	/* Reserved */
		unsigned int IODT           : 1;	/* In-Order Data Transactions */
		/* const */ unsigned int RES_11         : 7;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_SMACON_type;
#define CPU0_SMACON	(*( CPU0_SMACON_type *) 0xf881900cu)	/* SIST Mode Access Control Register */
#define CPU1_SMACON	(*( CPU0_SMACON_type *) 0xf883900cu)	/* SIST Mode Access Control Register */
#define CPU2_SMACON	(*( CPU0_SMACON_type *) 0xf885900cu)	/* SIST Mode Access Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EVTA           : 3;	/* Event Associated */
		unsigned int BBM            : 1;	/* Break Before Make (BBM) or Break After Make (BAM) Selection */
		unsigned int BOD            : 1;	/* Breakout Disable */
		unsigned int SUSP           : 1;	/* CDC Suspend-Out Signal State */
		unsigned int CNT            : 2;	/* Counter */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_SWEVT_type;
#define CPU0_SWEVT	(*( CPU0_SWEVT_type *) 0xf881fd10u)	/* Software Debug Event */
#define CPU1_SWEVT	(*( CPU0_SWEVT_type *) 0xf883fd10u)	/* Software Debug Event */
#define CPU2_SWEVT	(*( CPU0_SWEVT_type *) 0xf885fd10u)	/* Software Debug Event */

typedef volatile union
{
	struct
	{ 
		unsigned int FCDSF          : 1;	/* Free Context List Depleted Sticky Flag */
		unsigned int PROTEN         : 1;	/* Memory Protection Enable */
		unsigned int TPROTEN        : 1;	/* Temporal Protection Enable */
		unsigned int IS             : 1;	/* Initial State */
		unsigned int IT             : 1;	/* Initial State */
		/* const */ unsigned int RES            : 27;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_SYSCON_type;
#define CPU0_SYSCON	(*( CPU0_SYSCON_type *) 0xf881fe14u)	/* System Configuration Register */
#define CPU1_SYSCON	(*( CPU0_SYSCON_type *) 0xf883fe14u)	/* System Configuration Register */
#define CPU2_SYSCON	(*( CPU0_SYSCON_type *) 0xf885fe14u)	/* System Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ASI            : 5;	/* Address Space Identifier */
		/* const */ unsigned int RES            : 27;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_TASK_ASI_type;
#define CPU0_TASK_ASI	(*( CPU0_TASK_ASI_type *) 0xf8818004u)	/* CPU0 Task Address Space Identifier Register */
#define CPU1_TASK_ASI	(*( CPU0_TASK_ASI_type *) 0xf8838004u)	/* CPU1 Task Address Space Identifier Register */
#define CPU2_TASK_ASI	(*( CPU0_TASK_ASI_type *) 0xf8858004u)	/* CPU2 Task Address Space Identifier Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TEXP0          : 1;	/* Timer0 Expired Flag */
		/* const */ unsigned int TEXP1          : 1;	/* Timer1 Expired Flag */
		/* const */ unsigned int TEXP2          : 1;	/* Timer1 Expired Flag */
		/* const */ unsigned int RES            : 13;	/* Reserved */
		/* const */ unsigned int TTRAP          : 1;	/* Temporal Protection Trap */
		/* const */ unsigned int RES_6          : 15;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_TPS_CON_type;
#define CPU0_TPS_CON	(*( CPU0_TPS_CON_type *) 0xf881e400u)	/* CPU0 Temporal Protection System Control Register */
#define CPU1_TPS_CON	(*( CPU0_TPS_CON_type *) 0xf883e400u)	/* CPU1 Temporal Protection System Control Register */
#define CPU2_TPS_CON	(*( CPU0_TPS_CON_type *) 0xf885e400u)	/* CPU2 Temporal Protection System Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int Timer          : 32;	/* Temporal Protection Timer */
	} B;
	int I;
	unsigned int U;

} CPU0_TPS_TIMER0_type;
#define CPU0_TPS_TIMER0	(*( CPU0_TPS_TIMER0_type *) 0xf881e404u)	/* CPU0 Temporal Protection System Timer Register 0 */
#define CPU0_TPS_TIMER1	(*( CPU0_TPS_TIMER0_type *) 0xf881e408u)	/* CPU0 Temporal Protection System Timer Register 0 */
#define CPU0_TPS_TIMER2	(*( CPU0_TPS_TIMER0_type *) 0xf881e40cu)	/* CPU0 Temporal Protection System Timer Register 0 */
#define CPU1_TPS_TIMER0	(*( CPU0_TPS_TIMER0_type *) 0xf883e404u)	/* CPU1 Temporal Protection System Timer Register 1 */
#define CPU1_TPS_TIMER1	(*( CPU0_TPS_TIMER0_type *) 0xf883e408u)	/* CPU1 Temporal Protection System Timer Register 1 */
#define CPU1_TPS_TIMER2	(*( CPU0_TPS_TIMER0_type *) 0xf883e40cu)	/* CPU1 Temporal Protection System Timer Register 1 */
#define CPU2_TPS_TIMER0	(*( CPU0_TPS_TIMER0_type *) 0xf885e404u)	/* CPU2 Temporal Protection System Timer Register 2 */
#define CPU2_TPS_TIMER1	(*( CPU0_TPS_TIMER0_type *) 0xf885e408u)	/* CPU2 Temporal Protection System Timer Register 2 */
#define CPU2_TPS_TIMER2	(*( CPU0_TPS_TIMER0_type *) 0xf885e40cu)	/* CPU2 Temporal Protection System Timer Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 32;	/* Comparison Address */
	} B;
	int I;
	unsigned int U;

} CPU0_TR0ADR_type;
#define CPU0_TR0ADR	(*( CPU0_TR0ADR_type *) 0xf881f004u)	/* Trigger Address 0 */
#define CPU0_TR1ADR	(*( CPU0_TR0ADR_type *) 0xf881f00cu)	/* Trigger Address 1 */
#define CPU0_TR2ADR	(*( CPU0_TR0ADR_type *) 0xf881f014u)	/* Trigger Address 2 */
#define CPU0_TR3ADR	(*( CPU0_TR0ADR_type *) 0xf881f01cu)	/* Trigger Address 3 */
#define CPU0_TR4ADR	(*( CPU0_TR0ADR_type *) 0xf881f024u)	/* Trigger Address 4 */
#define CPU0_TR5ADR	(*( CPU0_TR0ADR_type *) 0xf881f02cu)	/* Trigger Address 5 */
#define CPU0_TR6ADR	(*( CPU0_TR0ADR_type *) 0xf881f034u)	/* Trigger Address 6 */
#define CPU0_TR7ADR	(*( CPU0_TR0ADR_type *) 0xf881f03cu)	/* Trigger Address 7 */
#define CPU1_TR0ADR	(*( CPU0_TR0ADR_type *) 0xf883f004u)	/* Trigger Address 0 */
#define CPU1_TR1ADR	(*( CPU0_TR0ADR_type *) 0xf883f00cu)	/* Trigger Address 1 */
#define CPU1_TR2ADR	(*( CPU0_TR0ADR_type *) 0xf883f014u)	/* Trigger Address 2 */
#define CPU1_TR3ADR	(*( CPU0_TR0ADR_type *) 0xf883f01cu)	/* Trigger Address 3 */
#define CPU1_TR4ADR	(*( CPU0_TR0ADR_type *) 0xf883f024u)	/* Trigger Address 4 */
#define CPU1_TR5ADR	(*( CPU0_TR0ADR_type *) 0xf883f02cu)	/* Trigger Address 5 */
#define CPU1_TR6ADR	(*( CPU0_TR0ADR_type *) 0xf883f034u)	/* Trigger Address 6 */
#define CPU1_TR7ADR	(*( CPU0_TR0ADR_type *) 0xf883f03cu)	/* Trigger Address 7 */
#define CPU2_TR0ADR	(*( CPU0_TR0ADR_type *) 0xf885f004u)	/* Trigger Address 0 */
#define CPU2_TR1ADR	(*( CPU0_TR0ADR_type *) 0xf885f00cu)	/* Trigger Address 1 */
#define CPU2_TR2ADR	(*( CPU0_TR0ADR_type *) 0xf885f014u)	/* Trigger Address 2 */
#define CPU2_TR3ADR	(*( CPU0_TR0ADR_type *) 0xf885f01cu)	/* Trigger Address 3 */
#define CPU2_TR4ADR	(*( CPU0_TR0ADR_type *) 0xf885f024u)	/* Trigger Address 4 */
#define CPU2_TR5ADR	(*( CPU0_TR0ADR_type *) 0xf885f02cu)	/* Trigger Address 5 */
#define CPU2_TR6ADR	(*( CPU0_TR0ADR_type *) 0xf885f034u)	/* Trigger Address 6 */
#define CPU2_TR7ADR	(*( CPU0_TR0ADR_type *) 0xf885f03cu)	/* Trigger Address 7 */

