svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EVTA           : 3;	/* Event Associated */
		unsigned int BBM            : 1;	/* Break Before Make (BBM) or Break After Make (BAM) Selection */
		unsigned int BOD            : 1;	/* Breakout Disable */
		unsigned int SUSP           : 1;	/* CDC Suspend-Out Signal State */
		unsigned int CNT            : 2;	/* Counter */
		/* const */ unsigned int RES            : 4;	/* Reserved */
		unsigned int TYP            : 1;	/* Input Selection */
		unsigned int RNG            : 1;	/* Compare Type */
		/* const */ unsigned int RES_9          : 1;	/* Reserved */
		unsigned int ASI_EN         : 1;	/* Enable ASI Comparison */
		unsigned int ASI            : 5;	/* Address Space Identifier */
		/* const */ unsigned int RES_12         : 6;	/* Reserved */
		unsigned int AST            : 1;	/* Address Store */
		unsigned int ALD            : 1;	/* Address Load */
		/* const */ unsigned int RES_15         : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_TR0EVT_type;
#define CPU0_TR0EVT	(*( CPU0_TR0EVT_type *) 0xf881f000u)	/* Trigger Event 0 */
#define CPU0_TR1EVT	(*( CPU0_TR0EVT_type *) 0xf881f008u)	/* Trigger Event 1 */
#define CPU0_TR2EVT	(*( CPU0_TR0EVT_type *) 0xf881f010u)	/* Trigger Event 2 */
#define CPU0_TR3EVT	(*( CPU0_TR0EVT_type *) 0xf881f018u)	/* Trigger Event 3 */
#define CPU0_TR4EVT	(*( CPU0_TR0EVT_type *) 0xf881f020u)	/* Trigger Event 4 */
#define CPU0_TR5EVT	(*( CPU0_TR0EVT_type *) 0xf881f028u)	/* Trigger Event 5 */
#define CPU0_TR6EVT	(*( CPU0_TR0EVT_type *) 0xf881f030u)	/* Trigger Event 6 */
#define CPU0_TR7EVT	(*( CPU0_TR0EVT_type *) 0xf881f038u)	/* Trigger Event 7 */
#define CPU1_TR0EVT	(*( CPU0_TR0EVT_type *) 0xf883f000u)	/* Trigger Event 0 */
#define CPU1_TR1EVT	(*( CPU0_TR0EVT_type *) 0xf883f008u)	/* Trigger Event 1 */
#define CPU1_TR2EVT	(*( CPU0_TR0EVT_type *) 0xf883f010u)	/* Trigger Event 2 */
#define CPU1_TR3EVT	(*( CPU0_TR0EVT_type *) 0xf883f018u)	/* Trigger Event 3 */
#define CPU1_TR4EVT	(*( CPU0_TR0EVT_type *) 0xf883f020u)	/* Trigger Event 4 */
#define CPU1_TR5EVT	(*( CPU0_TR0EVT_type *) 0xf883f028u)	/* Trigger Event 5 */
#define CPU1_TR6EVT	(*( CPU0_TR0EVT_type *) 0xf883f030u)	/* Trigger Event 6 */
#define CPU1_TR7EVT	(*( CPU0_TR0EVT_type *) 0xf883f038u)	/* Trigger Event 7 */
#define CPU2_TR0EVT	(*( CPU0_TR0EVT_type *) 0xf885f000u)	/* Trigger Event 0 */
#define CPU2_TR1EVT	(*( CPU0_TR0EVT_type *) 0xf885f008u)	/* Trigger Event 1 */
#define CPU2_TR2EVT	(*( CPU0_TR0EVT_type *) 0xf885f010u)	/* Trigger Event 2 */
#define CPU2_TR3EVT	(*( CPU0_TR0EVT_type *) 0xf885f018u)	/* Trigger Event 3 */
#define CPU2_TR4EVT	(*( CPU0_TR0EVT_type *) 0xf885f020u)	/* Trigger Event 4 */
#define CPU2_TR5EVT	(*( CPU0_TR0EVT_type *) 0xf885f028u)	/* Trigger Event 5 */
#define CPU2_TR6EVT	(*( CPU0_TR0EVT_type *) 0xf885f030u)	/* Trigger Event 6 */
#define CPU2_TR7EVT	(*( CPU0_TR0EVT_type *) 0xf885f038u)	/* Trigger Event 7 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int T0             : 1;	/* Trigger-0 */
		/* const */ unsigned int T1             : 1;	/* Trigger-1 */
		/* const */ unsigned int T2             : 1;	/* Trigger-2 */
		/* const */ unsigned int T3             : 1;	/* Trigger-3 */
		/* const */ unsigned int T4             : 1;	/* Trigger-4 */
		/* const */ unsigned int T5             : 1;	/* Trigger-5 */
		/* const */ unsigned int T6             : 1;	/* Trigger-6 */
		/* const */ unsigned int T7             : 1;	/* Trigger-7 */
		/* const */ unsigned int RES            : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_TRIG_ACC_type;
#define CPU0_TRIG_ACC	(*( CPU0_TRIG_ACC_type *) 0xf881fd30u)	/* CPU0 Trigger Address x */
#define CPU1_TRIG_ACC	(*( CPU0_TRIG_ACC_type *) 0xf883fd30u)	/* CPU1 Trigger Address x */
#define CPU2_TRIG_ACC	(*( CPU0_TRIG_ACC_type *) 0xf885fd30u)	/* CPU2 Trigger Address x */


/* CPU_SPROT */
typedef volatile union
{
	struct
	{ 
		unsigned int EN             : 32;	/* Access Enable for Master TAG ID n (n= 0-31) */
	} B;
	int I;
	unsigned int U;

} CPU0_SPROT_ACCENA_type;
#define CPU0_SPROT_ACCENA	(*( CPU0_SPROT_ACCENA_type *) 0xf880e100u)	/* CPU0 Safety Protection Register Access Enable Register A */
#define CPU1_SPROT_ACCENA	(*( CPU0_SPROT_ACCENA_type *) 0xf882e100u)	/* CPU1 Safety Protection Register Access Enable Register A */
#define CPU2_SPROT_ACCENA	(*( CPU0_SPROT_ACCENA_type *) 0xf884e100u)	/* CPU2 Safety Protection Register Access Enable Register A */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} CPU0_SPROT_ACCENB_type;
#define CPU0_SPROT_ACCENB	(*( CPU0_SPROT_ACCENB_type *) 0xf880e104u)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB0	(*( CPU0_SPROT_ACCENB_type *) 0xf880e00cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB1	(*( CPU0_SPROT_ACCENB_type *) 0xf880e01cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB2	(*( CPU0_SPROT_ACCENB_type *) 0xf880e02cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB3	(*( CPU0_SPROT_ACCENB_type *) 0xf880e03cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB4	(*( CPU0_SPROT_ACCENB_type *) 0xf880e04cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB5	(*( CPU0_SPROT_ACCENB_type *) 0xf880e05cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB6	(*( CPU0_SPROT_ACCENB_type *) 0xf880e06cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGNACCENB7	(*( CPU0_SPROT_ACCENB_type *) 0xf880e07cu)	/* CPU0 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_ACCENB	(*( CPU0_SPROT_ACCENB_type *) 0xf882e104u)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB0	(*( CPU0_SPROT_ACCENB_type *) 0xf882e00cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB1	(*( CPU0_SPROT_ACCENB_type *) 0xf882e01cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB2	(*( CPU0_SPROT_ACCENB_type *) 0xf882e02cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB3	(*( CPU0_SPROT_ACCENB_type *) 0xf882e03cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB4	(*( CPU0_SPROT_ACCENB_type *) 0xf882e04cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB5	(*( CPU0_SPROT_ACCENB_type *) 0xf882e05cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB6	(*( CPU0_SPROT_ACCENB_type *) 0xf882e06cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGNACCENB7	(*( CPU0_SPROT_ACCENB_type *) 0xf882e07cu)	/* CPU1 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_ACCENB	(*( CPU0_SPROT_ACCENB_type *) 0xf884e104u)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB0	(*( CPU0_SPROT_ACCENB_type *) 0xf884e00cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB1	(*( CPU0_SPROT_ACCENB_type *) 0xf884e01cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB2	(*( CPU0_SPROT_ACCENB_type *) 0xf884e02cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB3	(*( CPU0_SPROT_ACCENB_type *) 0xf884e03cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB4	(*( CPU0_SPROT_ACCENB_type *) 0xf884e04cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB5	(*( CPU0_SPROT_ACCENB_type *) 0xf884e05cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB6	(*( CPU0_SPROT_ACCENB_type *) 0xf884e06cu)	/* CPU2 Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGNACCENB7	(*( CPU0_SPROT_ACCENB_type *) 0xf884e07cu)	/* CPU2 Safety Protection Region Access Enable Register B */

