svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EN             : 32;	/* Access Enable for Master TAG ID n (n = 0-31) */
	} B;
	int I;
	unsigned int U;

} CPU0_SPROT_RGNACCENA0_type;
#define CPU0_SPROT_RGNACCENA0	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e008u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA1	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e018u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA2	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e028u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA3	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e038u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA4	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e048u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA5	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e058u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA6	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e068u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGNACCENA7	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf880e078u)	/* CPU0 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA0	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e008u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA1	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e018u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA2	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e028u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA3	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e038u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA4	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e048u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA5	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e058u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA6	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e068u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGNACCENA7	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf882e078u)	/* CPU1 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA0	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e008u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA1	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e018u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA2	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e028u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA3	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e038u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA4	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e048u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA5	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e058u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA6	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e068u)	/* CPU2 Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGNACCENA7	(*( CPU0_SPROT_RGNACCENA0_type *) 0xf884e078u)	/* CPU2 Safety Protection Region Access Enable Register A */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 5;	/* Reserved */
		unsigned int ADDR           : 27;	/* Region Lower Address */
	} B;
	int I;
	unsigned int U;

} CPU0_SPROT_RGNLA0_type;
#define CPU0_SPROT_RGNLA0	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e000u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA1	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e010u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA2	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e020u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA3	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e030u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA4	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e040u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA5	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e050u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA6	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e060u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGNLA7	(*( CPU0_SPROT_RGNLA0_type *) 0xf880e070u)	/* CPU0 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA0	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e000u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA1	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e010u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA2	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e020u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA3	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e030u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA4	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e040u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA5	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e050u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA6	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e060u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGNLA7	(*( CPU0_SPROT_RGNLA0_type *) 0xf882e070u)	/* CPU1 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA0	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e000u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA1	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e010u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA2	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e020u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA3	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e030u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA4	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e040u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA5	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e050u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA6	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e060u)	/* CPU2 Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGNLA7	(*( CPU0_SPROT_RGNLA0_type *) 0xf884e070u)	/* CPU2 Safety Protection Region Lower Address Register */

