svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 5;	/* Reserved */
		unsigned int ADDR           : 27;	/* Region Upper Address */
	} B;
	int I;
	unsigned int U;

} CPU0_SPROT_RGNUA0_type;
#define CPU0_SPROT_RGNUA0	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e004u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA1	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e014u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA2	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e024u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA3	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e034u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA4	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e044u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA5	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e054u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA6	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e064u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGNUA7	(*( CPU0_SPROT_RGNUA0_type *) 0xf880e074u)	/* CPU0 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA0	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e004u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA1	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e014u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA2	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e024u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA3	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e034u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA4	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e044u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA5	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e054u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA6	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e064u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGNUA7	(*( CPU0_SPROT_RGNUA0_type *) 0xf882e074u)	/* CPU1 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA0	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e004u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA1	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e014u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA2	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e024u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA3	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e034u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA4	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e044u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA5	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e054u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA6	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e064u)	/* CPU2 Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGNUA7	(*( CPU0_SPROT_RGNUA0_type *) 0xf884e074u)	/* CPU2 Safety protection Region Upper Address Register */


/* SMU */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} SMU_ACCEN0_type;
#define SMU_ACCEN0	(*( SMU_ACCEN0_type *) 0xf0036ffcu)	/* SMU Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SMU_ACCEN1_type;
