svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SMU_ACCEN1	(*( SMU_ACCEN1_type *) 0xf0036ff8u)	/* SMU Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DF0            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF1            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF2            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF3            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF4            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF5            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF6            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF7            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF8            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF9            : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF10           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF11           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF12           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF13           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF14           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF15           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF16           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF17           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF18           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF19           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF20           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF21           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF22           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF23           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF24           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF25           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF26           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF27           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF28           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF29           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF30           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
		/* const */ unsigned int DF31           : 1;	/* Debug flag for alarm n belonging to alarm group x (x=0-6). */
	} B;
	int I;
	unsigned int U;

} SMU_AD0_type;
#define SMU_AD0	(*( SMU_AD0_type *) 0xf0036a00u)	/* Alarm Status Register */
#define SMU_AD1	(*( SMU_AD0_type *) 0xf0036a04u)	/* Alarm Status Register */
#define SMU_AD2	(*( SMU_AD0_type *) 0xf0036a08u)	/* Alarm Status Register */
#define SMU_AD3	(*( SMU_AD0_type *) 0xf0036a0cu)	/* Alarm Status Register */
#define SMU_AD4	(*( SMU_AD0_type *) 0xf0036a10u)	/* Alarm Status Register */
#define SMU_AD5	(*( SMU_AD0_type *) 0xf0036a14u)	/* Alarm Status Register */
#define SMU_AD6	(*( SMU_AD0_type *) 0xf0036a18u)	/* Alarm Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SF0            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF1            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF2            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF3            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF4            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF5            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF6            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF7            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF8            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF9            : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF10           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF11           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF12           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF13           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF14           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF15           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF16           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF17           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF18           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF19           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF20           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF21           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF22           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF23           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF24           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF25           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF26           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF27           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF28           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF29           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF30           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
		unsigned int SF31           : 1;	/* Status flag for alarm n belonging to alarm group x (x=0-6). */
	} B;
	int I;
	unsigned int U;

} SMU_AG0_type;
#define SMU_AG0	(*( SMU_AG0_type *) 0xf00369c0u)	/* Alarm Status Register */
#define SMU_AG1	(*( SMU_AG0_type *) 0xf00369c4u)	/* Alarm Status Register */
#define SMU_AG2	(*( SMU_AG0_type *) 0xf00369c8u)	/* Alarm Status Register */
#define SMU_AG3	(*( SMU_AG0_type *) 0xf00369ccu)	/* Alarm Status Register */
#define SMU_AG4	(*( SMU_AG0_type *) 0xf00369d0u)	/* Alarm Status Register */
#define SMU_AG5	(*( SMU_AG0_type *) 0xf00369d4u)	/* Alarm Status Register */
#define SMU_AG6	(*( SMU_AG0_type *) 0xf00369d8u)	/* Alarm Status Register */

