svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CF0            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF1            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF2            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF3            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF4            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF5            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF6            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF7            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF8            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF9            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF10           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF11           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF12           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF13           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF14           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF15           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF16           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF17           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF18           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF19           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF20           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF21           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF22           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF23           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF24           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF25           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF26           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF27           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF28           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF29           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF30           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
		unsigned int CF31           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 0. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 0. */
	} B;
	int I;
	unsigned int U;

} SMU_AG0CF0_type;
#define SMU_AG0CF0	(*( SMU_AG0CF0_type *) 0xf0036900u)	/* Alarm Configuration Register */
#define SMU_AG0CF1	(*( SMU_AG0CF0_type *) 0xf0036904u)	/* Alarm Configuration Register */
#define SMU_AG0CF2	(*( SMU_AG0CF0_type *) 0xf0036908u)	/* Alarm Configuration Register */

