svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int FE0            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE1            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE2            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE3            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE4            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE5            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE6            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE7            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE8            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE9            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE10           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE11           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE12           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE13           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE14           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE15           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE16           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE17           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE18           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE19           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE20           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE21           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE22           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE23           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE24           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE25           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE26           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE27           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE28           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE29           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE30           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
		unsigned int FE31           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 5. */
	} B;
	int I;
	unsigned int U;

} SMU_AG5FSP_type;
#define SMU_AG5FSP	(*( SMU_AG5FSP_type *) 0xf0036994u)	/* FSP Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CF0            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF1            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF2            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF3            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF4            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF5            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF6            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF7            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF8            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF9            : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF10           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF11           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF12           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF13           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF14           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF15           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF16           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF17           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF18           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF19           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF20           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF21           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF22           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF23           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF24           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF25           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF26           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF27           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF28           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF29           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF30           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
		unsigned int CF31           : 1;	/* Configuration flag x (x=0-2) for alarm n belonging to alarm group 6. The configuration flags 0, 1 and 2 must be used together to define the behavior of the SMU when a fault state is reported by the alarm n belonging to group 6. */
	} B;
	int I;
	unsigned int U;

