svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} SMU_AG6CF0_type;
#define SMU_AG6CF0	(*( SMU_AG6CF0_type *) 0xf0036948u)	/* Alarm Configuration Register */
#define SMU_AG6CF1	(*( SMU_AG6CF0_type *) 0xf003694cu)	/* Alarm Configuration Register */
#define SMU_AG6CF2	(*( SMU_AG6CF0_type *) 0xf0036950u)	/* Alarm Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FE0            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE1            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE2            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE3            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE4            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE5            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE6            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE7            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE8            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE9            : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE10           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE11           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE12           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE13           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE14           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE15           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE16           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE17           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE18           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE19           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE20           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE21           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE22           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE23           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE24           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE25           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE26           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE27           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE28           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE29           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE30           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
		unsigned int FE31           : 1;	/* Fault signalling configuration flag for alarm n belonging to alarm group 6. */
	} B;
	int I;
	unsigned int U;

} SMU_AG6FSP_type;
#define SMU_AG6FSP	(*( SMU_AG6FSP_type *) 0xf0036998u)	/* FSP Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IGCS0          : 3;	/* Interrupt Generation Configuration Set 0 */
		unsigned int                : 1;
		unsigned int IGCS1          : 3;	/* Interrupt Generation Configuration Set 1 */
		unsigned int                : 1;
		unsigned int IGCS2          : 3;	/* Interrupt Generation Configuration Set 2 */
		unsigned int                : 5;
		unsigned int ICS            : 3;	/* Idle Configuration Set */
		unsigned int                : 5;
		unsigned int PES            : 5;	/* Port Emergency Stop */
		unsigned int EFRST          : 1;	/* Enable FAULT to RUN State Transition */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} SMU_AGC_type;
#define SMU_AGC	(*( SMU_AGC_type *) 0xf003682cu)	/* Alarm Global Configuration */

typedef volatile union
{
	struct
	{ 
		unsigned int CMD            : 4;	/* Implements the SMU Command Interface. */
		unsigned int ARG            : 4;	/* Implements the SMU Command Interface. */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} SMU_CMD_type;
#define SMU_CMD	(*( SMU_CMD_type *) 0xf0036820u)	/* Command Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SSM            : 2;	/* Running state of the SMU State Machine */
		/* const */ unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SMU_DBG_type;
#define SMU_DBG	(*( SMU_DBG_type *) 0xf0036838u)	/* Debug Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PRE1           : 3;	/* Prescaler1 */
		unsigned int PRE2           : 2;	/* Prescaler2 */
		unsigned int MODE           : 2;	/* Fault Signaling Protocol configuration */
		unsigned int PES            : 1;	/* Port Emergency Stop (PES) */
		/* const */ unsigned int TFSP_LOW       : 14;	/* Specifies the FSP fault state duration */
		unsigned int TFSP_HIGH      : 10;	/* Specifies the FSP fault state duration */
	} B;
	int I;
	unsigned int U;

} SMU_FSP_type;
#define SMU_FSP	(*( SMU_FSP_type *) 0xf0036828u)	/* Fault Signaling Protocol */

