svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} SMU_ID_type;
#define SMU_ID	(*( SMU_ID_type *) 0xf0036808u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CFGLCK         : 8;	/* Configuration Lock */
		unsigned int PERLCK         : 8;	/* Permanent Lock */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SMU_KEYS_type;
#define SMU_KEYS	(*( SMU_KEYS_type *) 0xf0036834u)	/* Key Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SMU_KRST0_type;
#define SMU_KRST0	(*( SMU_KRST0_type *) 0xf0036ff4u)	/* SMU Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} SMU_KRST1_type;
#define SMU_KRST1	(*( SMU_KRST1_type *) 0xf0036ff0u)	/* SMU Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} SMU_KRSTCLR_type;
#define SMU_KRSTCLR	(*( SMU_KRSTCLR_type *) 0xf0036fecu)	/* SMU Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} SMU_OCS_type;
#define SMU_OCS	(*( SMU_OCS_type *) 0xf0036fe8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int HWDIR          : 1;	/* Port Direction. */
		unsigned int HWEN           : 1;	/* Port Enable. */
		unsigned int                : 5;
		unsigned int PCS            : 1;	/* PAD Configuration Select */
		unsigned int                : 8;
		/* const */ unsigned int PCFG           : 16;	/* PAD Configuration */
	} B;
	int I;
	unsigned int U;

} SMU_PCTL_type;
#define SMU_PCTL	(*( SMU_PCTL_type *) 0xf003683cu)	/* Port Control */

typedef volatile union
{
	struct
	{ 
		unsigned int TE             : 1;	/* Test Enable. */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} SMU_RMCTL_type;
#define SMU_RMCTL	(*( SMU_RMCTL_type *) 0xf0036b00u)	/* Register Monitor Control */

typedef volatile union
{
	struct
	{ 
		unsigned int EF0            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF1            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF2            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF3            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF4            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF5            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF6            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF7            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF8            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF9            : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF10           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF11           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF12           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF13           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF14           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF15           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF16           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF17           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF18           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF19           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF20           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF21           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF22           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF23           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF24           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF25           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF26           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF27           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF28           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF29           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF30           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
		unsigned int EF31           : 1;	/* Status flag related to the different instances of the register monitor safety mechanism. */
	} B;
	int I;
	unsigned int U;

