svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} SMU_RMEF_type;
#define SMU_RMEF	(*( SMU_RMEF_type *) 0xf0036b04u)	/* Register Monitor Error Flags */

typedef volatile union
{
	struct
	{ 
		unsigned int STS0           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS1           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS2           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS3           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS4           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS5           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS6           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS7           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS8           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS9           : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS10          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS11          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS12          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS13          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS14          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS15          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS16          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS17          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS18          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS19          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS20          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS21          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS22          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS23          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS24          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS25          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS26          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS27          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS28          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS29          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS30          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
		unsigned int STS31          : 1;	/* Ready flag related to the different instances of the register monitor safety mechanism. */
	} B;
	int I;
	unsigned int U;

} SMU_RMSTS_type;
#define SMU_RMSTS	(*( SMU_RMSTS_type *) 0xf0036b08u)	/* Register Monitor Self Test Status */

typedef volatile union
{
	struct
	{ 
		unsigned int GID0           : 3;	/* Group Index 0. */
		unsigned int ALID0          : 5;	/* Alarm Identifier 0. */
		unsigned int GID1           : 3;	/* Group Index 1. */
		unsigned int ALID1          : 5;	/* Alarm Identifier 1. */
		unsigned int GID2           : 3;	/* Group Index 2. */
		unsigned int ALID2          : 5;	/* Alarm Identifier 2. */
		unsigned int GID3           : 3;	/* Group Index 3. */
		unsigned int ALID3          : 5;	/* Alarm Identifier 3. */
	} B;
	int I;
	unsigned int U;

} SMU_RTAC0_type;
#define SMU_RTAC0	(*( SMU_RTAC0_type *) 0xf0036860u)	/* Recovery Timer Alarm Configuration */
#define SMU_RTAC1	(*( SMU_RTAC0_type *) 0xf0036864u)	/* Recovery Timer Alarm Configuration */

typedef volatile union
{
	struct
	{ 
		unsigned int RT0E           : 1;	/* RT0 Enable Bit */
		unsigned int RT1E           : 1;	/* RT1 Enable Bit */
		unsigned int                : 6;
		unsigned int RTD            : 24;	/* Recovery Timer Duration */
	} B;
	int I;
	unsigned int U;

} SMU_RTC_type;
#define SMU_RTC	(*( SMU_RTC_type *) 0xf0036830u)	/* Fault Signaling Protocol */

typedef volatile union
{
	struct
	{ 
		unsigned int CMD            : 4;	/* Last command received */
		unsigned int ARG            : 4;	/* Last command argument received */
		unsigned int RES            : 1;	/* Result of last received command */
		unsigned int ASCE           : 1;	/* Alarm Status Clear Enable */
		/* const */ unsigned int FSP            : 2;	/* Fault Signaling Protocol status */
		unsigned int FSTS           : 1;	/* Fault State Timing Status */
		unsigned int                : 3;
		unsigned int RTS0           : 1;	/* Recovery Timer 0 Status */
		unsigned int RTME0          : 1;	/* Recovery Timer 0 Missed Event */
		unsigned int RTS1           : 1;	/* Recovery Timer 1 Status */
		unsigned int RTME1          : 1;	/* Recovery Timer 1 Missed Event */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} SMU_STS_type;
#define SMU_STS	(*( SMU_STS_type *) 0xf0036824u)	/* Status Register */


