svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
/* PMU */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} FLASH0_ACCEN0_type;
#define FLASH0_ACCEN0	(*( FLASH0_ACCEN0_type *) 0xf80023fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} FLASH0_ACCEN1_type;
#define FLASH0_ACCEN1	(*( FLASH0_ACCEN1_type *) 0xf80023f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL            : 6;	/* Select Bit-Errors */
		unsigned int                : 2;
		unsigned int CLR            : 1;	/* Clear */
		unsigned int DIS            : 1;	/* Disable */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} FLASH0_CBABCFG0_type;
#define FLASH0_CBABCFG0	(*( FLASH0_CBABCFG0_type *) 0xf80020b4u)	/* CBAB Configuration Port 0 */
#define FLASH0_CBABCFG1	(*( FLASH0_CBABCFG0_type *) 0xf80020c0u)	/* CBAB Configuration Port 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int VLD0           : 1;	/* Filling Level */
		/* const */ unsigned int VLD1           : 1;	/* Filling Level */
		/* const */ unsigned int VLD2           : 1;	/* Filling Level */
		/* const */ unsigned int VLD3           : 1;	/* Filling Level */
		/* const */ unsigned int VLD4           : 1;	/* Filling Level */
		/* const */ unsigned int                : 27;
	} B;
	int I;
	unsigned int U;

} FLASH0_CBABSTAT0_type;
#define FLASH0_CBABSTAT0	(*( FLASH0_CBABSTAT0_type *) 0xf80020b8u)	/* CBAB Status Port 0 */
#define FLASH0_CBABSTAT1	(*( FLASH0_CBABSTAT0_type *) 0xf80020c4u)	/* CBAB Status Port 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		/* const */ unsigned int ADDR           : 19;	/* Address */
		/* const */ unsigned int ERR            : 6;	/* Error Type */
		/* const */ unsigned int VLD            : 1;	/* Valid */
		unsigned int CLR            : 1;	/* Clear */
	} B;
	int I;
	unsigned int U;

} FLASH0_CBABTOP0_type;
#define FLASH0_CBABTOP0	(*( FLASH0_CBABTOP0_type *) 0xf80020bcu)	/* CBAB FIFO TOP Entry Port 0 */
#define FLASH0_CBABTOP1	(*( FLASH0_CBABTOP0_type *) 0xf80020c8u)	/* CBAB FIFO TOP Entry Port 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RCODE          : 22;	/* Error Correction Read Code */
		/* const */ unsigned int RED            : 2;	/* Redundant Bits */
		unsigned int                : 6;
		unsigned int EDCERRINJ      : 1;	/* EDC Error Injection */
		unsigned int ECCORDIS       : 1;	/* ECC Correction Disable */
	} B;
	int I;
	unsigned int U;

} FLASH0_ECCRD_type;
#define FLASH0_ECCRD	(*( FLASH0_ECCRD_type *) 0xf80020a4u)	/* ECC Read Register DF */
#define FLASH0_ECCRP0	(*( FLASH0_ECCRD_type *) 0xf8002094u)	/* ECC Read Register PF0 */
#define FLASH0_ECCRP1	(*( FLASH0_ECCRD_type *) 0xf8002098u)	/* ECC Read Register PF1 */

typedef volatile union
{
	struct
	{ 
		unsigned int WCODE          : 22;	/* Error Correction Write Code */
		unsigned int                : 8;
		unsigned int DECENCDIS      : 1;	/* DFlash ECC Encoding Disable */
		unsigned int PECENCDIS      : 1;	/* PFlash ECC Encoding Disable */
	} B;
	int I;
	unsigned int U;

} FLASH0_ECCW_type;
#define FLASH0_ECCW	(*( FLASH0_ECCW_type *) 0xf8002090u)	/* ECC Write Register */

typedef volatile union
{
	struct
	{ 
		unsigned int WSPFLASH       : 4;	/* Wait States for read access to PFlash */
		unsigned int WSECPF         : 2;	/* Wait States for Error Correction of PFlash */
		unsigned int WSDFLASH       : 6;	/* Wait States for read access to DFlash */
		unsigned int WSECDF         : 3;	/* Wait State for Error Correction of DFlash */
		unsigned int IDLE           : 1;	/* Dynamic Flash Idle */
		unsigned int ESLDIS         : 1;	/* External Sleep Request Disable */
		unsigned int SLEEP          : 1;	/* Flash SLEEP / Flash Shut-Down */
		unsigned int NSAFECC        : 1;	/* Non-Safety PFlash ECC */
		unsigned int STALL          : 1;	/* Stall SRI */
		unsigned int FSISTART       : 2;	/* Start FSI */
		unsigned int REC            : 2;	/* Start FSI Recovery */
		unsigned int VOPERM         : 1;	/* Verify and Operation Error Interrupt Mask */
		unsigned int SQERM          : 1;	/* Command Sequence Error Interrupt Mask */
		unsigned int PROERM         : 1;	/* Protection Error Interrupt Mask */
		unsigned int                : 3;
		unsigned int PR5V           : 1;	/* Programming Supply 5V */
		unsigned int EOBM           : 1;	/* End of Busy Interrupt Mask */
	} B;
	int I;
	unsigned int U;

} FLASH0_FCON_type;
#define FLASH0_FCON	(*( FLASH0_FCON_type *) 0xf8002014u)	/* Flash Configuration Register */

