svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PROINP         : 1;	/* PFlash Protection */
		/* const */ unsigned int PRODISP        : 1;	/* PFlash Protection DisabledCleared with command 'Resume Protection'. */
		/* const */ unsigned int PROIND         : 1;	/* DFlash Protection */
		/* const */ unsigned int PRODISD        : 1;	/* DFlash Protection Disabled */
		/* const */ unsigned int PROINHSMCOTP   : 1;	/* HSM OTP Protection */
		/* const */ unsigned int PROINHSMCFG    : 1;	/* HSM Configuration Protection */
		/* const */ unsigned int PROINOTP       : 1;	/* OTP and Write-Once Protection */
		/* const */ unsigned int PROINIFX       : 1;	/* UCB_IFX Protection */
		/* const */ unsigned int PROINDBG       : 1;	/* Debug Interface Password Protection */
		/* const */ unsigned int PRODISDBG      : 1;	/* Debug Interface Password Protection Disabled */
		/* const */ unsigned int PROINHSM       : 1;	/* HSM Configuration */
		unsigned int                : 5;
		unsigned int DCFP           : 1;	/* Disable Code Fetch from PFlash Memory for CPU0 PMI */
		unsigned int DDFP           : 1;	/* Disable Read from PFlash for CPU0 DMI */
		unsigned int DDFPX          : 1;	/* Disable Read from PFlash for Other Masters */
		unsigned int                : 1;
		unsigned int DDFD           : 1;	/* Disable Data Fetch from DFlash Memory */
		unsigned int                : 1;
		unsigned int ENPE           : 2;	/* Enable Program/Erase */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} FLASH0_FPRO_type;
#define FLASH0_FPRO	(*( FLASH0_FPRO_type *) 0xf800201cu)	/* Flash Protection Control and Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FABUSY         : 1;	/* Flash Array Busy Cleared with application reset */
		/* const */ unsigned int D0BUSY         : 1;	/* Data Flash Bank0 Busy */
		/* const */ unsigned int D1BUSY         : 1;	/* Data Flash Bank1 Busy */
		/* const */ unsigned int P0BUSY         : 1;	/* Program Flash PF0 Busy */
		/* const */ unsigned int P1BUSY         : 1;	/* Program Flash PF1 Busy */
		/* const */ unsigned int RES5           : 1;	/* Reserved for Program Flash PF2 Busy */
		/* const */ unsigned int RES6           : 1;	/* Reserved for Program Flash PF3 Busy */
		unsigned int PROG           : 1;	/* Programming State Cleared with command 'Clear Status'Cleared with power-on reset (PORST) */
		unsigned int ERASE          : 1;	/* Erase State */
		/* const */ unsigned int PFPAGE         : 1;	/* Program Flash in Page ModeCleared with command 'Reset to Read' */
		/* const */ unsigned int DFPAGE         : 1;	/* Data Flash in Page Mode */
		unsigned int OPER           : 1;	/* Flash Operation Error */
		unsigned int SQER           : 1;	/* Command Sequence Error */
		unsigned int PROER          : 1;	/* Protection Error */
		unsigned int PFSBER         : 1;	/* PFlash Single-Bit Error and Correction */
		unsigned int PFDBER         : 1;	/* PFlash Double-Bit Error */
		unsigned int PFMBER         : 1;	/* PFlash Uncorrectable Error */
		unsigned int RES17          : 1;	/* Reserved */
		unsigned int DFSBER         : 1;	/* DFlash Single-Bit Error */
		unsigned int DFDBER         : 1;	/* DFlash Double-Bit Error */
		unsigned int DFTBER         : 1;	/* DFlash Triple-Bit Error */
		unsigned int DFMBER         : 1;	/* DFlash Uncorrectable Error */
		unsigned int SRIADDERR      : 1;	/* SRI Bus Address ECC Error */
		unsigned int                : 1;
		unsigned int REC            : 1;	/* Recovery State */
		unsigned int PVER           : 1;	/* Program Verify Error */
		unsigned int EVER           : 1;	/* Erase Verify Error */
		/* const */ unsigned int SPND           : 1;	/* Operation Suspended */
		/* const */ unsigned int SLM            : 1;	/* Flash Sleep Mode */
		/* const */ unsigned int VIS            : 1;	/* Flash Virgin / Initial State */
		/* const */ unsigned int ORIER          : 1;	/* Original Error */
		/* const */ unsigned int CFU            : 1;	/* Configuration Sector Unlocked */
	} B;
	int I;
	unsigned int U;

} FLASH0_FSR_type;
#define FLASH0_FSR	(*( FLASH0_FSR_type *) 0xf8002010u)	/* Flash Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LCKHSMUCB      : 2;	/* Lock Access to UCB_HSMCFG */
		unsigned int                : 22;
		unsigned int VOPERM         : 1;	/* Verify and Operation Error Interrupt Mask */
		unsigned int SQERM          : 1;	/* Command Sequence Error Interrupt Mask */
		unsigned int                : 5;
		unsigned int EOBM           : 1;	/* End of Busy Interrupt Mask */
	} B;
	int I;
	unsigned int U;

} FLASH0_HSMFCON_type;
#define FLASH0_HSMFCON	(*( FLASH0_HSMFCON_type *) 0xf8002204u)	/* HSM Flash Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		/* const */ unsigned int D1BUSY         : 1;	/* Data Flash Bank1 BusyCleared with application reset */
		unsigned int                : 4;
		unsigned int PROG           : 1;	/* Programming State Cleared with command 'Clear Status'Cleared with power-on reset (PORST) */
		unsigned int ERASE          : 1;	/* Erase State */
		unsigned int                : 1;
		/* const */ unsigned int DFPAGE         : 1;	/* Data Flash in Page ModeCleared with command 'Reset to Read' */
		unsigned int OPER           : 1;	/* Flash Operation Error */
		unsigned int SQER           : 1;	/* Command Sequence Error */
		unsigned int                : 12;
		unsigned int PVER           : 1;	/* Program Verify Error */
		unsigned int EVER           : 1;	/* Erase Verify Error */
		/* const */ unsigned int SPND           : 1;	/* Operation Suspended */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} FLASH0_HSMFSR_type;
#define FLASH0_HSMFSR	(*( FLASH0_HSMFSR_type *) 0xf8002200u)	/* Flash Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int SELD1          : 1;	/* HSM DFLASH Bank Selection */
		unsigned int                : 1;
		unsigned int SPND           : 1;	/* Suspend */
		unsigned int SPNDERR        : 1;	/* Suspend Error */
		unsigned int                : 27;
	} B;
	int I;
	unsigned int U;

