svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} FLASH0_HSMMARD_type;
#define FLASH0_HSMMARD	(*( FLASH0_HSMMARD_type *) 0xf8002208u)	/* Margin Control Register HSM DFlash */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int ADD            : 29;	/* Address */
	} B;
	int I;
	unsigned int U;

} FLASH0_HSMRRAD_type;
#define FLASH0_HSMRRAD	(*( FLASH0_HSMRRAD_type *) 0xf8002218u)	/* HSM Requested Read Address Register */
#define FLASH0_RRAD	(*( FLASH0_HSMRRAD_type *) 0xf800214cu)	/* Requested Read Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int STRT           : 1;	/* Start Request */
		unsigned int STP            : 1;	/* Stop */
		/* const */ unsigned int BUSY           : 1;	/* Flash Read Busy */
		/* const */ unsigned int DONE           : 1;	/* Flash Read Done */
		/* const */ unsigned int ERR            : 1;	/* Error */
		unsigned int                : 3;
		unsigned int EOBM           : 1;	/* End of Busy Interrupt Mask */
		unsigned int                : 7;
		unsigned int CNT            : 16;	/* Count */
	} B;
	int I;
	unsigned int U;

} FLASH0_HSMRRCT_type;
#define FLASH0_HSMRRCT	(*( FLASH0_HSMRRCT_type *) 0xf800220cu)	/* Requested Read Control Register HSM */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DATA           : 32;	/* Read Data */
	} B;
	int I;
	unsigned int U;

} FLASH0_HSMRRD0_type;
#define FLASH0_HSMRRD0	(*( FLASH0_HSMRRD0_type *) 0xf8002210u)	/* HSM Requested Read Data Register 0 */
#define FLASH0_HSMRRD1	(*( FLASH0_HSMRRD0_type *) 0xf8002214u)	/* HSM Requested Read Data Register 1 */
#define FLASH0_RRD0	(*( FLASH0_HSMRRD0_type *) 0xf8002144u)	/* Requested Read Data Register 0 */
#define FLASH0_RRD1	(*( FLASH0_HSMRRD0_type *) 0xf8002148u)	/* Requested Read Data Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} FLASH0_ID_type;
#define FLASH0_ID	(*( FLASH0_ID_type *) 0xf8002008u)	/* Flash Module Identification Register */
#define PMU0_ID	(*( FLASH0_ID_type *) 0xf8000508u)	/* PMU0 Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HMARGIN        : 1;	/* Hard Margin Selection */
		unsigned int SELD0          : 1;	/* DFLASH Bank Selection */
		unsigned int                : 1;
		unsigned int SPND           : 1;	/* Suspend */
		unsigned int SPNDERR        : 1;	/* Suspend Error */
		unsigned int                : 10;
		unsigned int TRAPDIS        : 1;	/* DFLASH Uncorrectable Bit Error Trap Disable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FLASH0_MARD_type;
#define FLASH0_MARD	(*( FLASH0_MARD_type *) 0xf80020acu)	/* Margin Control Register DFlash */

typedef volatile union
{
	struct
	{ 
		unsigned int SELP0          : 1;	/* PFLASH Bank Selection */
		unsigned int SELP1          : 1;	/* PFLASH Bank Selection */
		unsigned int RES2           : 1;	/* Reserved */
		unsigned int RES3           : 1;	/* Reserved */
		unsigned int                : 11;
		unsigned int TRAPDIS        : 1;	/* PFLASH Uncorrectable Bit Error Trap Disable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FLASH0_MARP_type;
#define FLASH0_MARP	(*( FLASH0_MARP_type *) 0xf80020a8u)	/* Margin Control Register PFlash */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int L              : 1;	/* DF_EEPROM Locked for Write Protection */
		/* const */ unsigned int NSAFECC        : 1;	/* Non-Safety PFlash ECC */
		/* const */ unsigned int RAMIN          : 2;	/* RAM Initialization by SSW Control */
		/* const */ unsigned int RAMINSEL       : 4;	/* RAM Initialization Selection */
		/* const */ unsigned int OSCCFG         : 1;	/* OSC Configuration by SSW */
		/* const */ unsigned int MODE           : 2;	/* OSC Mode */
		/* const */ unsigned int APREN          : 1;	/* OSC Amplitude Regulation Enable */
		/* const */ unsigned int CAP0EN         : 1;	/* OSC Capacitance x Enable (x=0-3) */
		/* const */ unsigned int CAP1EN         : 1;	/* OSC Capacitance x Enable (x=0-3) */
		/* const */ unsigned int CAP2EN         : 1;	/* OSC Capacitance x Enable (x=0-3) */
		/* const */ unsigned int CAP3EN         : 1;	/* OSC Capacitance x Enable (x=0-3) */
		/* const */ unsigned int RSTCNT         : 12;	/* ESR0 Delay */
		/* const */ unsigned int RES29          : 2;	/* Reserved */
		/* const */ unsigned int TRISTREQ       : 1;	/* Tristate Request */
		/* const */ unsigned int RPRO           : 1;	/* Read Protection Configuration */
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCOND_type;
#define FLASH0_PROCOND	(*( FLASH0_PROCOND_type *) 0xf8002030u)	/* DFlash Protection Configuration */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OCDSDIS        : 1;	/* OCDS Disabled */
		/* const */ unsigned int DBGIFLCK       : 1;	/* Debug Interface Locked */
		/* const */ unsigned int EDM            : 2;	/* Entered Debug Mode */
		/* const */ unsigned int RES            : 12;	/* Reserved */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCONDBG_type;
#define FLASH0_PROCONDBG	(*( FLASH0_PROCONDBG_type *) 0xf8002058u)	/* Debug Interface Protection Configuration */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int HSMDBGDIS      : 1;	/* HSM Debug Disable */
		/* const */ unsigned int DBGIFLCK       : 1;	/* Debug Interface Locked */
		/* const */ unsigned int TSTIFLCK       : 1;	/* Test Interface Locked */
		/* const */ unsigned int HSMTSTDIS      : 1;	/* HSM Test Disable */
		/* const */ unsigned int RES15          : 12;	/* Reserved */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCONHSM_type;
#define FLASH0_PROCONHSM	(*( FLASH0_PROCONHSM_type *) 0xf800205cu)	/* HSM Interface Configuration */

