svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int HSMBOOTEN      : 1;	/* HSM Boot Enable */
		/* const */ unsigned int SSWWAIT        : 1;	/* SSW Wait */
		/* const */ unsigned int HSMDX          : 1;	/* HSM Data Sectors Exclusive */
		/* const */ unsigned int HSM6X          : 1;	/* HSM Code Sector 6 Exclusive */
		/* const */ unsigned int HSM16X         : 1;	/* HSM Code Sector 16 Exclusive */
		/* const */ unsigned int HSM17X         : 1;	/* HSM Code Sector 17 Exclusive */
		/* const */ unsigned int S6ROM          : 1;	/* HSM Code Sector 6 Locked Forever */
		/* const */ unsigned int HSMENPINS      : 2;	/* Enable HSM Forcing of Pins HSM1/2 */
		/* const */ unsigned int HSMENRES       : 2;	/* Enable HSM Triggering Resets */
		/* const */ unsigned int DESTDBG        : 2;	/* Destructive Debug Entry */
		/* const */ unsigned int RES            : 3;	/* Reserved */
		/* const */ unsigned int S16ROM         : 1;	/* HSM Code Sector 16 Locked Forever */
		/* const */ unsigned int S17ROM         : 1;	/* HSM Code Sector 17 Locked Forever */
		/* const */ unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCONHSMCOTP_type;
#define FLASH0_PROCONHSMCOTP	(*( FLASH0_PROCONHSMCOTP_type *) 0xf8002034u)	/* HSM Code Flash OTP Protection Configuration */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int S0ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S1ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S2ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S3ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S4ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S5ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S6ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S7ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S8ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S9ROM          : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S10ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S11ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S12ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S13ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S14ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S15ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S16ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S17ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S18ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S19ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S20ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S21ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S22ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S23ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S24ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S25ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int S26ROM         : 1;	/* PFlash p Sector x Locked for Forever */
		/* const */ unsigned int RES            : 2;	/* Reserved */
		/* const */ unsigned int BML            : 2;	/* Boot Mode Lock */
		/* const */ unsigned int TP             : 1;	/* Tuning Protection */
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCONOTP0_type;
#define FLASH0_PROCONOTP0	(*( FLASH0_PROCONOTP0_type *) 0xf8002038u)	/* OTP Protection Configuration PF0 */
#define FLASH0_PROCONOTP1	(*( FLASH0_PROCONOTP0_type *) 0xf800203cu)	/* OTP Protection Configuration PF1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int S0L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S1L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S2L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S3L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S4L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S5L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S6L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S7L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S8L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S9L            : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S10L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S11L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S12L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S13L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S14L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S15L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S16L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S17L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S18L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S19L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S20L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S21L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S22L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S23L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S24L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S25L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int S26L           : 1;	/* PFlash p Sector x Locked for Write Protection */
		/* const */ unsigned int RES            : 4;	/* Reserved */
		/* const */ unsigned int RPRO           : 1;	/* Read Protection Configuration */
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCONP0_type;
#define FLASH0_PROCONP0	(*( FLASH0_PROCONP0_type *) 0xf8002020u)	/* PFlash Protection Configuration PF0 */
#define FLASH0_PROCONP1	(*( FLASH0_PROCONP0_type *) 0xf8002024u)	/* PFlash Protection Configuration PF1 */

