svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int S0WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S1WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S2WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S3WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S4WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S5WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S6WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S7WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S8WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S9WOP          : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S10WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S11WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S12WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S13WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S14WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S15WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S16WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S17WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S18WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S19WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S20WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S21WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S22WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S23WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S24WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S25WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int S26WOP         : 1;	/* PFlash p Sector x Configured for Write-Once Protection */
		/* const */ unsigned int RES            : 4;	/* Reserved */
		/* const */ unsigned int DATM           : 1;	/* Disable ATM */
	} B;
	int I;
	unsigned int U;

} FLASH0_PROCONWOP0_type;
#define FLASH0_PROCONWOP0	(*( FLASH0_PROCONWOP0_type *) 0xf8002048u)	/* Write-Once Protection Configuration PF0 */
#define FLASH0_PROCONWOP1	(*( FLASH0_PROCONWOP0_type *) 0xf800204cu)	/* Write-Once Protection Configuration PF1 */

typedef volatile union
{
	struct
	{ 
		unsigned int TAG            : 6;	/* Master Tag */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} FLASH0_RDBCFG00_type;
#define FLASH0_RDBCFG00	(*( FLASH0_RDBCFG00_type *) 0xf8002060u)	/* Read Buffer Port 0 Cfg 0 */
#define FLASH0_RDBCFG01	(*( FLASH0_RDBCFG00_type *) 0xf8002064u)	/* Read Buffer Port 0 Cfg 1 */
#define FLASH0_RDBCFG02	(*( FLASH0_RDBCFG00_type *) 0xf8002068u)	/* Read Buffer Port 0 Cfg 2 */
#define FLASH0_RDBCFG10	(*( FLASH0_RDBCFG00_type *) 0xf800206cu)	/* Read Buffer Port 1 Cfg 0 */
#define FLASH0_RDBCFG11	(*( FLASH0_RDBCFG00_type *) 0xf8002070u)	/* Read Buffer Port 1 Cfg 1 */
#define FLASH0_RDBCFG12	(*( FLASH0_RDBCFG00_type *) 0xf8002074u)	/* Read Buffer Port 1 Cfg 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int STRT           : 1;	/* Start Request */
		unsigned int STP            : 1;	/* Stop */
		/* const */ unsigned int BUSY           : 1;	/* Flash Read Busy */
		/* const */ unsigned int DONE           : 1;	/* Flash Read Done */
		/* const */ unsigned int ERR            : 1;	/* Error */
		unsigned int                : 3;
		unsigned int EOBM           : 1;	/* End of Busy Interrupt Mask */
		unsigned int                : 7;
		unsigned int CNT            : 16;	/* Count */
	} B;
	int I;
	unsigned int U;

} FLASH0_RRCT_type;
#define FLASH0_RRCT	(*( FLASH0_RRCT_type *) 0xf8002140u)	/* Requested Read Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL            : 6;	/* Select Bit-Errors */
		unsigned int                : 2;
		unsigned int CLR            : 1;	/* Clear */
		unsigned int DIS            : 1;	/* Disable */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} FLASH0_UBABCFG0_type;
#define FLASH0_UBABCFG0	(*( FLASH0_UBABCFG0_type *) 0xf80020e4u)	/* UBAB Configuration Port 0 */
#define FLASH0_UBABCFG1	(*( FLASH0_UBABCFG0_type *) 0xf80020f0u)	/* UBAB Configuration Port 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int VLD0           : 1;	/* Filling Level */
		/* const */ unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} FLASH0_UBABSTAT0_type;
#define FLASH0_UBABSTAT0	(*( FLASH0_UBABSTAT0_type *) 0xf80020e8u)	/* UBAB Status Port 0 */
#define FLASH0_UBABSTAT1	(*( FLASH0_UBABSTAT0_type *) 0xf80020f4u)	/* UBAB Status Port 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		/* const */ unsigned int ADDR           : 19;	/* Address */
		/* const */ unsigned int ERR            : 6;	/* Error Type */
		/* const */ unsigned int VLD            : 1;	/* Valid */
		unsigned int CLR            : 1;	/* Clear */
	} B;
	int I;
	unsigned int U;

