svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} FLASH0_UBABTOP0_type;
#define FLASH0_UBABTOP0	(*( FLASH0_UBABTOP0_type *) 0xf80020ecu)	/* UBAB FIFO TOP Entry Port 0 */
#define FLASH0_UBABTOP1	(*( FLASH0_UBABTOP0_type *) 0xf80020f8u)	/* UBAB FIFO TOP Entry Port 1 */


/* LMU */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} LMU_ACCEN0_type;
#define LMU_ACCEN0	(*( LMU_ACCEN0_type *) 0xf8700810u)	/* LMU Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} LMU_ACCEN1_type;
#define LMU_ACCEN1	(*( LMU_ACCEN1_type *) 0xf8700814u)	/* LMU Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int TAG1           : 6;	/* Master Tag ID 1 */
		unsigned int                : 2;
		unsigned int TAG2           : 6;	/* Master Tag ID 2 */
		unsigned int                : 8;
		unsigned int EREN           : 1;	/* EMEM Read Buffer Enable */
		unsigned int EPEN           : 1;	/* EMEM Prefetch Enable */
		unsigned int                : 6;
		unsigned int EN1            : 1;	/* TAG1 Field Enable */
		unsigned int EN2            : 1;	/* TAG2 Field Enable */
	} B;
	int I;
	unsigned int U;

} LMU_BUFCON0_type;
#define LMU_BUFCON0	(*( LMU_BUFCON0_type *) 0xf8700830u)	/* LMU Buffer Control Register */
#define LMU_BUFCON1	(*( LMU_BUFCON0_type *) 0xf8700834u)	/* LMU Buffer Control Register */
#define LMU_BUFCON2	(*( LMU_BUFCON0_type *) 0xf8700838u)	/* LMU Buffer Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* LMU Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* LMU Disable Status Bit */
		/* const */ unsigned int RES            : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} LMU_CLC_type;
#define LMU_CLC	(*( LMU_CLC_type *) 0xf8700800u)	/* LMU Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OLDAEN         : 1;	/* Online Data Acquisition Enabled */
		unsigned int POLDAEN        : 1;	/* Protection Bit for OLDAEN */
		unsigned int INTERR         : 1;	/* Internal ECC Error */
		unsigned int ERERR          : 1;	/* EMEM Read Error */
		unsigned int RMWERR         : 1;	/* Internal Read Modify Write Error */
		unsigned int EWERR          : 1;	/* EMEM Write Error */
		unsigned int DATAERR        : 1;	/* SRI Data Phase ECC Error */
		unsigned int ADDERR         : 1;	/* SRI Address Phase ECC Error */
		unsigned int PMIC           : 1;	/* Protection Bit for Memory Integrity Control Bit */
		unsigned int ERRDIS         : 1;	/* ECC Error Disable */
		unsigned int                : 2;
		unsigned int WSTATES        : 4;	/* EMEM Wait States */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} LMU_MEMCON_type;
#define LMU_MEMCON	(*( LMU_MEMCON_type *) 0xf8700820u)	/* LMU Memory Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ID_VALUE       : 32;	/* Module Identification Value */
	} B;
	int I;
	unsigned int U;

} LMU_MODID_type;
#define LMU_MODID	(*( LMU_MODID_type *) 0xf8700808u)	/* LMU Module ID Register */


/* OVC */
typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int OMASK          : 12;	/* Overlay Address Mask */
		/* const */ unsigned int ONE            : 11;	/* Fixed '1' Values */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} OVC0_OMASK0_type;
#define OVC0_OMASK0	(*( OVC0_OMASK0_type *) 0xf880fb18u)	/* Overlay Mask Register 0 */
#define OVC0_OMASK1	(*( OVC0_OMASK0_type *) 0xf880fb24u)	/* Overlay Mask Register 1 */
#define OVC0_OMASK10	(*( OVC0_OMASK0_type *) 0xf880fb90u)	/* Overlay Mask Register 10 */
#define OVC0_OMASK11	(*( OVC0_OMASK0_type *) 0xf880fb9cu)	/* Overlay Mask Register 11 */
#define OVC0_OMASK12	(*( OVC0_OMASK0_type *) 0xf880fba8u)	/* Overlay Mask Register 12 */
#define OVC0_OMASK13	(*( OVC0_OMASK0_type *) 0xf880fbb4u)	/* Overlay Mask Register 13 */
#define OVC0_OMASK14	(*( OVC0_OMASK0_type *) 0xf880fbc0u)	/* Overlay Mask Register 14 */
#define OVC0_OMASK15	(*( OVC0_OMASK0_type *) 0xf880fbccu)	/* Overlay Mask Register 15 */
#define OVC0_OMASK16	(*( OVC0_OMASK0_type *) 0xf880fbd8u)	/* Overlay Mask Register 16 */
#define OVC0_OMASK17	(*( OVC0_OMASK0_type *) 0xf880fbe4u)	/* Overlay Mask Register 17 */
#define OVC0_OMASK18	(*( OVC0_OMASK0_type *) 0xf880fbf0u)	/* Overlay Mask Register 18 */
#define OVC0_OMASK19	(*( OVC0_OMASK0_type *) 0xf880fbfcu)	/* Overlay Mask Register 19 */
#define OVC0_OMASK2	(*( OVC0_OMASK0_type *) 0xf880fb30u)	/* Overlay Mask Register 2 */
#define OVC0_OMASK20	(*( OVC0_OMASK0_type *) 0xf880fc08u)	/* Overlay Mask Register 20 */
#define OVC0_OMASK21	(*( OVC0_OMASK0_type *) 0xf880fc14u)	/* Overlay Mask Register 21 */
#define OVC0_OMASK22	(*( OVC0_OMASK0_type *) 0xf880fc20u)	/* Overlay Mask Register 22 */
#define OVC0_OMASK23	(*( OVC0_OMASK0_type *) 0xf880fc2cu)	/* Overlay Mask Register 23 */
#define OVC0_OMASK24	(*( OVC0_OMASK0_type *) 0xf880fc38u)	/* Overlay Mask Register 24 */
#define OVC0_OMASK25	(*( OVC0_OMASK0_type *) 0xf880fc44u)	/* Overlay Mask Register 25 */
#define OVC0_OMASK26	(*( OVC0_OMASK0_type *) 0xf880fc50u)	/* Overlay Mask Register 26 */
#define OVC0_OMASK27	(*( OVC0_OMASK0_type *) 0xf880fc5cu)	/* Overlay Mask Register 27 */
#define OVC0_OMASK28	(*( OVC0_OMASK0_type *) 0xf880fc68u)	/* Overlay Mask Register 28 */
#define OVC0_OMASK29	(*( OVC0_OMASK0_type *) 0xf880fc74u)	/* Overlay Mask Register 29 */
#define OVC0_OMASK3	(*( OVC0_OMASK0_type *) 0xf880fb3cu)	/* Overlay Mask Register 3 */
#define OVC0_OMASK30	(*( OVC0_OMASK0_type *) 0xf880fc80u)	/* Overlay Mask Register 30 */
#define OVC0_OMASK31	(*( OVC0_OMASK0_type *) 0xf880fc8cu)	/* Overlay Mask Register 31 */
#define OVC0_OMASK4	(*( OVC0_OMASK0_type *) 0xf880fb48u)	/* Overlay Mask Register 4 */
#define OVC0_OMASK5	(*( OVC0_OMASK0_type *) 0xf880fb54u)	/* Overlay Mask Register 5 */
#define OVC0_OMASK6	(*( OVC0_OMASK0_type *) 0xf880fb60u)	/* Overlay Mask Register 6 */
#define OVC0_OMASK7	(*( OVC0_OMASK0_type *) 0xf880fb6cu)	/* Overlay Mask Register 7 */
#define OVC0_OMASK8	(*( OVC0_OMASK0_type *) 0xf880fb78u)	/* Overlay Mask Register 8 */
#define OVC0_OMASK9	(*( OVC0_OMASK0_type *) 0xf880fb84u)	/* Overlay Mask Register 9 */
#define OVC1_OMASK0	(*( OVC0_OMASK0_type *) 0xf882fb18u)	/* Overlay Mask Register 0 */
#define OVC1_OMASK1	(*( OVC0_OMASK0_type *) 0xf882fb24u)	/* Overlay Mask Register 1 */
#define OVC1_OMASK10	(*( OVC0_OMASK0_type *) 0xf882fb90u)	/* Overlay Mask Register 10 */
#define OVC1_OMASK11	(*( OVC0_OMASK0_type *) 0xf882fb9cu)	/* Overlay Mask Register 11 */
#define OVC1_OMASK12	(*( OVC0_OMASK0_type *) 0xf882fba8u)	/* Overlay Mask Register 12 */
#define OVC1_OMASK13	(*( OVC0_OMASK0_type *) 0xf882fbb4u)	/* Overlay Mask Register 13 */
#define OVC1_OMASK14	(*( OVC0_OMASK0_type *) 0xf882fbc0u)	/* Overlay Mask Register 14 */
#define OVC1_OMASK15	(*( OVC0_OMASK0_type *) 0xf882fbccu)	/* Overlay Mask Register 15 */
#define OVC1_OMASK16	(*( OVC0_OMASK0_type *) 0xf882fbd8u)	/* Overlay Mask Register 16 */
#define OVC1_OMASK17	(*( OVC0_OMASK0_type *) 0xf882fbe4u)	/* Overlay Mask Register 17 */
#define OVC1_OMASK18	(*( OVC0_OMASK0_type *) 0xf882fbf0u)	/* Overlay Mask Register 18 */
#define OVC1_OMASK19	(*( OVC0_OMASK0_type *) 0xf882fbfcu)	/* Overlay Mask Register 19 */
#define OVC1_OMASK2	(*( OVC0_OMASK0_type *) 0xf882fb30u)	/* Overlay Mask Register 2 */
#define OVC1_OMASK20	(*( OVC0_OMASK0_type *) 0xf882fc08u)	/* Overlay Mask Register 20 */
#define OVC1_OMASK21	(*( OVC0_OMASK0_type *) 0xf882fc14u)	/* Overlay Mask Register 21 */
#define OVC1_OMASK22	(*( OVC0_OMASK0_type *) 0xf882fc20u)	/* Overlay Mask Register 22 */
#define OVC1_OMASK23	(*( OVC0_OMASK0_type *) 0xf882fc2cu)	/* Overlay Mask Register 23 */
#define OVC1_OMASK24	(*( OVC0_OMASK0_type *) 0xf882fc38u)	/* Overlay Mask Register 24 */
#define OVC1_OMASK25	(*( OVC0_OMASK0_type *) 0xf882fc44u)	/* Overlay Mask Register 25 */
#define OVC1_OMASK26	(*( OVC0_OMASK0_type *) 0xf882fc50u)	/* Overlay Mask Register 26 */
#define OVC1_OMASK27	(*( OVC0_OMASK0_type *) 0xf882fc5cu)	/* Overlay Mask Register 27 */
#define OVC1_OMASK28	(*( OVC0_OMASK0_type *) 0xf882fc68u)	/* Overlay Mask Register 28 */
#define OVC1_OMASK29	(*( OVC0_OMASK0_type *) 0xf882fc74u)	/* Overlay Mask Register 29 */
#define OVC1_OMASK3	(*( OVC0_OMASK0_type *) 0xf882fb3cu)	/* Overlay Mask Register 3 */
#define OVC1_OMASK30	(*( OVC0_OMASK0_type *) 0xf882fc80u)	/* Overlay Mask Register 30 */
#define OVC1_OMASK31	(*( OVC0_OMASK0_type *) 0xf882fc8cu)	/* Overlay Mask Register 31 */
#define OVC1_OMASK4	(*( OVC0_OMASK0_type *) 0xf882fb48u)	/* Overlay Mask Register 4 */
#define OVC1_OMASK5	(*( OVC0_OMASK0_type *) 0xf882fb54u)	/* Overlay Mask Register 5 */
#define OVC1_OMASK6	(*( OVC0_OMASK0_type *) 0xf882fb60u)	/* Overlay Mask Register 6 */
#define OVC1_OMASK7	(*( OVC0_OMASK0_type *) 0xf882fb6cu)	/* Overlay Mask Register 7 */
#define OVC1_OMASK8	(*( OVC0_OMASK0_type *) 0xf882fb78u)	/* Overlay Mask Register 8 */
#define OVC1_OMASK9	(*( OVC0_OMASK0_type *) 0xf882fb84u)	/* Overlay Mask Register 9 */
#define OVC2_OMASK0	(*( OVC0_OMASK0_type *) 0xf884fb18u)	/* Overlay Mask Register 0 */
#define OVC2_OMASK1	(*( OVC0_OMASK0_type *) 0xf884fb24u)	/* Overlay Mask Register 1 */
#define OVC2_OMASK10	(*( OVC0_OMASK0_type *) 0xf884fb90u)	/* Overlay Mask Register 10 */
#define OVC2_OMASK11	(*( OVC0_OMASK0_type *) 0xf884fb9cu)	/* Overlay Mask Register 11 */
#define OVC2_OMASK12	(*( OVC0_OMASK0_type *) 0xf884fba8u)	/* Overlay Mask Register 12 */
#define OVC2_OMASK13	(*( OVC0_OMASK0_type *) 0xf884fbb4u)	/* Overlay Mask Register 13 */
#define OVC2_OMASK14	(*( OVC0_OMASK0_type *) 0xf884fbc0u)	/* Overlay Mask Register 14 */
#define OVC2_OMASK15	(*( OVC0_OMASK0_type *) 0xf884fbccu)	/* Overlay Mask Register 15 */
#define OVC2_OMASK16	(*( OVC0_OMASK0_type *) 0xf884fbd8u)	/* Overlay Mask Register 16 */
#define OVC2_OMASK17	(*( OVC0_OMASK0_type *) 0xf884fbe4u)	/* Overlay Mask Register 17 */
#define OVC2_OMASK18	(*( OVC0_OMASK0_type *) 0xf884fbf0u)	/* Overlay Mask Register 18 */
#define OVC2_OMASK19	(*( OVC0_OMASK0_type *) 0xf884fbfcu)	/* Overlay Mask Register 19 */
#define OVC2_OMASK2	(*( OVC0_OMASK0_type *) 0xf884fb30u)	/* Overlay Mask Register 2 */
#define OVC2_OMASK20	(*( OVC0_OMASK0_type *) 0xf884fc08u)	/* Overlay Mask Register 20 */
#define OVC2_OMASK21	(*( OVC0_OMASK0_type *) 0xf884fc14u)	/* Overlay Mask Register 21 */
#define OVC2_OMASK22	(*( OVC0_OMASK0_type *) 0xf884fc20u)	/* Overlay Mask Register 22 */
#define OVC2_OMASK23	(*( OVC0_OMASK0_type *) 0xf884fc2cu)	/* Overlay Mask Register 23 */
#define OVC2_OMASK24	(*( OVC0_OMASK0_type *) 0xf884fc38u)	/* Overlay Mask Register 24 */
#define OVC2_OMASK25	(*( OVC0_OMASK0_type *) 0xf884fc44u)	/* Overlay Mask Register 25 */
#define OVC2_OMASK26	(*( OVC0_OMASK0_type *) 0xf884fc50u)	/* Overlay Mask Register 26 */
#define OVC2_OMASK27	(*( OVC0_OMASK0_type *) 0xf884fc5cu)	/* Overlay Mask Register 27 */
#define OVC2_OMASK28	(*( OVC0_OMASK0_type *) 0xf884fc68u)	/* Overlay Mask Register 28 */
#define OVC2_OMASK29	(*( OVC0_OMASK0_type *) 0xf884fc74u)	/* Overlay Mask Register 29 */
#define OVC2_OMASK3	(*( OVC0_OMASK0_type *) 0xf884fb3cu)	/* Overlay Mask Register 3 */
#define OVC2_OMASK30	(*( OVC0_OMASK0_type *) 0xf884fc80u)	/* Overlay Mask Register 30 */
#define OVC2_OMASK31	(*( OVC0_OMASK0_type *) 0xf884fc8cu)	/* Overlay Mask Register 31 */
#define OVC2_OMASK4	(*( OVC0_OMASK0_type *) 0xf884fb48u)	/* Overlay Mask Register 4 */
#define OVC2_OMASK5	(*( OVC0_OMASK0_type *) 0xf884fb54u)	/* Overlay Mask Register 5 */
#define OVC2_OMASK6	(*( OVC0_OMASK0_type *) 0xf884fb60u)	/* Overlay Mask Register 6 */
#define OVC2_OMASK7	(*( OVC0_OMASK0_type *) 0xf884fb6cu)	/* Overlay Mask Register 7 */
#define OVC2_OMASK8	(*( OVC0_OMASK0_type *) 0xf884fb78u)	/* Overlay Mask Register 8 */
#define OVC2_OMASK9	(*( OVC0_OMASK0_type *) 0xf884fb84u)	/* Overlay Mask Register 9 */

