svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SHOVEN0        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN1        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN2        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN3        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN4        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN5        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN6        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN7        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN8        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN9        : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN10       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN11       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN12       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN13       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN14       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN15       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN16       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN17       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN18       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN19       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN20       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN21       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN22       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN23       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN24       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN25       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN26       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN27       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN28       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN29       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN30       : 1;	/* Shadow Overlay Enable x */
		unsigned int SHOVEN31       : 1;	/* Shadow Overlay Enable x */
	} B;
	int I;
	unsigned int U;

} OVC0_OSEL_type;
#define OVC0_OSEL	(*( OVC0_OSEL_type *) 0xf880fb00u)	/* Overlay Range Select Register */
#define OVC1_OSEL	(*( OVC0_OSEL_type *) 0xf882fb00u)	/* Overlay Range Select Register */
#define OVC2_OSEL	(*( OVC0_OSEL_type *) 0xf884fb00u)	/* Overlay Range Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int TBASE          : 23;	/* Target Base */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} OVC0_OTAR0_type;
#define OVC0_OTAR0	(*( OVC0_OTAR0_type *) 0xf880fb14u)	/* Overlay Target Address Register 0 */
#define OVC0_OTAR1	(*( OVC0_OTAR0_type *) 0xf880fb20u)	/* Overlay Target Address Register 1 */
#define OVC0_OTAR10	(*( OVC0_OTAR0_type *) 0xf880fb8cu)	/* Overlay Target Address Register 10 */
#define OVC0_OTAR11	(*( OVC0_OTAR0_type *) 0xf880fb98u)	/* Overlay Target Address Register 11 */
#define OVC0_OTAR12	(*( OVC0_OTAR0_type *) 0xf880fba4u)	/* Overlay Target Address Register 12 */
#define OVC0_OTAR13	(*( OVC0_OTAR0_type *) 0xf880fbb0u)	/* Overlay Target Address Register 13 */
#define OVC0_OTAR14	(*( OVC0_OTAR0_type *) 0xf880fbbcu)	/* Overlay Target Address Register 14 */
#define OVC0_OTAR15	(*( OVC0_OTAR0_type *) 0xf880fbc8u)	/* Overlay Target Address Register 15 */
#define OVC0_OTAR16	(*( OVC0_OTAR0_type *) 0xf880fbd4u)	/* Overlay Target Address Register 16 */
#define OVC0_OTAR17	(*( OVC0_OTAR0_type *) 0xf880fbe0u)	/* Overlay Target Address Register 17 */
#define OVC0_OTAR18	(*( OVC0_OTAR0_type *) 0xf880fbecu)	/* Overlay Target Address Register 18 */
#define OVC0_OTAR19	(*( OVC0_OTAR0_type *) 0xf880fbf8u)	/* Overlay Target Address Register 19 */
#define OVC0_OTAR2	(*( OVC0_OTAR0_type *) 0xf880fb2cu)	/* Overlay Target Address Register 2 */
#define OVC0_OTAR20	(*( OVC0_OTAR0_type *) 0xf880fc04u)	/* Overlay Target Address Register 20 */
#define OVC0_OTAR21	(*( OVC0_OTAR0_type *) 0xf880fc10u)	/* Overlay Target Address Register 21 */
#define OVC0_OTAR22	(*( OVC0_OTAR0_type *) 0xf880fc1cu)	/* Overlay Target Address Register 22 */
#define OVC0_OTAR23	(*( OVC0_OTAR0_type *) 0xf880fc28u)	/* Overlay Target Address Register 23 */
#define OVC0_OTAR24	(*( OVC0_OTAR0_type *) 0xf880fc34u)	/* Overlay Target Address Register 24 */
#define OVC0_OTAR25	(*( OVC0_OTAR0_type *) 0xf880fc40u)	/* Overlay Target Address Register 25 */
#define OVC0_OTAR26	(*( OVC0_OTAR0_type *) 0xf880fc4cu)	/* Overlay Target Address Register 26 */
#define OVC0_OTAR27	(*( OVC0_OTAR0_type *) 0xf880fc58u)	/* Overlay Target Address Register 27 */
#define OVC0_OTAR28	(*( OVC0_OTAR0_type *) 0xf880fc64u)	/* Overlay Target Address Register 28 */
#define OVC0_OTAR29	(*( OVC0_OTAR0_type *) 0xf880fc70u)	/* Overlay Target Address Register 29 */
#define OVC0_OTAR3	(*( OVC0_OTAR0_type *) 0xf880fb38u)	/* Overlay Target Address Register 3 */
#define OVC0_OTAR30	(*( OVC0_OTAR0_type *) 0xf880fc7cu)	/* Overlay Target Address Register 30 */
#define OVC0_OTAR31	(*( OVC0_OTAR0_type *) 0xf880fc88u)	/* Overlay Target Address Register 31 */
#define OVC0_OTAR4	(*( OVC0_OTAR0_type *) 0xf880fb44u)	/* Overlay Target Address Register 4 */
#define OVC0_OTAR5	(*( OVC0_OTAR0_type *) 0xf880fb50u)	/* Overlay Target Address Register 5 */
#define OVC0_OTAR6	(*( OVC0_OTAR0_type *) 0xf880fb5cu)	/* Overlay Target Address Register 6 */
#define OVC0_OTAR7	(*( OVC0_OTAR0_type *) 0xf880fb68u)	/* Overlay Target Address Register 7 */
#define OVC0_OTAR8	(*( OVC0_OTAR0_type *) 0xf880fb74u)	/* Overlay Target Address Register 8 */
#define OVC0_OTAR9	(*( OVC0_OTAR0_type *) 0xf880fb80u)	/* Overlay Target Address Register 9 */
#define OVC1_OTAR0	(*( OVC0_OTAR0_type *) 0xf882fb14u)	/* Overlay Target Address Register 0 */
#define OVC1_OTAR1	(*( OVC0_OTAR0_type *) 0xf882fb20u)	/* Overlay Target Address Register 1 */
#define OVC1_OTAR10	(*( OVC0_OTAR0_type *) 0xf882fb8cu)	/* Overlay Target Address Register 10 */
#define OVC1_OTAR11	(*( OVC0_OTAR0_type *) 0xf882fb98u)	/* Overlay Target Address Register 11 */
#define OVC1_OTAR12	(*( OVC0_OTAR0_type *) 0xf882fba4u)	/* Overlay Target Address Register 12 */
#define OVC1_OTAR13	(*( OVC0_OTAR0_type *) 0xf882fbb0u)	/* Overlay Target Address Register 13 */
#define OVC1_OTAR14	(*( OVC0_OTAR0_type *) 0xf882fbbcu)	/* Overlay Target Address Register 14 */
#define OVC1_OTAR15	(*( OVC0_OTAR0_type *) 0xf882fbc8u)	/* Overlay Target Address Register 15 */
#define OVC1_OTAR16	(*( OVC0_OTAR0_type *) 0xf882fbd4u)	/* Overlay Target Address Register 16 */
#define OVC1_OTAR17	(*( OVC0_OTAR0_type *) 0xf882fbe0u)	/* Overlay Target Address Register 17 */
#define OVC1_OTAR18	(*( OVC0_OTAR0_type *) 0xf882fbecu)	/* Overlay Target Address Register 18 */
#define OVC1_OTAR19	(*( OVC0_OTAR0_type *) 0xf882fbf8u)	/* Overlay Target Address Register 19 */
#define OVC1_OTAR2	(*( OVC0_OTAR0_type *) 0xf882fb2cu)	/* Overlay Target Address Register 2 */
#define OVC1_OTAR20	(*( OVC0_OTAR0_type *) 0xf882fc04u)	/* Overlay Target Address Register 20 */
#define OVC1_OTAR21	(*( OVC0_OTAR0_type *) 0xf882fc10u)	/* Overlay Target Address Register 21 */
#define OVC1_OTAR22	(*( OVC0_OTAR0_type *) 0xf882fc1cu)	/* Overlay Target Address Register 22 */
#define OVC1_OTAR23	(*( OVC0_OTAR0_type *) 0xf882fc28u)	/* Overlay Target Address Register 23 */
#define OVC1_OTAR24	(*( OVC0_OTAR0_type *) 0xf882fc34u)	/* Overlay Target Address Register 24 */
#define OVC1_OTAR25	(*( OVC0_OTAR0_type *) 0xf882fc40u)	/* Overlay Target Address Register 25 */
#define OVC1_OTAR26	(*( OVC0_OTAR0_type *) 0xf882fc4cu)	/* Overlay Target Address Register 26 */
#define OVC1_OTAR27	(*( OVC0_OTAR0_type *) 0xf882fc58u)	/* Overlay Target Address Register 27 */
#define OVC1_OTAR28	(*( OVC0_OTAR0_type *) 0xf882fc64u)	/* Overlay Target Address Register 28 */
#define OVC1_OTAR29	(*( OVC0_OTAR0_type *) 0xf882fc70u)	/* Overlay Target Address Register 29 */
#define OVC1_OTAR3	(*( OVC0_OTAR0_type *) 0xf882fb38u)	/* Overlay Target Address Register 3 */
#define OVC1_OTAR30	(*( OVC0_OTAR0_type *) 0xf882fc7cu)	/* Overlay Target Address Register 30 */
#define OVC1_OTAR31	(*( OVC0_OTAR0_type *) 0xf882fc88u)	/* Overlay Target Address Register 31 */
#define OVC1_OTAR4	(*( OVC0_OTAR0_type *) 0xf882fb44u)	/* Overlay Target Address Register 4 */
#define OVC1_OTAR5	(*( OVC0_OTAR0_type *) 0xf882fb50u)	/* Overlay Target Address Register 5 */
#define OVC1_OTAR6	(*( OVC0_OTAR0_type *) 0xf882fb5cu)	/* Overlay Target Address Register 6 */
#define OVC1_OTAR7	(*( OVC0_OTAR0_type *) 0xf882fb68u)	/* Overlay Target Address Register 7 */
#define OVC1_OTAR8	(*( OVC0_OTAR0_type *) 0xf882fb74u)	/* Overlay Target Address Register 8 */
#define OVC1_OTAR9	(*( OVC0_OTAR0_type *) 0xf882fb80u)	/* Overlay Target Address Register 9 */
#define OVC2_OTAR0	(*( OVC0_OTAR0_type *) 0xf884fb14u)	/* Overlay Target Address Register 0 */
#define OVC2_OTAR1	(*( OVC0_OTAR0_type *) 0xf884fb20u)	/* Overlay Target Address Register 1 */
#define OVC2_OTAR10	(*( OVC0_OTAR0_type *) 0xf884fb8cu)	/* Overlay Target Address Register 10 */
#define OVC2_OTAR11	(*( OVC0_OTAR0_type *) 0xf884fb98u)	/* Overlay Target Address Register 11 */
#define OVC2_OTAR12	(*( OVC0_OTAR0_type *) 0xf884fba4u)	/* Overlay Target Address Register 12 */
#define OVC2_OTAR13	(*( OVC0_OTAR0_type *) 0xf884fbb0u)	/* Overlay Target Address Register 13 */
#define OVC2_OTAR14	(*( OVC0_OTAR0_type *) 0xf884fbbcu)	/* Overlay Target Address Register 14 */
#define OVC2_OTAR15	(*( OVC0_OTAR0_type *) 0xf884fbc8u)	/* Overlay Target Address Register 15 */
#define OVC2_OTAR16	(*( OVC0_OTAR0_type *) 0xf884fbd4u)	/* Overlay Target Address Register 16 */
#define OVC2_OTAR17	(*( OVC0_OTAR0_type *) 0xf884fbe0u)	/* Overlay Target Address Register 17 */
#define OVC2_OTAR18	(*( OVC0_OTAR0_type *) 0xf884fbecu)	/* Overlay Target Address Register 18 */
#define OVC2_OTAR19	(*( OVC0_OTAR0_type *) 0xf884fbf8u)	/* Overlay Target Address Register 19 */
#define OVC2_OTAR2	(*( OVC0_OTAR0_type *) 0xf884fb2cu)	/* Overlay Target Address Register 2 */
#define OVC2_OTAR20	(*( OVC0_OTAR0_type *) 0xf884fc04u)	/* Overlay Target Address Register 20 */
#define OVC2_OTAR21	(*( OVC0_OTAR0_type *) 0xf884fc10u)	/* Overlay Target Address Register 21 */
#define OVC2_OTAR22	(*( OVC0_OTAR0_type *) 0xf884fc1cu)	/* Overlay Target Address Register 22 */
#define OVC2_OTAR23	(*( OVC0_OTAR0_type *) 0xf884fc28u)	/* Overlay Target Address Register 23 */
#define OVC2_OTAR24	(*( OVC0_OTAR0_type *) 0xf884fc34u)	/* Overlay Target Address Register 24 */
#define OVC2_OTAR25	(*( OVC0_OTAR0_type *) 0xf884fc40u)	/* Overlay Target Address Register 25 */
#define OVC2_OTAR26	(*( OVC0_OTAR0_type *) 0xf884fc4cu)	/* Overlay Target Address Register 26 */
#define OVC2_OTAR27	(*( OVC0_OTAR0_type *) 0xf884fc58u)	/* Overlay Target Address Register 27 */
#define OVC2_OTAR28	(*( OVC0_OTAR0_type *) 0xf884fc64u)	/* Overlay Target Address Register 28 */
#define OVC2_OTAR29	(*( OVC0_OTAR0_type *) 0xf884fc70u)	/* Overlay Target Address Register 29 */
#define OVC2_OTAR3	(*( OVC0_OTAR0_type *) 0xf884fb38u)	/* Overlay Target Address Register 3 */
#define OVC2_OTAR30	(*( OVC0_OTAR0_type *) 0xf884fc7cu)	/* Overlay Target Address Register 30 */
#define OVC2_OTAR31	(*( OVC0_OTAR0_type *) 0xf884fc88u)	/* Overlay Target Address Register 31 */
#define OVC2_OTAR4	(*( OVC0_OTAR0_type *) 0xf884fb44u)	/* Overlay Target Address Register 4 */
#define OVC2_OTAR5	(*( OVC0_OTAR0_type *) 0xf884fb50u)	/* Overlay Target Address Register 5 */
#define OVC2_OTAR6	(*( OVC0_OTAR0_type *) 0xf884fb5cu)	/* Overlay Target Address Register 6 */
#define OVC2_OTAR7	(*( OVC0_OTAR0_type *) 0xf884fb68u)	/* Overlay Target Address Register 7 */
#define OVC2_OTAR8	(*( OVC0_OTAR0_type *) 0xf884fb74u)	/* Overlay Target Address Register 8 */
#define OVC2_OTAR9	(*( OVC0_OTAR0_type *) 0xf884fb80u)	/* Overlay Target Address Register 9 */

