svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int OBASE          : 17;	/* Overlay Block Base Address */
		unsigned int                : 2;
		unsigned int OMEM           : 3;	/* Overlay Memory Select */
		unsigned int                : 4;
		unsigned int OVEN           : 1;	/* Overlay Enabled */
	} B;
	int I;
	unsigned int U;

} OVC0_RABR0_type;
#define OVC0_RABR0	(*( OVC0_RABR0_type *) 0xf880fb10u)	/* Redirected Address Base Register 0 */
#define OVC0_RABR1	(*( OVC0_RABR0_type *) 0xf880fb1cu)	/* Redirected Address Base Register 1 */
#define OVC0_RABR10	(*( OVC0_RABR0_type *) 0xf880fb88u)	/* Redirected Address Base Register 10 */
#define OVC0_RABR11	(*( OVC0_RABR0_type *) 0xf880fb94u)	/* Redirected Address Base Register 11 */
#define OVC0_RABR12	(*( OVC0_RABR0_type *) 0xf880fba0u)	/* Redirected Address Base Register 12 */
#define OVC0_RABR13	(*( OVC0_RABR0_type *) 0xf880fbacu)	/* Redirected Address Base Register 13 */
#define OVC0_RABR14	(*( OVC0_RABR0_type *) 0xf880fbb8u)	/* Redirected Address Base Register 14 */
#define OVC0_RABR15	(*( OVC0_RABR0_type *) 0xf880fbc4u)	/* Redirected Address Base Register 15 */
#define OVC0_RABR16	(*( OVC0_RABR0_type *) 0xf880fbd0u)	/* Redirected Address Base Register 16 */
#define OVC0_RABR17	(*( OVC0_RABR0_type *) 0xf880fbdcu)	/* Redirected Address Base Register 17 */
#define OVC0_RABR18	(*( OVC0_RABR0_type *) 0xf880fbe8u)	/* Redirected Address Base Register 18 */
#define OVC0_RABR19	(*( OVC0_RABR0_type *) 0xf880fbf4u)	/* Redirected Address Base Register 19 */
#define OVC0_RABR2	(*( OVC0_RABR0_type *) 0xf880fb28u)	/* Redirected Address Base Register 2 */
#define OVC0_RABR20	(*( OVC0_RABR0_type *) 0xf880fc00u)	/* Redirected Address Base Register 20 */
#define OVC0_RABR21	(*( OVC0_RABR0_type *) 0xf880fc0cu)	/* Redirected Address Base Register 21 */
#define OVC0_RABR22	(*( OVC0_RABR0_type *) 0xf880fc18u)	/* Redirected Address Base Register 22 */
#define OVC0_RABR23	(*( OVC0_RABR0_type *) 0xf880fc24u)	/* Redirected Address Base Register 23 */
#define OVC0_RABR24	(*( OVC0_RABR0_type *) 0xf880fc30u)	/* Redirected Address Base Register 24 */
#define OVC0_RABR25	(*( OVC0_RABR0_type *) 0xf880fc3cu)	/* Redirected Address Base Register 25 */
#define OVC0_RABR26	(*( OVC0_RABR0_type *) 0xf880fc48u)	/* Redirected Address Base Register 26 */
#define OVC0_RABR27	(*( OVC0_RABR0_type *) 0xf880fc54u)	/* Redirected Address Base Register 27 */
#define OVC0_RABR28	(*( OVC0_RABR0_type *) 0xf880fc60u)	/* Redirected Address Base Register 28 */
#define OVC0_RABR29	(*( OVC0_RABR0_type *) 0xf880fc6cu)	/* Redirected Address Base Register 29 */
#define OVC0_RABR3	(*( OVC0_RABR0_type *) 0xf880fb34u)	/* Redirected Address Base Register 3 */
#define OVC0_RABR30	(*( OVC0_RABR0_type *) 0xf880fc78u)	/* Redirected Address Base Register 30 */
#define OVC0_RABR31	(*( OVC0_RABR0_type *) 0xf880fc84u)	/* Redirected Address Base Register 31 */
#define OVC0_RABR4	(*( OVC0_RABR0_type *) 0xf880fb40u)	/* Redirected Address Base Register 4 */
#define OVC0_RABR5	(*( OVC0_RABR0_type *) 0xf880fb4cu)	/* Redirected Address Base Register 5 */
#define OVC0_RABR6	(*( OVC0_RABR0_type *) 0xf880fb58u)	/* Redirected Address Base Register 6 */
#define OVC0_RABR7	(*( OVC0_RABR0_type *) 0xf880fb64u)	/* Redirected Address Base Register 7 */
#define OVC0_RABR8	(*( OVC0_RABR0_type *) 0xf880fb70u)	/* Redirected Address Base Register 8 */
#define OVC0_RABR9	(*( OVC0_RABR0_type *) 0xf880fb7cu)	/* Redirected Address Base Register 9 */
#define OVC1_RABR0	(*( OVC0_RABR0_type *) 0xf882fb10u)	/* Redirected Address Base Register 0 */
#define OVC1_RABR1	(*( OVC0_RABR0_type *) 0xf882fb1cu)	/* Redirected Address Base Register 1 */
#define OVC1_RABR10	(*( OVC0_RABR0_type *) 0xf882fb88u)	/* Redirected Address Base Register 10 */
#define OVC1_RABR11	(*( OVC0_RABR0_type *) 0xf882fb94u)	/* Redirected Address Base Register 11 */
#define OVC1_RABR12	(*( OVC0_RABR0_type *) 0xf882fba0u)	/* Redirected Address Base Register 12 */
#define OVC1_RABR13	(*( OVC0_RABR0_type *) 0xf882fbacu)	/* Redirected Address Base Register 13 */
#define OVC1_RABR14	(*( OVC0_RABR0_type *) 0xf882fbb8u)	/* Redirected Address Base Register 14 */
#define OVC1_RABR15	(*( OVC0_RABR0_type *) 0xf882fbc4u)	/* Redirected Address Base Register 15 */
#define OVC1_RABR16	(*( OVC0_RABR0_type *) 0xf882fbd0u)	/* Redirected Address Base Register 16 */
#define OVC1_RABR17	(*( OVC0_RABR0_type *) 0xf882fbdcu)	/* Redirected Address Base Register 17 */
#define OVC1_RABR18	(*( OVC0_RABR0_type *) 0xf882fbe8u)	/* Redirected Address Base Register 18 */
#define OVC1_RABR19	(*( OVC0_RABR0_type *) 0xf882fbf4u)	/* Redirected Address Base Register 19 */
#define OVC1_RABR2	(*( OVC0_RABR0_type *) 0xf882fb28u)	/* Redirected Address Base Register 2 */
#define OVC1_RABR20	(*( OVC0_RABR0_type *) 0xf882fc00u)	/* Redirected Address Base Register 20 */
#define OVC1_RABR21	(*( OVC0_RABR0_type *) 0xf882fc0cu)	/* Redirected Address Base Register 21 */
#define OVC1_RABR22	(*( OVC0_RABR0_type *) 0xf882fc18u)	/* Redirected Address Base Register 22 */
#define OVC1_RABR23	(*( OVC0_RABR0_type *) 0xf882fc24u)	/* Redirected Address Base Register 23 */
#define OVC1_RABR24	(*( OVC0_RABR0_type *) 0xf882fc30u)	/* Redirected Address Base Register 24 */
#define OVC1_RABR25	(*( OVC0_RABR0_type *) 0xf882fc3cu)	/* Redirected Address Base Register 25 */
#define OVC1_RABR26	(*( OVC0_RABR0_type *) 0xf882fc48u)	/* Redirected Address Base Register 26 */
#define OVC1_RABR27	(*( OVC0_RABR0_type *) 0xf882fc54u)	/* Redirected Address Base Register 27 */
#define OVC1_RABR28	(*( OVC0_RABR0_type *) 0xf882fc60u)	/* Redirected Address Base Register 28 */
#define OVC1_RABR29	(*( OVC0_RABR0_type *) 0xf882fc6cu)	/* Redirected Address Base Register 29 */
#define OVC1_RABR3	(*( OVC0_RABR0_type *) 0xf882fb34u)	/* Redirected Address Base Register 3 */
#define OVC1_RABR30	(*( OVC0_RABR0_type *) 0xf882fc78u)	/* Redirected Address Base Register 30 */
#define OVC1_RABR31	(*( OVC0_RABR0_type *) 0xf882fc84u)	/* Redirected Address Base Register 31 */
#define OVC1_RABR4	(*( OVC0_RABR0_type *) 0xf882fb40u)	/* Redirected Address Base Register 4 */
#define OVC1_RABR5	(*( OVC0_RABR0_type *) 0xf882fb4cu)	/* Redirected Address Base Register 5 */
#define OVC1_RABR6	(*( OVC0_RABR0_type *) 0xf882fb58u)	/* Redirected Address Base Register 6 */
#define OVC1_RABR7	(*( OVC0_RABR0_type *) 0xf882fb64u)	/* Redirected Address Base Register 7 */
#define OVC1_RABR8	(*( OVC0_RABR0_type *) 0xf882fb70u)	/* Redirected Address Base Register 8 */
#define OVC1_RABR9	(*( OVC0_RABR0_type *) 0xf882fb7cu)	/* Redirected Address Base Register 9 */
#define OVC2_RABR0	(*( OVC0_RABR0_type *) 0xf884fb10u)	/* Redirected Address Base Register 0 */
#define OVC2_RABR1	(*( OVC0_RABR0_type *) 0xf884fb1cu)	/* Redirected Address Base Register 1 */
#define OVC2_RABR10	(*( OVC0_RABR0_type *) 0xf884fb88u)	/* Redirected Address Base Register 10 */
#define OVC2_RABR11	(*( OVC0_RABR0_type *) 0xf884fb94u)	/* Redirected Address Base Register 11 */
#define OVC2_RABR12	(*( OVC0_RABR0_type *) 0xf884fba0u)	/* Redirected Address Base Register 12 */
#define OVC2_RABR13	(*( OVC0_RABR0_type *) 0xf884fbacu)	/* Redirected Address Base Register 13 */
#define OVC2_RABR14	(*( OVC0_RABR0_type *) 0xf884fbb8u)	/* Redirected Address Base Register 14 */
#define OVC2_RABR15	(*( OVC0_RABR0_type *) 0xf884fbc4u)	/* Redirected Address Base Register 15 */
#define OVC2_RABR16	(*( OVC0_RABR0_type *) 0xf884fbd0u)	/* Redirected Address Base Register 16 */
#define OVC2_RABR17	(*( OVC0_RABR0_type *) 0xf884fbdcu)	/* Redirected Address Base Register 17 */
#define OVC2_RABR18	(*( OVC0_RABR0_type *) 0xf884fbe8u)	/* Redirected Address Base Register 18 */
#define OVC2_RABR19	(*( OVC0_RABR0_type *) 0xf884fbf4u)	/* Redirected Address Base Register 19 */
#define OVC2_RABR2	(*( OVC0_RABR0_type *) 0xf884fb28u)	/* Redirected Address Base Register 2 */
#define OVC2_RABR20	(*( OVC0_RABR0_type *) 0xf884fc00u)	/* Redirected Address Base Register 20 */
#define OVC2_RABR21	(*( OVC0_RABR0_type *) 0xf884fc0cu)	/* Redirected Address Base Register 21 */
#define OVC2_RABR22	(*( OVC0_RABR0_type *) 0xf884fc18u)	/* Redirected Address Base Register 22 */
#define OVC2_RABR23	(*( OVC0_RABR0_type *) 0xf884fc24u)	/* Redirected Address Base Register 23 */
#define OVC2_RABR24	(*( OVC0_RABR0_type *) 0xf884fc30u)	/* Redirected Address Base Register 24 */
#define OVC2_RABR25	(*( OVC0_RABR0_type *) 0xf884fc3cu)	/* Redirected Address Base Register 25 */
#define OVC2_RABR26	(*( OVC0_RABR0_type *) 0xf884fc48u)	/* Redirected Address Base Register 26 */
#define OVC2_RABR27	(*( OVC0_RABR0_type *) 0xf884fc54u)	/* Redirected Address Base Register 27 */
#define OVC2_RABR28	(*( OVC0_RABR0_type *) 0xf884fc60u)	/* Redirected Address Base Register 28 */
#define OVC2_RABR29	(*( OVC0_RABR0_type *) 0xf884fc6cu)	/* Redirected Address Base Register 29 */
#define OVC2_RABR3	(*( OVC0_RABR0_type *) 0xf884fb34u)	/* Redirected Address Base Register 3 */
#define OVC2_RABR30	(*( OVC0_RABR0_type *) 0xf884fc78u)	/* Redirected Address Base Register 30 */
#define OVC2_RABR31	(*( OVC0_RABR0_type *) 0xf884fc84u)	/* Redirected Address Base Register 31 */
#define OVC2_RABR4	(*( OVC0_RABR0_type *) 0xf884fb40u)	/* Redirected Address Base Register 4 */
#define OVC2_RABR5	(*( OVC0_RABR0_type *) 0xf884fb4cu)	/* Redirected Address Base Register 5 */
#define OVC2_RABR6	(*( OVC0_RABR0_type *) 0xf884fb58u)	/* Redirected Address Base Register 6 */
#define OVC2_RABR7	(*( OVC0_RABR0_type *) 0xf884fb64u)	/* Redirected Address Base Register 7 */
#define OVC2_RABR8	(*( OVC0_RABR0_type *) 0xf884fb70u)	/* Redirected Address Base Register 8 */
#define OVC2_RABR9	(*( OVC0_RABR0_type *) 0xf884fb7cu)	/* Redirected Address Base Register 9 */


/* Ports */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} P00_ACCEN0_type;
