svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define P00_ACCEN0	(*( P00_ACCEN0_type *) 0xf003a0fcu)	/* Port 00 Access Enable Register 0 */
#define P01_ACCEN0	(*( P00_ACCEN0_type *) 0xf003a1fcu)	/* Port 01 Access Enable Register 0 */
#define P02_ACCEN0	(*( P00_ACCEN0_type *) 0xf003a2fcu)	/* Port 02 Access Enable Register 0 */
#define P10_ACCEN0	(*( P00_ACCEN0_type *) 0xf003b0fcu)	/* Port 10 Access Enable Register 0 */
#define P11_ACCEN0	(*( P00_ACCEN0_type *) 0xf003b1fcu)	/* Port 11 Access Enable Register 0 */
#define P12_ACCEN0	(*( P00_ACCEN0_type *) 0xf003b2fcu)	/* Port 12 Access Enable Register 0 */
#define P13_ACCEN0	(*( P00_ACCEN0_type *) 0xf003b3fcu)	/* Port 13 Access Enable Register 0 */
#define P14_ACCEN0	(*( P00_ACCEN0_type *) 0xf003b4fcu)	/* Port 14 Access Enable Register 0 */
#define P15_ACCEN0	(*( P00_ACCEN0_type *) 0xf003b5fcu)	/* Port 15 Access Enable Register 0 */
#define P20_ACCEN0	(*( P00_ACCEN0_type *) 0xf003c0fcu)	/* Port 20 Access Enable Register 0 */
#define P21_ACCEN0	(*( P00_ACCEN0_type *) 0xf003c1fcu)	/* Port 21 Access Enable Register 0 */
#define P22_ACCEN0	(*( P00_ACCEN0_type *) 0xf003c2fcu)	/* Port 22 Access Enable Register 0 */
#define P23_ACCEN0	(*( P00_ACCEN0_type *) 0xf003c3fcu)	/* Port 23 Access Enable Register 0 */
#define P32_ACCEN0	(*( P00_ACCEN0_type *) 0xf003d2fcu)	/* Port 32 Access Enable Register 0 */
#define P33_ACCEN0	(*( P00_ACCEN0_type *) 0xf003d3fcu)	/* Port 33 Access Enable Register 0 */
#define P34_ACCEN0	(*( P00_ACCEN0_type *) 0xf003d4fcu)	/* Port 34 Access Enable Register 0 */
#define P40_ACCEN0	(*( P00_ACCEN0_type *) 0xf003e0fcu)	/* Port 40 Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P00_ACCEN1_type;
#define P00_ACCEN1	(*( P00_ACCEN1_type *) 0xf003a0f8u)	/* Port 00 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN1            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN2            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN3            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN4            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN5            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN6            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN7            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN8            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN9            : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN10           : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN11           : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN12           : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN13           : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN14           : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int EN15           : 1;	/* Emergency Stop Enable for Port n Pin x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P00_ESR_type;
#define P00_ESR	(*( P00_ESR_type *) 0xf003a050u)	/* Port 00 Emergency Stop Register */
#define P01_ESR	(*( P00_ESR_type *) 0xf003a150u)	/* Port 01 Emergency Stop Register */
#define P02_ESR	(*( P00_ESR_type *) 0xf003a250u)	/* Port 02 Emergency Stop Register */
#define P10_ESR	(*( P00_ESR_type *) 0xf003b050u)	/* Port 10 Emergency Stop Register */
#define P11_ESR	(*( P00_ESR_type *) 0xf003b150u)	/* Port 11 Emergency Stop Register */
#define P12_ESR	(*( P00_ESR_type *) 0xf003b250u)	/* Port 12 Emergency Stop Register */
#define P13_ESR	(*( P00_ESR_type *) 0xf003b350u)	/* Port 13 Emergency Stop Register */
#define P14_ESR	(*( P00_ESR_type *) 0xf003b450u)	/* Port 14 Emergency Stop Register */
#define P15_ESR	(*( P00_ESR_type *) 0xf003b550u)	/* Port 15 Emergency Stop Register */
#define P20_ESR	(*( P00_ESR_type *) 0xf003c050u)	/* Port 20 Emergency Stop Register */
#define P21_ESR	(*( P00_ESR_type *) 0xf003c150u)	/* Port 21 Emergency Stop Register */
#define P22_ESR	(*( P00_ESR_type *) 0xf003c250u)	/* Port 22 Emergency Stop Register */
#define P23_ESR	(*( P00_ESR_type *) 0xf003c350u)	/* Port 23 Emergency Stop Register */
#define P32_ESR	(*( P00_ESR_type *) 0xf003d250u)	/* Port 32 Emergency Stop Register */
#define P33_ESR	(*( P00_ESR_type *) 0xf003d350u)	/* Port 33 Emergency Stop Register */
#define P34_ESR	(*( P00_ESR_type *) 0xf003d450u)	/* Port 34 Emergency Stop Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} P00_ID_type;
#define P00_ID	(*( P00_ID_type *) 0xf003a008u)	/* Identification Register */
#define P01_ID	(*( P00_ID_type *) 0xf003a108u)	/* Identification Register */
#define P02_ID	(*( P00_ID_type *) 0xf003a208u)	/* Identification Register */
#define P10_ID	(*( P00_ID_type *) 0xf003b008u)	/* Identification Register */
#define P11_ID	(*( P00_ID_type *) 0xf003b108u)	/* Identification Register */
#define P12_ID	(*( P00_ID_type *) 0xf003b208u)	/* Identification Register */
#define P13_ID	(*( P00_ID_type *) 0xf003b308u)	/* Identification Register */
#define P14_ID	(*( P00_ID_type *) 0xf003b408u)	/* Identification Register */
#define P15_ID	(*( P00_ID_type *) 0xf003b508u)	/* Identification Register */
#define P20_ID	(*( P00_ID_type *) 0xf003c008u)	/* Identification Register */
#define P21_ID	(*( P00_ID_type *) 0xf003c108u)	/* Identification Register */
#define P22_ID	(*( P00_ID_type *) 0xf003c208u)	/* Identification Register */
#define P23_ID	(*( P00_ID_type *) 0xf003c308u)	/* Identification Register */
#define P32_ID	(*( P00_ID_type *) 0xf003d208u)	/* Identification Register */
#define P33_ID	(*( P00_ID_type *) 0xf003d308u)	/* Identification Register */
#define P34_ID	(*( P00_ID_type *) 0xf003d408u)	/* Identification Register */
#define P40_ID	(*( P00_ID_type *) 0xf003e008u)	/* Identification Register */

