svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int P0             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P1             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P2             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P3             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P4             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P5             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P6             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P7             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P8             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P9             : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P10            : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P11            : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P12            : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P13            : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P14            : 1;	/* Port n Input Bit x */
		/* const */ unsigned int P15            : 1;	/* Port n Input Bit x */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P00_IN_type;
#define P00_IN	(*( P00_IN_type *) 0xf003a024u)	/* Port 00 Input Register */
#define P01_IN	(*( P00_IN_type *) 0xf003a124u)	/* Port 01 Input Register */
#define P02_IN	(*( P00_IN_type *) 0xf003a224u)	/* Port 02 Input Register */
#define P10_IN	(*( P00_IN_type *) 0xf003b024u)	/* Port 10 Input Register */
#define P11_IN	(*( P00_IN_type *) 0xf003b124u)	/* Port 11 Input Register */
#define P12_IN	(*( P00_IN_type *) 0xf003b224u)	/* Port 12 Input Register */
#define P13_IN	(*( P00_IN_type *) 0xf003b324u)	/* Port 13 Input Register */
#define P14_IN	(*( P00_IN_type *) 0xf003b424u)	/* Port 14 Input Register */
#define P15_IN	(*( P00_IN_type *) 0xf003b524u)	/* Port 15 Input Register */
#define P20_IN	(*( P00_IN_type *) 0xf003c024u)	/* Port 20 Input Register */
#define P21_IN	(*( P00_IN_type *) 0xf003c124u)	/* Port 21 Input Register */
#define P22_IN	(*( P00_IN_type *) 0xf003c224u)	/* Port 22 Input Register */
#define P23_IN	(*( P00_IN_type *) 0xf003c324u)	/* Port 23 Input Register */
#define P32_IN	(*( P00_IN_type *) 0xf003d224u)	/* Port 32 Input Register */
#define P33_IN	(*( P00_IN_type *) 0xf003d324u)	/* Port 33 Input Register */
#define P34_IN	(*( P00_IN_type *) 0xf003d424u)	/* Port 34 Input Register */
#define P40_IN	(*( P00_IN_type *) 0xf003e024u)	/* Port 40 Input Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Port Control for Port n Pin 0 to 3 */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Port Control for Port n Pin 0 to 3 */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Port Control for Port n Pin 0 to 3 */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Port Control for Port n Pin 0 to 3 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Port Control for Port n Pin 0 to 3 */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Port Control for Port n Pin 0 to 3 */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Port Control for Port n Pin 0 to 3 */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Port Control for Port n Pin 0 to 3 */
	} B2;
	int I;
	unsigned int U;

} P00_IOCR0_type;
#define P00_IOCR0	(*( P00_IOCR0_type *) 0xf003a010u)	/* Port 00 Input/Output Control Register 0 */
#define P02_IOCR0	(*( P00_IOCR0_type *) 0xf003a210u)	/* Port 02 Input/Output Control Register 0 */
#define P10_IOCR0	(*( P00_IOCR0_type *) 0xf003b010u)	/* Port 10 Input/Output Control Register 0 */
#define P11_IOCR0	(*( P00_IOCR0_type *) 0xf003b110u)	/* Port 11 Input/Output Control Register 0 */
#define P13_IOCR0	(*( P00_IOCR0_type *) 0xf003b310u)	/* Port 13 Input/Output Control Register 0 */
#define P14_IOCR0	(*( P00_IOCR0_type *) 0xf003b410u)	/* Port 14 Input/Output Control Register 0 */
#define P15_IOCR0	(*( P00_IOCR0_type *) 0xf003b510u)	/* Port 15 Input/Output Control Register 0 */
#define P20_IOCR0	(*( P00_IOCR0_type *) 0xf003c010u)	/* Port 20 Input/Output Control Register 0 */
#define P21_IOCR0	(*( P00_IOCR0_type *) 0xf003c110u)	/* Port 21 Input/Output Control Register 0 */
#define P22_IOCR0	(*( P00_IOCR0_type *) 0xf003c210u)	/* Port 22 Input/Output Control Register 0 */
#define P23_IOCR0	(*( P00_IOCR0_type *) 0xf003c310u)	/* Port 23 Input/Output Control Register 0 */
#define P33_IOCR0	(*( P00_IOCR0_type *) 0xf003d310u)	/* Port 33 Input/Output Control Register 0 */
#define P34_IOCR0	(*( P00_IOCR0_type *) 0xf003d410u)	/* Port 34 Input/Output Control Register 0 */
#define P40_IOCR0	(*( P00_IOCR0_type *) 0xf003e010u)	/* Port 40 Input/Output Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC12           : 5;	/* Port Control for Port 00.12 */
		unsigned int                : 3;
		unsigned int PC13           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC14           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC15           : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC12           : 5;	/* Port Control for Port 00.12 */
		unsigned int                : 3;
		unsigned int PC13           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC14           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC15           : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P00_IOCR12_type;
#define P00_IOCR12	(*( P00_IOCR12_type *) 0xf003a01cu)	/* Port 00 Input/Output Control Register 12 */

