svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC4            : 5;	/* Port Control for Port n Pin 4 to 7 */
		unsigned int                : 3;
		unsigned int PC5            : 5;	/* Port Control for Port n Pin 4 to 7 */
		unsigned int                : 3;
		unsigned int PC6            : 5;	/* Port Control for Port n Pin 4 to 7 */
		unsigned int                : 3;
		unsigned int PC7            : 5;	/* Port Control for Port n Pin 4 to 7 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC4            : 5;	/* Port Control for Port n Pin 4 to 7 */
		unsigned int                : 3;
		unsigned int PC5            : 5;	/* Port Control for Port n Pin 4 to 7 */
		unsigned int                : 3;
		unsigned int PC6            : 5;	/* Port Control for Port n Pin 4 to 7 */
		unsigned int                : 3;
		unsigned int PC7            : 5;	/* Port Control for Port n Pin 4 to 7 */
	} B2;
	int I;
	unsigned int U;

} P00_IOCR4_type;
#define P00_IOCR4	(*( P00_IOCR4_type *) 0xf003a014u)	/* Port 00 Input/Output Control Register 4 */
#define P01_IOCR4	(*( P00_IOCR4_type *) 0xf003a114u)	/* Port 01 Input/Output Control Register 4 */
#define P02_IOCR4	(*( P00_IOCR4_type *) 0xf003a214u)	/* Port 02 Input/Output Control Register 4 */
#define P10_IOCR4	(*( P00_IOCR4_type *) 0xf003b014u)	/* Port 10 Input/Output Control Register 4 */
#define P11_IOCR4	(*( P00_IOCR4_type *) 0xf003b114u)	/* Port 11 Input/Output Control Register 4 */
#define P14_IOCR4	(*( P00_IOCR4_type *) 0xf003b414u)	/* Port 14 Input/Output Control Register 4 */
#define P15_IOCR4	(*( P00_IOCR4_type *) 0xf003b514u)	/* Port 15 Input/Output Control Register 4 */
#define P21_IOCR4	(*( P00_IOCR4_type *) 0xf003c114u)	/* Port 21 Input/Output Control Register 4 */
#define P22_IOCR4	(*( P00_IOCR4_type *) 0xf003c214u)	/* Port 22 Input/Output Control Register 4 */
#define P23_IOCR4	(*( P00_IOCR4_type *) 0xf003c314u)	/* Port 23 Input/Output Control Register 4 */
#define P32_IOCR4	(*( P00_IOCR4_type *) 0xf003d214u)	/* Port 32 Input/Output Control Register 4 */
#define P33_IOCR4	(*( P00_IOCR4_type *) 0xf003d314u)	/* Port 33 Input/Output Control Register 4 */
#define P40_IOCR4	(*( P00_IOCR4_type *) 0xf003e014u)	/* Port 40 Input/Output Control Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port n Pin 8 to 11 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Port Control for Port n Pin 8 to 11 */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Port Control for Port n Pin 8 to 11 */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Port Control for Port n Pin 8 to 11 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port n Pin 8 to 11 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Port Control for Port n Pin 8 to 11 */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Port Control for Port n Pin 8 to 11 */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Port Control for Port n Pin 8 to 11 */
	} B2;
	int I;
	unsigned int U;

} P00_IOCR8_type;
#define P00_IOCR8	(*( P00_IOCR8_type *) 0xf003a018u)	/* Port 00 Input/Output Control Register 8 */
#define P02_IOCR8	(*( P00_IOCR8_type *) 0xf003a218u)	/* Port 02 Input/Output Control Register 8 */
#define P11_IOCR8	(*( P00_IOCR8_type *) 0xf003b118u)	/* Port 11 Input/Output Control Register 8 */
#define P20_IOCR8	(*( P00_IOCR8_type *) 0xf003c018u)	/* Port 20 Input/Output Control Register 8 */
#define P22_IOCR8	(*( P00_IOCR8_type *) 0xf003c218u)	/* Port 22 Input/Output Control Register 8 */
#define P33_IOCR8	(*( P00_IOCR8_type *) 0xf003d318u)	/* Port 33 Input/Output Control Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int PCL0           : 1;	/* Port n Clear Bit x */
		unsigned int PCL1           : 1;	/* Port n Clear Bit x */
		unsigned int PCL2           : 1;	/* Port n Clear Bit x */
		unsigned int PCL3           : 1;	/* Port n Clear Bit x */
		unsigned int PCL4           : 1;	/* Port n Clear Bit x */
		unsigned int PCL5           : 1;	/* Port n Clear Bit x */
		unsigned int PCL6           : 1;	/* Port n Clear Bit x */
		unsigned int PCL7           : 1;	/* Port n Clear Bit x */
		unsigned int PCL8           : 1;	/* Port n Clear Bit x */
		unsigned int PCL9           : 1;	/* Port n Clear Bit x */
		unsigned int PCL10          : 1;	/* Port n Clear Bit x */
		unsigned int PCL11          : 1;	/* Port n Clear Bit x */
		unsigned int PCL12          : 1;	/* Port n Clear Bit x */
		unsigned int PCL13          : 1;	/* Port n Clear Bit x */
		unsigned int PCL14          : 1;	/* Port n Clear Bit x */
		unsigned int PCL15          : 1;	/* Port n Clear Bit x */
	} B;
	int I;
	unsigned int U;

} P00_OMCR_type;
#define P00_OMCR	(*( P00_OMCR_type *) 0xf003a094u)	/* Port 00 Output Modification Clear Register */
#define P01_OMCR	(*( P00_OMCR_type *) 0xf003a194u)	/* Port 01 Output Modification Clear Register */
#define P02_OMCR	(*( P00_OMCR_type *) 0xf003a294u)	/* Port 02 Output Modification Clear Register */
#define P10_OMCR	(*( P00_OMCR_type *) 0xf003b094u)	/* Port 10 Output Modification Clear Register */
#define P11_OMCR	(*( P00_OMCR_type *) 0xf003b194u)	/* Port 11 Output Modification Clear Register */
#define P12_OMCR	(*( P00_OMCR_type *) 0xf003b294u)	/* Port 12 Output Modification Clear Register */
#define P13_OMCR	(*( P00_OMCR_type *) 0xf003b394u)	/* Port 13 Output Modification Clear Register */
#define P14_OMCR	(*( P00_OMCR_type *) 0xf003b494u)	/* Port 14 Output Modification Clear Register */
#define P15_OMCR	(*( P00_OMCR_type *) 0xf003b594u)	/* Port 15 Output Modification Clear Register */
#define P20_OMCR	(*( P00_OMCR_type *) 0xf003c094u)	/* Port 20 Output Modification Clear Register */
#define P21_OMCR	(*( P00_OMCR_type *) 0xf003c194u)	/* Port 21 Output Modification Clear Register */
#define P22_OMCR	(*( P00_OMCR_type *) 0xf003c294u)	/* Port 22 Output Modification Clear Register */
#define P23_OMCR	(*( P00_OMCR_type *) 0xf003c394u)	/* Port 23 Output Modification Clear Register */
#define P32_OMCR	(*( P00_OMCR_type *) 0xf003d294u)	/* Port 32 Output Modification Clear Register */
#define P33_OMCR	(*( P00_OMCR_type *) 0xf003d394u)	/* Port 33 Output Modification Clear Register */
#define P34_OMCR	(*( P00_OMCR_type *) 0xf003d494u)	/* Port 34 Output Modification Clear Register */

