svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int PCL0           : 1;	/* Port n Clear Bit x */
		unsigned int PCL1           : 1;	/* Port n Clear Bit x */
		unsigned int PCL2           : 1;	/* Port n Clear Bit x */
		unsigned int PCL3           : 1;	/* Port n Clear Bit x */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} P00_OMCR0_type;
#define P00_OMCR0	(*( P00_OMCR0_type *) 0xf003a080u)	/* Port 00 Output Modification Clear Register 0 */
#define P01_OMCR0	(*( P00_OMCR0_type *) 0xf003a180u)	/* Port 01 Output Modification Clear Register 0 */
#define P02_OMCR0	(*( P00_OMCR0_type *) 0xf003a280u)	/* Port 02 Output Modification Clear Register 0 */
#define P10_OMCR0	(*( P00_OMCR0_type *) 0xf003b080u)	/* Port 10 Output Modification Clear Register 0 */
#define P11_OMCR0	(*( P00_OMCR0_type *) 0xf003b180u)	/* Port 11 Output Modification Clear Register 0 */
#define P12_OMCR0	(*( P00_OMCR0_type *) 0xf003b280u)	/* Port 12 Output Modification Clear Register 0 */
#define P13_OMCR0	(*( P00_OMCR0_type *) 0xf003b380u)	/* Port 13 Output Modification Clear Register 0 */
#define P14_OMCR0	(*( P00_OMCR0_type *) 0xf003b480u)	/* Port 14 Output Modification Clear Register 0 */
#define P15_OMCR0	(*( P00_OMCR0_type *) 0xf003b580u)	/* Port 15 Output Modification Clear Register 0 */
#define P20_OMCR0	(*( P00_OMCR0_type *) 0xf003c080u)	/* Port 20 Output Modification Clear Register 0 */
#define P21_OMCR0	(*( P00_OMCR0_type *) 0xf003c180u)	/* Port 21 Output Modification Clear Register 0 */
#define P22_OMCR0	(*( P00_OMCR0_type *) 0xf003c280u)	/* Port 22 Output Modification Clear Register 0 */
#define P23_OMCR0	(*( P00_OMCR0_type *) 0xf003c380u)	/* Port 23 Output Modification Clear Register 0 */
#define P32_OMCR0	(*( P00_OMCR0_type *) 0xf003d280u)	/* Port 32 Output Modification Clear Register 0 */
#define P33_OMCR0	(*( P00_OMCR0_type *) 0xf003d380u)	/* Port 33 Output Modification Clear Register 0 */
#define P34_OMCR0	(*( P00_OMCR0_type *) 0xf003d480u)	/* Port 34 Output Modification Clear Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 28;
		unsigned int PCL12          : 1;	/* Port n Clear Bit x */
		unsigned int PCL13          : 1;	/* Port n Clear Bit x */
		unsigned int PCL14          : 1;	/* Port n Clear Bit x */
		unsigned int PCL15          : 1;	/* Port n Clear Bit x */
	} B;
	int I;
	unsigned int U;

} P00_OMCR12_type;
#define P00_OMCR12	(*( P00_OMCR12_type *) 0xf003a08cu)	/* Port 00 Output Modification Clear Register 12 */
#define P11_OMCR12	(*( P00_OMCR12_type *) 0xf003b18cu)	/* Port 11 Output Modification Clear Register 12 */
#define P20_OMCR12	(*( P00_OMCR12_type *) 0xf003c08cu)	/* Port 20 Output Modification Clear Register 12 */
#define P33_OMCR12	(*( P00_OMCR12_type *) 0xf003d38cu)	/* Port 33 Output Modification Clear Register 12 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 20;
		unsigned int PCL4           : 1;	/* Port n Clear Bit x */
		unsigned int PCL5           : 1;	/* Port n Clear Bit x */
		unsigned int PCL6           : 1;	/* Port n Clear Bit x */
		unsigned int PCL7           : 1;	/* Port n Clear Bit x */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} P00_OMCR4_type;
#define P00_OMCR4	(*( P00_OMCR4_type *) 0xf003a084u)	/* Port 00 Output Modification Clear Register 4 */
#define P01_OMCR4	(*( P00_OMCR4_type *) 0xf003a184u)	/* Port 01 Output Modification Clear Register 4 */
#define P02_OMCR4	(*( P00_OMCR4_type *) 0xf003a284u)	/* Port 02 Output Modification Clear Register 4 */
#define P10_OMCR4	(*( P00_OMCR4_type *) 0xf003b084u)	/* Port 10 Output Modification Clear Register 4 */
#define P11_OMCR4	(*( P00_OMCR4_type *) 0xf003b184u)	/* Port 11 Output Modification Clear Register 4 */
#define P14_OMCR4	(*( P00_OMCR4_type *) 0xf003b484u)	/* Port 14 Output Modification Clear Register 4 */
#define P15_OMCR4	(*( P00_OMCR4_type *) 0xf003b584u)	/* Port 15 Output Modification Clear Register 4 */
#define P20_OMCR4	(*( P00_OMCR4_type *) 0xf003c084u)	/* Port 20 Output Modification Clear Register 4 */
#define P21_OMCR4	(*( P00_OMCR4_type *) 0xf003c184u)	/* Port 21 Output Modification Clear Register 4 */
#define P22_OMCR4	(*( P00_OMCR4_type *) 0xf003c284u)	/* Port 22 Output Modification Clear Register 4 */
#define P23_OMCR4	(*( P00_OMCR4_type *) 0xf003c384u)	/* Port 23 Output Modification Clear Register 4 */
#define P32_OMCR4	(*( P00_OMCR4_type *) 0xf003d284u)	/* Port 32 Output Modification Clear Register 4 */
#define P33_OMCR4	(*( P00_OMCR4_type *) 0xf003d384u)	/* Port 33 Output Modification Clear Register 4 */
#define P34_OMCR4	(*( P00_OMCR4_type *) 0xf003d484u)	/* Port 34 Output Modification Clear Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int PCL8           : 1;	/* Port n Clear Bit x */
		unsigned int PCL9           : 1;	/* Port n Clear Bit x */
		unsigned int PCL10          : 1;	/* Port n Clear Bit x */
		unsigned int PCL11          : 1;	/* Port n Clear Bit x */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} P00_OMCR8_type;
#define P00_OMCR8	(*( P00_OMCR8_type *) 0xf003a088u)	/* Port 00 Output Modification Clear Register 8 */
#define P02_OMCR8	(*( P00_OMCR8_type *) 0xf003a288u)	/* Port 02 Output Modification Clear Register 8 */
#define P10_OMCR8	(*( P00_OMCR8_type *) 0xf003b088u)	/* Port 10 Output Modification Clear Register 8 */
#define P11_OMCR8	(*( P00_OMCR8_type *) 0xf003b188u)	/* Port 11 Output Modification Clear Register 8 */
#define P14_OMCR8	(*( P00_OMCR8_type *) 0xf003b488u)	/* Port 14 Output Modification Clear Register 8 */
#define P15_OMCR8	(*( P00_OMCR8_type *) 0xf003b588u)	/* Port 15 Output Modification Clear Register 8 */
#define P20_OMCR8	(*( P00_OMCR8_type *) 0xf003c088u)	/* Port 20 Output Modification Clear Register 8 */
#define P22_OMCR8	(*( P00_OMCR8_type *) 0xf003c288u)	/* Port 22 Output Modification Clear Register 8 */
#define P33_OMCR8	(*( P00_OMCR8_type *) 0xf003d388u)	/* Port 33 Output Modification Clear Register 8 */

