svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* Port n Set Bit x */
		unsigned int PS1            : 1;	/* Port n Set Bit x */
		unsigned int PS2            : 1;	/* Port n Set Bit x */
		unsigned int PS3            : 1;	/* Port n Set Bit x */
		unsigned int PS4            : 1;	/* Port n Set Bit x */
		unsigned int PS5            : 1;	/* Port n Set Bit x */
		unsigned int PS6            : 1;	/* Port n Set Bit x */
		unsigned int PS7            : 1;	/* Port n Set Bit x */
		unsigned int PS8            : 1;	/* Port n Set Bit x */
		unsigned int PS9            : 1;	/* Port n Set Bit x */
		unsigned int PS10           : 1;	/* Port n Set Bit x */
		unsigned int PS11           : 1;	/* Port n Set Bit x */
		unsigned int PS12           : 1;	/* Port n Set Bit x */
		unsigned int PS13           : 1;	/* Port n Set Bit x */
		unsigned int PS14           : 1;	/* Port n Set Bit x */
		unsigned int PS15           : 1;	/* Port n Set Bit x */
		unsigned int PCL0           : 1;	/* Port n Clear Bit x */
		unsigned int PCL1           : 1;	/* Port n Clear Bit x */
		unsigned int PCL2           : 1;	/* Port n Clear Bit x */
		unsigned int PCL3           : 1;	/* Port n Clear Bit x */
		unsigned int PCL4           : 1;	/* Port n Clear Bit x */
		unsigned int PCL5           : 1;	/* Port n Clear Bit x */
		unsigned int PCL6           : 1;	/* Port n Clear Bit x */
		unsigned int PCL7           : 1;	/* Port n Clear Bit x */
		unsigned int PCL8           : 1;	/* Port n Clear Bit x */
		unsigned int PCL9           : 1;	/* Port n Clear Bit x */
		unsigned int PCL10          : 1;	/* Port n Clear Bit x */
		unsigned int PCL11          : 1;	/* Port n Clear Bit x */
		unsigned int PCL12          : 1;	/* Port n Clear Bit x */
		unsigned int PCL13          : 1;	/* Port n Clear Bit x */
		unsigned int PCL14          : 1;	/* Port n Clear Bit x */
		unsigned int PCL15          : 1;	/* Port n Clear Bit x */
	} B;
	int I;
	unsigned int U;

} P00_OMR_type;
#define P00_OMR	(*( P00_OMR_type *) 0xf003a004u)	/* Port 00 Output Modification Register */
#define P01_OMR	(*( P00_OMR_type *) 0xf003a104u)	/* Port 01 Output Modification Register */
#define P02_OMR	(*( P00_OMR_type *) 0xf003a204u)	/* Port 02 Output Modification Register */
#define P10_OMR	(*( P00_OMR_type *) 0xf003b004u)	/* Port 10 Output Modification Register */
#define P11_OMR	(*( P00_OMR_type *) 0xf003b104u)	/* Port 11 Output Modification Register */
#define P12_OMR	(*( P00_OMR_type *) 0xf003b204u)	/* Port 12 Output Modification Register */
#define P13_OMR	(*( P00_OMR_type *) 0xf003b304u)	/* Port 13 Output Modification Register */
#define P14_OMR	(*( P00_OMR_type *) 0xf003b404u)	/* Port 14 Output Modification Register */
#define P15_OMR	(*( P00_OMR_type *) 0xf003b504u)	/* Port 15 Output Modification Register */
#define P20_OMR	(*( P00_OMR_type *) 0xf003c004u)	/* Port 20 Output Modification Register */
#define P21_OMR	(*( P00_OMR_type *) 0xf003c104u)	/* Port 21 Output Modification Register */
#define P22_OMR	(*( P00_OMR_type *) 0xf003c204u)	/* Port 22 Output Modification Register */
#define P23_OMR	(*( P00_OMR_type *) 0xf003c304u)	/* Port 23 Output Modification Register */
#define P32_OMR	(*( P00_OMR_type *) 0xf003d204u)	/* Port 32 Output Modification Register */
#define P33_OMR	(*( P00_OMR_type *) 0xf003d304u)	/* Port 33 Output Modification Register */
#define P34_OMR	(*( P00_OMR_type *) 0xf003d404u)	/* Port 34 Output Modification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* Port n Set Bit x */
		unsigned int PS1            : 1;	/* Port n Set Bit x */
		unsigned int PS2            : 1;	/* Port n Set Bit x */
		unsigned int PS3            : 1;	/* Port n Set Bit x */
		unsigned int PS4            : 1;	/* Port n Set Bit x */
		unsigned int PS5            : 1;	/* Port n Set Bit x */
		unsigned int PS6            : 1;	/* Port n Set Bit x */
		unsigned int PS7            : 1;	/* Port n Set Bit x */
		unsigned int PS8            : 1;	/* Port n Set Bit x */
		unsigned int PS9            : 1;	/* Port n Set Bit x */
		unsigned int PS10           : 1;	/* Port n Set Bit x */
		unsigned int PS11           : 1;	/* Port n Set Bit x */
		unsigned int PS12           : 1;	/* Port n Set Bit x */
		unsigned int PS13           : 1;	/* Port n Set Bit x */
		unsigned int PS14           : 1;	/* Port n Set Bit x */
		unsigned int PS15           : 1;	/* Port n Set Bit x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P00_OMSR_type;
#define P00_OMSR	(*( P00_OMSR_type *) 0xf003a090u)	/* Port 00 Output Modification Set Register */
#define P01_OMSR	(*( P00_OMSR_type *) 0xf003a190u)	/* Port 01 Output Modification Set Register */
#define P02_OMSR	(*( P00_OMSR_type *) 0xf003a290u)	/* Port 02 Output Modification Set Register */
#define P10_OMSR	(*( P00_OMSR_type *) 0xf003b090u)	/* Port 10 Output Modification Set Register */
#define P11_OMSR	(*( P00_OMSR_type *) 0xf003b190u)	/* Port 11 Output Modification Set Register */
#define P12_OMSR	(*( P00_OMSR_type *) 0xf003b290u)	/* Port 12 Output Modification Set Register */
#define P13_OMSR	(*( P00_OMSR_type *) 0xf003b390u)	/* Port 13 Output Modification Set Register */
#define P14_OMSR	(*( P00_OMSR_type *) 0xf003b490u)	/* Port 14 Output Modification Set Register */
#define P15_OMSR	(*( P00_OMSR_type *) 0xf003b590u)	/* Port 15 Output Modification Set Register */
#define P20_OMSR	(*( P00_OMSR_type *) 0xf003c090u)	/* Port 20 Output Modification Set Register */
#define P21_OMSR	(*( P00_OMSR_type *) 0xf003c190u)	/* Port 21 Output Modification Set Register */
#define P22_OMSR	(*( P00_OMSR_type *) 0xf003c290u)	/* Port 22 Output Modification Set Register */
#define P23_OMSR	(*( P00_OMSR_type *) 0xf003c390u)	/* Port 23 Output Modification Set Register */
#define P32_OMSR	(*( P00_OMSR_type *) 0xf003d290u)	/* Port 32 Output Modification Set Register */
#define P33_OMSR	(*( P00_OMSR_type *) 0xf003d390u)	/* Port 33 Output Modification Set Register */
#define P34_OMSR	(*( P00_OMSR_type *) 0xf003d490u)	/* Port 34 Output Modification Set Register */

