svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* Port n Set Bit x */
		unsigned int PS1            : 1;	/* Port n Set Bit x */
		unsigned int PS2            : 1;	/* Port n Set Bit x */
		unsigned int PS3            : 1;	/* Port n Set Bit x */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} P00_OMSR0_type;
#define P00_OMSR0	(*( P00_OMSR0_type *) 0xf003a070u)	/* Port 00 Output Modification Set Register 0 */
#define P01_OMSR0	(*( P00_OMSR0_type *) 0xf003a170u)	/* Port 01 Output Modification Set Register 0 */
#define P02_OMSR0	(*( P00_OMSR0_type *) 0xf003a270u)	/* Port 02 Output Modification Set Register 0 */
#define P10_OMSR0	(*( P00_OMSR0_type *) 0xf003b070u)	/* Port 10 Output Modification Set Register 0 */
#define P11_OMSR0	(*( P00_OMSR0_type *) 0xf003b170u)	/* Port 11 Output Modification Set Register 0 */
#define P12_OMSR0	(*( P00_OMSR0_type *) 0xf003b270u)	/* Port 12 Output Modification Set Register 0 */
#define P13_OMSR0	(*( P00_OMSR0_type *) 0xf003b370u)	/* Port 13 Output Modification Set Register 0 */
#define P14_OMSR0	(*( P00_OMSR0_type *) 0xf003b470u)	/* Port 14 Output Modification Set Register 0 */
#define P15_OMSR0	(*( P00_OMSR0_type *) 0xf003b570u)	/* Port 15 Output Modification Set Register 0 */
#define P20_OMSR0	(*( P00_OMSR0_type *) 0xf003c070u)	/* Port 20 Output Modification Set Register 0 */
#define P21_OMSR0	(*( P00_OMSR0_type *) 0xf003c170u)	/* Port 21 Output Modification Set Register 0 */
#define P22_OMSR0	(*( P00_OMSR0_type *) 0xf003c270u)	/* Port 22 Output Modification Set Register 0 */
#define P23_OMSR0	(*( P00_OMSR0_type *) 0xf003c370u)	/* Port 23 Output Modification Set Register 0 */
#define P32_OMSR0	(*( P00_OMSR0_type *) 0xf003d270u)	/* Port 32 Output Modification Set Register 0 */
#define P33_OMSR0	(*( P00_OMSR0_type *) 0xf003d370u)	/* Port 33 Output Modification Set Register 0 */
#define P34_OMSR0	(*( P00_OMSR0_type *) 0xf003d470u)	/* Port 34 Output Modification Set Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 12;
		unsigned int PS12           : 1;	/* Port n Set Bit x */
		unsigned int PS13           : 1;	/* Port n Set Bit x */
		unsigned int PS14           : 1;	/* Port n Set Bit x */
		unsigned int PS15           : 1;	/* Port n Set Bit x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P00_OMSR12_type;
#define P00_OMSR12	(*( P00_OMSR12_type *) 0xf003a07cu)	/* Port 00 Output Modification Set Register 12 */
#define P11_OMSR12	(*( P00_OMSR12_type *) 0xf003b17cu)	/* Port 11 Output Modification Set Register 12 */
#define P20_OMSR12	(*( P00_OMSR12_type *) 0xf003c07cu)	/* Port 20 Output Modification Set Register 12 */
#define P33_OMSR12	(*( P00_OMSR12_type *) 0xf003d37cu)	/* Port 33 Output Modification Set Register 12 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int PS4            : 1;	/* Port n Set Bit x */
		unsigned int PS5            : 1;	/* Port n Set Bit x */
		unsigned int PS6            : 1;	/* Port n Set Bit x */
		unsigned int PS7            : 1;	/* Port n Set Bit x */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} P00_OMSR4_type;
#define P00_OMSR4	(*( P00_OMSR4_type *) 0xf003a074u)	/* Port 00 Output Modification Set Register 4 */
#define P01_OMSR4	(*( P00_OMSR4_type *) 0xf003a174u)	/* Port 01 Output Modification Set Register 4 */
#define P02_OMSR4	(*( P00_OMSR4_type *) 0xf003a274u)	/* Port 02 Output Modification Set Register 4 */
#define P10_OMSR4	(*( P00_OMSR4_type *) 0xf003b074u)	/* Port 10 Output Modification Set Register 4 */
#define P11_OMSR4	(*( P00_OMSR4_type *) 0xf003b174u)	/* Port 11 Output Modification Set Register 4 */
#define P14_OMSR4	(*( P00_OMSR4_type *) 0xf003b474u)	/* Port 14 Output Modification Set Register 4 */
#define P15_OMSR4	(*( P00_OMSR4_type *) 0xf003b574u)	/* Port 15 Output Modification Set Register 4 */
#define P20_OMSR4	(*( P00_OMSR4_type *) 0xf003c074u)	/* Port 20 Output Modification Set Register 4 */
#define P21_OMSR4	(*( P00_OMSR4_type *) 0xf003c174u)	/* Port 21 Output Modification Set Register 4 */
#define P22_OMSR4	(*( P00_OMSR4_type *) 0xf003c274u)	/* Port 22 Output Modification Set Register 4 */
#define P23_OMSR4	(*( P00_OMSR4_type *) 0xf003c374u)	/* Port 23 Output Modification Set Register 4 */
#define P32_OMSR4	(*( P00_OMSR4_type *) 0xf003d274u)	/* Port 32 Output Modification Set Register 4 */
#define P33_OMSR4	(*( P00_OMSR4_type *) 0xf003d374u)	/* Port 33 Output Modification Set Register 4 */
#define P34_OMSR4	(*( P00_OMSR4_type *) 0xf003d474u)	/* Port 34 Output Modification Set Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 8;
		unsigned int PS8            : 1;	/* Port n Set Bit x */
		unsigned int PS9            : 1;	/* Port n Set Bit x */
		unsigned int PS10           : 1;	/* Port n Set Bit x */
		unsigned int PS11           : 1;	/* Port n Set Bit x */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} P00_OMSR8_type;
#define P00_OMSR8	(*( P00_OMSR8_type *) 0xf003a078u)	/* Port 00 Output Modification Set Register 8 */
#define P02_OMSR8	(*( P00_OMSR8_type *) 0xf003a278u)	/* Port 02 Output Modification Set Register 8 */
#define P10_OMSR8	(*( P00_OMSR8_type *) 0xf003b078u)	/* Port 10 Output Modification Set Register 8 */
#define P11_OMSR8	(*( P00_OMSR8_type *) 0xf003b178u)	/* Port 11 Output Modification Set Register 8 */
#define P14_OMSR8	(*( P00_OMSR8_type *) 0xf003b478u)	/* Port 14 Output Modification Set Register 8 */
#define P15_OMSR8	(*( P00_OMSR8_type *) 0xf003b578u)	/* Port 15 Output Modification Set Register 8 */
#define P20_OMSR8	(*( P00_OMSR8_type *) 0xf003c078u)	/* Port 20 Output Modification Set Register 8 */
#define P22_OMSR8	(*( P00_OMSR8_type *) 0xf003c278u)	/* Port 22 Output Modification Set Register 8 */
#define P33_OMSR8	(*( P00_OMSR8_type *) 0xf003d378u)	/* Port 33 Output Modification Set Register 8 */

