svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int P0             : 1;	/* Port n Output Bit x */
		unsigned int P1             : 1;	/* Port n Output Bit x */
		unsigned int P2             : 1;	/* Port n Output Bit x */
		unsigned int P3             : 1;	/* Port n Output Bit x */
		unsigned int P4             : 1;	/* Port n Output Bit x */
		unsigned int P5             : 1;	/* Port n Output Bit x */
		unsigned int P6             : 1;	/* Port n Output Bit x */
		unsigned int P7             : 1;	/* Port n Output Bit x */
		unsigned int P8             : 1;	/* Port n Output Bit x */
		unsigned int P9             : 1;	/* Port n Output Bit x */
		unsigned int P10            : 1;	/* Port n Output Bit x */
		unsigned int P11            : 1;	/* Port n Output Bit x */
		unsigned int P12            : 1;	/* Port n Output Bit x */
		unsigned int P13            : 1;	/* Port n Output Bit x */
		unsigned int P14            : 1;	/* Port n Output Bit x */
		unsigned int P15            : 1;	/* Port n Output Bit x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P00_OUT_type;
#define P00_OUT	(*( P00_OUT_type *) 0xf003a000u)	/* Port 00 Output Register */
#define P01_OUT	(*( P00_OUT_type *) 0xf003a100u)	/* Port 01 Output Register */
#define P02_OUT	(*( P00_OUT_type *) 0xf003a200u)	/* Port 02 Output Register */
#define P10_OUT	(*( P00_OUT_type *) 0xf003b000u)	/* Port 10 Output Register */
#define P11_OUT	(*( P00_OUT_type *) 0xf003b100u)	/* Port 11 Output Register */
#define P12_OUT	(*( P00_OUT_type *) 0xf003b200u)	/* Port 12 Output Register */
#define P13_OUT	(*( P00_OUT_type *) 0xf003b300u)	/* Port 13 Output Register */
#define P14_OUT	(*( P00_OUT_type *) 0xf003b400u)	/* Port 14 Output Register */
#define P15_OUT	(*( P00_OUT_type *) 0xf003b500u)	/* Port 15 Output Register */
#define P20_OUT	(*( P00_OUT_type *) 0xf003c000u)	/* Port 20 Output Register */
#define P21_OUT	(*( P00_OUT_type *) 0xf003c100u)	/* Port 21 Output Register */
#define P22_OUT	(*( P00_OUT_type *) 0xf003c200u)	/* Port 22 Output Register */
#define P23_OUT	(*( P00_OUT_type *) 0xf003c300u)	/* Port 23 Output Register */
#define P32_OUT	(*( P00_OUT_type *) 0xf003d200u)	/* Port 32 Output Register */
#define P33_OUT	(*( P00_OUT_type *) 0xf003d300u)	/* Port 33 Output Register */
#define P34_OUT	(*( P00_OUT_type *) 0xf003d400u)	/* Port 34 Output Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL0            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD1            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL1            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD2            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL2            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD3            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL3            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD4            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL4            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD5            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL5            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD6            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL6            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
		unsigned int PD7            : 3;	/* Pad Driver Mode for Port n Pin 0 to 7 */
		unsigned int PL7            : 1;	/* Pad Level Selection for Port n Pin 0 to 7 */
	} B;
	int I;
	unsigned int U;

} P00_PDR0_type;
#define P00_PDR0	(*( P00_PDR0_type *) 0xf003a040u)	/* Port 00 Pad Driver Mode 0 Register */
#define P02_PDR0	(*( P00_PDR0_type *) 0xf003a240u)	/* Port 02 Pad Driver Mode 0 Register */
#define P10_PDR0	(*( P00_PDR0_type *) 0xf003b040u)	/* Port 10 Pad Driver Mode 0 Register */
#define P11_PDR0	(*( P00_PDR0_type *) 0xf003b140u)	/* Port 11 Pad Driver Mode 0 Register */
#define P14_PDR0	(*( P00_PDR0_type *) 0xf003b440u)	/* Port 14 Pad Driver Mode 0 Register */
#define P15_PDR0	(*( P00_PDR0_type *) 0xf003b540u)	/* Port 15 Pad Driver Mode 0 Register */
#define P21_PDR0	(*( P00_PDR0_type *) 0xf003c140u)	/* Port 21 Pad Driver Mode 0 Register */
#define P22_PDR0	(*( P00_PDR0_type *) 0xf003c240u)	/* Port 22 Pad Driver Mode 0 Register */
#define P23_PDR0	(*( P00_PDR0_type *) 0xf003c340u)	/* Port 23 Pad Driver Mode 0 Register */
#define P32_PDR0	(*( P00_PDR0_type *) 0xf003d240u)	/* Port 32 Pad Driver Mode 0 Register */
#define P33_PDR0	(*( P00_PDR0_type *) 0xf003d340u)	/* Port 33 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port 00 Pin 8 to 12 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port 00 Pin 8 to 12 */
		unsigned int PD9            : 3;	/* Pad Driver Mode for Port 00 Pin 8 to 12 */
		unsigned int PL9            : 1;	/* Pad Level Selection for Port 00 Pin 8 to 12 */
		unsigned int PD10           : 3;	/* Pad Driver Mode for Port 00 Pin 8 to 12 */
		unsigned int PL10           : 1;	/* Pad Level Selection for Port 00 Pin 8 to 12 */
		unsigned int PD11           : 3;	/* Pad Driver Mode for Port 00 Pin 8 to 12 */
		unsigned int PL11           : 1;	/* Pad Level Selection for Port 00 Pin 8 to 12 */
		unsigned int PD12           : 3;	/* Pad Driver Mode for Port 00 Pin 8 to 12 */
		unsigned int PL12           : 1;	/* Pad Level Selection for Port 00 Pin 8 to 12 */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

