svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} P00_PDR1_type;
#define P00_PDR1	(*( P00_PDR1_type *) 0xf003a044u)	/* Port 00 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P01_ACCEN1_type;
#define P01_ACCEN1	(*( P01_ACCEN1_type *) 0xf003a1f8u)	/* Port 01 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Port Control for Port 01 Pin 3 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Port Control for Port 01 Pin 3 */
	} B2;
	int I;
	unsigned int U;

} P01_IOCR0_type;
#define P01_IOCR0	(*( P01_IOCR0_type *) 0xf003a110u)	/* Port 01 Input/Output Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Reserved */
		unsigned int PL0            : 1;	/* Reserved */
		unsigned int PD1            : 3;	/* Reserved */
		unsigned int PL1            : 1;	/* Reserved */
		unsigned int PD2            : 3;	/* Reserved */
		unsigned int PL2            : 1;	/* Reserved */
		unsigned int PD3            : 3;	/* Pad Driver Mode for Port n Pin 3 to 7 */
		unsigned int PL3            : 1;	/* Pad Level Selection for Port n Pin 3 to 7 */
		unsigned int PD4            : 3;	/* Pad Driver Mode for Port n Pin 3 to 7 */
		unsigned int PL4            : 1;	/* Pad Level Selection for Port n Pin 3 to 7 */
		unsigned int PD5            : 3;	/* Pad Driver Mode for Port n Pin 3 to 7 */
		unsigned int PL5            : 1;	/* Pad Level Selection for Port n Pin 3 to 7 */
		unsigned int PD6            : 3;	/* Pad Driver Mode for Port n Pin 3 to 7 */
		unsigned int PL6            : 1;	/* Pad Level Selection for Port n Pin 3 to 7 */
		unsigned int PD7            : 3;	/* Pad Driver Mode for Port n Pin 3 to 7 */
		unsigned int PL7            : 1;	/* Pad Level Selection for Port n Pin 3 to 7 */
	} B;
	int I;
	unsigned int U;

} P01_PDR0_type;
#define P01_PDR0	(*( P01_PDR0_type *) 0xf003a140u)	/* Port 01 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P02_ACCEN1_type;
#define P02_ACCEN1	(*( P02_ACCEN1_type *) 0xf003a2f8u)	/* Port 02 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port n Pin 8 to 11 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port n Pin 8 to 11 */
		unsigned int PD9            : 3;	/* Pad Driver Mode for Port n Pin 8 to 11 */
		unsigned int PL9            : 1;	/* Pad Level Selection for Port n Pin 8 to 11 */
		unsigned int PD10           : 3;	/* Pad Driver Mode for Port n Pin 8 to 11 */
		unsigned int PL10           : 1;	/* Pad Level Selection for Port n Pin 8 to 11 */
		unsigned int PD11           : 3;	/* Pad Driver Mode for Port n Pin 8 to 11 */
		unsigned int PL11           : 1;	/* Pad Level Selection for Port n Pin 8 to 11 */
		unsigned int PD12           : 3;	/* Reserved */
		unsigned int PL12           : 1;	/* Reserved */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P02_PDR1_type;
#define P02_PDR1	(*( P02_PDR1_type *) 0xf003a244u)	/* Port 02 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P10_ACCEN1_type;
#define P10_ACCEN1	(*( P10_ACCEN1_type *) 0xf003b0f8u)	/* Port 10 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 10 Pin 8 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 10 Pin 8 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P10_IOCR8_type;
#define P10_IOCR8	(*( P10_IOCR8_type *) 0xf003b018u)	/* Port 10 Input/Output Control Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port 10 Pin 8 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port 10 Pin 8 */
		unsigned int PD9            : 3;	/* Reserved */
		unsigned int PL9            : 1;	/* Reserved */
		unsigned int PD10           : 3;	/* Reserved */
		unsigned int PL10           : 1;	/* Reserved */
		unsigned int PD11           : 3;	/* Reserved */
		unsigned int PL11           : 1;	/* Reserved */
		unsigned int PD12           : 3;	/* Reserved */
		unsigned int PL12           : 1;	/* Reserved */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P10_PDR1_type;
#define P10_PDR1	(*( P10_PDR1_type *) 0xf003b044u)	/* Port 10 Pad Driver Mode 1 Register */

