svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P11_ACCEN1_type;
#define P11_ACCEN1	(*( P11_ACCEN1_type *) 0xf003b1f8u)	/* Port 11 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC12           : 5;	/* Port Control for Port n Pin 12 to 15 */
		unsigned int                : 3;
		unsigned int PC13           : 5;	/* Port Control for Port n Pin 12 to 15 */
		unsigned int                : 3;
		unsigned int PC14           : 5;	/* Port Control for Port n Pin 12 to 15 */
		unsigned int                : 3;
		unsigned int PC15           : 5;	/* Port Control for Port n Pin 12 to 15 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC12           : 5;	/* Port Control for Port n Pin 12 to 15 */
		unsigned int                : 3;
		unsigned int PC13           : 5;	/* Port Control for Port n Pin 12 to 15 */
		unsigned int                : 3;
		unsigned int PC14           : 5;	/* Port Control for Port n Pin 12 to 15 */
		unsigned int                : 3;
		unsigned int PC15           : 5;	/* Port Control for Port n Pin 12 to 15 */
	} B2;
	int I;
	unsigned int U;

} P11_IOCR12_type;
#define P11_IOCR12	(*( P11_IOCR12_type *) 0xf003b11cu)	/* Port 11 Input/Output Control Register 12 */
#define P33_IOCR12	(*( P11_IOCR12_type *) 0xf003d31cu)	/* Port 33 Input/Output Control Register 12 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD9            : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL9            : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD10           : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL10           : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD11           : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL11           : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD12           : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL12           : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD13           : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL13           : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD14           : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL14           : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
		unsigned int PD15           : 3;	/* Pad Driver Mode for Port n Pin 8 to 15 */
		unsigned int PL15           : 1;	/* Pad Level Selection for Port n Pin 8 to 15 */
	} B;
	int I;
	unsigned int U;

} P11_PDR1_type;
#define P11_PDR1	(*( P11_PDR1_type *) 0xf003b144u)	/* Port 11 Pad Driver Mode 1 Register */
#define P33_PDR1	(*( P11_PDR1_type *) 0xf003d344u)	/* Port 33 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P12_ACCEN1_type;
#define P12_ACCEN1	(*( P12_ACCEN1_type *) 0xf003b2f8u)	/* Port 12 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Port Control for Port 12 Pin 0 to 1 */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Port Control for Port 12 Pin 0 to 1 */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Port Control for Port 12 Pin 0 to 1 */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Port Control for Port 12 Pin 0 to 1 */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P12_IOCR0_type;
#define P12_IOCR0	(*( P12_IOCR0_type *) 0xf003b210u)	/* Port 12 Input/Output Control Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Pad Driver Mode for Port 12 Pin 0 to 1 */
		unsigned int PL0            : 1;	/* Pad Level Selection for Port 12 Pin 0 to 1 */
		unsigned int PD1            : 3;	/* Pad Driver Mode for Port 12 Pin 0 to 1 */
		unsigned int PL1            : 1;	/* Pad Level Selection for Port 12 Pin 0 to 1 */
		unsigned int PD2            : 3;	/* Reserved */
		unsigned int PL2            : 1;	/* Reserved */
		unsigned int PD3            : 3;	/* Reserved */
		unsigned int PL3            : 1;	/* Reserved */
		unsigned int PD4            : 3;	/* Reserved */
		unsigned int PL4            : 1;	/* Reserved */
		unsigned int PD5            : 3;	/* Reserved */
		unsigned int PL5            : 1;	/* Reserved */
		unsigned int PD6            : 3;	/* Reserved */
		unsigned int PL6            : 1;	/* Reserved */
		unsigned int PD7            : 3;	/* Reserved */
		unsigned int PL7            : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P12_PDR0_type;
#define P12_PDR0	(*( P12_PDR0_type *) 0xf003b240u)	/* Port 12 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P13_ACCEN1_type;
#define P13_ACCEN1	(*( P13_ACCEN1_type *) 0xf003b3f8u)	/* Port 13 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Pad Driver Mode for Port 13 Pin [1:0] */
		unsigned int PL0            : 1;	/* Pad Level Selection for Port 13 Pin 0 to 3 */
		unsigned int PD1            : 3;	/* Pad Driver Mode for Port 13 Pin 1 and 3 */
		unsigned int PL1            : 1;	/* Pad Level Selection for Port 13 Pin 0 to 3 */
		unsigned int PD2            : 3;	/* Pad Driver Mode for Port 13 Pin [3:2] */
		unsigned int PL2            : 1;	/* Pad Level Selection for Port 13 Pin 0 to 3 */
		unsigned int PD3            : 3;	/* Pad Driver Mode for Port 13 Pin 1 and 3 */
		unsigned int PL3            : 1;	/* Pad Level Selection for Port 13 Pin 0 to 3 */
		unsigned int PD4            : 3;	/* Reserved */
		unsigned int PL4            : 1;	/* Reserved */
		unsigned int PD5            : 3;	/* Reserved */
		unsigned int PL5            : 1;	/* Reserved */
		unsigned int PD6            : 3;	/* Reserved */
		unsigned int PL6            : 1;	/* Reserved */
		unsigned int PD7            : 3;	/* Reserved */
		unsigned int PL7            : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P13_PDR0_type;
