svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define P13_PDR0	(*( P13_PDR0_type *) 0xf003b340u)	/* Port 13 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P14_ACCEN1_type;
#define P14_ACCEN1	(*( P14_ACCEN1_type *) 0xf003b4f8u)	/* Port 14 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 14 Pin 8 to 10 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Port Control for Port 14 Pin 8 to 10 */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Port Control for Port 14 Pin 8 to 10 */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 14 Pin 8 to 10 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Port Control for Port 14 Pin 8 to 10 */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Port Control for Port 14 Pin 8 to 10 */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P14_IOCR8_type;
#define P14_IOCR8	(*( P14_IOCR8_type *) 0xf003b418u)	/* Port 14 Input/Output Control Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port 14 Pin 8 to 10 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port 14 Pin 8 to 10 */
		unsigned int PD9            : 3;	/* Pad Driver Mode for Port 14 Pin 8 to 10 */
		unsigned int PL9            : 1;	/* Pad Level Selection for Port 14 Pin 8 to 10 */
		unsigned int PD10           : 3;	/* Pad Driver Mode for Port 14 Pin 8 to 10 */
		unsigned int PL10           : 1;	/* Pad Level Selection for Port 14 Pin 8 to 10 */
		unsigned int PD11           : 3;	/* Reserved */
		unsigned int PL11           : 1;	/* Reserved */
		unsigned int PD12           : 3;	/* Reserved */
		unsigned int PL12           : 1;	/* Reserved */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P14_PDR1_type;
#define P14_PDR1	(*( P14_PDR1_type *) 0xf003b444u)	/* Port 14 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P15_ACCEN1_type;
#define P15_ACCEN1	(*( P15_ACCEN1_type *) 0xf003b5f8u)	/* Port 15 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 15 Pin 8 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 15 Pin 8 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P15_IOCR8_type;
#define P15_IOCR8	(*( P15_IOCR8_type *) 0xf003b518u)	/* Port 15 Input/Output Control Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port 15 Pin 8 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port 15 Pin 8 */
		unsigned int PD9            : 3;	/* Reserved */
		unsigned int PL9            : 1;	/* Reserved */
		unsigned int PD10           : 3;	/* Reserved */
		unsigned int PL10           : 1;	/* Reserved */
		unsigned int PD11           : 3;	/* Reserved */
		unsigned int PL11           : 1;	/* Reserved */
		unsigned int PD12           : 3;	/* Reserved */
		unsigned int PL12           : 1;	/* Reserved */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P15_PDR1_type;
#define P15_PDR1	(*( P15_PDR1_type *) 0xf003b544u)	/* Port 15 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P20_ACCEN1_type;
#define P20_ACCEN1	(*( P20_ACCEN1_type *) 0xf003c0f8u)	/* Port 20 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC12           : 5;	/* Port Control for Port 20 Pin 12 to 14 */
		unsigned int                : 3;
		unsigned int PC13           : 5;	/* Port Control for Port 20 Pin 12 to 14 */
		unsigned int                : 3;
		unsigned int PC14           : 5;	/* Port Control for Port 20 Pin 12 to 14 */
		unsigned int                : 3;
		unsigned int PC15           : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC12           : 5;	/* Port Control for Port 20 Pin 12 to 14 */
		unsigned int                : 3;
		unsigned int PC13           : 5;	/* Port Control for Port 20 Pin 12 to 14 */
		unsigned int                : 3;
		unsigned int PC14           : 5;	/* Port Control for Port 20 Pin 12 to 14 */
		unsigned int                : 3;
		unsigned int PC15           : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P20_IOCR12_type;
#define P20_IOCR12	(*( P20_IOCR12_type *) 0xf003c01cu)	/* Port 20 Input/Output Control Register 12 */

