svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC4            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC5            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC6            : 5;	/* Port Control for Port 20 Pin 6 to 7 */
		unsigned int                : 3;
		unsigned int PC7            : 5;	/* Port Control for Port 20 Pin 6 to 7 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC4            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC5            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC6            : 5;	/* Port Control for Port 20 Pin 6 to 7 */
		unsigned int                : 3;
		unsigned int PC7            : 5;	/* Port Control for Port 20 Pin 6 to 7 */
	} B2;
	int I;
	unsigned int U;

} P20_IOCR4_type;
#define P20_IOCR4	(*( P20_IOCR4_type *) 0xf003c014u)	/* Port 20 Input/Output Control Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Pad Driver Mode for Port 20 Pin 0 to 7 */
		unsigned int PL0            : 1;	/* Pad Level Selection for Port 20 Pin 0 to 7 */
		unsigned int PD1            : 3;	/* Pad Driver Mode for Port 20 Pin 0 to 7 */
		unsigned int PL1            : 1;	/* Pad Level Selection for Port 20 Pin 0 to 7 */
		unsigned int PD2            : 3;	/* Pad Driver Mode for Port 20 Pin 0 to 7 */
		unsigned int PL2            : 1;	/* Pad Level Selection for Port 20 Pin 0 to 7 */
		unsigned int PD3            : 3;	/* Pad Driver Mode for Port 20 Pin 0 to 7 */
		unsigned int PL3            : 1;	/* Pad Level Selection for Port 20 Pin 0 to 7 */
		unsigned int PD4            : 3;	/* Reserved */
		unsigned int PL4            : 1;	/* Reserved */
		unsigned int PD5            : 3;	/* Reserved */
		unsigned int PL5            : 1;	/* Reserved */
		unsigned int PD6            : 3;	/* Pad Driver Mode for Port 20 Pin 0 to 7 */
		unsigned int PL6            : 1;	/* Pad Level Selection for Port 20 Pin 0 to 7 */
		unsigned int PD7            : 3;	/* Pad Driver Mode for Port 20 Pin 0 to 7 */
		unsigned int PL7            : 1;	/* Pad Level Selection for Port 20 Pin 0 to 7 */
	} B;
	int I;
	unsigned int U;

} P20_PDR0_type;
#define P20_PDR0	(*( P20_PDR0_type *) 0xf003c040u)	/* Port 20 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD9            : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL9            : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD10           : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL10           : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD11           : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL11           : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD12           : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL12           : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD13           : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL13           : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD14           : 3;	/* Pad Driver Mode for Port 20 Pin 8 to 14 */
		unsigned int PL14           : 1;	/* Pad Level Selection for Port 20 Pin 8 to 14 */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P20_PDR1_type;
#define P20_PDR1	(*( P20_PDR1_type *) 0xf003c044u)	/* Port 20 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P21_ACCEN1_type;
#define P21_ACCEN1	(*( P21_ACCEN1_type *) 0xf003c1f8u)	/* Port 21 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P22_ACCEN1_type;
#define P22_ACCEN1	(*( P22_ACCEN1_type *) 0xf003c2f8u)	/* Port 22 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Pad Driver Mode for Port 22 Pin 8 to 11 */
		unsigned int PL8            : 1;	/* Pad Level Selection for Port 22 Pin 8 to 11 */
		unsigned int PD9            : 3;	/* Pad Driver Mode for Port 22 Pin 8 to 11 */
		unsigned int PL9            : 1;	/* Pad Level Selection for Port 22 Pin 8 to 11 */
		unsigned int PD10           : 3;	/* Pad Driver Mode for Port 22 Pin 8 to 11 */
		unsigned int PL10           : 1;	/* Pad Level Selection for Port 22 Pin 8 to 11 */
		unsigned int PD11           : 3;	/* Pad Driver Mode for Port 22 Pin 8 to 11 */
		unsigned int PL11           : 1;	/* Pad Level Selection for Port 22 Pin 8 to 11 */
		unsigned int PD12           : 3;	/* Reserved */
		unsigned int PL12           : 1;	/* Reserved */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P22_PDR1_type;
#define P22_PDR1	(*( P22_PDR1_type *) 0xf003c244u)	/* Port 22 Pad Driver Mode 1 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P23_ACCEN1_type;
#define P23_ACCEN1	(*( P23_ACCEN1_type *) 0xf003c3f8u)	/* Port 23 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P32_ACCEN1_type;
#define P32_ACCEN1	(*( P32_ACCEN1_type *) 0xf003d2f8u)	/* Port 32 Access Enable Register 1 */

