svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Port Control for Port n Pin 0, Pin 2 to 3 */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Port Control for Port n Pin 0, Pin 2 to 3 */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Port Control for Port n Pin 0, Pin 2 to 3 */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC0            : 5;	/* Port Control for Port n Pin 0, Pin 2 to 3 */
		unsigned int                : 3;
		unsigned int PC1            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC2            : 5;	/* Port Control for Port n Pin 0, Pin 2 to 3 */
		unsigned int                : 3;
		unsigned int PC3            : 5;	/* Port Control for Port n Pin 0, Pin 2 to 3 */
	} B2;
	int I;
	unsigned int U;

} P32_IOCR0_type;
#define P32_IOCR0	(*( P32_IOCR0_type *) 0xf003d210u)	/* Port 32 Input/Output Control Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P33_ACCEN1_type;
#define P33_ACCEN1	(*( P33_ACCEN1_type *) 0xf003d3f8u)	/* Port 33 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P34_ACCEN1_type;
#define P34_ACCEN1	(*( P34_ACCEN1_type *) 0xf003d4f8u)	/* Port 34 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC4            : 5;	/* Port Control for Port 34 Pin 4 to 5 */
		unsigned int                : 3;
		unsigned int PC5            : 5;	/* Port Control for Port 34 Pin 4 to 5 */
		unsigned int                : 3;
		unsigned int PC6            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC7            : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC4            : 5;	/* Port Control for Port 34 Pin 4 to 5 */
		unsigned int                : 3;
		unsigned int PC5            : 5;	/* Port Control for Port 34 Pin 4 to 5 */
		unsigned int                : 3;
		unsigned int PC6            : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC7            : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P34_IOCR4_type;
#define P34_IOCR4	(*( P34_IOCR4_type *) 0xf003d414u)	/* Port 34 Input/Output Control Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Pad Driver Mode for Port 34 Pin 0 to 5 */
		unsigned int PL0            : 1;	/* Pad Level Selection for Port 34 Pin 0 to 5 */
		unsigned int PD1            : 3;	/* Pad Driver Mode for Port 34 Pin 0 to 5 */
		unsigned int PL1            : 1;	/* Pad Level Selection for Port 34 Pin 0 to 5 */
		unsigned int PD2            : 3;	/* Pad Driver Mode for Port 34 Pin 0 to 5 */
		unsigned int PL2            : 1;	/* Pad Level Selection for Port 34 Pin 0 to 5 */
		unsigned int PD3            : 3;	/* Pad Driver Mode for Port 34 Pin 0 to 5 */
		unsigned int PL3            : 1;	/* Pad Level Selection for Port 34 Pin 0 to 5 */
		unsigned int PD4            : 3;	/* Pad Driver Mode for Port 34 Pin 0 to 5 */
		unsigned int PL4            : 1;	/* Pad Level Selection for Port 34 Pin 0 to 5 */
		unsigned int PD5            : 3;	/* Pad Driver Mode for Port 34 Pin 0 to 5 */
		unsigned int PL5            : 1;	/* Pad Level Selection for Port 34 Pin 0 to 5 */
		unsigned int PD6            : 3;	/* Reserved */
		unsigned int PL6            : 1;	/* Reserved */
		unsigned int PD7            : 3;	/* Reserved */
		unsigned int PL7            : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P34_PDR0_type;
#define P34_PDR0	(*( P34_PDR0_type *) 0xf003d440u)	/* Port 34 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P40_ACCEN1_type;
#define P40_ACCEN1	(*( P40_ACCEN1_type *) 0xf003e0f8u)	/* Port 40 Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 40 Pin 8 to 9 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Port Control for Port 40 Pin 8 to 9 */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B1;
	struct
	{ 
		unsigned int                : 3;
		unsigned int PC8            : 5;	/* Port Control for Port 40 Pin 8 to 9 */
		unsigned int                : 3;
		unsigned int PC9            : 5;	/* Port Control for Port 40 Pin 8 to 9 */
		unsigned int                : 3;
		unsigned int PC10           : 5;	/* Reserved */
		unsigned int                : 3;
		unsigned int PC11           : 5;	/* Reserved */
	} B2;
	int I;
	unsigned int U;

} P40_IOCR8_type;
#define P40_IOCR8	(*( P40_IOCR8_type *) 0xf003e018u)	/* Port 40 Input/Output Control Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int PCL0           : 1;	/* Reserved */
		unsigned int PCL1           : 1;	/* Reserved */
		unsigned int PCL2           : 1;	/* Reserved */
		unsigned int PCL3           : 1;	/* Reserved */
		unsigned int PCL4           : 1;	/* Reserved */
		unsigned int PCL5           : 1;	/* Reserved */
		unsigned int PCL6           : 1;	/* Reserved */
		unsigned int PCL7           : 1;	/* Reserved */
		unsigned int PCL8           : 1;	/* Reserved */
		unsigned int PCL9           : 1;	/* Reserved */
		unsigned int PCL10          : 1;	/* Reserved */
		unsigned int PCL11          : 1;	/* Reserved */
		unsigned int PCL12          : 1;	/* Reserved */
		unsigned int PCL13          : 1;	/* Reserved */
		unsigned int PCL14          : 1;	/* Reserved */
		unsigned int PCL15          : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P40_OMCR_type;
#define P40_OMCR	(*( P40_OMCR_type *) 0xf003e094u)	/* Port 40 Output Modification Clear Register */

