svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int PCL0           : 1;	/* Reserved */
		unsigned int PCL1           : 1;	/* Reserved */
		unsigned int PCL2           : 1;	/* Reserved */
		unsigned int PCL3           : 1;	/* Reserved */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} P40_OMCR0_type;
#define P40_OMCR0	(*( P40_OMCR0_type *) 0xf003e080u)	/* Port 40 Output Modification Clear Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 20;
		unsigned int PCL4           : 1;	/* Reserved */
		unsigned int PCL5           : 1;	/* Reserved */
		unsigned int PCL6           : 1;	/* Reserved */
		unsigned int PCL7           : 1;	/* Reserved */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} P40_OMCR4_type;
#define P40_OMCR4	(*( P40_OMCR4_type *) 0xf003e084u)	/* Port 40 Output Modification Clear Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int PCL8           : 1;	/* Reserved */
		unsigned int PCL9           : 1;	/* Reserved */
		unsigned int PCL10          : 1;	/* Reserved */
		unsigned int PCL11          : 1;	/* Reserved */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} P40_OMCR8_type;
#define P40_OMCR8	(*( P40_OMCR8_type *) 0xf003e088u)	/* Port 40 Output Modification Clear Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* Reserved */
		unsigned int PS1            : 1;	/* Reserved */
		unsigned int PS2            : 1;	/* Reserved */
		unsigned int PS3            : 1;	/* Reserved */
		unsigned int PS4            : 1;	/* Reserved */
		unsigned int PS5            : 1;	/* Reserved */
		unsigned int PS6            : 1;	/* Reserved */
		unsigned int PS7            : 1;	/* Reserved */
		unsigned int PS8            : 1;	/* Reserved */
		unsigned int PS9            : 1;	/* Reserved */
		unsigned int PS10           : 1;	/* Reserved */
		unsigned int PS11           : 1;	/* Reserved */
		unsigned int PS12           : 1;	/* Reserved */
		unsigned int PS13           : 1;	/* Reserved */
		unsigned int PS14           : 1;	/* Reserved */
		unsigned int PS15           : 1;	/* Reserved */
		unsigned int PCL0           : 1;	/* Reserved */
		unsigned int PCL1           : 1;	/* Reserved */
		unsigned int PCL2           : 1;	/* Reserved */
		unsigned int PCL3           : 1;	/* Reserved */
		unsigned int PCL4           : 1;	/* Reserved */
		unsigned int PCL5           : 1;	/* Reserved */
		unsigned int PCL6           : 1;	/* Reserved */
		unsigned int PCL7           : 1;	/* Reserved */
		unsigned int PCL8           : 1;	/* Reserved */
		unsigned int PCL9           : 1;	/* Reserved */
		unsigned int PCL10          : 1;	/* Reserved */
		unsigned int PCL11          : 1;	/* Reserved */
		unsigned int PCL12          : 1;	/* Reserved */
		unsigned int PCL13          : 1;	/* Reserved */
		unsigned int PCL14          : 1;	/* Reserved */
		unsigned int PCL15          : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P40_OMR_type;
#define P40_OMR	(*( P40_OMR_type *) 0xf003e004u)	/* Port 40 Output Modification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* Reserved */
		unsigned int PS1            : 1;	/* Reserved */
		unsigned int PS2            : 1;	/* Reserved */
		unsigned int PS3            : 1;	/* Reserved */
		unsigned int PS4            : 1;	/* Reserved */
		unsigned int PS5            : 1;	/* Reserved */
		unsigned int PS6            : 1;	/* Reserved */
		unsigned int PS7            : 1;	/* Reserved */
		unsigned int PS8            : 1;	/* Reserved */
		unsigned int PS9            : 1;	/* Reserved */
		unsigned int PS10           : 1;	/* Reserved */
		unsigned int PS11           : 1;	/* Reserved */
		unsigned int PS12           : 1;	/* Reserved */
		unsigned int PS13           : 1;	/* Reserved */
		unsigned int PS14           : 1;	/* Reserved */
		unsigned int PS15           : 1;	/* Reserved */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P40_OMSR_type;
#define P40_OMSR	(*( P40_OMSR_type *) 0xf003e090u)	/* Port 40 Output Modification Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PS0            : 1;	/* Reserved */
		unsigned int PS1            : 1;	/* Reserved */
		unsigned int PS2            : 1;	/* Reserved */
		unsigned int PS3            : 1;	/* Reserved */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} P40_OMSR0_type;
#define P40_OMSR0	(*( P40_OMSR0_type *) 0xf003e070u)	/* Port 40 Output Modification Set Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int PS4            : 1;	/* Reserved */
		unsigned int PS5            : 1;	/* Reserved */
		unsigned int PS6            : 1;	/* Reserved */
		unsigned int PS7            : 1;	/* Reserved */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} P40_OMSR4_type;
#define P40_OMSR4	(*( P40_OMSR4_type *) 0xf003e074u)	/* Port 40 Output Modification Set Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 8;
		unsigned int PS8            : 1;	/* Reserved */
		unsigned int PS9            : 1;	/* Reserved */
		unsigned int PS10           : 1;	/* Reserved */
		unsigned int PS11           : 1;	/* Reserved */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} P40_OMSR8_type;
#define P40_OMSR8	(*( P40_OMSR8_type *) 0xf003e078u)	/* Port 40 Output Modification Set Register 8 */

typedef volatile union
{
	struct
	{ 
		unsigned int P0             : 1;	/* Reserved */
		unsigned int P1             : 1;	/* Reserved */
		unsigned int P2             : 1;	/* Reserved */
		unsigned int P3             : 1;	/* Reserved */
		unsigned int P4             : 1;	/* Reserved */
		unsigned int P5             : 1;	/* Reserved */
		unsigned int P6             : 1;	/* Reserved */
		unsigned int P7             : 1;	/* Reserved */
		unsigned int P8             : 1;	/* Reserved */
		unsigned int P9             : 1;	/* Reserved */
		unsigned int P10            : 1;	/* Reserved */
		unsigned int P11            : 1;	/* Reserved */
		unsigned int P12            : 1;	/* Reserved */
		unsigned int P13            : 1;	/* Reserved */
		unsigned int P14            : 1;	/* Reserved */
		unsigned int P15            : 1;	/* Reserved */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P40_OUT_type;
