svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define P40_OUT	(*( P40_OUT_type *) 0xf003e000u)	/* Port 40 Output Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PDIS0          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS1          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS2          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS3          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS4          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS5          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS6          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS7          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS8          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS9          : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS10         : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS11         : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS12         : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS13         : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS14         : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int PDIS15         : 1;	/* Pin Function Decision Control for Pin x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} P40_PDISC_type;
#define P40_PDISC	(*( P40_PDISC_type *) 0xf003e060u)	/* Port 40 Pin Function Decision Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PD0            : 3;	/* Reserved */
		unsigned int PL0            : 1;	/* Reserved */
		unsigned int PD1            : 3;	/* Reserved */
		unsigned int PL1            : 1;	/* Reserved */
		unsigned int PD2            : 3;	/* Reserved */
		unsigned int PL2            : 1;	/* Reserved */
		unsigned int PD3            : 3;	/* Reserved */
		unsigned int PL3            : 1;	/* Reserved */
		unsigned int PD4            : 3;	/* Reserved */
		unsigned int PL4            : 1;	/* Reserved */
		unsigned int PD5            : 3;	/* Reserved */
		unsigned int PL5            : 1;	/* Reserved */
		unsigned int PD6            : 3;	/* Reserved */
		unsigned int PL6            : 1;	/* Reserved */
		unsigned int PD7            : 3;	/* Reserved */
		unsigned int PL7            : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P40_PDR0_type;
#define P40_PDR0	(*( P40_PDR0_type *) 0xf003e040u)	/* Port 40 Pad Driver Mode 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PD8            : 3;	/* Reserved */
		unsigned int PL8            : 1;	/* Reserved */
		unsigned int PD9            : 3;	/* Reserved */
		unsigned int PL9            : 1;	/* Reserved */
		unsigned int PD10           : 3;	/* Reserved */
		unsigned int PL10           : 1;	/* Reserved */
		unsigned int PD11           : 3;	/* Reserved */
		unsigned int PL11           : 1;	/* Reserved */
		unsigned int PD12           : 3;	/* Reserved */
		unsigned int PL12           : 1;	/* Reserved */
		unsigned int PD13           : 3;	/* Reserved */
		unsigned int PL13           : 1;	/* Reserved */
		unsigned int PD14           : 3;	/* Reserved */
		unsigned int PL14           : 1;	/* Reserved */
		unsigned int PD15           : 3;	/* Reserved */
		unsigned int PL15           : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} P40_PDR1_type;
#define P40_PDR1	(*( P40_PDR1_type *) 0xf003e044u)	/* Port 40 Pad Driver Mode 1 Register */


/* FCE */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

