svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} FCE_ACCEN0_type;
#define FCE_ACCEN0	(*( FCE_ACCEN0_type *) 0xf0003ffcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} FCE_ACCEN1_type;
#define FCE_ACCEN1	(*( FCE_ACCEN1_type *) 0xf0003ff8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CMI            : 1;	/* CRC Mismatch Interrupt */
		unsigned int CEI            : 1;	/* Configuration Error Interrupt */
		unsigned int LEI            : 1;	/* Length Error Interrupt */
		unsigned int BEI            : 1;	/* Bus Error Interrupt */
		unsigned int CCE            : 1;	/* CRC Check Comparison */
		unsigned int ALR            : 1;	/* Automatic Length Reload */
		unsigned int                : 2;
		unsigned int REFIN          : 1;	/* IR Byte Wise Reflection */
		unsigned int REFOUT         : 1;	/* CRC 32-Bit Wise Reflection */
		unsigned int XSEL           : 1;	/* Selects the value to be xored with the final CRC */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} FCE_CFG0_type;
#define FCE_CFG0	(*( FCE_CFG0_type *) 0xf0003f28u)	/* CRC Configuration Register 0 */
#define FCE_CFG1	(*( FCE_CFG0_type *) 0xf0003f48u)	/* CRC Configuration Register 1 */
#define FCE_CFG2	(*( FCE_CFG0_type *) 0xf0003f68u)	/* CRC Configuration Register 2 */
#define FCE_CFG3	(*( FCE_CFG0_type *) 0xf0003f88u)	/* CRC Configuration Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int CHECK          : 32;	/* CHECK Register */
	} B;
	int I;
	unsigned int U;

} FCE_CHECK0_type;
#define FCE_CHECK0	(*( FCE_CHECK0_type *) 0xf0003f34u)	/* CRC Check Register 0 */
#define FCE_CHECK1	(*( FCE_CHECK0_type *) 0xf0003f54u)	/* CRC Check Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CHECK          : 16;	/* CHECK Register */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FCE_CHECK2_type;
#define FCE_CHECK2	(*( FCE_CHECK2_type *) 0xf0003f74u)	/* CRC Check Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int CHECK          : 8;	/* CHECK Register */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} FCE_CHECK3_type;
#define FCE_CHECK3	(*( FCE_CHECK3_type *) 0xf0003f94u)	/* CRC Check Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} FCE_CLC_type;
#define FCE_CLC	(*( FCE_CLC_type *) 0xf0003f00u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CRC            : 32;	/* CRC Register */
	} B;
	int I;
	unsigned int U;

} FCE_CRC0_type;
#define FCE_CRC0	(*( FCE_CRC0_type *) 0xf0003f38u)	/* CRC Register 0 */
#define FCE_CRC1	(*( FCE_CRC0_type *) 0xf0003f58u)	/* CRC Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CRC            : 16;	/* CRC Register */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FCE_CRC2_type;
#define FCE_CRC2	(*( FCE_CRC2_type *) 0xf0003f78u)	/* CRC Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int CRC            : 8;	/* CRC Register */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} FCE_CRC3_type;
#define FCE_CRC3	(*( FCE_CRC3_type *) 0xf0003f98u)	/* CRC Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int FCM            : 1;	/* Force CRC Mismatch */
		unsigned int FRM_CFG        : 1;	/* Force CFG Register Mismatch */
		unsigned int FRM_CHECK      : 1;	/* Force Check Register Mismatch */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} FCE_CTR0_type;
#define FCE_CTR0	(*( FCE_CTR0_type *) 0xf0003f3cu)	/* CRC Test Register 0 */
#define FCE_CTR1	(*( FCE_CTR0_type *) 0xf0003f5cu)	/* CRC Test Register 1 */
#define FCE_CTR2	(*( FCE_CTR0_type *) 0xf0003f7cu)	/* CRC Test Register 2 */
#define FCE_CTR3	(*( FCE_CTR0_type *) 0xf0003f9cu)	/* CRC Test Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} FCE_ID_type;
#define FCE_ID	(*( FCE_ID_type *) 0xf0003f08u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IR             : 32;	/* Input Register */
	} B;
	int I;
	unsigned int U;

} FCE_IR0_type;
#define FCE_IR0	(*( FCE_IR0_type *) 0xf0003f20u)	/* Input Register 0 */
#define FCE_IR1	(*( FCE_IR0_type *) 0xf0003f40u)	/* Input Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int IR             : 16;	/* Input Register */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FCE_IR2_type;
#define FCE_IR2	(*( FCE_IR2_type *) 0xf0003f60u)	/* Input Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int IR             : 8;	/* Input Register */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} FCE_IR3_type;
#define FCE_IR3	(*( FCE_IR3_type *) 0xf0003f80u)	/* Input Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} FCE_KRST0_type;
#define FCE_KRST0	(*( FCE_KRST0_type *) 0xf0003ff4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} FCE_KRST1_type;
#define FCE_KRST1	(*( FCE_KRST1_type *) 0xf0003ff0u)	/* Kernel Reset Register 1 */

