svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} FCE_KRSTCLR_type;
#define FCE_KRSTCLR	(*( FCE_KRSTCLR_type *) 0xf0003fecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LENGTH         : 16;	/* Message Length Register */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FCE_LENGTH0_type;
#define FCE_LENGTH0	(*( FCE_LENGTH0_type *) 0xf0003f30u)	/* CRC Length Register 0 */
#define FCE_LENGTH1	(*( FCE_LENGTH0_type *) 0xf0003f50u)	/* CRC Length Register 1 */
#define FCE_LENGTH2	(*( FCE_LENGTH0_type *) 0xf0003f70u)	/* CRC Length Register 2 */
#define FCE_LENGTH3	(*( FCE_LENGTH0_type *) 0xf0003f90u)	/* CRC Length Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Result Register */
	} B;
	int I;
	unsigned int U;

} FCE_RES0_type;
#define FCE_RES0	(*( FCE_RES0_type *) 0xf0003f24u)	/* CRC Result Register 0 */
#define FCE_RES1	(*( FCE_RES0_type *) 0xf0003f44u)	/* CRC Result Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 16;	/* Result Register */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} FCE_RES2_type;
#define FCE_RES2	(*( FCE_RES2_type *) 0xf0003f64u)	/* CRC Result Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 8;	/* Result Register */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} FCE_RES3_type;
#define FCE_RES3	(*( FCE_RES3_type *) 0xf0003f84u)	/* CRC Result Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int CMF            : 1;	/* CRC Mismatch Flag */
		unsigned int CEF            : 1;	/* Configuration Error Flag */
		unsigned int LEF            : 1;	/* Length Error Flag */
		unsigned int BEF            : 1;	/* Bus Error Flag */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} FCE_STS0_type;
#define FCE_STS0	(*( FCE_STS0_type *) 0xf0003f2cu)	/* CRC Status Register 0 */
#define FCE_STS1	(*( FCE_STS0_type *) 0xf0003f4cu)	/* CRC Status Register 1 */
#define FCE_STS2	(*( FCE_STS0_type *) 0xf0003f6cu)	/* CRC Status Register 2 */
#define FCE_STS3	(*( FCE_STS0_type *) 0xf0003f8cu)	/* CRC Status Register 3 */


/* STM */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} STM0_ACCEN0_type;
#define STM0_ACCEN0	(*( STM0_ACCEN0_type *) 0xf00000fcu)	/* Access Enable Register 0 */
#define STM1_ACCEN0	(*( STM0_ACCEN0_type *) 0xf00001fcu)	/* Access Enable Register 0 */
#define STM2_ACCEN0	(*( STM0_ACCEN0_type *) 0xf00002fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} STM0_ACCEN1_type;
#define STM0_ACCEN1	(*( STM0_ACCEN1_type *) 0xf00000f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STMCAP         : 32;	/* Captured System Timer Bits [63:32] */
	} B;
	int I;
	unsigned int U;

} STM0_CAP_type;
#define STM0_CAP	(*( STM0_CAP_type *) 0xf000002cu)	/* Timer Capture Register */
#define STM1_CAP	(*( STM0_CAP_type *) 0xf000012cu)	/* Timer Capture Register */
#define STM2_CAP	(*( STM0_CAP_type *) 0xf000022cu)	/* Timer Capture Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

