svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} STM0_CLC_type;
#define STM0_CLC	(*( STM0_CLC_type *) 0xf0000000u)	/* Clock Control Register */
#define STM1_CLC	(*( STM0_CLC_type *) 0xf0000100u)	/* Clock Control Register */
#define STM2_CLC	(*( STM0_CLC_type *) 0xf0000200u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MSIZE0         : 5;	/* Compare Register Size for CMP0 */
		unsigned int                : 3;
		unsigned int MSTART0        : 5;	/* Start Bit Location for CMP0 */
		unsigned int                : 3;
		unsigned int MSIZE1         : 5;	/* Compare Register Size for CMP1 */
		unsigned int                : 3;
		unsigned int MSTART1        : 5;	/* Start Bit Location for CMP1 */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} STM0_CMCON_type;
#define STM0_CMCON	(*( STM0_CMCON_type *) 0xf0000038u)	/* Compare Match Control Register */
#define STM1_CMCON	(*( STM0_CMCON_type *) 0xf0000138u)	/* Compare Match Control Register */
#define STM2_CMCON	(*( STM0_CMCON_type *) 0xf0000238u)	/* Compare Match Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CMPVAL         : 32;	/* Compare Value of Compare Register x */
	} B;
	int I;
	unsigned int U;

} STM0_CMP0_type;
#define STM0_CMP0	(*( STM0_CMP0_type *) 0xf0000030u)	/* Compare Register 0 */
#define STM0_CMP1	(*( STM0_CMP0_type *) 0xf0000034u)	/* Compare Register 1 */
#define STM1_CMP0	(*( STM0_CMP0_type *) 0xf0000130u)	/* Compare Register 0 */
#define STM1_CMP1	(*( STM0_CMP0_type *) 0xf0000134u)	/* Compare Register 1 */
#define STM2_CMP0	(*( STM0_CMP0_type *) 0xf0000230u)	/* Compare Register 0 */
#define STM2_CMP1	(*( STM0_CMP0_type *) 0xf0000234u)	/* Compare Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CMP0EN         : 1;	/* Compare Register CMP0 Interrupt Enable Control */
		/* const */ unsigned int CMP0IR         : 1;	/* Compare Register CMP0 Interrupt Request Flag */
		unsigned int CMP0OS         : 1;	/* Compare Register CMP0 Interrupt Output Selection */
		unsigned int                : 1;
		unsigned int CMP1EN         : 1;	/* Compare Register CMP1 Interrupt Enable Control */
		/* const */ unsigned int CMP1IR         : 1;	/* Compare Register CMP1 Interrupt Request Flag */
		unsigned int CMP1OS         : 1;	/* Compare Register CMP1 Interrupt Output Selection */
		unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

} STM0_ICR_type;
#define STM0_ICR	(*( STM0_ICR_type *) 0xf000003cu)	/* Interrupt Control Register */
#define STM1_ICR	(*( STM0_ICR_type *) 0xf000013cu)	/* Interrupt Control Register */
#define STM2_ICR	(*( STM0_ICR_type *) 0xf000023cu)	/* Interrupt Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} STM0_ID_type;
#define STM0_ID	(*( STM0_ID_type *) 0xf0000008u)	/* Module Identification Register */
#define STM1_ID	(*( STM0_ID_type *) 0xf0000108u)	/* Module Identification Register */
#define STM2_ID	(*( STM0_ID_type *) 0xf0000208u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CMP0IRR        : 1;	/* Reset Compare Register CMP0 Interrupt Flag */
		unsigned int CMP0IRS        : 1;	/* Set Compare Register CMP0 Interrupt Flag */
		unsigned int CMP1IRR        : 1;	/* Reset Compare Register CMP1 Interrupt Flag */
		unsigned int CMP1IRS        : 1;	/* Set Compare Register CMP1 Interrupt Flag */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} STM0_ISCR_type;
#define STM0_ISCR	(*( STM0_ISCR_type *) 0xf0000040u)	/* Interrupt Set/Clear Register */
#define STM1_ISCR	(*( STM0_ISCR_type *) 0xf0000140u)	/* Interrupt Set/Clear Register */
#define STM2_ISCR	(*( STM0_ISCR_type *) 0xf0000240u)	/* Interrupt Set/Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} STM0_KRST0_type;
#define STM0_KRST0	(*( STM0_KRST0_type *) 0xf00000f4u)	/* Kernel Reset Register 0 */
#define STM1_KRST0	(*( STM0_KRST0_type *) 0xf00001f4u)	/* Kernel Reset Register 0 */
#define STM2_KRST0	(*( STM0_KRST0_type *) 0xf00002f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} STM0_KRST1_type;
#define STM0_KRST1	(*( STM0_KRST1_type *) 0xf00000f0u)	/* Kernel Reset Register 1 */
#define STM1_KRST1	(*( STM0_KRST1_type *) 0xf00001f0u)	/* Kernel Reset Register 1 */
#define STM2_KRST1	(*( STM0_KRST1_type *) 0xf00002f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} STM0_KRSTCLR_type;
#define STM0_KRSTCLR	(*( STM0_KRSTCLR_type *) 0xf00000ecu)	/* Kernel Reset Status Clear Register */
#define STM1_KRSTCLR	(*( STM0_KRSTCLR_type *) 0xf00001ecu)	/* Kernel Reset Status Clear Register */
#define STM2_KRSTCLR	(*( STM0_KRSTCLR_type *) 0xf00002ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} STM0_OCS_type;
#define STM0_OCS	(*( STM0_OCS_type *) 0xf00000e8u)	/* OCDS Control and Status */
#define STM1_OCS	(*( STM0_OCS_type *) 0xf00001e8u)	/* OCDS Control and Status */
#define STM2_OCS	(*( STM0_OCS_type *) 0xf00002e8u)	/* OCDS Control and Status */

