svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [31:0] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM0_type;
#define STM0_TIM0	(*( STM0_TIM0_type *) 0xf0000010u)	/* Timer Register 0 */
#define STM1_TIM0	(*( STM0_TIM0_type *) 0xf0000110u)	/* Timer Register 0 */
#define STM2_TIM0	(*( STM0_TIM0_type *) 0xf0000210u)	/* Timer Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [35:4] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM1_type;
#define STM0_TIM1	(*( STM0_TIM1_type *) 0xf0000014u)	/* Timer Register 1 */
#define STM1_TIM1	(*( STM0_TIM1_type *) 0xf0000114u)	/* Timer Register 1 */
#define STM2_TIM1	(*( STM0_TIM1_type *) 0xf0000214u)	/* Timer Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [39:8] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM2_type;
#define STM0_TIM2	(*( STM0_TIM2_type *) 0xf0000018u)	/* Timer Register 2 */
#define STM1_TIM2	(*( STM0_TIM2_type *) 0xf0000118u)	/* Timer Register 2 */
#define STM2_TIM2	(*( STM0_TIM2_type *) 0xf0000218u)	/* Timer Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [43:12] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM3_type;
#define STM0_TIM3	(*( STM0_TIM3_type *) 0xf000001cu)	/* Timer Register 3 */
#define STM1_TIM3	(*( STM0_TIM3_type *) 0xf000011cu)	/* Timer Register 3 */
#define STM2_TIM3	(*( STM0_TIM3_type *) 0xf000021cu)	/* Timer Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [47:16] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM4_type;
#define STM0_TIM4	(*( STM0_TIM4_type *) 0xf0000020u)	/* Timer Register 4 */
#define STM1_TIM4	(*( STM0_TIM4_type *) 0xf0000120u)	/* Timer Register 4 */
#define STM2_TIM4	(*( STM0_TIM4_type *) 0xf0000220u)	/* Timer Register 4 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [51:20] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM5_type;
#define STM0_TIM5	(*( STM0_TIM5_type *) 0xf0000024u)	/* Timer Register 5 */
#define STM1_TIM5	(*( STM0_TIM5_type *) 0xf0000124u)	/* Timer Register 5 */
#define STM2_TIM5	(*( STM0_TIM5_type *) 0xf0000224u)	/* Timer Register 5 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int STM            : 32;	/* System Timer Bits [63:32] */
	} B;
	int I;
	unsigned int U;

} STM0_TIM6_type;
#define STM0_TIM6	(*( STM0_TIM6_type *) 0xf0000028u)	/* Timer Register 6 */
#define STM1_TIM6	(*( STM0_TIM6_type *) 0xf0000128u)	/* Timer Register 6 */
#define STM2_TIM6	(*( STM0_TIM6_type *) 0xf0000228u)	/* Timer Register 6 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} STM1_ACCEN1_type;
#define STM1_ACCEN1	(*( STM1_ACCEN1_type *) 0xf00001f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} STM2_ACCEN1_type;
#define STM2_ACCEN1	(*( STM2_ACCEN1_type *) 0xf00002f8u)	/* Access Enable Register 1 */

#define SYSTIME_LOW	STM0_TIM0.U
#define SYSTIME_HIGH	STM0_CAP.U
#define SYSTIME0_LOW	STM0_TIM0.U
#define SYSTIME0_HIGH	STM0_CAP.U
#define SYSTIME1_LOW	STM1_TIM0.U
#define SYSTIME1_HIGH	STM1_CAP.U
#define SYSTIME2_LOW	STM2_TIM0.U
#define SYSTIME2_HIGH	STM2_CAP.U

/* OCDS */
typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 32;	/* Read/Write Data */
	} B;
	int I;
	unsigned int U;

} CBS_COMDATA_type;
#define CBS_COMDATA	(*( CBS_COMDATA_type *) 0xf0000468u)	/* Communication Mode Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 32;	/* Source Address */
	} B;
	int I;
	unsigned int U;

} CBS_ICTSA_type;
#define CBS_ICTSA	(*( CBS_ICTSA_type *) 0xf0000488u)	/* Internally Controlled Trace Source Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 32;	/* Destination Address */
	} B;
	int I;
	unsigned int U;

} CBS_ICTTA_type;
#define CBS_ICTTA	(*( CBS_ICTTA_type *) 0xf000048cu)	/* Internally Controlled Trace Destination Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SET_CRS        : 1;	/* Set Read Sync Flag */
		unsigned int SET_CWS        : 1;	/* Set Write Sync Flag */
		unsigned int SET_CS         : 1;	/* Set Communication Synchronization Flag */
		unsigned int CLR_CS         : 1;	/* Clear Communication Synchronization Flag */
		unsigned int CHANNEL_P      : 1;	/* CHANNEL Write Protection */
		unsigned int CHANNEL        : 3;	/* Channel Indication */
		unsigned int                : 8;
		unsigned int SET_INT_MOD    : 1;	/* Enter Internal Mode */
		unsigned int                : 1;
		unsigned int SET_INT_TRC    : 1;	/* Enable Internally Controlled Triggered Transfer */
		unsigned int CLR_INT_TRC    : 1;	/* Disable Internally Controlled Triggered Transfer */
		unsigned int TRC_MOD_P      : 1;	/* TRC_MOD Write Protection */
		unsigned int TRC_MOD        : 2;	/* Data Size Definition for Triggered Transfer */
		unsigned int                : 1;
		/* const */ unsigned int INT_MOD        : 1;	/* Internal Mode Enabled Flag */
		/* const */ unsigned int INT_TRC        : 1;	/* Internally Controlled Triggered Transfer Enable */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} CBS_INTMOD_type;
#define CBS_INTMOD	(*( CBS_INTMOD_type *) 0xf0000484u)	/* Internal Mode Status and Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		/* const */ unsigned int CRSYNC         : 1;	/* Communication Mode Read Sync Flag */
		/* const */ unsigned int CWSYNC         : 1;	/* Communication Mode Write Sync Flag */
		unsigned int CW_ACK         : 1;	/* Communication Mode Write Acknowledge */
		/* const */ unsigned int COM_SYNC       : 1;	/* Communication Mode Synchronization Flag */
		/* const */ unsigned int HOSTED         : 1;	/* Tool Interface in Use */
		unsigned int                : 3;
		/* const */ unsigned int CHANNEL        : 3;	/* Channel Indication */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} CBS_IOSR_type;
#define CBS_IOSR	(*( CBS_IOSR_type *) 0xf000046cu)	/* IOClient Status and Control Register */

