svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} CBS_JDPID_type;
#define CBS_JDPID	(*( CBS_JDPID_type *) 0xf0000408u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int JTAG_ID        : 32;	/* JTAG Device ID */
	} B;
	int I;
	unsigned int U;

} CBS_JTAGID_type;
#define CBS_JTAGID	(*( CBS_JTAGID_type *) 0xf0000464u)	/* JTAG Device Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OC0_P          : 1;	/* OCx Write Protection */
		unsigned int OC0            : 1;	/* Set/Clear OCDS Control Bits Bus Domain */
		unsigned int OC1_P          : 1;	/* OCx Write Protection */
		unsigned int OC1            : 1;	/* Set/Clear OCDS Control Bits Bus Domain */
		unsigned int OC2_P          : 1;	/* OCx Write Protection */
		unsigned int OC2            : 1;	/* Set/Clear OCDS Control Bits Bus Domain */
		unsigned int OC3_P          : 1;	/* OCx Write Protection */
		unsigned int OC3            : 1;	/* Set/Clear OCDS Control Bits Bus Domain */
		unsigned int OC4_P          : 1;	/* OCx Write Protection */
		unsigned int OC4            : 1;	/* Set/Clear OCDS Control Bits Bus Domain */
		unsigned int OC5_P          : 1;	/* OCx Write Protection */
		unsigned int OC5            : 1;	/* Set/Clear OCDS Control Bits Bus Domain */
		unsigned int WDTSUS_P       : 1;	/* WDTSUS Write Protection */
		unsigned int WDTSUS         : 1;	/* Set/Clear Watchdog Timer Suspension Control */
		unsigned int STABLE_P       : 1;	/* STABLE Write Protection */
		unsigned int STABLE         : 1;	/* Initialize Application Reset Indication */
		unsigned int OJC0_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC0           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC1_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC1           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC2_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC2           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC3_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC3           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC4_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC4           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC5_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC5           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC6_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC6           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
		unsigned int OJC7_P         : 1;	/* OJCx Write Protection */
		unsigned int OJC7           : 1;	/* Set/Clear OCDS Control Bits IOClient Domain */
	} B;
	int I;
	unsigned int U;

} CBS_OCNTRL_type;
#define CBS_OCNTRL	(*( CBS_OCNTRL_type *) 0xf000047cu)	/* OSCU Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PAT            : 8;	/* OCDS Enabling Pattern */
		unsigned int DS             : 1;	/* Disable OCDS */
		unsigned int                : 7;
		unsigned int IF_LCK_P       : 1;	/* IF_LCK Write Protection */
		unsigned int IF_LCK         : 1;	/* Set/Clear Interface Locked Indication */
		unsigned int AUT_OK_P       : 1;	/* AUT_OK Write Protection */
		unsigned int AUT_OK         : 1;	/* Set/Clear the Authorization OK Indication */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} CBS_OEC_type;
#define CBS_OEC	(*( CBS_OEC_type *) 0xf0000478u)	/* OCDS Enable Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DAPMODE        : 3;	/* DAP Interface Mode */
		unsigned int DAPRST         : 1;	/* DAP Protocol Clear */
		unsigned int                : 4;
		unsigned int F_JTAG         : 1;	/* Forced JTAG Mode (dap_bypass_o) */
		unsigned int N_JTAG         : 1;	/* No Switch to JTAG (jtag_disable_o) */
		unsigned int                : 2;
		unsigned int PADCTL         : 4;	/* Pad Control for Debug Interface Pins (padctl_o) */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CBS_OIFM_type;
#define CBS_OIFM	(*( CBS_OIFM_type *) 0xf000040cu)	/* OCDS Interface Mode Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OEN            : 1;	/* OCDS Enabled Flag */
		/* const */ unsigned int OC0            : 1;	/* OCDS Control Bits System Bus Domain */
		/* const */ unsigned int OC1            : 1;	/* OCDS Control Bits System Bus Domain */
		/* const */ unsigned int OC2            : 1;	/* OCDS Control Bits System Bus Domain */
		/* const */ unsigned int ENIDIS         : 1;	/* OCDS ENDINIT Protection Override */
		/* const */ unsigned int EECTRC         : 1;	/* On Chip Trace Enable */
		/* const */ unsigned int EECDIS         : 1;	/* Emulation Logic Disable */
		/* const */ unsigned int WDTSUS         : 1;	/* Control of Watchdog Timer Suspension */
		/* const */ unsigned int HARR           : 1;	/* Halt after Reset Request */
		/* const */ unsigned int OJC1           : 1;	/* OCDS Control Bits IOClient Domain */
		/* const */ unsigned int OJC2           : 1;	/* OCDS Control Bits IOClient Domain */
		/* const */ unsigned int OJC3           : 1;	/* OCDS Control Bits IOClient Domain */
		/* const */ unsigned int RSTCL0         : 1;	/* OCDS System Reset (Class 0) Request */
		/* const */ unsigned int RSTCL1         : 1;	/* OCDS Debug Reset (Class 1) Request */
		/* const */ unsigned int OJC6           : 1;	/* OCDS Control Bits IOClient Domain */
		/* const */ unsigned int RSTCL3         : 1;	/* OCDS Application Reset (Class 3) Request */
		/* const */ unsigned int IF_LCK         : 1;	/* Interface Locked Indication */
		/* const */ unsigned int AUT_OK         : 1;	/* Authorization OK Indication */
		/* const */ unsigned int STABLE         : 1;	/* Application Reset Indication */
		/* const */ unsigned int                : 13;
	} B;
	int I;
	unsigned int U;

} CBS_OSTATE_type;
#define CBS_OSTATE	(*( CBS_OSTATE_type *) 0xf0000480u)	/* OSCU Status Register */

