svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int C0             : 1;	/* Capture of BRKOUT Signal of CPUx */
		/* const */ unsigned int C1             : 1;	/* Capture of BRKOUT Signal of CPUx */
		/* const */ unsigned int C2             : 1;	/* Capture of BRKOUT Signal of CPUx */
		/* const */ unsigned int                : 28;
		/* const */ unsigned int HSM            : 1;	/* Capture of BRKOUT Signal of HSM */
	} B;
	int I;
	unsigned int U;

} CBS_TCCB_type;
#define CBS_TCCB	(*( CBS_TCCB_type *) 0xf00004b0u)	/* TG Capture for Cores - BRKOUT */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int C0             : 1;	/* Capture of HALT Signal of CPUx */
		/* const */ unsigned int C1             : 1;	/* Capture of HALT Signal of CPUx */
		/* const */ unsigned int C2             : 1;	/* Capture of HALT Signal of CPUx */
		/* const */ unsigned int                : 28;
		/* const */ unsigned int HSM            : 1;	/* Capture of HALT Signal of HSM */
	} B;
	int I;
	unsigned int U;

} CBS_TCCH_type;
#define CBS_TCCH	(*( CBS_TCCH_type *) 0xf00004b4u)	/* TG Capture for Cores - HALT */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int P0             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P1             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P2             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P3             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P4             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P5             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P6             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int P7             : 1;	/* Capture of Trigger Input Pin x */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CBS_TCIP_type;
#define CBS_TCIP	(*( CBS_TCIP_type *) 0xf000041cu)	/* TG Capture for TG Input Pins */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int BRK            : 1;	/* Capture of MCDS break_out */
		/* const */ unsigned int SUS            : 1;	/* Capture of MCDS suspend_out */
		/* const */ unsigned int                : 6;
		/* const */ unsigned int T0             : 1;	/* Capture of MCDS trig_out x */
		/* const */ unsigned int T1             : 1;	/* Capture of MCDS trig_out x */
		/* const */ unsigned int T2             : 1;	/* Capture of MCDS trig_out x */
		/* const */ unsigned int T3             : 1;	/* Capture of MCDS trig_out x */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} CBS_TCM_type;
#define CBS_TCM	(*( CBS_TCM_type *) 0xf00004bcu)	/* TG Capture for MCDS */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OTGB0          : 16;	/* Capture Bits for OTGB0 */
		/* const */ unsigned int OTGB1          : 16;	/* Capture Bits for OTGB1 */
	} B;
	int I;
	unsigned int U;

} CBS_TCTGB_type;
#define CBS_TCTGB	(*( CBS_TCTGB_type *) 0xf00004b8u)	/* TG Capture for OTGB0/1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 1;
		/* const */ unsigned int TL1            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int TL2            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int TL3            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int TL4            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int TL5            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int TL6            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int TL7            : 1;	/* Capture of Trigger Line x */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CBS_TCTL_type;
#define CBS_TCTL	(*( CBS_TCTL_type *) 0xf0000474u)	/* TG Capture for TG Lines */

typedef volatile union
{
	struct
	{ 
		unsigned int PIN0           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN1           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN2           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN3           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN4           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN5           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN6           : 4;	/* Trigger Pin x to Trigger Line Routing */
		unsigned int PIN7           : 4;	/* Trigger Pin x to Trigger Line Routing */
	} B;
	int I;
	unsigned int U;

} CBS_TIPR_type;
#define CBS_TIPR	(*( CBS_TIPR_type *) 0xf0000410u)	/* TG Input Pins Routing */

typedef volatile union
{
	struct
	{ 
		unsigned int C0             : 1;	/* CPUx as Suspend Target */
		unsigned int C1             : 1;	/* CPUx as Suspend Target */
		unsigned int C2             : 1;	/* CPUx as Suspend Target */
		unsigned int                : 21;
		unsigned int M0123          : 4;	/* Master X as Suspend Target */
		unsigned int HSS            : 1;	/* HSSL as Suspend Target */
		unsigned int SDM            : 1;	/* SDMA as Suspend Target */
		unsigned int DM             : 1;	/* DMA as Suspend Target */
		unsigned int HSM            : 1;	/* HSM as Suspend Target */
	} B;
	int I;
	unsigned int U;

} CBS_TL1ST_type;
#define CBS_TL1ST	(*( CBS_TL1ST_type *) 0xf0000494u)	/* TG Line 1 Suspend Targets */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int TLSP1          : 4;	/* TG Line Signal Processing */
		unsigned int TLSP2          : 4;	/* TG Line Signal Processing */
		unsigned int TLSP3          : 4;	/* TG Line Signal Processing */
		unsigned int TLSP4          : 4;	/* TG Line Signal Processing */
		unsigned int TLSP5          : 4;	/* TG Line Signal Processing */
		unsigned int TLSP6          : 4;	/* TG Line Signal Processing */
		unsigned int TLSP7          : 4;	/* TG Line Signal Processing */
	} B;
	int I;
	unsigned int U;

