svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} CBS_TLC_type;
#define CBS_TLC	(*( CBS_TLC_type *) 0xf0000490u)	/* TG Line Control */

typedef volatile union
{
	struct
	{ 
		unsigned int TGL            : 4;	/* Trigger Line to Counter Routing */
		unsigned int LE             : 3;	/* Level or Edge Counting */
		unsigned int                : 1;
		unsigned int CLR            : 2;	/* Clear and Enable Counter(s) */
		unsigned int                : 2;
		unsigned int STOP           : 2;	/* Stop Counter(s) */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} CBS_TLCC0_type;
#define CBS_TLCC0	(*( CBS_TLCC0_type *) 0xf0000440u)	/* TG Line Counter Control */
#define CBS_TLCC1	(*( CBS_TLCC0_type *) 0xf0000444u)	/* TG Line Counter Control */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int TL1            : 1;	/* Capture and Hold Enable for Trigger Line x */
		unsigned int TL2            : 1;	/* Capture and Hold Enable for Trigger Line x */
		unsigned int TL3            : 1;	/* Capture and Hold Enable for Trigger Line x */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CBS_TLCHE_type;
#define CBS_TLCHE	(*( CBS_TLCHE_type *) 0xf0000498u)	/* TG Line Capture and Hold Enable */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int TL1            : 1;	/* Capture and Hold Clear for Trigger Line x */
		unsigned int TL2            : 1;	/* Capture and Hold Clear for Trigger Line x */
		unsigned int TL3            : 1;	/* Capture and Hold Clear for Trigger Line x */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} CBS_TLCHS_type;
#define CBS_TLCHS	(*( CBS_TLCHS_type *) 0xf000049cu)	/* TG Line Capture and Hold Clear */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CV             : 31;	/* Count Value */
		/* const */ unsigned int SO             : 1;	/* Sticky Overflow Bit */
	} B;
	int I;
	unsigned int U;

} CBS_TLCV0_type;
#define CBS_TLCV0	(*( CBS_TLCV0_type *) 0xf0000450u)	/* TG Line Counter Value */
#define CBS_TLCV1	(*( CBS_TLCV0_type *) 0xf0000454u)	/* TG Line Counter Value */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 1;
		/* const */ unsigned int TL1            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int TL2            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int TL3            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int TL4            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int TL5            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int TL6            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int TL7            : 1;	/* Current State of Trigger Line x */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} CBS_TLS_type;
#define CBS_TLS	(*( CBS_TLS_type *) 0xf0000470u)	/* TG Line State */

typedef volatile union
{
	struct
	{ 
		unsigned int TGL            : 4;	/* Timer to Trigger Line Routing */
		unsigned int VTZ            : 1;	/* TG Line Value when Timer Value is Zero */
		unsigned int                : 11;
		unsigned int TIM            : 16;	/* Timer Value */
	} B;
	int I;
	unsigned int U;

} CBS_TLT_type;
#define CBS_TLT	(*( CBS_TLT_type *) 0xf00004a8u)	/* TG Line Timer */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int TL1            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int TL2            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int TL3            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int TL4            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int TL5            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int TL6            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int TL7            : 2;	/* TG Line Enabling for Trigger to Host (TRIG) */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CBS_TLTTH_type;
#define CBS_TLTTH	(*( CBS_TLTTH_type *) 0xf00004acu)	/* TG Lines for Trigger to Host */

typedef volatile union
{
	struct
	{ 
		unsigned int PIN0           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN1           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN2           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN3           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN4           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN5           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN6           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int PIN7           : 2;	/* Pulse Stretch Control for Trigger Pin x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CBS_TOPPS_type;
#define CBS_TOPPS	(*( CBS_TOPPS_type *) 0xf0000418u)	/* TG Output Pins Pulse Stretcher */

typedef volatile union
{
	struct
	{ 
		unsigned int PIN0           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN1           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN2           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN3           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN4           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN5           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN6           : 4;	/* Trigger Line to Trigger Pin x Routing */
		unsigned int PIN7           : 4;	/* Trigger Line to Trigger Pin x Routing */
	} B;
	int I;
	unsigned int U;

} CBS_TOPR_type;
#define CBS_TOPR	(*( CBS_TOPR_type *) 0xf0000414u)	/* TG Output Pins Routing */

