svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int HALT           : 4;	/* HALT to Trigger Line Routing */
		unsigned int BRKOUT         : 4;	/* BRKOUT to Trigger Line Routing */
		unsigned int BT1            : 1;	/* BRKOUT to Trigger Line 1 Routing */
		unsigned int                : 11;
		unsigned int BRKIN          : 4;	/* Trigger Line to BRKIN Routing */
		unsigned int SUSIN          : 4;	/* Trigger Line to SUSIN Routing */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} CBS_TRC0_type;
#define CBS_TRC0	(*( CBS_TRC0_type *) 0xf0000420u)	/* TG Routing for CPU0 */
#define CBS_TRC1	(*( CBS_TRC0_type *) 0xf0000424u)	/* TG Routing for CPU1 */
#define CBS_TRC2	(*( CBS_TRC0_type *) 0xf0000428u)	/* TG Routing for CPU2 */

typedef volatile union
{
	struct
	{ 
		unsigned int TR0EV          : 4;	/* TRxEVT to Trigger Line Routing */
		unsigned int                : 4;
		unsigned int TR2EV          : 4;	/* TRxEVT to Trigger Line Routing */
		unsigned int                : 4;
		unsigned int TR4EV          : 4;	/* TRxEVT to Trigger Line Routing */
		unsigned int                : 4;
		unsigned int TR6EV          : 4;	/* TRxEVT to Trigger Line Routing */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} CBS_TREC0_type;
#define CBS_TREC0	(*( CBS_TREC0_type *) 0xf00004c0u)	/* TG Routing Events of CPU0 */
#define CBS_TREC1	(*( CBS_TREC0_type *) 0xf00004c4u)	/* TG Routing Events of CPU1 */
#define CBS_TREC2	(*( CBS_TREC0_type *) 0xf00004c8u)	/* TG Routing Events of CPU2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TRGx_0         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_1         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_2         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_3         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_4         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_5         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_6         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_7         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_8         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_9         : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_10        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_11        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_12        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_13        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_14        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_15        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_16        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_17        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_18        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_19        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_20        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_21        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_22        : 1;	/* Service Request Bits */
		/* const */ unsigned int TRGx_23        : 1;	/* Service Request Bits */
		/* const */ unsigned int x              : 8;	/* TRIG register number */
	} B;
	int I;
	unsigned int U;

} CBS_TRIG0_type;
#define CBS_TRIG0	(*( CBS_TRIG0_type *) 0xf0000500u)	/* Trigger to Host Register 0 */
#define CBS_TRIG1	(*( CBS_TRIG0_type *) 0xf0000504u)	/* Trigger to Host Register 1 */
#define CBS_TRIG10	(*( CBS_TRIG0_type *) 0xf0000528u)	/* Trigger to Host Register 10 */
#define CBS_TRIG11	(*( CBS_TRIG0_type *) 0xf000052cu)	/* Trigger to Host Register 11 */
#define CBS_TRIG12	(*( CBS_TRIG0_type *) 0xf0000530u)	/* Trigger to Host Register 12 */
#define CBS_TRIG13	(*( CBS_TRIG0_type *) 0xf0000534u)	/* Trigger to Host Register 13 */
#define CBS_TRIG14	(*( CBS_TRIG0_type *) 0xf0000538u)	/* Trigger to Host Register 14 */
#define CBS_TRIG15	(*( CBS_TRIG0_type *) 0xf000053cu)	/* Trigger to Host Register 15 */
#define CBS_TRIG16	(*( CBS_TRIG0_type *) 0xf0000540u)	/* Trigger to Host Register 16 */
#define CBS_TRIG17	(*( CBS_TRIG0_type *) 0xf0000544u)	/* Trigger to Host Register 17 */
#define CBS_TRIG18	(*( CBS_TRIG0_type *) 0xf0000548u)	/* Trigger to Host Register 18 */
#define CBS_TRIG19	(*( CBS_TRIG0_type *) 0xf000054cu)	/* Trigger to Host Register 19 */
#define CBS_TRIG2	(*( CBS_TRIG0_type *) 0xf0000508u)	/* Trigger to Host Register 2 */
#define CBS_TRIG20	(*( CBS_TRIG0_type *) 0xf0000550u)	/* Trigger to Host Register 20 */
#define CBS_TRIG21	(*( CBS_TRIG0_type *) 0xf0000554u)	/* Trigger to Host Register 21 */
#define CBS_TRIG3	(*( CBS_TRIG0_type *) 0xf000050cu)	/* Trigger to Host Register 3 */
#define CBS_TRIG4	(*( CBS_TRIG0_type *) 0xf0000510u)	/* Trigger to Host Register 4 */
#define CBS_TRIG5	(*( CBS_TRIG0_type *) 0xf0000514u)	/* Trigger to Host Register 5 */
#define CBS_TRIG6	(*( CBS_TRIG0_type *) 0xf0000518u)	/* Trigger to Host Register 6 */
#define CBS_TRIG7	(*( CBS_TRIG0_type *) 0xf000051cu)	/* Trigger to Host Register 7 */
#define CBS_TRIG8	(*( CBS_TRIG0_type *) 0xf0000520u)	/* Trigger to Host Register 8 */
#define CBS_TRIG9	(*( CBS_TRIG0_type *) 0xf0000524u)	/* Trigger to Host Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TRGx_0         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_1         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_2         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_3         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_4         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_5         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_6         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_7         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_8         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_9         : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_10        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_11        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_12        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_13        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_14        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_15        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_16        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_17        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_18        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_19        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_20        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_21        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_22        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int TRGx_23        : 1;	/* Request Bits of most important register TRIGx */
		/* const */ unsigned int x              : 8;	/* Index of most important register TRIGx */
	} B;
	int I;
	unsigned int U;

} CBS_TRIGC_type;
#define CBS_TRIGC	(*( CBS_TRIGC_type *) 0xf00004a4u)	/* Clear Trigger to Host Register */

