svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int BITNUM         : 13;	/* Service Request Bit Number to Set */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} CBS_TRIGS_type;
#define CBS_TRIGS	(*( CBS_TRIGS_type *) 0xf00004a0u)	/* Set Trigger to Host Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 4;
		unsigned int BRKOUT         : 4;	/* MCDS break_out to Trigger Line Routing */
		unsigned int SUSOUT         : 4;	/* MCDS suspend_out to Trigger Line Routing */
		unsigned int                : 8;
		unsigned int BRKIN          : 4;	/* Trigger Line to MCDS break_in Routing */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CBS_TRMC_type;
#define CBS_TRMC	(*( CBS_TRMC_type *) 0xf000043cu)	/* TG Routing for MCDS Control */

typedef volatile union
{
	struct
	{ 
		unsigned int TG0            : 4;	/* MCDS trig_out x to Trigger Line Routing */
		unsigned int TG1            : 4;	/* MCDS trig_out x to Trigger Line Routing */
		unsigned int TG2            : 4;	/* MCDS trig_out x to Trigger Line Routing */
		unsigned int TG3            : 4;	/* MCDS trig_out x to Trigger Line Routing */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} CBS_TRMT_type;
#define CBS_TRMT	(*( CBS_TRMT_type *) 0xf00004dcu)	/* TG Routing for MCDS Triggers */

typedef volatile union
{
	struct
	{ 
		unsigned int TT             : 4;	/* Trigger Line to Cerberus? Triggered Transfer Routing */
		unsigned int                : 12;
		unsigned int SRC0           : 4;	/* Trigger Line to SRCx Interrupt Routing */
		unsigned int SRC1           : 4;	/* Trigger Line to SRCx Interrupt Routing */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} CBS_TRSS_type;
#define CBS_TRSS	(*( CBS_TRSS_type *) 0xf0000460u)	/* TG Routing for Special Signals */

typedef volatile union
{
	struct
	{ 
		unsigned int TG8            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG9            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG10           : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG11           : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG12           : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG13           : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG14           : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG15           : 4;	/* OTGB0 Bit x to Trigger Line Routing */
	} B;
	int I;
	unsigned int U;

} CBS_TRTGB0H_type;
#define CBS_TRTGB0H	(*( CBS_TRTGB0H_type *) 0xf00004e4u)	/* TG Routing for OTGB0 Bits [15:8] */

typedef volatile union
{
	struct
	{ 
		unsigned int TG0            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG1            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG2            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG3            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG4            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG5            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG6            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
		unsigned int TG7            : 4;	/* OTGB0 Bit x to Trigger Line Routing */
	} B;
	int I;
	unsigned int U;

} CBS_TRTGB0L_type;
#define CBS_TRTGB0L	(*( CBS_TRTGB0L_type *) 0xf00004e0u)	/* TG Routing for OTGB0 Bits [7:0] */

typedef volatile union
{
	struct
	{ 
		unsigned int TG8            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG9            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG10           : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG11           : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG12           : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG13           : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG14           : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG15           : 4;	/* OTGB1 Bit x to Trigger Line Routing */
	} B;
	int I;
	unsigned int U;

} CBS_TRTGB1H_type;
#define CBS_TRTGB1H	(*( CBS_TRTGB1H_type *) 0xf00004ecu)	/* TG Routing for OTGB1 Bits [15:8] */

typedef volatile union
{
	struct
	{ 
		unsigned int TG0            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG1            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG2            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG3            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG4            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG5            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG6            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
		unsigned int TG7            : 4;	/* OTGB1 Bit x to Trigger Line Routing */
	} B;
	int I;
	unsigned int U;

} CBS_TRTGB1L_type;
#define CBS_TRTGB1L	(*( CBS_TRTGB1L_type *) 0xf00004e8u)	/* TG Routing for OTGB1 Bits [7:0] */


/* ASCLIN */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_ACCEN0_type;
#define ASCLIN0_ACCEN0	(*( ASCLIN0_ACCEN0_type *) 0xf00006fcu)	/* Access Enable Register 0 */
#define ASCLIN1_ACCEN0	(*( ASCLIN0_ACCEN0_type *) 0xf00007fcu)	/* Access Enable Register 0 */
#define ASCLIN2_ACCEN0	(*( ASCLIN0_ACCEN0_type *) 0xf00008fcu)	/* Access Enable Register 0 */
#define ASCLIN3_ACCEN0	(*( ASCLIN0_ACCEN0_type *) 0xf00009fcu)	/* Access Enable Register 0 */

