svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_ACCEN1_type;
#define ASCLIN0_ACCEN1	(*( ASCLIN0_ACCEN1_type *) 0xf00006f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PRESCALER      : 12;	/* Prescaling of the Fractional Divider */
		unsigned int                : 4;
		unsigned int OVERSAMPLING   : 4;	/* Oversampling Factor */
		unsigned int                : 4;
		unsigned int SAMPLEPOINT    : 4;	/* Sample Point Position */
		unsigned int                : 3;
		unsigned int SM             : 1;	/* Sample Mode */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_BITCON_type;
#define ASCLIN0_BITCON	(*( ASCLIN0_BITCON_type *) 0xf0000614u)	/* Bit Configuration Register */
#define ASCLIN1_BITCON	(*( ASCLIN0_BITCON_type *) 0xf0000714u)	/* Bit Configuration Register */
#define ASCLIN2_BITCON	(*( ASCLIN0_BITCON_type *) 0xf0000814u)	/* Bit Configuration Register */
#define ASCLIN3_BITCON	(*( ASCLIN0_BITCON_type *) 0xf0000914u)	/* Bit Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LOWERLIMIT     : 8;	/* Lower Limit */
		unsigned int UPPERLIMIT     : 8;	/* Upper Limit */
		/* const */ unsigned int MEASURED       : 12;	/* Measured Value of the Denominator */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_BRD_type;
#define ASCLIN0_BRD	(*( ASCLIN0_BRD_type *) 0xf0000624u)	/* Baud Rate Detection Register */
#define ASCLIN1_BRD	(*( ASCLIN0_BRD_type *) 0xf0000724u)	/* Baud Rate Detection Register */
#define ASCLIN2_BRD	(*( ASCLIN0_BRD_type *) 0xf0000824u)	/* Baud Rate Detection Register */
#define ASCLIN3_BRD	(*( ASCLIN0_BRD_type *) 0xf0000924u)	/* Baud Rate Detection Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DENOMINATOR    : 12;	/* Denominator */
		unsigned int                : 4;
		unsigned int NUMERATOR      : 12;	/* Numerator */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_BRG_type;
#define ASCLIN0_BRG	(*( ASCLIN0_BRG_type *) 0xf0000620u)	/* Baud Rate Generation Register */
#define ASCLIN1_BRG	(*( ASCLIN0_BRG_type *) 0xf0000720u)	/* Baud Rate Generation Register */
#define ASCLIN2_BRG	(*( ASCLIN0_BRG_type *) 0xf0000820u)	/* Baud Rate Generation Register */
#define ASCLIN3_BRG	(*( ASCLIN0_BRG_type *) 0xf0000920u)	/* Baud Rate Generation Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_CLC_type;
#define ASCLIN0_CLC	(*( ASCLIN0_CLC_type *) 0xf0000600u)	/* Clock Control Register */
#define ASCLIN1_CLC	(*( ASCLIN0_CLC_type *) 0xf0000700u)	/* Clock Control Register */
#define ASCLIN2_CLC	(*( ASCLIN0_CLC_type *) 0xf0000800u)	/* Clock Control Register */
#define ASCLIN3_CLC	(*( ASCLIN0_CLC_type *) 0xf0000900u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLKSEL         : 4;	/* Baud Rate Logic Clock Select */
		unsigned int                : 27;
		/* const */ unsigned int CON            : 1;	/* Clock On Flag */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_CSR_type;
#define ASCLIN0_CSR	(*( ASCLIN0_CSR_type *) 0xf000064cu)	/* Clock Selection Register */
#define ASCLIN1_CSR	(*( ASCLIN0_CSR_type *) 0xf000074cu)	/* Clock Selection Register */
#define ASCLIN2_CSR	(*( ASCLIN0_CSR_type *) 0xf000084cu)	/* Clock Selection Register */
#define ASCLIN3_CSR	(*( ASCLIN0_CSR_type *) 0xf000094cu)	/* Clock Selection Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATLEN         : 4;	/* Data Length */
		unsigned int                : 9;
		unsigned int HO             : 1;	/* Header Only */
		unsigned int RM             : 1;	/* Response Mode */
		unsigned int CSM            : 1;	/* Checksum Mode */
		unsigned int RESPONSE       : 8;	/* Response Timeout Threshold Value */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_DATCON_type;
#define ASCLIN0_DATCON	(*( ASCLIN0_DATCON_type *) 0xf000061cu)	/* Data Configuration Register */
#define ASCLIN1_DATCON	(*( ASCLIN0_DATCON_type *) 0xf000071cu)	/* Data Configuration Register */
#define ASCLIN2_DATCON	(*( ASCLIN0_DATCON_type *) 0xf000081cu)	/* Data Configuration Register */
#define ASCLIN3_DATCON	(*( ASCLIN0_DATCON_type *) 0xf000091cu)	/* Data Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TH             : 1;	/* Transmit Header End Flag */
		/* const */ unsigned int TR             : 1;	/* Transmit Response End Flag */
		/* const */ unsigned int RH             : 1;	/* Receive Header End Flag */
		/* const */ unsigned int RR             : 1;	/* Receive Response End Flag */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int FED            : 1;	/* Falling Edge from Level 1 to Level 0 Detected */
		/* const */ unsigned int RED            : 1;	/* Rising Edge from Level 0 to Level 1 Detected */
		/* const */ unsigned int                : 6;
		/* const */ unsigned int TWRQ           : 1;	/* Transmit Wake Request Flag */
		/* const */ unsigned int THRQ           : 1;	/* Transmit Header Request Flag */
		/* const */ unsigned int TRRQ           : 1;	/* Transmit Response Request Flag */
		/* const */ unsigned int PE             : 1;	/* Parity Error Flag */
		/* const */ unsigned int TC             : 1;	/* Transmission Completed Flag */
		/* const */ unsigned int FE             : 1;	/* Framing Error Flag */
		/* const */ unsigned int HT             : 1;	/* Header Timeout Flag */
		/* const */ unsigned int RT             : 1;	/* Response Timeout Flag */
		/* const */ unsigned int BD             : 1;	/* Break Detected Flag */
		/* const */ unsigned int LP             : 1;	/* LIN Parity Error Flag */
		/* const */ unsigned int LA             : 1;	/* LIN Autobaud Detection Error Flag */
		/* const */ unsigned int LC             : 1;	/* LIN Checksum Error Flag */
		/* const */ unsigned int CE             : 1;	/* Collision Detection Error Flag */
		/* const */ unsigned int RFO            : 1;	/* Receive FIFO Overflow Flag */
		/* const */ unsigned int RFU            : 1;	/* Receive FIFO Underflow Flag */
		/* const */ unsigned int RFL            : 1;	/* Receive FIFO Level Flag */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int TFO            : 1;	/* Transmit FIFO Overflow Flag */
		/* const */ unsigned int TFL            : 1;	/* Transmit FIFO Level Flag */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_FLAGS_type;
#define ASCLIN0_FLAGS	(*( ASCLIN0_FLAGS_type *) 0xf0000634u)	/* Flags Register */
#define ASCLIN1_FLAGS	(*( ASCLIN0_FLAGS_type *) 0xf0000734u)	/* Flags Register */
#define ASCLIN2_FLAGS	(*( ASCLIN0_FLAGS_type *) 0xf0000834u)	/* Flags Register */
#define ASCLIN3_FLAGS	(*( ASCLIN0_FLAGS_type *) 0xf0000934u)	/* Flags Register */

