svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int THC            : 1;	/* Flag Clear Bit */
		unsigned int TRC            : 1;	/* Flag Clear Bit */
		unsigned int RHC            : 1;	/* Flag Clear Bit */
		unsigned int RRC            : 1;	/* Flag Clear Bit */
		unsigned int                : 1;
		unsigned int FEDC           : 1;	/* Flag Clear Bit */
		unsigned int REDC           : 1;	/* Flag Clear Bit */
		unsigned int                : 6;
		unsigned int TWRQC          : 1;	/* Flag Clear Bit */
		unsigned int THRQC          : 1;	/* Flag Clear Bit */
		unsigned int TRRQC          : 1;	/* Flag Clear Bit */
		unsigned int PEC            : 1;	/* Flag Clear Bit */
		unsigned int TCC            : 1;	/* Flag Clear Bit */
		unsigned int FEC            : 1;	/* Flag Clear Bit */
		unsigned int HTC            : 1;	/* Flag Clear Bit */
		unsigned int RTC            : 1;	/* Flag Clear Bit */
		unsigned int BDC            : 1;	/* Flag Clear Bit */
		unsigned int LPC            : 1;	/* Flag Clear Bit */
		unsigned int LAC            : 1;	/* Flag Clear Bit */
		unsigned int LCC            : 1;	/* Flag Clear Bit */
		unsigned int CEC            : 1;	/* Flag Clear Bit */
		unsigned int RFOC           : 1;	/* Flag Clear Bit */
		unsigned int RFUC           : 1;	/* Flag Clear Bit */
		unsigned int RFLC           : 1;	/* Flag Clear Bit */
		unsigned int                : 1;
		unsigned int TFOC           : 1;	/* Flag Clear Bit */
		unsigned int TFLC           : 1;	/* Flag Clear Bit */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_FLAGSCLEAR_type;
#define ASCLIN0_FLAGSCLEAR	(*( ASCLIN0_FLAGSCLEAR_type *) 0xf000063cu)	/* Flags Clear Register */
#define ASCLIN1_FLAGSCLEAR	(*( ASCLIN0_FLAGSCLEAR_type *) 0xf000073cu)	/* Flags Clear Register */
#define ASCLIN2_FLAGSCLEAR	(*( ASCLIN0_FLAGSCLEAR_type *) 0xf000083cu)	/* Flags Clear Register */
#define ASCLIN3_FLAGSCLEAR	(*( ASCLIN0_FLAGSCLEAR_type *) 0xf000093cu)	/* Flags Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int THE            : 1;	/* Flag Enable Bit */
		unsigned int TRE            : 1;	/* Flag Enable Bit */
		unsigned int RHE            : 1;	/* Flag Enable Bit */
		unsigned int RRE            : 1;	/* Flag Enable Bit */
		unsigned int                : 1;
		unsigned int FEDE           : 1;	/* Flag Enable Bit */
		unsigned int REDE           : 1;	/* Flag Enable Bit */
		unsigned int                : 9;
		unsigned int PEE            : 1;	/* Flag Enable Bit */
		unsigned int TCE            : 1;	/* Flag Enable Bit */
		unsigned int FEE            : 1;	/* Flag Enable Bit */
		unsigned int HTE            : 1;	/* Flag Enable Bit */
		unsigned int RTE            : 1;	/* Flag Enable Bit */
		unsigned int BDE            : 1;	/* Flag Enable Bit */
		unsigned int LPE            : 1;	/* Flag Enable Bit */
		unsigned int ABE            : 1;	/* Flag Enable Bit */
		unsigned int LCE            : 1;	/* Flag Enable Bit */
		unsigned int CEE            : 1;	/* Flag Enable Bit */
		unsigned int RFOE           : 1;	/* Flag Enable Bit */
		unsigned int RFUE           : 1;	/* Flag Enable Bit */
		unsigned int RFLE           : 1;	/* Flag Enable Bit */
		unsigned int                : 1;
		unsigned int TFOE           : 1;	/* Flag Enable Bit */
		unsigned int TFLE           : 1;	/* Flag Enable Bit */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_FLAGSENABLE_type;
#define ASCLIN0_FLAGSENABLE	(*( ASCLIN0_FLAGSENABLE_type *) 0xf0000640u)	/* Flags Enable Register */
#define ASCLIN1_FLAGSENABLE	(*( ASCLIN0_FLAGSENABLE_type *) 0xf0000740u)	/* Flags Enable Register */
#define ASCLIN2_FLAGSENABLE	(*( ASCLIN0_FLAGSENABLE_type *) 0xf0000840u)	/* Flags Enable Register */
#define ASCLIN3_FLAGSENABLE	(*( ASCLIN0_FLAGSENABLE_type *) 0xf0000940u)	/* Flags Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int THS            : 1;	/* Flag Set Bit */
		unsigned int TRS            : 1;	/* Flag Set Bit */
		unsigned int RHS            : 1;	/* Flag Set Bit */
		unsigned int RRS            : 1;	/* Flag Set Bit */
		unsigned int                : 1;
		unsigned int FEDS           : 1;	/* Flag Set Bit */
		unsigned int REDS           : 1;	/* Flag Set Bit */
		unsigned int                : 6;
		unsigned int TWRQS          : 1;	/* Flag Set Bit */
		unsigned int THRQS          : 1;	/* Flag Set Bit */
		unsigned int TRRQS          : 1;	/* Flag Set Bit */
		unsigned int PES            : 1;	/* Flag Set Bit */
		unsigned int TCS            : 1;	/* Flag Set Bit */
		unsigned int FES            : 1;	/* Flag Set Bit */
		unsigned int HTS            : 1;	/* Flag Set Bit */
		unsigned int RTS            : 1;	/* Flag Set Bit */
		unsigned int BDS            : 1;	/* Flag Set Bit */
		unsigned int LPS            : 1;	/* Flag Set Bit */
		unsigned int LAS            : 1;	/* Flag Set Bit */
		unsigned int LCS            : 1;	/* Flag Set Bit */
		unsigned int CES            : 1;	/* Flag Set Bit */
		unsigned int RFOS           : 1;	/* Flag Set Bit */
		unsigned int RFUS           : 1;	/* Flag Set Bit */
		unsigned int RFLS           : 1;	/* Flag Set Bit */
		unsigned int                : 1;
		unsigned int TFOS           : 1;	/* Flag Set Bit */
		unsigned int TFLS           : 1;	/* Flag Set Bit */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_FLAGSSET_type;
#define ASCLIN0_FLAGSSET	(*( ASCLIN0_FLAGSSET_type *) 0xf0000638u)	/* Flags Set Register */
#define ASCLIN1_FLAGSSET	(*( ASCLIN0_FLAGSSET_type *) 0xf0000738u)	/* Flags Set Register */
#define ASCLIN2_FLAGSSET	(*( ASCLIN0_FLAGSSET_type *) 0xf0000838u)	/* Flags Set Register */
#define ASCLIN3_FLAGSSET	(*( ASCLIN0_FLAGSSET_type *) 0xf0000938u)	/* Flags Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 6;
		unsigned int IDLE           : 3;	/* Duration of the IDLE delay */
		unsigned int STOP           : 3;	/* Number of Stop Bits */
		unsigned int LEAD           : 3;	/* Duration of the Leading Delay */
		unsigned int                : 1;
		unsigned int MODE           : 2;	/* Mode Selection */
		unsigned int                : 10;
		unsigned int MSB            : 1;	/* Shift Direction */
		unsigned int CEN            : 1;	/* Collision Detection Enable */
		unsigned int PEN            : 1;	/* Parity Enable */
		unsigned int ODD            : 1;	/* Parity Type */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_FRAMECON_type;
#define ASCLIN0_FRAMECON	(*( ASCLIN0_FRAMECON_type *) 0xf0000618u)	/* Frame Control Register */
#define ASCLIN1_FRAMECON	(*( ASCLIN0_FRAMECON_type *) 0xf0000718u)	/* Frame Control Register */
#define ASCLIN2_FRAMECON	(*( ASCLIN0_FRAMECON_type *) 0xf0000818u)	/* Frame Control Register */
#define ASCLIN3_FRAMECON	(*( ASCLIN0_FRAMECON_type *) 0xf0000918u)	/* Frame Control Register */

