svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_ID_type;
#define ASCLIN0_ID	(*( ASCLIN0_ID_type *) 0xf0000608u)	/* Module Identification Register */
#define ASCLIN1_ID	(*( ASCLIN0_ID_type *) 0xf0000708u)	/* Module Identification Register */
#define ASCLIN2_ID	(*( ASCLIN0_ID_type *) 0xf0000808u)	/* Module Identification Register */
#define ASCLIN3_ID	(*( ASCLIN0_ID_type *) 0xf0000908u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ALTI           : 3;	/* Alternate Input Select */
		unsigned int                : 1;
		unsigned int DEPTH          : 6;	/* Digital Glitch Filter Depth */
		unsigned int                : 6;
		unsigned int CTS            : 2;	/* CTS Select */
		unsigned int                : 7;
		unsigned int RCPOL          : 1;	/* RTS CTS Polarity */
		unsigned int CPOL           : 1;	/* Clock Polarity in Synchronous Mode */
		unsigned int SPOL           : 1;	/* Slave Polarity in Synchronous Mode */
		unsigned int LB             : 1;	/* Loop Back Mode */
		unsigned int CTSEN          : 1;	/* Input Signal CTS Enable */
		/* const */ unsigned int RXM            : 1;	/* Receive Monitor */
		/* const */ unsigned int TXM            : 1;	/* Transmit Monitor */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_IOCR_type;
#define ASCLIN0_IOCR	(*( ASCLIN0_IOCR_type *) 0xf0000604u)	/* Input and Output Control Register */
#define ASCLIN1_IOCR	(*( ASCLIN0_IOCR_type *) 0xf0000704u)	/* Input and Output Control Register */
#define ASCLIN2_IOCR	(*( ASCLIN0_IOCR_type *) 0xf0000804u)	/* Input and Output Control Register */
#define ASCLIN3_IOCR	(*( ASCLIN0_IOCR_type *) 0xf0000904u)	/* Input and Output Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_KRST0_type;
#define ASCLIN0_KRST0	(*( ASCLIN0_KRST0_type *) 0xf00006f4u)	/* Kernel Reset Register 0 */
#define ASCLIN1_KRST0	(*( ASCLIN0_KRST0_type *) 0xf00007f4u)	/* Kernel Reset Register 0 */
#define ASCLIN2_KRST0	(*( ASCLIN0_KRST0_type *) 0xf00008f4u)	/* Kernel Reset Register 0 */
#define ASCLIN3_KRST0	(*( ASCLIN0_KRST0_type *) 0xf00009f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_KRST1_type;
#define ASCLIN0_KRST1	(*( ASCLIN0_KRST1_type *) 0xf00006f0u)	/* Kernel Reset Register 1 */
#define ASCLIN1_KRST1	(*( ASCLIN0_KRST1_type *) 0xf00007f0u)	/* Kernel Reset Register 1 */
#define ASCLIN2_KRST1	(*( ASCLIN0_KRST1_type *) 0xf00008f0u)	/* Kernel Reset Register 1 */
#define ASCLIN3_KRST1	(*( ASCLIN0_KRST1_type *) 0xf00009f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_KRSTCLR_type;
#define ASCLIN0_KRSTCLR	(*( ASCLIN0_KRSTCLR_type *) 0xf00006ecu)	/* Kernel Reset Status Clear Register */
#define ASCLIN1_KRSTCLR	(*( ASCLIN0_KRSTCLR_type *) 0xf00007ecu)	/* Kernel Reset Status Clear Register */
#define ASCLIN2_KRSTCLR	(*( ASCLIN0_KRSTCLR_type *) 0xf00008ecu)	/* Kernel Reset Status Clear Register */
#define ASCLIN3_KRSTCLR	(*( ASCLIN0_KRSTCLR_type *) 0xf00009ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BREAK          : 6;	/* Break Pulse Generation and Detection */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_LINBTIMER_type;
#define ASCLIN0_LINBTIMER	(*( ASCLIN0_LINBTIMER_type *) 0xf000062cu)	/* LIN Break Timer Register */
#define ASCLIN1_LINBTIMER	(*( ASCLIN0_LINBTIMER_type *) 0xf000072cu)	/* LIN Break Timer Register */
#define ASCLIN2_LINBTIMER	(*( ASCLIN0_LINBTIMER_type *) 0xf000082cu)	/* LIN Break Timer Register */
#define ASCLIN3_LINBTIMER	(*( ASCLIN0_LINBTIMER_type *) 0xf000092cu)	/* LIN Break Timer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 23;
		unsigned int CSI            : 1;	/* Checksum Injection */
		unsigned int                : 1;
		unsigned int CSEN           : 1;	/* Hardware Checksum Enable */
		unsigned int MS             : 1;	/* Master Slave Mode */
		unsigned int ABD            : 1;	/* Autobaud Detection */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_LINCON_type;
#define ASCLIN0_LINCON	(*( ASCLIN0_LINCON_type *) 0xf0000628u)	/* LIN Control Register */
#define ASCLIN1_LINCON	(*( ASCLIN0_LINCON_type *) 0xf0000728u)	/* LIN Control Register */
#define ASCLIN2_LINCON	(*( ASCLIN0_LINCON_type *) 0xf0000828u)	/* LIN Control Register */
#define ASCLIN3_LINCON	(*( ASCLIN0_LINCON_type *) 0xf0000928u)	/* LIN Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HEADER         : 8;	/* Header Timeout Threshold Value */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_LINHTIMER_type;
#define ASCLIN0_LINHTIMER	(*( ASCLIN0_LINHTIMER_type *) 0xf0000630u)	/* LIN Header Timer Register */
#define ASCLIN1_LINHTIMER	(*( ASCLIN0_LINHTIMER_type *) 0xf0000730u)	/* LIN Header Timer Register */
#define ASCLIN2_LINHTIMER	(*( ASCLIN0_LINHTIMER_type *) 0xf0000830u)	/* LIN Header Timer Register */
#define ASCLIN3_LINHTIMER	(*( ASCLIN0_LINHTIMER_type *) 0xf0000930u)	/* LIN Header Timer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

