svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ASCLIN0_OCS_type;
#define ASCLIN0_OCS	(*( ASCLIN0_OCS_type *) 0xf00006e8u)	/* OCDS Control and Status */
#define ASCLIN1_OCS	(*( ASCLIN0_OCS_type *) 0xf00007e8u)	/* OCDS Control and Status */
#define ASCLIN2_OCS	(*( ASCLIN0_OCS_type *) 0xf00008e8u)	/* OCDS Control and Status */
#define ASCLIN3_OCS	(*( ASCLIN0_OCS_type *) 0xf00009e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DATA           : 32;	/* Data */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_RXDATA_type;
#define ASCLIN0_RXDATA	(*( ASCLIN0_RXDATA_type *) 0xf0000648u)	/* Receive Data Register */
#define ASCLIN1_RXDATA	(*( ASCLIN0_RXDATA_type *) 0xf0000748u)	/* Receive Data Register */
#define ASCLIN2_RXDATA	(*( ASCLIN0_RXDATA_type *) 0xf0000848u)	/* Receive Data Register */
#define ASCLIN3_RXDATA	(*( ASCLIN0_RXDATA_type *) 0xf0000948u)	/* Receive Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FLUSH          : 1;	/* Flush the receive FIFO */
		unsigned int ENI            : 1;	/* Receive FIFO Inlet Enable */
		unsigned int                : 4;
		unsigned int OUTW           : 2;	/* Receive FIFO Outlet Width */
		unsigned int INTLEVEL       : 4;	/* FIFO Interrupt Level */
		unsigned int                : 4;
		/* const */ unsigned int FILL           : 5;	/* FIFO Filling Level */
		unsigned int                : 10;
		unsigned int BUF            : 1;	/* Receive Buffer Mode */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_RXFIFOCON_type;
#define ASCLIN0_RXFIFOCON	(*( ASCLIN0_RXFIFOCON_type *) 0xf0000610u)	/* RX FIFO Configuration Register */
#define ASCLIN1_RXFIFOCON	(*( ASCLIN0_RXFIFOCON_type *) 0xf0000710u)	/* RX FIFO Configuration Register */
#define ASCLIN2_RXFIFOCON	(*( ASCLIN0_RXFIFOCON_type *) 0xf0000810u)	/* RX FIFO Configuration Register */
#define ASCLIN3_RXFIFOCON	(*( ASCLIN0_RXFIFOCON_type *) 0xf0000910u)	/* RX FIFO Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 32;	/* Data */
	} B;
	int I;
	unsigned int U;

} ASCLIN0_TXDATA_type;
#define ASCLIN0_TXDATA	(*( ASCLIN0_TXDATA_type *) 0xf0000644u)	/* Transmit Data Register */
#define ASCLIN1_TXDATA	(*( ASCLIN0_TXDATA_type *) 0xf0000744u)	/* Transmit Data Register */
#define ASCLIN2_TXDATA	(*( ASCLIN0_TXDATA_type *) 0xf0000844u)	/* Transmit Data Register */
#define ASCLIN3_TXDATA	(*( ASCLIN0_TXDATA_type *) 0xf0000944u)	/* Transmit Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FLUSH          : 1;	/* Flush the transmit FIFO */
		unsigned int ENO            : 1;	/* Transmit FIFO Outlet Enable */
		unsigned int                : 4;
		unsigned int INW            : 2;	/* Transmit FIFO Inlet Width */
		unsigned int INTLEVEL       : 4;	/* FIFO Interrupt Level */
		unsigned int                : 4;
		/* const */ unsigned int FILL           : 5;	/* FIFO Filling Level */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} ASCLIN0_TXFIFOCON_type;
#define ASCLIN0_TXFIFOCON	(*( ASCLIN0_TXFIFOCON_type *) 0xf000060cu)	/* TX FIFO Configuration Register */
#define ASCLIN1_TXFIFOCON	(*( ASCLIN0_TXFIFOCON_type *) 0xf000070cu)	/* TX FIFO Configuration Register */
#define ASCLIN2_TXFIFOCON	(*( ASCLIN0_TXFIFOCON_type *) 0xf000080cu)	/* TX FIFO Configuration Register */
#define ASCLIN3_TXFIFOCON	(*( ASCLIN0_TXFIFOCON_type *) 0xf000090cu)	/* TX FIFO Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} ASCLIN1_ACCEN1_type;
#define ASCLIN1_ACCEN1	(*( ASCLIN1_ACCEN1_type *) 0xf00007f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} ASCLIN2_ACCEN1_type;
#define ASCLIN2_ACCEN1	(*( ASCLIN2_ACCEN1_type *) 0xf00008f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} ASCLIN3_ACCEN1_type;
#define ASCLIN3_ACCEN1	(*( ASCLIN3_ACCEN1_type *) 0xf00009f8u)	/* Access Enable Register 1 */


/* QSPI */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

