svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} QSPI0_ACCEN0_type;
#define QSPI0_ACCEN0	(*( QSPI0_ACCEN0_type *) 0xf0001cfcu)	/* Access Enable Register 0 */
#define QSPI1_ACCEN0	(*( QSPI0_ACCEN0_type *) 0xf0001dfcu)	/* Access Enable Register 0 */
#define QSPI2_ACCEN0	(*( QSPI0_ACCEN0_type *) 0xf0001efcu)	/* Access Enable Register 0 */
#define QSPI3_ACCEN0	(*( QSPI0_ACCEN0_type *) 0xf0001ffcu)	/* Access Enable Register 0 */
#define QSPI4_ACCEN0	(*( QSPI0_ACCEN0_type *) 0xf00020fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} QSPI0_ACCEN1_type;
#define QSPI0_ACCEN1	(*( QSPI0_ACCEN1_type *) 0xf0001cf8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LAST           : 1;	/* Last Word in a Frame */
		/* const */ unsigned int IPRE           : 3;	/* Prescaler for the Idle Delay */
		/* const */ unsigned int IDLE           : 3;	/* Idle Delay Length */
		/* const */ unsigned int LPRE           : 3;	/* Prescaler for the Leading Delay */
		/* const */ unsigned int LEAD           : 3;	/* Leading Delay Length */
		/* const */ unsigned int TPRE           : 3;	/* Prescaler for the Trailing Delay */
		/* const */ unsigned int TRAIL          : 3;	/* Trailing Delay Length */
		/* const */ unsigned int PARTYP         : 1;	/* Parity Type */
		/* const */ unsigned int UINT           : 1;	/* User Interrupt at the PT1 Event in the Subsequent Frames */
		/* const */ unsigned int MSB            : 1;	/* Shift MSB or LSB First */
		/* const */ unsigned int BYTE           : 1;	/* Byte */
		/* const */ unsigned int DL             : 5;	/* Data Length */
		/* const */ unsigned int CS             : 4;	/* Channel Select */
	} B;
	int I;
	unsigned int U;

} QSPI0_BACON_type;
#define QSPI0_BACON	(*( QSPI0_BACON_type *) 0xf0001c18u)	/* Basic Configuration Register */
#define QSPI1_BACON	(*( QSPI0_BACON_type *) 0xf0001d18u)	/* Basic Configuration Register */
#define QSPI2_BACON	(*( QSPI0_BACON_type *) 0xf0001e18u)	/* Basic Configuration Register */
#define QSPI3_BACON	(*( QSPI0_BACON_type *) 0xf0001f18u)	/* Basic Configuration Register */
#define QSPI4_BACON	(*( QSPI0_BACON_type *) 0xf0002018u)	/* Basic Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int E              : 32;	/* Entry Point to the TxFIFO */
	} B;
	int I;
	unsigned int U;

} QSPI0_BACONENTRY_type;
#define QSPI0_BACONENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001c60u)	/* BACON_ENTRY Register */
#define QSPI0_DATAENTRY0	(*( QSPI0_BACONENTRY_type *) 0xf0001c64u)	/* DATA_ENTRY Register 0 */
#define QSPI0_DATAENTRY1	(*( QSPI0_BACONENTRY_type *) 0xf0001c68u)	/* DATA_ENTRY Register 1 */
#define QSPI0_DATAENTRY2	(*( QSPI0_BACONENTRY_type *) 0xf0001c6cu)	/* DATA_ENTRY Register 2 */
#define QSPI0_DATAENTRY3	(*( QSPI0_BACONENTRY_type *) 0xf0001c70u)	/* DATA_ENTRY Register 3 */
#define QSPI0_DATAENTRY4	(*( QSPI0_BACONENTRY_type *) 0xf0001c74u)	/* DATA_ENTRY Register 4 */
#define QSPI0_DATAENTRY5	(*( QSPI0_BACONENTRY_type *) 0xf0001c78u)	/* DATA_ENTRY Register 5 */
#define QSPI0_DATAENTRY6	(*( QSPI0_BACONENTRY_type *) 0xf0001c7cu)	/* DATA_ENTRY Register 6 */
#define QSPI0_DATAENTRY7	(*( QSPI0_BACONENTRY_type *) 0xf0001c80u)	/* DATA_ENTRY Register 7 */
#define QSPI0_MIXENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001c5cu)	/* MIX_ENTRY Register */
#define QSPI1_BACONENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001d60u)	/* BACON_ENTRY Register */
#define QSPI1_DATAENTRY0	(*( QSPI0_BACONENTRY_type *) 0xf0001d64u)	/* DATA_ENTRY Register 0 */
#define QSPI1_DATAENTRY1	(*( QSPI0_BACONENTRY_type *) 0xf0001d68u)	/* DATA_ENTRY Register 1 */
#define QSPI1_DATAENTRY2	(*( QSPI0_BACONENTRY_type *) 0xf0001d6cu)	/* DATA_ENTRY Register 2 */
#define QSPI1_DATAENTRY3	(*( QSPI0_BACONENTRY_type *) 0xf0001d70u)	/* DATA_ENTRY Register 3 */
#define QSPI1_DATAENTRY4	(*( QSPI0_BACONENTRY_type *) 0xf0001d74u)	/* DATA_ENTRY Register 4 */
#define QSPI1_DATAENTRY5	(*( QSPI0_BACONENTRY_type *) 0xf0001d78u)	/* DATA_ENTRY Register 5 */
#define QSPI1_DATAENTRY6	(*( QSPI0_BACONENTRY_type *) 0xf0001d7cu)	/* DATA_ENTRY Register 6 */
#define QSPI1_DATAENTRY7	(*( QSPI0_BACONENTRY_type *) 0xf0001d80u)	/* DATA_ENTRY Register 7 */
#define QSPI1_MIXENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001d5cu)	/* MIX_ENTRY Register */
#define QSPI2_BACONENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001e60u)	/* BACON_ENTRY Register */
#define QSPI2_DATAENTRY0	(*( QSPI0_BACONENTRY_type *) 0xf0001e64u)	/* DATA_ENTRY Register 0 */
#define QSPI2_DATAENTRY1	(*( QSPI0_BACONENTRY_type *) 0xf0001e68u)	/* DATA_ENTRY Register 1 */
#define QSPI2_DATAENTRY2	(*( QSPI0_BACONENTRY_type *) 0xf0001e6cu)	/* DATA_ENTRY Register 2 */
#define QSPI2_DATAENTRY3	(*( QSPI0_BACONENTRY_type *) 0xf0001e70u)	/* DATA_ENTRY Register 3 */
#define QSPI2_DATAENTRY4	(*( QSPI0_BACONENTRY_type *) 0xf0001e74u)	/* DATA_ENTRY Register 4 */
#define QSPI2_DATAENTRY5	(*( QSPI0_BACONENTRY_type *) 0xf0001e78u)	/* DATA_ENTRY Register 5 */
#define QSPI2_DATAENTRY6	(*( QSPI0_BACONENTRY_type *) 0xf0001e7cu)	/* DATA_ENTRY Register 6 */
#define QSPI2_DATAENTRY7	(*( QSPI0_BACONENTRY_type *) 0xf0001e80u)	/* DATA_ENTRY Register 7 */
#define QSPI2_MIXENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001e5cu)	/* MIX_ENTRY Register */
#define QSPI3_BACONENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001f60u)	/* BACON_ENTRY Register */
#define QSPI3_DATAENTRY0	(*( QSPI0_BACONENTRY_type *) 0xf0001f64u)	/* DATA_ENTRY Register 0 */
#define QSPI3_DATAENTRY1	(*( QSPI0_BACONENTRY_type *) 0xf0001f68u)	/* DATA_ENTRY Register 1 */
#define QSPI3_DATAENTRY2	(*( QSPI0_BACONENTRY_type *) 0xf0001f6cu)	/* DATA_ENTRY Register 2 */
#define QSPI3_DATAENTRY3	(*( QSPI0_BACONENTRY_type *) 0xf0001f70u)	/* DATA_ENTRY Register 3 */
#define QSPI3_DATAENTRY4	(*( QSPI0_BACONENTRY_type *) 0xf0001f74u)	/* DATA_ENTRY Register 4 */
#define QSPI3_DATAENTRY5	(*( QSPI0_BACONENTRY_type *) 0xf0001f78u)	/* DATA_ENTRY Register 5 */
#define QSPI3_DATAENTRY6	(*( QSPI0_BACONENTRY_type *) 0xf0001f7cu)	/* DATA_ENTRY Register 6 */
#define QSPI3_DATAENTRY7	(*( QSPI0_BACONENTRY_type *) 0xf0001f80u)	/* DATA_ENTRY Register 7 */
#define QSPI3_MIXENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0001f5cu)	/* MIX_ENTRY Register */
#define QSPI4_BACONENTRY	(*( QSPI0_BACONENTRY_type *) 0xf0002060u)	/* BACON_ENTRY Register */
#define QSPI4_DATAENTRY0	(*( QSPI0_BACONENTRY_type *) 0xf0002064u)	/* DATA_ENTRY Register 0 */
#define QSPI4_DATAENTRY1	(*( QSPI0_BACONENTRY_type *) 0xf0002068u)	/* DATA_ENTRY Register 1 */
#define QSPI4_DATAENTRY2	(*( QSPI0_BACONENTRY_type *) 0xf000206cu)	/* DATA_ENTRY Register 2 */
#define QSPI4_DATAENTRY3	(*( QSPI0_BACONENTRY_type *) 0xf0002070u)	/* DATA_ENTRY Register 3 */
#define QSPI4_DATAENTRY4	(*( QSPI0_BACONENTRY_type *) 0xf0002074u)	/* DATA_ENTRY Register 4 */
#define QSPI4_DATAENTRY5	(*( QSPI0_BACONENTRY_type *) 0xf0002078u)	/* DATA_ENTRY Register 5 */
#define QSPI4_DATAENTRY6	(*( QSPI0_BACONENTRY_type *) 0xf000207cu)	/* DATA_ENTRY Register 6 */
#define QSPI4_DATAENTRY7	(*( QSPI0_BACONENTRY_type *) 0xf0002080u)	/* DATA_ENTRY Register 7 */
#define QSPI4_MIXENTRY	(*( QSPI0_BACONENTRY_type *) 0xf000205cu)	/* MIX_ENTRY Register */

