svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int IPRE           : 3;	/* Prescaler for the Idle Delay */
		unsigned int IDLE           : 3;	/* Idle Delay Length */
		unsigned int LPRE           : 3;	/* Prescaler for the Leading Delay */
		unsigned int LEAD           : 3;	/* Leading Delay Length */
		unsigned int TPRE           : 3;	/* Prescaler for the Trailing Delay */
		unsigned int TRAIL          : 3;	/* Trailing Delay Length */
		unsigned int PARTYP         : 1;	/* Parity Type */
		unsigned int                : 1;
		unsigned int MSB            : 1;	/* Shift MSB or LSB First */
		unsigned int                : 1;
		unsigned int DL             : 5;	/* Data Length */
		unsigned int CS             : 4;	/* Channel Select */
	} B;
	int I;
	unsigned int U;

} QSPI0_BACONPWM_type;
#define QSPI0_BACONPWM	(*( QSPI0_BACONPWM_type *) 0xf0001c1cu)	/* Basic Configuration Register 1 */
#define QSPI1_BACONPWM	(*( QSPI0_BACONPWM_type *) 0xf0001d1cu)	/* Basic Configuration Register 1 */
#define QSPI2_BACONPWM	(*( QSPI0_BACONPWM_type *) 0xf0001e1cu)	/* Basic Configuration Register 1 */
#define QSPI3_BACONPWM	(*( QSPI0_BACONPWM_type *) 0xf0001f1cu)	/* Basic Configuration Register 1 */
#define QSPI4_BACONPWM	(*( QSPI0_BACONPWM_type *) 0xf000201cu)	/* Basic Configuration Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} QSPI0_CLC_type;
#define QSPI0_CLC	(*( QSPI0_CLC_type *) 0xf0001c00u)	/* Clock Control Register */
#define QSPI1_CLC	(*( QSPI0_CLC_type *) 0xf0001d00u)	/* Clock Control Register */
#define QSPI2_CLC	(*( QSPI0_CLC_type *) 0xf0001e00u)	/* Clock Control Register */
#define QSPI3_CLC	(*( QSPI0_CLC_type *) 0xf0001f00u)	/* Clock Control Register */
#define QSPI4_CLC	(*( QSPI0_CLC_type *) 0xf0002000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int Q              : 6;	/* Time Quantum */
		unsigned int A              : 2;	/* Bit Segment 1 */
		unsigned int B              : 2;	/* Bit Segment 2 */
		unsigned int C              : 2;	/* Bit Segment 3 */
		unsigned int CPH            : 1;	/* Clock Phase */
		unsigned int CPOL           : 1;	/* Clock Polarity */
		unsigned int PAREN          : 1;	/* Enable Parity Check */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} QSPI0_ECON0_type;
#define QSPI0_ECON0	(*( QSPI0_ECON0_type *) 0xf0001c20u)	/* Configuration Extension 0 */
#define QSPI0_ECON1	(*( QSPI0_ECON0_type *) 0xf0001c24u)	/* Configuration Extension 1 */
#define QSPI0_ECON2	(*( QSPI0_ECON0_type *) 0xf0001c28u)	/* Configuration Extension 2 */
#define QSPI0_ECON3	(*( QSPI0_ECON0_type *) 0xf0001c2cu)	/* Configuration Extension 3 */
#define QSPI0_ECON4	(*( QSPI0_ECON0_type *) 0xf0001c30u)	/* Configuration Extension 4 */
#define QSPI0_ECON5	(*( QSPI0_ECON0_type *) 0xf0001c34u)	/* Configuration Extension 5 */
#define QSPI0_ECON6	(*( QSPI0_ECON0_type *) 0xf0001c38u)	/* Configuration Extension 6 */
#define QSPI0_ECON7	(*( QSPI0_ECON0_type *) 0xf0001c3cu)	/* Configuration Extension 7 */
#define QSPI1_ECON0	(*( QSPI0_ECON0_type *) 0xf0001d20u)	/* Configuration Extension 0 */
#define QSPI1_ECON1	(*( QSPI0_ECON0_type *) 0xf0001d24u)	/* Configuration Extension 1 */
#define QSPI1_ECON2	(*( QSPI0_ECON0_type *) 0xf0001d28u)	/* Configuration Extension 2 */
#define QSPI1_ECON3	(*( QSPI0_ECON0_type *) 0xf0001d2cu)	/* Configuration Extension 3 */
#define QSPI1_ECON4	(*( QSPI0_ECON0_type *) 0xf0001d30u)	/* Configuration Extension 4 */
#define QSPI1_ECON5	(*( QSPI0_ECON0_type *) 0xf0001d34u)	/* Configuration Extension 5 */
#define QSPI1_ECON6	(*( QSPI0_ECON0_type *) 0xf0001d38u)	/* Configuration Extension 6 */
#define QSPI1_ECON7	(*( QSPI0_ECON0_type *) 0xf0001d3cu)	/* Configuration Extension 7 */
#define QSPI2_ECON0	(*( QSPI0_ECON0_type *) 0xf0001e20u)	/* Configuration Extension 0 */
#define QSPI2_ECON1	(*( QSPI0_ECON0_type *) 0xf0001e24u)	/* Configuration Extension 1 */
#define QSPI2_ECON2	(*( QSPI0_ECON0_type *) 0xf0001e28u)	/* Configuration Extension 2 */
#define QSPI2_ECON3	(*( QSPI0_ECON0_type *) 0xf0001e2cu)	/* Configuration Extension 3 */
#define QSPI2_ECON4	(*( QSPI0_ECON0_type *) 0xf0001e30u)	/* Configuration Extension 4 */
#define QSPI2_ECON5	(*( QSPI0_ECON0_type *) 0xf0001e34u)	/* Configuration Extension 5 */
#define QSPI2_ECON6	(*( QSPI0_ECON0_type *) 0xf0001e38u)	/* Configuration Extension 6 */
#define QSPI2_ECON7	(*( QSPI0_ECON0_type *) 0xf0001e3cu)	/* Configuration Extension 7 */
#define QSPI3_ECON0	(*( QSPI0_ECON0_type *) 0xf0001f20u)	/* Configuration Extension 0 */
#define QSPI3_ECON1	(*( QSPI0_ECON0_type *) 0xf0001f24u)	/* Configuration Extension 1 */
#define QSPI3_ECON2	(*( QSPI0_ECON0_type *) 0xf0001f28u)	/* Configuration Extension 2 */
#define QSPI3_ECON3	(*( QSPI0_ECON0_type *) 0xf0001f2cu)	/* Configuration Extension 3 */
#define QSPI3_ECON4	(*( QSPI0_ECON0_type *) 0xf0001f30u)	/* Configuration Extension 4 */
#define QSPI3_ECON5	(*( QSPI0_ECON0_type *) 0xf0001f34u)	/* Configuration Extension 5 */
#define QSPI3_ECON6	(*( QSPI0_ECON0_type *) 0xf0001f38u)	/* Configuration Extension 6 */
#define QSPI3_ECON7	(*( QSPI0_ECON0_type *) 0xf0001f3cu)	/* Configuration Extension 7 */
#define QSPI4_ECON0	(*( QSPI0_ECON0_type *) 0xf0002020u)	/* Configuration Extension 0 */
#define QSPI4_ECON1	(*( QSPI0_ECON0_type *) 0xf0002024u)	/* Configuration Extension 1 */
#define QSPI4_ECON2	(*( QSPI0_ECON0_type *) 0xf0002028u)	/* Configuration Extension 2 */
#define QSPI4_ECON3	(*( QSPI0_ECON0_type *) 0xf000202cu)	/* Configuration Extension 3 */
#define QSPI4_ECON4	(*( QSPI0_ECON0_type *) 0xf0002030u)	/* Configuration Extension 4 */
#define QSPI4_ECON5	(*( QSPI0_ECON0_type *) 0xf0002034u)	/* Configuration Extension 5 */
#define QSPI4_ECON6	(*( QSPI0_ECON0_type *) 0xf0002038u)	/* Configuration Extension 6 */
#define QSPI4_ECON7	(*( QSPI0_ECON0_type *) 0xf000203cu)	/* Configuration Extension 7 */

