svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ERRORCLEARS    : 9;	/* Write Only Bits for Clearing the Error Flags */
		unsigned int TXC            : 1;	/* Transmit Event Flag Clear */
		unsigned int RXC            : 1;	/* Receive Event Flag Clear */
		unsigned int PT1C           : 1;	/* PT1 Event Flag Clear */
		unsigned int PT2C           : 1;	/* PT2 Event Flag Clear */
		unsigned int HC1C           : 1;	/* HC1 Event Flag Clear */
		unsigned int HC2C           : 1;	/* HC2 Event Flag Clear */
		unsigned int USRC           : 1;	/* User Event Flag Clear */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} QSPI0_FLAGSCLEAR_type;
#define QSPI0_FLAGSCLEAR	(*( QSPI0_FLAGSCLEAR_type *) 0xf0001c54u)	/* Flags Clear Register */
#define QSPI1_FLAGSCLEAR	(*( QSPI0_FLAGSCLEAR_type *) 0xf0001d54u)	/* Flags Clear Register */
#define QSPI2_FLAGSCLEAR	(*( QSPI0_FLAGSCLEAR_type *) 0xf0001e54u)	/* Flags Clear Register */
#define QSPI3_FLAGSCLEAR	(*( QSPI0_FLAGSCLEAR_type *) 0xf0001f54u)	/* Flags Clear Register */
#define QSPI4_FLAGSCLEAR	(*( QSPI0_FLAGSCLEAR_type *) 0xf0002054u)	/* Flags Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TQ             : 8;	/* Global Time Quantum Length */
		unsigned int                : 1;
		unsigned int SI             : 1;	/* Status Injection */
		unsigned int EXPECT         : 4;	/* Time-Out Value for the Expect Phase */
		unsigned int LB             : 1;	/* Loop-Back Control */
		unsigned int DEL0           : 1;	/* Delayed Mode for SLSO0 */
		unsigned int STROBE         : 5;	/* Strobe Delay for SLSO0 in Delayed Mode */
		unsigned int SRF            : 1;	/* Stop on RxFIFO Full */
		unsigned int STIP           : 1;	/* Slave Transmit Idle State Polarity */
		unsigned int                : 1;
		unsigned int EN             : 1;	/* Enable Bit */
		unsigned int MS             : 2;	/* Master Slave Mode */
		unsigned int AREN           : 1;	/* Automatic Reset Enable */
		unsigned int RESETS         : 4;	/* Bits for resetting sub-modules per software */
	} B;
	int I;
	unsigned int U;

} QSPI0_GLOBALCON_type;
#define QSPI0_GLOBALCON	(*( QSPI0_GLOBALCON_type *) 0xf0001c10u)	/* Global Configuration Register */
#define QSPI1_GLOBALCON	(*( QSPI0_GLOBALCON_type *) 0xf0001d10u)	/* Global Configuration Register */
#define QSPI2_GLOBALCON	(*( QSPI0_GLOBALCON_type *) 0xf0001e10u)	/* Global Configuration Register */
#define QSPI3_GLOBALCON	(*( QSPI0_GLOBALCON_type *) 0xf0001f10u)	/* Global Configuration Register */
#define QSPI4_GLOBALCON	(*( QSPI0_GLOBALCON_type *) 0xf0002010u)	/* Global Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ERRORENS       : 9;	/* Error Enable Bits */
		unsigned int TXEN           : 1;	/* Tx Interrupt Event Enable */
		unsigned int RXEN           : 1;	/* RX Interrupt Event Enable */
		unsigned int PT1EN          : 1;	/* Interrupt on PT1 Event Enable */
		unsigned int PT2EN          : 1;	/* Interrupt on PT2 Event Enable */
		unsigned int HC1EN          : 1;	/* Interrupt on HC1 Event Enable */
		unsigned int HC2EN          : 1;	/* Interrupt on HC2 Event Enable */
		unsigned int USREN          : 1;	/* Interrupt on USR Event Enable */
		unsigned int TXFIFOINT      : 2;	/* Transmit FIFO Interrupt Threshold */
		unsigned int RXFIFOINT      : 2;	/* Receive FIFO Interrupt Threshold */
		unsigned int PT1            : 3;	/* Phase Transition Event 1 */
		unsigned int PT2            : 3;	/* Phase Transition Event 2 */
		unsigned int TXFM           : 2;	/* TXFIFO Mode */
		unsigned int RXFM           : 2;	/* RXFIFO Mode */
		unsigned int PWMVIOEN       : 1;	/* PWM Time Window Violation Interrupt */
		unsigned int TVIOEN         : 1;	/* Tx FIFO Time Window Violation Interrupt */
	} B;
	int I;
	unsigned int U;

} QSPI0_GLOBALCON1_type;
#define QSPI0_GLOBALCON1	(*( QSPI0_GLOBALCON1_type *) 0xf0001c14u)	/* Global Configuration Register 1 */
#define QSPI1_GLOBALCON1	(*( QSPI0_GLOBALCON1_type *) 0xf0001d14u)	/* Global Configuration Register 1 */
#define QSPI2_GLOBALCON1	(*( QSPI0_GLOBALCON1_type *) 0xf0001e14u)	/* Global Configuration Register 1 */
#define QSPI3_GLOBALCON1	(*( QSPI0_GLOBALCON1_type *) 0xf0001f14u)	/* Global Configuration Register 1 */
#define QSPI4_GLOBALCON1	(*( QSPI0_GLOBALCON1_type *) 0xf0002014u)	/* Global Configuration Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} QSPI0_ID_type;
#define QSPI0_ID	(*( QSPI0_ID_type *) 0xf0001c08u)	/* Module Identification Register */
#define QSPI1_ID	(*( QSPI0_ID_type *) 0xf0001d08u)	/* Module Identification Register */
#define QSPI2_ID	(*( QSPI0_ID_type *) 0xf0001e08u)	/* Module Identification Register */
#define QSPI3_ID	(*( QSPI0_ID_type *) 0xf0001f08u)	/* Module Identification Register */
#define QSPI4_ID	(*( QSPI0_ID_type *) 0xf0002008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int INJECT         : 32;	/* Inject */
	} B;
	int I;
	unsigned int U;

} QSPI0_INJECT_type;
#define QSPI0_INJECT	(*( QSPI0_INJECT_type *) 0xf0001c50u)	/* Inject Register */
#define QSPI1_INJECT	(*( QSPI0_INJECT_type *) 0xf0001d50u)	/* Inject Register */
#define QSPI2_INJECT	(*( QSPI0_INJECT_type *) 0xf0001e50u)	/* Inject Register */
#define QSPI3_INJECT	(*( QSPI0_INJECT_type *) 0xf0001f50u)	/* Inject Register */
#define QSPI4_INJECT	(*( QSPI0_INJECT_type *) 0xf0002050u)	/* Inject Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} QSPI0_KRST0_type;
#define QSPI0_KRST0	(*( QSPI0_KRST0_type *) 0xf0001cf4u)	/* Kernel Reset Register 0 */
#define QSPI1_KRST0	(*( QSPI0_KRST0_type *) 0xf0001df4u)	/* Kernel Reset Register 0 */
#define QSPI2_KRST0	(*( QSPI0_KRST0_type *) 0xf0001ef4u)	/* Kernel Reset Register 0 */
#define QSPI3_KRST0	(*( QSPI0_KRST0_type *) 0xf0001ff4u)	/* Kernel Reset Register 0 */
#define QSPI4_KRST0	(*( QSPI0_KRST0_type *) 0xf00020f4u)	/* Kernel Reset Register 0 */

