svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} QSPI0_KRST1_type;
#define QSPI0_KRST1	(*( QSPI0_KRST1_type *) 0xf0001cf0u)	/* Kernel Reset Register 1 */
#define QSPI1_KRST1	(*( QSPI0_KRST1_type *) 0xf0001df0u)	/* Kernel Reset Register 1 */
#define QSPI2_KRST1	(*( QSPI0_KRST1_type *) 0xf0001ef0u)	/* Kernel Reset Register 1 */
#define QSPI3_KRST1	(*( QSPI0_KRST1_type *) 0xf0001ff0u)	/* Kernel Reset Register 1 */
#define QSPI4_KRST1	(*( QSPI0_KRST1_type *) 0xf00020f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} QSPI0_KRSTCLR_type;
#define QSPI0_KRSTCLR	(*( QSPI0_KRSTCLR_type *) 0xf0001cecu)	/* Kernel Reset Status Clear Register */
#define QSPI1_KRSTCLR	(*( QSPI0_KRSTCLR_type *) 0xf0001decu)	/* Kernel Reset Status Clear Register */
#define QSPI2_KRSTCLR	(*( QSPI0_KRSTCLR_type *) 0xf0001eecu)	/* Kernel Reset Status Clear Register */
#define QSPI3_KRSTCLR	(*( QSPI0_KRSTCLR_type *) 0xf0001fecu)	/* Kernel Reset Status Clear Register */
#define QSPI4_KRSTCLR	(*( QSPI0_KRSTCLR_type *) 0xf00020ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MASK           : 32;	/* Mask */
	} B;
	int I;
	unsigned int U;

} QSPI0_MASK_type;
#define QSPI0_MASK	(*( QSPI0_MASK_type *) 0xf0001c4cu)	/* Mask Register */
#define QSPI1_MASK	(*( QSPI0_MASK_type *) 0xf0001d4cu)	/* Mask Register */
#define QSPI2_MASK	(*( QSPI0_MASK_type *) 0xf0001e4cu)	/* Mask Register */
#define QSPI3_MASK	(*( QSPI0_MASK_type *) 0xf0001f4cu)	/* Mask Register */
#define QSPI4_MASK	(*( QSPI0_MASK_type *) 0xf000204cu)	/* Mask Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} QSPI0_OCS_type;
#define QSPI0_OCS	(*( QSPI0_OCS_type *) 0xf0001ce8u)	/* OCDS Control and Status */
#define QSPI1_OCS	(*( QSPI0_OCS_type *) 0xf0001de8u)	/* OCDS Control and Status */
#define QSPI2_OCS	(*( QSPI0_OCS_type *) 0xf0001ee8u)	/* OCDS Control and Status */
#define QSPI3_OCS	(*( QSPI0_OCS_type *) 0xf0001fe8u)	/* OCDS Control and Status */
#define QSPI4_OCS	(*( QSPI0_OCS_type *) 0xf00020e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int MRIS           : 3;	/* Master Mode Receive Input Select */
		unsigned int                : 1;
		unsigned int SRIS           : 3;	/* Slave Mode Receive Input Select */
		unsigned int                : 1;
		unsigned int SCIS           : 3;	/* Slave Mode Clock Input Select */
		unsigned int                : 1;
		unsigned int SLSIS          : 3;	/* Slave Mode Slave Select Input Selection */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} QSPI0_PISEL_type;
#define QSPI0_PISEL	(*( QSPI0_PISEL_type *) 0xf0001c04u)	/* Port Input Select Register */
#define QSPI1_PISEL	(*( QSPI0_PISEL_type *) 0xf0001d04u)	/* Port Input Select Register */
#define QSPI2_PISEL	(*( QSPI0_PISEL_type *) 0xf0001e04u)	/* Port Input Select Register */
#define QSPI3_PISEL	(*( QSPI0_PISEL_type *) 0xf0001f04u)	/* Port Input Select Register */
#define QSPI4_PISEL	(*( QSPI0_PISEL_type *) 0xf0002004u)	/* Port Input Select Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int E              : 32;	/* Read Point from the RxFIFO */
	} B;
	int I;
	unsigned int U;

} QSPI0_RXEXIT_type;
#define QSPI0_RXEXIT	(*( QSPI0_RXEXIT_type *) 0xf0001c90u)	/* RX_EXIT Register */
#define QSPI1_RXEXIT	(*( QSPI0_RXEXIT_type *) 0xf0001d90u)	/* RX_EXIT Register */
#define QSPI2_RXEXIT	(*( QSPI0_RXEXIT_type *) 0xf0001e90u)	/* RX_EXIT Register */
#define QSPI3_RXEXIT	(*( QSPI0_RXEXIT_type *) 0xf0001f90u)	/* RX_EXIT Register */
#define QSPI4_RXEXIT	(*( QSPI0_RXEXIT_type *) 0xf0002090u)	/* RX_EXIT Register */

typedef volatile union
{
	struct
	{ 
		unsigned int AOL            : 16;	/* Active Output Level for the SLSO Outputs */
		unsigned int OEN            : 16;	/* Enable Bits for the SLSO Outputs */
	} B;
	int I;
	unsigned int U;

} QSPI0_SSOC_type;
#define QSPI0_SSOC	(*( QSPI0_SSOC_type *) 0xf0001c48u)	/* Slave Select Output Control Register */
#define QSPI1_SSOC	(*( QSPI0_SSOC_type *) 0xf0001d48u)	/* Slave Select Output Control Register */
#define QSPI2_SSOC	(*( QSPI0_SSOC_type *) 0xf0001e48u)	/* Slave Select Output Control Register */
#define QSPI3_SSOC	(*( QSPI0_SSOC_type *) 0xf0001f48u)	/* Slave Select Output Control Register */
#define QSPI4_SSOC	(*( QSPI0_SSOC_type *) 0xf0002048u)	/* Slave Select Output Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ERRORFLAGS     : 9;	/* Sticky Flags Signalling Errors */
		unsigned int TXF            : 1;	/* Transmit Interrupt Request Flag */
		unsigned int RXF            : 1;	/* Receive Interrupt Request Flag */
		unsigned int PT1F           : 1;	/* Phase Transition 1 Flag */
		unsigned int PT2F           : 1;	/* Phase Transition 2 Flag */
		unsigned int HC1F           : 1;	/* PWM Half Cycle 1 Flag */
		unsigned int HC2F           : 1;	/* PWM Half Cycle 2 Flag */
		unsigned int USRF           : 1;	/* User Interrupt Request Flag */
		/* const */ unsigned int TXFIFOLEVEL    : 3;	/* TXFIFO Filling Level */
		/* const */ unsigned int RXFIFOLEVEL    : 3;	/* RXFIFO Filling Level */
		/* const */ unsigned int SLAVESEL       : 4;	/* Currently Active Slave Select Flag */
		/* const */ unsigned int RPV            : 1;	/* Received Parity Value */
		/* const */ unsigned int TPV            : 1;	/* Transmitted Parity Value */
		/* const */ unsigned int PHASE          : 4;	/* Flags the ongoing phase */
	} B;
	int I;
	unsigned int U;

} QSPI0_STATUS_type;
