svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define QSPI0_STATUS	(*( QSPI0_STATUS_type *) 0xf0001c40u)	/* Status Register */
#define QSPI1_STATUS	(*( QSPI0_STATUS_type *) 0xf0001d40u)	/* Status Register */
#define QSPI2_STATUS	(*( QSPI0_STATUS_type *) 0xf0001e40u)	/* Status Register */
#define QSPI3_STATUS	(*( QSPI0_STATUS_type *) 0xf0001f40u)	/* Status Register */
#define QSPI4_STATUS	(*( QSPI0_STATUS_type *) 0xf0002040u)	/* Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int BITCOUNT       : 8;	/* Number of the bit shifted out */
		/* const */ unsigned int PWMVIO         : 1;	/* PWM Frame Violates its Time Window */
		unsigned int MPWMVIO        : 2;	/* Modify the PWMVIO Flag */
		/* const */ unsigned int TVIO           : 1;	/* Tx FIFO Frame Violates its Time Window */
		unsigned int MTVIO          : 2;	/* Modify the TVIO Flag */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} QSPI0_STATUS1_type;
#define QSPI0_STATUS1	(*( QSPI0_STATUS1_type *) 0xf0001c44u)	/* Status Register 1 */
#define QSPI1_STATUS1	(*( QSPI0_STATUS1_type *) 0xf0001d44u)	/* Status Register 1 */
#define QSPI2_STATUS1	(*( QSPI0_STATUS1_type *) 0xf0001e44u)	/* Status Register 1 */
#define QSPI3_STATUS1	(*( QSPI0_STATUS1_type *) 0xf0001f44u)	/* Status Register 1 */
#define QSPI4_STATUS1	(*( QSPI0_STATUS1_type *) 0xf0002044u)	/* Status Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} QSPI1_ACCEN1_type;
#define QSPI1_ACCEN1	(*( QSPI1_ACCEN1_type *) 0xf0001df8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} QSPI2_ACCEN1_type;
#define QSPI2_ACCEN1	(*( QSPI2_ACCEN1_type *) 0xf0001ef8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} QSPI3_ACCEN1_type;
#define QSPI3_ACCEN1	(*( QSPI3_ACCEN1_type *) 0xf0001ff8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} QSPI4_ACCEN1_type;
#define QSPI4_ACCEN1	(*( QSPI4_ACCEN1_type *) 0xf00020f8u)	/* Access Enable Register 1 */


/* HSSL */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} HSSL_ACCEN0_type;
#define HSSL_ACCEN0	(*( HSSL_ACCEN0_type *) 0xf00800fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} HSSL_ACCEN1_type;
#define HSSL_ACCEN1	(*( HSSL_ACCEN1_type *) 0xf00800f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PREDIV         : 14;	/* Global Predivider */
		unsigned int                : 2;
		unsigned int SMT            : 1;	/* Streaming Mode Transmitter */
		unsigned int SMR            : 1;	/* Streaming Mode Receiver */
		unsigned int SCM            : 1;	/* Streaming Channel Mode */
		unsigned int CCC            : 1;	/* Channel Code Control */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} HSSL_CFG_type;
#define HSSL_CFG	(*( HSSL_CFG_type *) 0xf0080010u)	/* Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} HSSL_CLC_type;
#define HSSL_CLC	(*( HSSL_CLC_type *) 0xf0080000u)	/* Clock Control Register */

