svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int XORMASK        : 16;	/* Value to be XORed with the Calculated CRC */
		unsigned int XEN            : 1;	/* Enable the Error Injection via XORMASK */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} HSSL_CRC_type;
#define HSSL_CRC	(*( HSSL_CRC_type *) 0xf008000cu)	/* CRC Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IDQ            : 1;	/* Read ID Request */
		unsigned int TQ             : 1;	/* Trigger Request */
		/* const */ unsigned int LETT           : 3;	/* Last Error Transaction Tag */
		/* const */ unsigned int CETT           : 3;	/* Currently Expected Transaction Tag */
		/* const */ unsigned int TOCV           : 8;	/* Time Out Current Value */
		unsigned int DATLEN         : 2;	/* Data Length */
		unsigned int RWT            : 2;	/* Read Write Trigger Command Type */
		/* const */ unsigned int BSY            : 1;	/* Channel Busy */
		/* const */ unsigned int ITTAG          : 3;	/* Initiator Transaction Tag */
		unsigned int TOREL          : 8;	/* Time Out Reload Value */
	} B;
	int I;
	unsigned int U;

} HSSL_ICON0_type;
#define HSSL_ICON0	(*( HSSL_ICON0_type *) 0xf0080034u)	/* Initiator Control Data Register 0 */
#define HSSL_ICON1	(*( HSSL_ICON0_type *) 0xf0080044u)	/* Initiator Control Data Register 1 */
#define HSSL_ICON2	(*( HSSL_ICON0_type *) 0xf0080054u)	/* Initiator Control Data Register 2 */
#define HSSL_ICON3	(*( HSSL_ICON0_type *) 0xf0080064u)	/* Initiator Control Data Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} HSSL_ID_type;
#define HSSL_ID	(*( HSSL_ID_type *) 0xf0080008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DATA           : 32;	/* Data Delivered by a Read Response Frame */
	} B;
	int I;
	unsigned int U;

} HSSL_IRD0_type;
#define HSSL_IRD0	(*( HSSL_IRD0_type *) 0xf008003cu)	/* Initiator Read Data Register */
#define HSSL_IRD1	(*( HSSL_IRD0_type *) 0xf008004cu)	/* Initiator Read Data Register */
#define HSSL_IRD2	(*( HSSL_IRD0_type *) 0xf008005cu)	/* Initiator Read Data Register */
#define HSSL_IRD3	(*( HSSL_IRD0_type *) 0xf008006cu)	/* Initiator Read Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRESS        : 32;	/* Address Part of the Payload of a Write Frame */
	} B;
	int I;
	unsigned int U;

} HSSL_IRWA0_type;
#define HSSL_IRWA0	(*( HSSL_IRWA0_type *) 0xf0080038u)	/* Initiator Read Write Address Register */
#define HSSL_IRWA1	(*( HSSL_IRWA0_type *) 0xf0080048u)	/* Initiator Read Write Address Register */
#define HSSL_IRWA2	(*( HSSL_IRWA0_type *) 0xf0080058u)	/* Initiator Read Write Address Register */
#define HSSL_IRWA3	(*( HSSL_IRWA0_type *) 0xf0080068u)	/* Initiator Read Write Address Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 5;
		/* const */ unsigned int CURR           : 27;	/* Address of the Memory Location for the Current Transfer */
	} B;
	int I;
	unsigned int U;

} HSSL_ISCA_type;
#define HSSL_ISCA	(*( HSSL_ISCA_type *) 0xf00800a8u)	/* Initiator Stream Current Address Register */
#define HSSL_TSCA	(*( HSSL_ISCA_type *) 0xf00800b8u)	/* Target Stream Current Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RELCOUNT       : 16;	/* Reload Count Number */
		/* const */ unsigned int CURCOUNT       : 16;	/* Current Count Number */
	} B;
	int I;
	unsigned int U;

} HSSL_ISFC_type;
#define HSSL_ISFC	(*( HSSL_ISFC_type *) 0xf00800acu)	/* Initiator Stream Frame Count Register */
#define HSSL_TSFC	(*( HSSL_ISFC_type *) 0xf00800bcu)	/* Target Stream Frame Count Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int START          : 27;	/* Start Address for the Memory Range */
	} B;
	int I;
	unsigned int U;

} HSSL_ISSA0_type;
#define HSSL_ISSA0	(*( HSSL_ISSA0_type *) 0xf00800a0u)	/* Initiator Stream Start Address Register */
#define HSSL_ISSA1	(*( HSSL_ISSA0_type *) 0xf00800a4u)	/* Initiator Stream Start Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 32;	/* Data Part of the Payload of a Write Frame */
	} B;
	int I;
	unsigned int U;

} HSSL_IWD0_type;
#define HSSL_IWD0	(*( HSSL_IWD0_type *) 0xf0080030u)	/* Initiator Write Data Register 0 */
#define HSSL_IWD1	(*( HSSL_IWD0_type *) 0xf0080040u)	/* Initiator Write Data Register 1 */
#define HSSL_IWD2	(*( HSSL_IWD0_type *) 0xf0080050u)	/* Initiator Write Data Register 2 */
#define HSSL_IWD3	(*( HSSL_IWD0_type *) 0xf0080060u)	/* Initiator Write Data Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} HSSL_KRST0_type;
#define HSSL_KRST0	(*( HSSL_KRST0_type *) 0xf00800f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} HSSL_KRST1_type;
#define HSSL_KRST1	(*( HSSL_KRST1_type *) 0xf00800f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} HSSL_KRSTCLR_type;
#define HSSL_KRSTCLR	(*( HSSL_KRSTCLR_type *) 0xf00800ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NACK           : 4;	/* Not Acknowledge Error - Target Error */
		/* const */ unsigned int TTE            : 4;	/* Transaction Tag Error */
		/* const */ unsigned int TIMEOUT        : 4;	/* Timeout Error */
		/* const */ unsigned int UNEXPECTED     : 4;	/* Unexpected Type of Frame Error */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int TMB            : 1;	/* Target Memory Block */
		/* const */ unsigned int IMB            : 1;	/* Initiator Memory Block */
		/* const */ unsigned int ISB            : 1;	/* Initiator Stream Block Request */
		/* const */ unsigned int MAV            : 1;	/* Memory Access Violation */
		/* const */ unsigned int SRIE           : 1;	/* SRI Bus Access Error */
		/* const */ unsigned int PIE1           : 1;	/* PHY Inconsistency Error 1 (Channel Number Code Error) */
		/* const */ unsigned int PIE2           : 1;	/* PHY Inconsistency Error 2 (Data Length Error) */
		/* const */ unsigned int CRCE           : 1;	/* CRC Error */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int TSE            : 1;	/* Target Stream Enable */
		/* const */ unsigned int TEI            : 1;	/* Transmit Enable Input */
		/* const */ unsigned int TEO            : 1;	/* Transmit Enable Output */
		/* const */ unsigned int INI            : 1;	/* Initialize Mode */
	} B;
	int I;
	unsigned int U;

} HSSL_MFLAGS_type;
#define HSSL_MFLAGS	(*( HSSL_MFLAGS_type *) 0xf0080018u)	/* Miscellaneous Flags Register */

