svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int NACKC          : 4;	/* NACK Flags Clear */
		unsigned int TTEC           : 4;	/* Transaction Tag Error Flags Clear */
		unsigned int TIMEOUTC       : 4;	/* Timeout Error Flags Clear */
		unsigned int UNEXPECTEDC    : 4;	/* Unexpected Error Flags Clear */
		unsigned int                : 2;
		unsigned int TMBC           : 1;	/* Target Memory Block Flag Clear */
		unsigned int IMBC           : 1;	/* Initiator Memory Block Flag Clear */
		unsigned int ISBC           : 1;	/* Initiator Stream Block Request Clear */
		unsigned int MAVC           : 1;	/* MAV Flag Clear */
		unsigned int SRIEC          : 1;	/* SRI Bus Access Error Flag Clear */
		unsigned int PIE1C          : 1;	/* PIE1 Error Flag Clear */
		unsigned int PIE2C          : 1;	/* PIE2 Error Flag Clear */
		unsigned int CRCEC          : 1;	/* CRC Error Flag Clear */
		unsigned int                : 2;
		unsigned int TSEC           : 1;	/* Target Stream Enable Flag Clear */
		unsigned int                : 1;
		unsigned int TEOC           : 1;	/* Transmit Enable Flag Clear */
		unsigned int INIC           : 1;	/* Initialize Mode Flag Clear */
	} B;
	int I;
	unsigned int U;

} HSSL_MFLAGSCL_type;
#define HSSL_MFLAGSCL	(*( HSSL_MFLAGSCL_type *) 0xf0080020u)	/* Miscellaneous Flags Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NACKEN         : 4;	/* Not Acknowledge Error Enable Bits */
		unsigned int TTEEN          : 4;	/* Transaction Tag Error Enable Bits */
		unsigned int TIMEOUTEN      : 4;	/* Timeout Error Enable Bits */
		unsigned int UNEXPECTEDEN   : 4;	/* Unexpected Error Enable Bits */
		unsigned int                : 5;
		unsigned int MAVEN          : 1;	/* MAV Enable Bit */
		unsigned int SRIEEN         : 1;	/* SRI Bus Access Error Enable Bit */
		unsigned int PIE1EN         : 1;	/* PIE1 Error Enable Bit */
		unsigned int PIE2EN         : 1;	/* PIE2 Error Enable Bit */
		unsigned int CRCEEN         : 1;	/* CRC Error Enable Bit */
		unsigned int                : 3;
		unsigned int TEIEN          : 1;	/* TEI Enable Bit */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} HSSL_MFLAGSEN_type;
#define HSSL_MFLAGSEN	(*( HSSL_MFLAGSEN_type *) 0xf0080024u)	/* Flags Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NACKS          : 4;	/* NACK Flags Set */
		unsigned int TTES           : 4;	/* Transaction Tag Error Flags Set */
		unsigned int TIMEOUTS       : 4;	/* Timeout Error Flags Set */
		unsigned int UNEXPECTEDS    : 4;	/* Unexpected Error Flags Set */
		unsigned int                : 2;
		unsigned int TMBS           : 1;	/* Target Memory Block Flag Set */
		unsigned int IMBS           : 1;	/* Initiator Memory Block Flag Set */
		unsigned int ISBS           : 1;	/* Initiator Stream Block Request Set */
		unsigned int MAVS           : 1;	/* MAV Flag Set */
		unsigned int SRIES          : 1;	/* SRI Bus Access Error Flag Set */
		unsigned int PIE1S          : 1;	/* PIE1 Error Flag Set */
		unsigned int PIE2S          : 1;	/* PIE2 Error Flag Set */
		unsigned int CRCES          : 1;	/* CRC Error Flag Set */
		unsigned int                : 2;
		unsigned int TSES           : 1;	/* Target Stream Enable Flag Set */
		unsigned int                : 1;
		unsigned int TEOS           : 1;	/* Transmit Enable Flag Set */
		unsigned int INIS           : 1;	/* Initialize Mode Flag Set */
	} B;
	int I;
	unsigned int U;

} HSSL_MFLAGSSET_type;
#define HSSL_MFLAGSSET	(*( HSSL_MFLAGSSET_type *) 0xf008001cu)	/* Miscellaneous Flags Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} HSSL_OCS_type;
#define HSSL_OCS	(*( HSSL_OCS_type *) 0xf00800e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int I              : 4;	/* Request Flags for Initiated Commands */
		/* const */ unsigned int T              : 4;	/* Request Flags for Commands Arrived at Target */
		/* const */ unsigned int R              : 4;	/* Request Flags for Response Frames at the Target */
		/* const */ unsigned int                : 4;
		/* const */ unsigned int E0             : 2;	/* Expect Flags for Activated Timeout Timer 0 */
		/* const */ unsigned int E1             : 2;	/* Expect Flags for Activated Timeout Timer 1 */
		/* const */ unsigned int E2             : 2;	/* Expect Flags for Activated Timeout Timer 2 */
		/* const */ unsigned int E3             : 2;	/* Expect Flags for Activated Timeout Timer 3 */
		/* const */ unsigned int                : 4;
		/* const */ unsigned int IS             : 1;	/* I Flag for Stream Frames */
		/* const */ unsigned int RS             : 1;	/* R Flag for Stream Frames */
		/* const */ unsigned int TS             : 1;	/* T Flag for Stream Frames */
		/* const */ unsigned int ES             : 1;	/* E Flag for Stream Frames */
	} B;
	int I;
	unsigned int U;

} HSSL_QFLAGS_type;
#define HSSL_QFLAGS	(*( HSSL_QFLAGS_type *) 0xf0080014u)	/* Request Flags Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXFL           : 2;	/* Stream RxFIFO Filling Level */
		/* const */ unsigned int TXFL           : 2;	/* Stream TxFIFO Filling Level */
		/* const */ unsigned int EXFL           : 2;	/* Stream Expect FIFO Filling Level */
		/* const */ unsigned int                : 9;
		/* const */ unsigned int ISF            : 1;	/* Initiator Stream Frame Request */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

