svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} HSSL_SFSFLAGS_type;
#define HSSL_SFSFLAGS	(*( HSSL_SFSFLAGS_type *) 0xf0080028u)	/* Stream FIFOs Status Flags Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int A              : 32;	/* Address Part of the Payload of a Write Command Frame or a Read Command Frame or ID Frame */
	} B;
	int I;
	unsigned int U;

} HSSL_TCA0_type;
#define HSSL_TCA0	(*( HSSL_TCA0_type *) 0xf0080074u)	/* Target Current Address Register 0 */
#define HSSL_TCA1	(*( HSSL_TCA0_type *) 0xf008007cu)	/* Target Current Address Register 1 */
#define HSSL_TCA2	(*( HSSL_TCA0_type *) 0xf0080084u)	/* Target Current Address Register 2 */
#define HSSL_TCA3	(*( HSSL_TCA0_type *) 0xf008008cu)	/* Target Current Address Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int D              : 32;	/* Data Part of the Payload of a Write Command Frame or Read Data of a Read Command Frame */
	} B;
	int I;
	unsigned int U;

} HSSL_TCD0_type;
#define HSSL_TCD0	(*( HSSL_TCD0_type *) 0xf0080070u)	/* Target Current Data Register 0 */
#define HSSL_TCD1	(*( HSSL_TCD0_type *) 0xf0080078u)	/* Target Current Data Register 1 */
#define HSSL_TCD2	(*( HSSL_TCD0_type *) 0xf0080080u)	/* Target Current Data Register 2 */
#define HSSL_TCD3	(*( HSSL_TCD0_type *) 0xf0080088u)	/* Target Current Data Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int A              : 32;	/* Address Pointer */
	} B;
	int I;
	unsigned int U;

} HSSL_TIDADD_type;
#define HSSL_TIDADD	(*( HSSL_TIDADD_type *) 0xf0080094u)	/* Target ID Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 5;
		unsigned int ADDR           : 27;	/* Start Address for the Memory Range */
	} B;
	int I;
	unsigned int U;

} HSSL_TSSA0_type;
#define HSSL_TSSA0	(*( HSSL_TSSA0_type *) 0xf00800b0u)	/* Target Stream Start Address Register 0 */
#define HSSL_TSSA1	(*( HSSL_TSSA0_type *) 0xf00800b4u)	/* Target Stream Start Address Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LASTCC0        : 5;	/* Last Command Code */
		/* const */ unsigned int LASTTT0        : 3;	/* Last Transaction Tag */
		/* const */ unsigned int LASTCC1        : 5;	/* Last Command Code */
		/* const */ unsigned int LASTTT1        : 3;	/* Last Transaction Tag */
		/* const */ unsigned int LASTCC2        : 5;	/* Last Command Code */
		/* const */ unsigned int LASTTT2        : 3;	/* Last Transaction Tag */
		/* const */ unsigned int LASTCC3        : 5;	/* Last Command Code */
		/* const */ unsigned int LASTTT3        : 3;	/* Last Transaction Tag */
	} B;
	int I;
	unsigned int U;

} HSSL_TSTAT_type;
#define HSSL_TSTAT	(*( HSSL_TSTAT_type *) 0xf0080090u)	/* Target Status Register */


/* HSCT */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} HSCT_ACCEN0_type;
#define HSCT_ACCEN0	(*( HSCT_ACCEN0_type *) 0xf009fffcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} HSCT_ACCEN1_type;
#define HSCT_ACCEN1	(*( HSCT_ACCEN1_type *) 0xf009fff8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} HSCT_CLC_type;
#define HSCT_CLC	(*( HSCT_CLC_type *) 0xf0090000u)	/* Clock Control Register */

