svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int PHYPD          : 1;	/* Physical layer Power Down */
		unsigned int PLLPON         : 1;	/* PLL Power On (Master Mode only) */
		unsigned int PLLPE          : 6;	/* PLL phase enable - allows to enable/disable each of the 6 Phase outputs. */
		unsigned int PLLWMF         : 6;	/* PLL frequency control word multiplication factor */
		unsigned int PLLKPKI        : 1;	/* KP/KI Setting */
		unsigned int PHYRST         : 1;	/* Physical Layer Reset */
		unsigned int PLLKP          : 3;	/* KP of PLL - Configuration of PLL beta coefficients of proportional part of loop filter */
		unsigned int PLLKI          : 3;	/* KI of PLL - Configuration of PLL alpha coefficients of integral part of loop filter */
		unsigned int PLLIVR         : 4;	/* Adjustment for integrated voltage regulator */
		unsigned int                : 2;
		unsigned int OSCCLKEN       : 1;	/* Enable Oscillator Clock as PLL reference clock */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} HSCT_CONFIGPHY_type;
#define HSCT_CONFIGPHY	(*( HSCT_CONFIGPHY_type *) 0xf0090030u)	/* Configuration physical layer register */

typedef volatile union
{
	struct
	{ 
		unsigned int CTS_FRAME      : 1;	/* Transmit CTS Frame Generation */
		unsigned int CTS_TXD        : 1;	/* Disable TX CTS signaling */
		unsigned int CTS_RXD        : 1;	/* Disable RX CTS detection */
		unsigned int HSSL_CTS_FBD   : 1;	/* Disable HSSL interface CTS Frame Blocking */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} HSCT_CTSCTRL_type;
#define HSCT_CTSCTRL	(*( HSCT_CTSCTRL_type *) 0xf009001cu)	/* Clear To Send Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TX_DIS         : 1;	/* Disable HSCT Transmit path in Master interface */
		unsigned int RX_DIS         : 1;	/* Disable HSCT Receive path in Master interface */
		unsigned int RX_HEPD        : 1;	/* Disable RX Header Error Discard Payload data. */
		unsigned int TX_PWDPD       : 1;	/* Disable TX Power down pull down. */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} HSCT_DISABLE_type;
#define HSCT_DISABLE	(*( HSCT_DISABLE_type *) 0xf0090020u)	/* Transmission Disable Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} HSCT_ID_type;
#define HSCT_ID	(*( HSCT_ID_type *) 0xf0090008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IFCVS          : 8;	/* Master Mode - Interface Control Value to be send to Slave interface */
		unsigned int SIFCV          : 1;	/* Master Mode - Slave IF control frame trigger */
		unsigned int                : 7;
		unsigned int MRXSPEED       : 2;	/* Master Mode RX speed */
		unsigned int MTXSPEED       : 2;	/* Master Mode TX speed */
		unsigned int IFTESTMD       : 1;	/* Master Mode Interface Test Mode */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} HSCT_IFCTRL_type;
#define HSCT_IFCTRL	(*( HSCT_IFCTRL_type *) 0xf0090014u)	/* CPU transfer control register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX_STAT        : 3;	/* HSCT slave interface Status for RX link */
		/* const */ unsigned int TX_STAT        : 2;	/* HSCT slave interface Status for TX link */
		/* const */ unsigned int                : 27;
	} B;
	int I;
	unsigned int U;

} HSCT_IFSTAT_type;
#define HSCT_IFSTAT	(*( HSCT_IFSTAT_type *) 0xf0090028u)	/* Interface Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TERM           : 1;	/* Select Receiver Termination Mode of HSCT Interface */
		unsigned int SYS_CLK_EN     : 1;	/* Enable SysClk in Master interface */
		unsigned int SRCF           : 1;	/* Select SysClk / Reference Clock Frequency rate */
		unsigned int IFM            : 1;	/* Select Interface Mode */
		unsigned int                : 4;
		unsigned int LVDSR          : 1;	/* Special reduced LVDS electrical signaling mode */
		unsigned int LVDSRL         : 1;	/* LVDS IEEE electrical signaling mode */
		unsigned int LHLR           : 1;	/* Loopback path at Slave interface side at higher layer system RAM. */
		unsigned int                : 5;
		unsigned int TXHD           : 3;	/* Transmit High Speed Divider. */
		unsigned int RXHD           : 3;	/* Receive High Speed Divider. */
		unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} HSCT_INIT_type;
#define HSCT_INIT	(*( HSCT_INIT_type *) 0xf0090010u)	/* Initialization register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int                : 1;
		/* const */ unsigned int HER            : 1;	/* Header error detected */
		/* const */ unsigned int PYER           : 1;	/* Payload error detected */
		/* const */ unsigned int CER            : 1;	/* HSCT command error */
		/* const */ unsigned int IFCFS          : 1;	/* HSCT interface control frame send */
		/* const */ unsigned int SMER           : 1;	/* Speed Mode Switch Error (Master Mode only) */
		/* const */ unsigned int USMSF          : 1;	/* Unsolicited message frame send finished */
		/* const */ unsigned int PLER           : 1;	/* PLL lost lock error */
		/* const */ unsigned int USM            : 1;	/* Unsolicited Message Received */
		/* const */ unsigned int PAR            : 1;	/* PING Answer Received */
		/* const */ unsigned int TXTE           : 1;	/* TX transfer error occurred on a disabled TX channel. */
		/* const */ unsigned int SFO            : 1;	/* Synchronization FIFO overflow (in RX direction) */
		/* const */ unsigned int SFU            : 1;	/* Synchronization FIFO underflow (in TX direction) */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} HSCT_IRQ_type;
#define HSCT_IRQ	(*( HSCT_IRQ_type *) 0xf0090040u)	/* Interrupt register */

