svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int HERCLR         : 1;	/* Header error detected interrupt clear */
		unsigned int PYERCLR        : 1;	/* Payload error detected interrupt clear */
		unsigned int CERCLR         : 1;	/* HSCT command error interrupt clear */
		unsigned int IFCFSCLR       : 1;	/* HSCT interface control command send interrupt clear */
		unsigned int SMERCLR        : 1;	/* Speed Mode Switch Error interrupt clear */
		unsigned int USMSFCLR       : 1;	/* Unsolicited message frame send finished interrupt clear */
		unsigned int PLERCLR        : 1;	/* PLL lost lock error interrupt clear */
		unsigned int USMCLR         : 1;	/* Unsolicited Message received clear */
		unsigned int PARCLR         : 1;	/* PING Answer received clear */
		unsigned int TXTECLR        : 1;	/* TX disable error interrupt clear */
		unsigned int SFOEN          : 1;	/* Synchronization FIFO overflow (in RX direction) interrupt clear */
		unsigned int SFUEN          : 1;	/* Synchronization FIFO underflow (in TX direction) interrupt clear */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} HSCT_IRQCLR_type;
#define HSCT_IRQCLR	(*( HSCT_IRQCLR_type *) 0xf0090048u)	/* Interrupt clear register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 1;
		unsigned int HEREN          : 1;	/* Header error detected interrupt enable */
		unsigned int PYEREN         : 1;	/* Payload error detected interrupt enable */
		unsigned int CEREN          : 1;	/* HSCT command error interrupt enable */
		unsigned int IFCFSEN        : 1;	/* HSCT interface control command send enable */
		unsigned int SMEREN         : 1;	/* Speed Mode Switch Error interrupt enable */
		unsigned int USMSFEN        : 1;	/* Unsolicited message frame send finished */
		unsigned int PLEREN         : 1;	/* PLL lost lock error interrupt enable */
		unsigned int USMEN          : 1;	/* Unsolicited Message received enable */
		unsigned int PAREN          : 1;	/* PING Answer Received enable */
		unsigned int TXTEEN         : 1;	/* TX disable error interrupt enable */
		unsigned int SFOEN          : 1;	/* Synchronization FIFO overflow (in RX direction) interrupt enable */
		unsigned int SFUEN          : 1;	/* Synchronization FIFO underflow (in TX direction) interrupt enable */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} HSCT_IRQEN_type;
#define HSCT_IRQEN	(*( HSCT_IRQEN_type *) 0xf0090044u)	/* Interrupt enable register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} HSCT_KRST0_type;
#define HSCT_KRST0	(*( HSCT_KRST0_type *) 0xf009fff4u)	/* Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} HSCT_KRST1_type;
#define HSCT_KRST1	(*( HSCT_KRST1_type *) 0xf009fff0u)	/* Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} HSCT_KRSTCLR_type;
#define HSCT_KRSTCLR	(*( HSCT_KRSTCLR_type *) 0xf009ffecu)	/* Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} HSCT_OCS_type;
#define HSCT_OCS	(*( HSCT_OCS_type *) 0xf009ffe8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int SLPEN          : 1;	/* Sleep mode enabled */
		unsigned int SLPCLKG        : 1;	/* Clock Gating in Sleep Mode */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} HSCT_SLEEPCTRL_type;
#define HSCT_SLEEPCTRL	(*( HSCT_SLEEPCTRL_type *) 0xf0090018u)	/* Sleep Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX_PSIZE       : 3;	/* RX (receiving) Payload Size */
		/* const */ unsigned int RX_CHANNEL     : 4;	/* RX (receiving) Logical Channel Type */
		/* const */ unsigned int RX_SLEEP       : 1;	/* RX (receiving) Sleep Mode Status */
		/* const */ unsigned int TX_SLEEP       : 1;	/* TX (transmitting) Sleep Mode Status */
		/* const */ unsigned int                : 3;
		/* const */ unsigned int TX_PSIZE       : 3;	/* Transmission Payload Size */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int TX_CHANNEL_TYPE: 4;	/* Transmission Logical Channel Type */
		/* const */ unsigned int                : 4;
		/* const */ unsigned int LIFCCMDR       : 8;	/* Last Interface Control Command Received */
	} B;
	int I;
	unsigned int U;

} HSCT_STAT_type;
#define HSCT_STAT	(*( HSCT_STAT_type *) 0xf0090024u)	/* Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PLOCK          : 1;	/* PLL locked */
		/* const */ unsigned int RXLSA          : 1;	/* Receiver in Low speed */
		/* const */ unsigned int TXLSA          : 1;	/* Transmitter in Low speed */
		/* const */ unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} HSCT_STATPHY_type;
#define HSCT_STATPHY	(*( HSCT_STATPHY_type *) 0xf0090034u)	/* STATPHY */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int USMR           : 32;	/* Unsolicited status message received */
	} B;
	int I;
	unsigned int U;

} HSCT_USMR_type;
#define HSCT_USMR	(*( HSCT_USMR_type *) 0xf0090050u)	/* Unsolicited Status Message Received */

