svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int USMS           : 32;	/* Unsolicited status message send */
	} B;
	int I;
	unsigned int U;

} HSCT_USMS_type;
#define HSCT_USMS	(*( HSCT_USMS_type *) 0xf0090054u)	/* Unsolicited Status Message Send */


/* MSC */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} MSC0_ACCEN0_type;
#define MSC0_ACCEN0	(*( MSC0_ACCEN0_type *) 0xf00026fcu)	/* Access Enable Register 0 */
#define MSC1_ACCEN0	(*( MSC0_ACCEN0_type *) 0xf00027fcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} MSC0_ACCEN1_type;
#define MSC0_ACCEN1	(*( MSC0_ACCEN1_type *) 0xf00026f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} MSC0_CLC_type;
#define MSC0_CLC	(*( MSC0_CLC_type *) 0xf0002600u)	/* Clock Control Register */
#define MSC1_CLC	(*( MSC0_CLC_type *) 0xf0002700u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DCL            : 16;	/* Downstream Command for SRL Shift Register */
		unsigned int DCH            : 16;	/* Downstream Command for SRH Shift Register */
	} B;
	int I;
	unsigned int U;

} MSC0_DC_type;
#define MSC0_DC	(*( MSC0_DC_type *) 0xf0002620u)	/* Downstream Command Register */
#define MSC1_DC	(*( MSC0_DC_type *) 0xf0002720u)	/* Downstream Command Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DDL            : 16;	/* Downstream Data for SRL Shift Register */
		unsigned int DDH            : 16;	/* Downstream Data for SRH Shift Register */
	} B;
	int I;
	unsigned int U;

} MSC0_DD_type;
#define MSC0_DD	(*( MSC0_DD_type *) 0xf000261cu)	/* Downstream Data Register */
#define MSC1_DD	(*( MSC0_DD_type *) 0xf000271cu)	/* Downstream Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TM             : 1;	/* Transmission Mode */
		/* const */ unsigned int CP             : 1;	/* Command Pending */
		/* const */ unsigned int DP             : 1;	/* Data Pending */
		unsigned int NDBL           : 5;	/* Number of SRL Bits Shifted at Data Frames */
		unsigned int NDBH           : 5;	/* Number of SRH Bits Shifted at Data Frames */
		unsigned int ENSELL         : 1;	/* Enable SRL Active Phase Selection Bit */
		unsigned int ENSELH         : 1;	/* Enable SRH Active Phase Selection Bit */
		/* const */ unsigned int DSDIS          : 1;	/* Downstream Disable */
		unsigned int NBC            : 6;	/* Number of Bits Shifted at Command Frames */
		unsigned int                : 2;
		unsigned int PPD            : 5;	/* Passive Phase Length at Data Frames */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} MSC0_DSC_type;
#define MSC0_DSC	(*( MSC0_DSC_type *) 0xf0002614u)	/* Downstream Control Register */
#define MSC1_DSC	(*( MSC0_DSC_type *) 0xf0002714u)	/* Downstream Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NDBHE          : 1;	/* Number of SRH Bits Shifted at Data Frames Extension */
		unsigned int NDBLE          : 1;	/* Number of SRH Bits Shifted at Data Frames Extension */
		unsigned int                : 12;
		unsigned int EXEN           : 1;	/* Extension Enable */
		/* const */ unsigned int CCF            : 1;	/* Command-Comand Flag */
		unsigned int INJENP0        : 1;	/* Injection Enable of the Pin 0 Signal */
		unsigned int INJPOSP0       : 6;	/* Injection Position of the Pin 0 Signal */
		unsigned int                : 1;
		unsigned int INJENP1        : 1;	/* Injection Enable of the Pin 1 Signal */
		unsigned int INJPOSP1       : 6;	/* Injection Position of the Pin 1 Signal */
		unsigned int CDCM           : 1;	/* Command-Data-Comand in Data Repetition Mode */
	} B;
	int I;
	unsigned int U;

} MSC0_DSCE_type;
#define MSC0_DSCE	(*( MSC0_DSCE_type *) 0xf0002658u)	/* Downstream Control Enhanced Register 1 */
#define MSC1_DSCE	(*( MSC0_DSCE_type *) 0xf0002758u)	/* Downstream Control Enhanced Register 1 */

