svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SH0            : 2;	/* Select Source for SRH */
		unsigned int SH1            : 2;	/* Select Source for SRH */
		unsigned int SH2            : 2;	/* Select Source for SRH */
		unsigned int SH3            : 2;	/* Select Source for SRH */
		unsigned int SH4            : 2;	/* Select Source for SRH */
		unsigned int SH5            : 2;	/* Select Source for SRH */
		unsigned int SH6            : 2;	/* Select Source for SRH */
		unsigned int SH7            : 2;	/* Select Source for SRH */
		unsigned int SH8            : 2;	/* Select Source for SRH */
		unsigned int SH9            : 2;	/* Select Source for SRH */
		unsigned int SH10           : 2;	/* Select Source for SRH */
		unsigned int SH11           : 2;	/* Select Source for SRH */
		unsigned int SH12           : 2;	/* Select Source for SRH */
		unsigned int SH13           : 2;	/* Select Source for SRH */
		unsigned int SH14           : 2;	/* Select Source for SRH */
		unsigned int SH15           : 2;	/* Select Source for SRH */
	} B;
	int I;
	unsigned int U;

} MSC0_DSDSH_type;
#define MSC0_DSDSH	(*( MSC0_DSDSH_type *) 0xf0002628u)	/* Downstream Select Data Source High Register */
#define MSC1_DSDSH	(*( MSC0_DSDSH_type *) 0xf0002728u)	/* Downstream Select Data Source High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SL0            : 2;	/* Select Source for SRL */
		unsigned int SL1            : 2;	/* Select Source for SRL */
		unsigned int SL2            : 2;	/* Select Source for SRL */
		unsigned int SL3            : 2;	/* Select Source for SRL */
		unsigned int SL4            : 2;	/* Select Source for SRL */
		unsigned int SL5            : 2;	/* Select Source for SRL */
		unsigned int SL6            : 2;	/* Select Source for SRL */
		unsigned int SL7            : 2;	/* Select Source for SRL */
		unsigned int SL8            : 2;	/* Select Source for SRL */
		unsigned int SL9            : 2;	/* Select Source for SRL */
		unsigned int SL10           : 2;	/* Select Source for SRL */
		unsigned int SL11           : 2;	/* Select Source for SRL */
		unsigned int SL12           : 2;	/* Select Source for SRL */
		unsigned int SL13           : 2;	/* Select Source for SRL */
		unsigned int SL14           : 2;	/* Select Source for SRL */
		unsigned int SL15           : 2;	/* Select Source for SRL */
	} B;
	int I;
	unsigned int U;

} MSC0_DSDSL_type;
#define MSC0_DSDSL	(*( MSC0_DSDSL_type *) 0xf0002624u)	/* Downstream Select Data Source Low Register */
#define MSC1_DSDSL	(*( MSC0_DSDSL_type *) 0xf0002724u)	/* Downstream Select Data Source Low Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int PFC            : 4;	/* Passive Time Frame Counter */
		unsigned int                : 4;
		unsigned int NPTF           : 4;	/* Number Of Passive Time Frames */
		unsigned int                : 4;
		/* const */ unsigned int DC             : 8;	/* Downstream Counter */
		/* const */ unsigned int DFA            : 1;	/* Data Frame Active */
		/* const */ unsigned int CFA            : 1;	/* Command Frame Active */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} MSC0_DSS_type;
#define MSC0_DSS	(*( MSC0_DSS_type *) 0xf0002618u)	/* Downstream Status Register */
#define MSC1_DSS	(*( MSC0_DSS_type *) 0xf0002718u)	/* Downstream Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENL0           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL1           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL2           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL3           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL4           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL5           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL6           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL7           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL8           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL9           : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL10          : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL11          : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL12          : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL13          : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL14          : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENL15          : 1;	/* Emergency Stop Enable for Bit x in SRL */
		unsigned int ENH0           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH1           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH2           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH3           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH4           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH5           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH6           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH7           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH8           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH9           : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH10          : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH11          : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH12          : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH13          : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH14          : 1;	/* Emergency Stop Enable for Bit x in SRH */
		unsigned int ENH15          : 1;	/* Emergency Stop Enable for Bit x in SRH */
	} B;
	int I;
	unsigned int U;

} MSC0_ESR_type;
#define MSC0_ESR	(*( MSC0_ESR_type *) 0xf000262cu)	/* Emergency Stop Register */
#define MSC1_ESR	(*( MSC0_ESR_type *) 0xf000272cu)	/* Emergency Stop Register */

