svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 1;
		unsigned int SM             : 1;	/* Suspend Mode */
		unsigned int SC             : 2;	/* Suspend Control */
		unsigned int DM             : 2;	/* Divider Mode */
		/* const */ unsigned int RESULT         : 10;	/* Result Value */
		unsigned int                : 2;
		/* const */ unsigned int SUSACK         : 1;	/* Suspend Mode Acknowledge */
		/* const */ unsigned int SUSREQ         : 1;	/* Suspend Mode Request */
		unsigned int ENHW           : 1;	/* Enable Hardware Clock Control */
		unsigned int DISCLK         : 1;	/* Disable Clock */
	} B;
	int I;
	unsigned int U;

} MSC0_FDR_type;
#define MSC0_FDR	(*( MSC0_FDR_type *) 0xf000260cu)	/* Fractional Divider Register */
#define MSC1_FDR	(*( MSC0_FDR_type *) 0xf000270cu)	/* Fractional Divider Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EDIP           : 2;	/* Data Frame Interrupt Node Pointer */
		unsigned int EDIE           : 2;	/* Data Frame Interrupt Enable */
		unsigned int ECIP           : 2;	/* Command Frame Interrupt Node Pointer */
		unsigned int                : 1;
		unsigned int ECIE           : 1;	/* Command Frame Interrupt Enable */
		unsigned int TFIP           : 2;	/* Time Frame Interrupt Pointer */
		unsigned int                : 1;
		unsigned int TFIE           : 1;	/* Time Frame Interrupt Enable */
		unsigned int RDIP           : 2;	/* Receive Data Interrupt Pointer */
		unsigned int RDIE           : 2;	/* Receive Data Interrupt Enable */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} MSC0_ICR_type;
#define MSC0_ICR	(*( MSC0_ICR_type *) 0xf0002640u)	/* Interrupt Control Register */
#define MSC1_ICR	(*( MSC0_ICR_type *) 0xf0002740u)	/* Interrupt Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} MSC0_ID_type;
#define MSC0_ID	(*( MSC0_ID_type *) 0xf0002608u)	/* Module Identification Register */
#define MSC1_ID	(*( MSC0_ID_type *) 0xf0002708u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CDEDI          : 1;	/* Clear DEDI Flag */
		unsigned int CDECI          : 1;	/* Clear DECI Flag */
		unsigned int CDTFI          : 1;	/* Clear DTFI Flag */
		unsigned int CURDI          : 1;	/* Clear URDI Flag */
		unsigned int CDP            : 1;	/* Clear DP Flag */
		unsigned int CCP            : 1;	/* Clear CP Flag */
		unsigned int CDDIS          : 1;	/* Clear DSDIS Flag */
		unsigned int                : 9;
		unsigned int SDEDI          : 1;	/* Set DEDI Flag */
		unsigned int SDECI          : 1;	/* Set DECI Flag */
		unsigned int SDTFI          : 1;	/* Set DTFI Flag */
		unsigned int SURDI          : 1;	/* Set URDI Flag */
		unsigned int SDP            : 1;	/* Set DP Bit */
		unsigned int SCP            : 1;	/* Set CP Flag */
		unsigned int SDDIS          : 1;	/* Set DSDIS Flag */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} MSC0_ISC_type;
#define MSC0_ISC	(*( MSC0_ISC_type *) 0xf0002648u)	/* Interrupt Set Clear Register */
#define MSC1_ISC	(*( MSC0_ISC_type *) 0xf0002748u)	/* Interrupt Set Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DEDI           : 1;	/* Data Frame Interrupt Flag */
		/* const */ unsigned int DECI           : 1;	/* Command Frame Interrupt Flag */
		/* const */ unsigned int DTFI           : 1;	/* Time Frame Interrupt Flag */
		/* const */ unsigned int URDI           : 1;	/* Receive Data Interrupt Flag */
		/* const */ unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} MSC0_ISR_type;
#define MSC0_ISR	(*( MSC0_ISR_type *) 0xf0002644u)	/* Interrupt Status Register */
#define MSC1_ISR	(*( MSC0_ISR_type *) 0xf0002744u)	/* Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} MSC0_KRST0_type;
#define MSC0_KRST0	(*( MSC0_KRST0_type *) 0xf00026f4u)	/* Kernel Reset Register 0 */
#define MSC1_KRST0	(*( MSC0_KRST0_type *) 0xf00027f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} MSC0_KRST1_type;
#define MSC0_KRST1	(*( MSC0_KRST1_type *) 0xf00026f0u)	/* Kernel Reset Register 1 */
#define MSC1_KRST1	(*( MSC0_KRST1_type *) 0xf00027f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} MSC0_KRSTCLR_type;
#define MSC0_KRSTCLR	(*( MSC0_KRSTCLR_type *) 0xf00026ecu)	/* Kernel Reset Status Clear Register */
#define MSC1_KRSTCLR	(*( MSC0_KRSTCLR_type *) 0xf00027ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLP            : 1;	/* FCLP Line Polarity */
		unsigned int SLP            : 1;	/* SOP Line Polarity */
		unsigned int CSLP           : 1;	/* Chip Selection Lines Polarity */
		unsigned int ILP            : 1;	/* SDI Line Polarity */
		unsigned int                : 4;
		unsigned int CLKCTRL        : 1;	/* Clock Control */
		unsigned int CSL            : 2;	/* Chip Enable Selection for ENL */
		unsigned int CSH            : 2;	/* Chip Enable Selection for ENH */
		unsigned int CSC            : 2;	/* Chip Enable Selection for ENC */
		unsigned int                : 1;
		unsigned int SDISEL         : 3;	/* Serial Data Input Selection */
		unsigned int                : 13;
	} B;
	int I;
	unsigned int U;

