svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} MSC0_OCR_type;
#define MSC0_OCR	(*( MSC0_OCR_type *) 0xf000264cu)	/* Output Control Register */
#define MSC1_OCR	(*( MSC0_OCR_type *) 0xf000274cu)	/* Output Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} MSC0_OCS_type;
#define MSC0_OCS	(*( MSC0_OCS_type *) 0xf00026e8u)	/* OCDS Control and Status */
#define MSC1_OCS	(*( MSC0_OCS_type *) 0xf00027e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DATA           : 8;	/* Received Data */
		unsigned int                : 8;
		/* const */ unsigned int V              : 1;	/* Valid Bit */
		/* const */ unsigned int P              : 1;	/* Parity Bit */
		unsigned int C              : 1;	/* Clear Bit */
		/* const */ unsigned int LABF           : 2;	/* Lower Address Bit Field */
		/* const */ unsigned int IPF            : 1;	/* Internal Parity Flag */
		/* const */ unsigned int PERR           : 1;	/* Parity Error */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} MSC0_UD0_type;
#define MSC0_UD0	(*( MSC0_UD0_type *) 0xf0002630u)	/* Upstream Data Register 0 */
#define MSC0_UD1	(*( MSC0_UD0_type *) 0xf0002634u)	/* Upstream Data Register 1 */
#define MSC0_UD2	(*( MSC0_UD0_type *) 0xf0002638u)	/* Upstream Data Register 2 */
#define MSC0_UD3	(*( MSC0_UD0_type *) 0xf000263cu)	/* Upstream Data Register 3 */
#define MSC1_UD0	(*( MSC0_UD0_type *) 0xf0002730u)	/* Upstream Data Register 0 */
#define MSC1_UD1	(*( MSC0_UD0_type *) 0xf0002734u)	/* Upstream Data Register 1 */
#define MSC1_UD2	(*( MSC0_UD0_type *) 0xf0002738u)	/* Upstream Data Register 2 */
#define MSC1_UD3	(*( MSC0_UD0_type *) 0xf000273cu)	/* Upstream Data Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int USTOPRE        : 4;	/* Upstream Timeout Prescaler */
		unsigned int USTOVAL        : 4;	/* Upstream Timeout Value */
		unsigned int USTOEN         : 1;	/* Upstream Timeout Interrupt Enable */
		/* const */ unsigned int USTF           : 1;	/* Upstream Timeout Flag */
		unsigned int USTC           : 1;	/* Upstream Timout Clear */
		unsigned int USTS           : 1;	/* Upstream Timout Set */
		unsigned int                : 1;
		unsigned int UTASR          : 1;	/* Upstream Timout Alternate Service Request */
		unsigned int USTOIP         : 2;	/* Upstream Timout Interrupt Node Pointer */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} MSC0_USCE_type;
#define MSC0_USCE	(*( MSC0_USCE_type *) 0xf000265cu)	/* Upstream Control Enhanced Register 1 */
#define MSC1_USCE	(*( MSC0_USCE_type *) 0xf000275cu)	/* Upstream Control Enhanced Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int UFT            : 1;	/* Upstream Channel Frame Type */
		unsigned int URR            : 3;	/* Upstream Channel Receiving Rate */
		unsigned int PCTR           : 1;	/* Parity Control */
		unsigned int SRDC           : 1;	/* Service Request Delay Control */
		unsigned int                : 10;
		/* const */ unsigned int UC             : 5;	/* Upstream Counter */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} MSC0_USR_type;
#define MSC0_USR	(*( MSC0_USR_type *) 0xf0002610u)	/* Upstream Status Register */
#define MSC1_USR	(*( MSC0_USR_type *) 0xf0002710u)	/* Upstream Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} MSC1_ACCEN1_type;
#define MSC1_ACCEN1	(*( MSC1_ACCEN1_type *) 0xf00027f8u)	/* Access Enable Register 1 */


/* SENT */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} SENT_ACCEN0_type;
#define SENT_ACCEN0	(*( SENT_ACCEN0_type *) 0xf00030fcu)	/* Access Enable Register 0 */

