svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} SENT_ACCEN1_type;
#define SENT_ACCEN1	(*( SENT_ACCEN1_type *) 0xf00030f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DIV            : 12;	/* Divider Value */
		unsigned int                : 4;
		/* const */ unsigned int DIVM           : 12;	/* Measured Divider Value */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} SENT_CFDR0_type;
#define SENT_CFDR0	(*( SENT_CFDR0_type *) 0xf0003104u)	/* Channel Fractional Divider Register 0 */
#define SENT_CFDR1	(*( SENT_CFDR0_type *) 0xf0003144u)	/* Channel Fractional Divider Register 1 */
#define SENT_CFDR2	(*( SENT_CFDR0_type *) 0xf0003184u)	/* Channel Fractional Divider Register 2 */
#define SENT_CFDR3	(*( SENT_CFDR0_type *) 0xf00031c4u)	/* Channel Fractional Divider Register 3 */
#define SENT_CFDR4	(*( SENT_CFDR0_type *) 0xf0003204u)	/* Channel Fractional Divider Register 4 */
#define SENT_CFDR5	(*( SENT_CFDR0_type *) 0xf0003244u)	/* Channel Fractional Divider Register 5 */
#define SENT_CFDR6	(*( SENT_CFDR0_type *) 0xf0003284u)	/* Channel Fractional Divider Register 6 */
#define SENT_CFDR7	(*( SENT_CFDR0_type *) 0xf00032c4u)	/* Channel Fractional Divider Register 7 */
#define SENT_CFDR8	(*( SENT_CFDR0_type *) 0xf0003304u)	/* Channel Fractional Divider Register 8 */
#define SENT_CFDR9	(*( SENT_CFDR0_type *) 0xf0003344u)	/* Channel Fractional Divider Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 4;
		unsigned int RMC            : 8;	/* 8-bit Clock Divider Value in RUN Mode */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SENT_CLC_type;
#define SENT_CLC	(*( SENT_CLC_type *) 0xf0003000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PDIV           : 12;	/* Divider Factor of Pre Divider for Channel x */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} SENT_CPDR0_type;
#define SENT_CPDR0	(*( SENT_CPDR0_type *) 0xf0003100u)	/* Channel Pre Divider Register 0 */
#define SENT_CPDR1	(*( SENT_CPDR0_type *) 0xf0003140u)	/* Channel Pre Divider Register 1 */
#define SENT_CPDR2	(*( SENT_CPDR0_type *) 0xf0003180u)	/* Channel Pre Divider Register 2 */
#define SENT_CPDR3	(*( SENT_CPDR0_type *) 0xf00031c0u)	/* Channel Pre Divider Register 3 */
#define SENT_CPDR4	(*( SENT_CPDR0_type *) 0xf0003200u)	/* Channel Pre Divider Register 4 */
#define SENT_CPDR5	(*( SENT_CPDR0_type *) 0xf0003240u)	/* Channel Pre Divider Register 5 */
#define SENT_CPDR6	(*( SENT_CPDR0_type *) 0xf0003280u)	/* Channel Pre Divider Register 6 */
#define SENT_CPDR7	(*( SENT_CPDR0_type *) 0xf00032c0u)	/* Channel Pre Divider Register 7 */
#define SENT_CPDR8	(*( SENT_CPDR0_type *) 0xf0003300u)	/* Channel Pre Divider Register 8 */
#define SENT_CPDR9	(*( SENT_CPDR0_type *) 0xf0003340u)	/* Channel Pre Divider Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 4;
		unsigned int DM             : 2;	/* Divider Mode */
		/* const */ unsigned int RESULT         : 10;	/* Result Value */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} SENT_FDR_type;
#define SENT_FDR	(*( SENT_FDR_type *) 0xf000300cu)	/* SENT Fractional Divider Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} SENT_ID_type;
#define SENT_ID	(*( SENT_ID_type *) 0xf0003008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 4;	/* Interrupt Node Pointer for Interrupt RSI */
		unsigned int RDI            : 4;	/* Interrupt Node Pointer for Interrupt RDI */
		unsigned int RBI            : 4;	/* Interrupt Node Pointer for Interrupt RBI */
		unsigned int TDI            : 4;	/* Interrupt Node Pointer for Interrupt TDI */
		unsigned int TBI            : 4;	/* Interrupt Node Pointer for Interrupt TBI */
		unsigned int ERRI           : 4;	/* Interrupt Node Pointer for Interrupt FRI, FDI, NNI, NVI, CRCI, WSI, SCRI */
		unsigned int SDI            : 4;	/* Interrupt Node Pointer for Interrupt SDI */
		unsigned int WDI            : 4;	/* Interrupt Node Pointer for Interrupt WDI */
	} B;
	int I;
	unsigned int U;

} SENT_INP0_type;
#define SENT_INP0	(*( SENT_INP0_type *) 0xf0003130u)	/* Interrupt Node Pointer Register 0 */
#define SENT_INP1	(*( SENT_INP0_type *) 0xf0003170u)	/* Interrupt Node Pointer Register 1 */
#define SENT_INP2	(*( SENT_INP0_type *) 0xf00031b0u)	/* Interrupt Node Pointer Register 2 */
#define SENT_INP3	(*( SENT_INP0_type *) 0xf00031f0u)	/* Interrupt Node Pointer Register 3 */
#define SENT_INP4	(*( SENT_INP0_type *) 0xf0003230u)	/* Interrupt Node Pointer Register 4 */
#define SENT_INP5	(*( SENT_INP0_type *) 0xf0003270u)	/* Interrupt Node Pointer Register 5 */
#define SENT_INP6	(*( SENT_INP0_type *) 0xf00032b0u)	/* Interrupt Node Pointer Register 6 */
#define SENT_INP7	(*( SENT_INP0_type *) 0xf00032f0u)	/* Interrupt Node Pointer Register 7 */
#define SENT_INP8	(*( SENT_INP0_type *) 0xf0003330u)	/* Interrupt Node Pointer Register 8 */
#define SENT_INP9	(*( SENT_INP0_type *) 0xf0003370u)	/* Interrupt Node Pointer Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 1;	/* Clear Interrupt Request Flag RSI */
		unsigned int RDI            : 1;	/* Clear Interrupt Request Flag RDI */
		unsigned int RBI            : 1;	/* Clear Interrupt Request Flag RBI */
		unsigned int TDI            : 1;	/* Clear Interrupt Request Flag TDI */
		unsigned int TBI            : 1;	/* Clear Interrupt Request Flag TBI */
		unsigned int FRI            : 1;	/* Clear Interrupt Request Flag FRI */
		unsigned int FDI            : 1;	/* Clear Interrupt Request Flag FDI */
		unsigned int NNI            : 1;	/* Clear Interrupt Request Flag NMI */
		unsigned int NVI            : 1;	/* Clear Interrupt Request Flag NVI */
		unsigned int CRCI           : 1;	/* Clear Interrupt Request Flag CRCI */
		unsigned int WSI            : 1;	/* Clear Interrupt Request Flag WSI */
		unsigned int SDI            : 1;	/* Clear Interrupt Request Flag SDI */
		unsigned int SCRI           : 1;	/* Clear Interrupt Request Flag SCRI */
		unsigned int WDI            : 1;	/* Clear Interrupt Request Flag WDI */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} SENT_INTCLR0_type;
#define SENT_INTCLR0	(*( SENT_INTCLR0_type *) 0xf0003128u)	/* Interrupt Clear Register 0 */
#define SENT_INTCLR1	(*( SENT_INTCLR0_type *) 0xf0003168u)	/* Interrupt Clear Register 1 */
#define SENT_INTCLR2	(*( SENT_INTCLR0_type *) 0xf00031a8u)	/* Interrupt Clear Register 2 */
#define SENT_INTCLR3	(*( SENT_INTCLR0_type *) 0xf00031e8u)	/* Interrupt Clear Register 3 */
#define SENT_INTCLR4	(*( SENT_INTCLR0_type *) 0xf0003228u)	/* Interrupt Clear Register 4 */
#define SENT_INTCLR5	(*( SENT_INTCLR0_type *) 0xf0003268u)	/* Interrupt Clear Register 5 */
#define SENT_INTCLR6	(*( SENT_INTCLR0_type *) 0xf00032a8u)	/* Interrupt Clear Register 6 */
#define SENT_INTCLR7	(*( SENT_INTCLR0_type *) 0xf00032e8u)	/* Interrupt Clear Register 7 */
#define SENT_INTCLR8	(*( SENT_INTCLR0_type *) 0xf0003328u)	/* Interrupt Clear Register 8 */
#define SENT_INTCLR9	(*( SENT_INTCLR0_type *) 0xf0003368u)	/* Interrupt Clear Register 9 */

