svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 1;	/* Enable Interrupt Request RSI */
		unsigned int RDI            : 1;	/* Enable Interrupt Request RDI */
		unsigned int RBI            : 1;	/* Enable Interrupt Request RBI */
		unsigned int TDI            : 1;	/* Enable Interrupt Request TDI */
		unsigned int TBI            : 1;	/* Enable Interrupt Request TBI */
		unsigned int FRI            : 1;	/* Enable Interrupt Request FRI */
		unsigned int FDI            : 1;	/* Enable Interrupt Request FDI */
		unsigned int NNI            : 1;	/* Enable Interrupt Request NNI */
		unsigned int NVI            : 1;	/* Enable Interrupt Request NVI */
		unsigned int CRCI           : 1;	/* Enable Interrupt Request CRCI */
		unsigned int WSI            : 1;	/* Enable Interrupt Request WSI */
		unsigned int SDI            : 1;	/* Enable Interrupt Request SDI */
		unsigned int SCRI           : 1;	/* Enable Interrupt Request SCRI */
		unsigned int WDI            : 1;	/* Enable Interrupt Request WDI */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} SENT_INTEN0_type;
#define SENT_INTEN0	(*( SENT_INTEN0_type *) 0xf000312cu)	/* Interrupt Enable Register 0 */
#define SENT_INTEN1	(*( SENT_INTEN0_type *) 0xf000316cu)	/* Interrupt Enable Register 1 */
#define SENT_INTEN2	(*( SENT_INTEN0_type *) 0xf00031acu)	/* Interrupt Enable Register 2 */
#define SENT_INTEN3	(*( SENT_INTEN0_type *) 0xf00031ecu)	/* Interrupt Enable Register 3 */
#define SENT_INTEN4	(*( SENT_INTEN0_type *) 0xf000322cu)	/* Interrupt Enable Register 4 */
#define SENT_INTEN5	(*( SENT_INTEN0_type *) 0xf000326cu)	/* Interrupt Enable Register 5 */
#define SENT_INTEN6	(*( SENT_INTEN0_type *) 0xf00032acu)	/* Interrupt Enable Register 6 */
#define SENT_INTEN7	(*( SENT_INTEN0_type *) 0xf00032ecu)	/* Interrupt Enable Register 7 */
#define SENT_INTEN8	(*( SENT_INTEN0_type *) 0xf000332cu)	/* Interrupt Enable Register 8 */
#define SENT_INTEN9	(*( SENT_INTEN0_type *) 0xf000336cu)	/* Interrupt Enable Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int IPC0           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC1           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC2           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC3           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC4           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC5           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC6           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC7           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC8           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int IPC9           : 1;	/* Interrupt Pending on Channel y */
		/* const */ unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} SENT_INTOV_type;
#define SENT_INTOV	(*( SENT_INTOV_type *) 0xf0003014u)	/* Interrupt Overview Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 1;	/* Set Interrupt Request Flag RSI */
		unsigned int RDI            : 1;	/* Set Interrupt Request Flag RDI */
		unsigned int RBI            : 1;	/* Set Interrupt Request Flag RBI */
		unsigned int TDI            : 1;	/* Set Interrupt Request Flag TDI */
		unsigned int TBI            : 1;	/* Set Interrupt Request Flag TBI */
		unsigned int FRI            : 1;	/* Set Interrupt Request Flag FRI */
		unsigned int FDI            : 1;	/* Set Interrupt Request Flag FDI */
		unsigned int NNI            : 1;	/* Set Interrupt Request Flag NNI */
		unsigned int NVI            : 1;	/* Set Interrupt Request Flag NVI */
		unsigned int CRCI           : 1;	/* Set Interrupt Request Flag CRCI */
		unsigned int WSI            : 1;	/* Set Interrupt Request Flag WSI */
		unsigned int SDI            : 1;	/* Set Interrupt Request Flag SDI */
		unsigned int SCRI           : 1;	/* Set Interrupt Request Flag SCRI */
		unsigned int WDI            : 1;	/* Set Interrupt Request Flag WDI */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} SENT_INTSET0_type;
#define SENT_INTSET0	(*( SENT_INTSET0_type *) 0xf0003124u)	/* Interrupt Set Register 0 */
#define SENT_INTSET1	(*( SENT_INTSET0_type *) 0xf0003164u)	/* Interrupt Set Register 1 */
#define SENT_INTSET2	(*( SENT_INTSET0_type *) 0xf00031a4u)	/* Interrupt Set Register 2 */
#define SENT_INTSET3	(*( SENT_INTSET0_type *) 0xf00031e4u)	/* Interrupt Set Register 3 */
#define SENT_INTSET4	(*( SENT_INTSET0_type *) 0xf0003224u)	/* Interrupt Set Register 4 */
#define SENT_INTSET5	(*( SENT_INTSET0_type *) 0xf0003264u)	/* Interrupt Set Register 5 */
#define SENT_INTSET6	(*( SENT_INTSET0_type *) 0xf00032a4u)	/* Interrupt Set Register 6 */
#define SENT_INTSET7	(*( SENT_INTSET0_type *) 0xf00032e4u)	/* Interrupt Set Register 7 */
#define SENT_INTSET8	(*( SENT_INTSET0_type *) 0xf0003324u)	/* Interrupt Set Register 8 */
#define SENT_INTSET9	(*( SENT_INTSET0_type *) 0xf0003364u)	/* Interrupt Set Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RSI            : 1;	/* Receive Success Interrupt Request Flag */
		/* const */ unsigned int RDI            : 1;	/* Receive Data Interrupt Request Flag */
		/* const */ unsigned int RBI            : 1;	/* Receive Buffer Overflow Interrupt Request Flag */
		/* const */ unsigned int TDI            : 1;	/* Transfer Data Interrupt Request Flag */
		/* const */ unsigned int TBI            : 1;	/* Transmit Buffer Underflow Interrupt Request Flag */
		/* const */ unsigned int FRI            : 1;	/* Frequency Range Interrupt Request Flag */
		/* const */ unsigned int FDI            : 1;	/* Frequency Drift Interrupt Request Flag */
		/* const */ unsigned int NNI            : 1;	/* Number of Nibbles Wrong Request Flag */
		/* const */ unsigned int NVI            : 1;	/* Nibbles Value out of Range Request Flag */
		/* const */ unsigned int CRCI           : 1;	/* CRC Error Request Flag */
		/* const */ unsigned int WSI            : 1;	/* Wrong Status and Communication Nibble Error Request Flag */
		/* const */ unsigned int SDI            : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SCRI           : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int WDI            : 1;	/* Watch Dog Error Request Flag */
		/* const */ unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} SENT_INTSTAT0_type;
