svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define SENT_INTSTAT0	(*( SENT_INTSTAT0_type *) 0xf0003120u)	/* Interrupt Status Register 0 */
#define SENT_INTSTAT1	(*( SENT_INTSTAT0_type *) 0xf0003160u)	/* Interrupt Status Register 1 */
#define SENT_INTSTAT2	(*( SENT_INTSTAT0_type *) 0xf00031a0u)	/* Interrupt Status Register 2 */
#define SENT_INTSTAT3	(*( SENT_INTSTAT0_type *) 0xf00031e0u)	/* Interrupt Status Register 3 */
#define SENT_INTSTAT4	(*( SENT_INTSTAT0_type *) 0xf0003220u)	/* Interrupt Status Register 4 */
#define SENT_INTSTAT5	(*( SENT_INTSTAT0_type *) 0xf0003260u)	/* Interrupt Status Register 5 */
#define SENT_INTSTAT6	(*( SENT_INTSTAT0_type *) 0xf00032a0u)	/* Interrupt Status Register 6 */
#define SENT_INTSTAT7	(*( SENT_INTSTAT0_type *) 0xf00032e0u)	/* Interrupt Status Register 7 */
#define SENT_INTSTAT8	(*( SENT_INTSTAT0_type *) 0xf0003320u)	/* Interrupt Status Register 8 */
#define SENT_INTSTAT9	(*( SENT_INTSTAT0_type *) 0xf0003360u)	/* Interrupt Status Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int ALTI           : 2;	/* Alternate Input Select */
		unsigned int                : 2;
		unsigned int DEPTH          : 4;	/* Digital Glitch Filter Depth */
		unsigned int OIE            : 1;	/* Output Inverter Enable Channel x */
		unsigned int IIE            : 1;	/* Input Inverter Enable Channel x */
		unsigned int CEC            : 1;	/* Clear Edge Counter */
		unsigned int                : 1;
		/* const */ unsigned int REG            : 1;	/* Rising Edge Glitch Flag for Channel x */
		/* const */ unsigned int FEG            : 1;	/* Falling Edge Glitch Flag for Channel x */
		unsigned int CREG           : 1;	/* Clear Rising Edge Glitch Flag for Channel x */
		unsigned int CFEG           : 1;	/* Clear Falling Edge Glitch Flag for Channel x */
		unsigned int ETS            : 4;	/* External Trigger Select */
		/* const */ unsigned int EC             : 8;	/* Edge Counter */
		unsigned int CTR            : 1;	/* Clear Trigger Monitor Flag for Channel x */
		/* const */ unsigned int TRM            : 1;	/* Trigger Monitor Flag for Channel x */
		/* const */ unsigned int RXM            : 1;	/* Receive Monitor for Channel x */
		/* const */ unsigned int TXM            : 1;	/* Transmit Monitor for Channel x */
	} B;
	int I;
	unsigned int U;

} SENT_IOCR0_type;
#define SENT_IOCR0	(*( SENT_IOCR0_type *) 0xf0003114u)	/* Input and Output Control Register 0 */
#define SENT_IOCR1	(*( SENT_IOCR0_type *) 0xf0003154u)	/* Input and Output Control Register 1 */
#define SENT_IOCR2	(*( SENT_IOCR0_type *) 0xf0003194u)	/* Input and Output Control Register 2 */
#define SENT_IOCR3	(*( SENT_IOCR0_type *) 0xf00031d4u)	/* Input and Output Control Register 3 */
#define SENT_IOCR4	(*( SENT_IOCR0_type *) 0xf0003214u)	/* Input and Output Control Register 4 */
#define SENT_IOCR5	(*( SENT_IOCR0_type *) 0xf0003254u)	/* Input and Output Control Register 5 */
#define SENT_IOCR6	(*( SENT_IOCR0_type *) 0xf0003294u)	/* Input and Output Control Register 6 */
#define SENT_IOCR7	(*( SENT_IOCR0_type *) 0xf00032d4u)	/* Input and Output Control Register 7 */
#define SENT_IOCR8	(*( SENT_IOCR0_type *) 0xf0003314u)	/* Input and Output Control Register 8 */
#define SENT_IOCR9	(*( SENT_IOCR0_type *) 0xf0003354u)	/* Input and Output Control Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} SENT_KRST0_type;
#define SENT_KRST0	(*( SENT_KRST0_type *) 0xf00030f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} SENT_KRST1_type;
#define SENT_KRST1	(*( SENT_KRST1_type *) 0xf00030f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} SENT_KRSTCLR_type;
#define SENT_KRSTCLR	(*( SENT_KRSTCLR_type *) 0xf00030ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} SENT_OCS_type;
#define SENT_OCS	(*( SENT_OCS_type *) 0xf00030e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int CEN            : 1;	/* Channel Enable */
		unsigned int IEP            : 1;	/* Ignore End Pulse */
		unsigned int ACE            : 1;	/* Alternative CRC Mode Enable */
		unsigned int SNI            : 1;	/* Status Nibble Included in CRC */
		unsigned int SDP            : 1;	/* Serial Data Processing Mode */
		unsigned int SCDIS          : 1;	/* CRC for Serial Data Disabled Mode */
		unsigned int CDIS           : 1;	/* CRC Disabled Mode */
		unsigned int CFC            : 1;	/* Consecutive Frame Check */
		unsigned int FRL            : 8;	/* Frame Length */
		unsigned int CRZ            : 1;	/* CRC with Zero Nibble for Serial Data */
		unsigned int ESF            : 1;	/* Extended Serial Frame Mode */
		unsigned int IDE            : 1;	/* Ignore Drift Error Mode */
		unsigned int SUSEN          : 1;	/* Suspend Enable */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} SENT_RCR0_type;
#define SENT_RCR0	(*( SENT_RCR0_type *) 0xf0003108u)	/* Receiver Control Register 0 */
#define SENT_RCR1	(*( SENT_RCR0_type *) 0xf0003148u)	/* Receiver Control Register 1 */
#define SENT_RCR2	(*( SENT_RCR0_type *) 0xf0003188u)	/* Receiver Control Register 2 */
#define SENT_RCR3	(*( SENT_RCR0_type *) 0xf00031c8u)	/* Receiver Control Register 3 */
#define SENT_RCR4	(*( SENT_RCR0_type *) 0xf0003208u)	/* Receiver Control Register 4 */
#define SENT_RCR5	(*( SENT_RCR0_type *) 0xf0003248u)	/* Receiver Control Register 5 */
#define SENT_RCR6	(*( SENT_RCR0_type *) 0xf0003288u)	/* Receiver Control Register 6 */
#define SENT_RCR7	(*( SENT_RCR0_type *) 0xf00032c8u)	/* Receiver Control Register 7 */
#define SENT_RCR8	(*( SENT_RCR0_type *) 0xf0003308u)	/* Receiver Control Register 8 */
#define SENT_RCR9	(*( SENT_RCR0_type *) 0xf0003348u)	/* Receiver Control Register 9 */

