svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RD0            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD1            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD2            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD3            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD4            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD5            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD6            : 4;	/* Receive Data Nibble y */
		/* const */ unsigned int RD7            : 4;	/* Receive Data Nibble y */
	} B;
	int I;
	unsigned int U;

} SENT_RDR0_type;
#define SENT_RDR0	(*( SENT_RDR0_type *) 0xf0003080u)	/* Receive Data Register 0 */
#define SENT_RDR1	(*( SENT_RDR0_type *) 0xf0003084u)	/* Receive Data Register 1 */
#define SENT_RDR2	(*( SENT_RDR0_type *) 0xf0003088u)	/* Receive Data Register 2 */
#define SENT_RDR3	(*( SENT_RDR0_type *) 0xf000308cu)	/* Receive Data Register 3 */
#define SENT_RDR4	(*( SENT_RDR0_type *) 0xf0003090u)	/* Receive Data Register 4 */
#define SENT_RDR5	(*( SENT_RDR0_type *) 0xf0003094u)	/* Receive Data Register 5 */
#define SENT_RDR6	(*( SENT_RDR0_type *) 0xf0003098u)	/* Receive Data Register 6 */
#define SENT_RDR7	(*( SENT_RDR0_type *) 0xf000309cu)	/* Receive Data Register 7 */
#define SENT_RDR8	(*( SENT_RDR0_type *) 0xf00030a0u)	/* Receive Data Register 8 */
#define SENT_RDR9	(*( SENT_RDR0_type *) 0xf00030a4u)	/* Receive Data Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CRC            : 4;	/* CRC */
		/* const */ unsigned int CST            : 2;	/* Channel Status */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int SCN            : 4;	/* Status and Communication Nibble */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} SENT_RSR0_type;
#define SENT_RSR0	(*( SENT_RSR0_type *) 0xf000310cu)	/* Receive Status Register 0 */
#define SENT_RSR1	(*( SENT_RSR0_type *) 0xf000314cu)	/* Receive Status Register 1 */
#define SENT_RSR2	(*( SENT_RSR0_type *) 0xf000318cu)	/* Receive Status Register 2 */
#define SENT_RSR3	(*( SENT_RSR0_type *) 0xf00031ccu)	/* Receive Status Register 3 */
#define SENT_RSR4	(*( SENT_RSR0_type *) 0xf000320cu)	/* Receive Status Register 4 */
#define SENT_RSR5	(*( SENT_RSR0_type *) 0xf000324cu)	/* Receive Status Register 5 */
#define SENT_RSR6	(*( SENT_RSR0_type *) 0xf000328cu)	/* Receive Status Register 6 */
#define SENT_RSR7	(*( SENT_RSR0_type *) 0xf00032ccu)	/* Receive Status Register 7 */
#define SENT_RSR8	(*( SENT_RSR0_type *) 0xf000330cu)	/* Receive Status Register 8 */
#define SENT_RSR9	(*( SENT_RSR0_type *) 0xf000334cu)	/* Receive Status Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LTS            : 32;	/* Last Receive Time Stamp for Channel x */
	} B;
	int I;
	unsigned int U;

} SENT_RTS0_type;
#define SENT_RTS0	(*( SENT_RTS0_type *) 0xf0003a80u)	/* Receive Time Stamp Register 0 */
#define SENT_RTS1	(*( SENT_RTS0_type *) 0xf0003a84u)	/* Receive Time Stamp Register 1 */
#define SENT_RTS2	(*( SENT_RTS0_type *) 0xf0003a88u)	/* Receive Time Stamp Register 2 */
#define SENT_RTS3	(*( SENT_RTS0_type *) 0xf0003a8cu)	/* Receive Time Stamp Register 3 */
#define SENT_RTS4	(*( SENT_RTS0_type *) 0xf0003a90u)	/* Receive Time Stamp Register 4 */
#define SENT_RTS5	(*( SENT_RTS0_type *) 0xf0003a94u)	/* Receive Time Stamp Register 5 */
#define SENT_RTS6	(*( SENT_RTS0_type *) 0xf0003a98u)	/* Receive Time Stamp Register 6 */
#define SENT_RTS7	(*( SENT_RTS0_type *) 0xf0003a9cu)	/* Receive Time Stamp Register 7 */
#define SENT_RTS8	(*( SENT_RTS0_type *) 0xf0003aa0u)	/* Receive Time Stamp Register 8 */
#define SENT_RTS9	(*( SENT_RTS0_type *) 0xf0003aa4u)	/* Receive Time Stamp Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int PLEN           : 6;	/* Pulse Length */
		unsigned int TRIG           : 2;	/* Trigger Source and Mode Selection */
		unsigned int DEL            : 6;	/* Delay Length */
		unsigned int BASE           : 1;	/* Time Base */
		/* const */ unsigned int TRQ            : 1;	/* Transfer Request in Progress */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SENT_SCR0_type;
#define SENT_SCR0	(*( SENT_SCR0_type *) 0xf0003118u)	/* SPC Control Register 0 */
#define SENT_SCR1	(*( SENT_SCR0_type *) 0xf0003158u)	/* SPC Control Register 1 */
#define SENT_SCR2	(*( SENT_SCR0_type *) 0xf0003198u)	/* SPC Control Register 2 */
#define SENT_SCR3	(*( SENT_SCR0_type *) 0xf00031d8u)	/* SPC Control Register 3 */
#define SENT_SCR4	(*( SENT_SCR0_type *) 0xf0003218u)	/* SPC Control Register 4 */
#define SENT_SCR5	(*( SENT_SCR0_type *) 0xf0003258u)	/* SPC Control Register 5 */
#define SENT_SCR6	(*( SENT_SCR0_type *) 0xf0003298u)	/* SPC Control Register 6 */
#define SENT_SCR7	(*( SENT_SCR0_type *) 0xf00032d8u)	/* SPC Control Register 7 */
#define SENT_SCR8	(*( SENT_SCR0_type *) 0xf0003318u)	/* SPC Control Register 8 */
#define SENT_SCR9	(*( SENT_SCR0_type *) 0xf0003358u)	/* SPC Control Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SD             : 16;	/* Serial Data */
		/* const */ unsigned int MID            : 8;	/* Message ID */
		/* const */ unsigned int SCRC           : 6;	/* SCRC */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int CON            : 1;	/* Configuration bit */
	} B;
	int I;
	unsigned int U;

} SENT_SDS0_type;
#define SENT_SDS0	(*( SENT_SDS0_type *) 0xf0003110u)	/* Serial Data and Status Register 0 */
#define SENT_SDS1	(*( SENT_SDS0_type *) 0xf0003150u)	/* Serial Data and Status Register 1 */
#define SENT_SDS2	(*( SENT_SDS0_type *) 0xf0003190u)	/* Serial Data and Status Register 2 */
#define SENT_SDS3	(*( SENT_SDS0_type *) 0xf00031d0u)	/* Serial Data and Status Register 3 */
#define SENT_SDS4	(*( SENT_SDS0_type *) 0xf0003210u)	/* Serial Data and Status Register 4 */
#define SENT_SDS5	(*( SENT_SDS0_type *) 0xf0003250u)	/* Serial Data and Status Register 5 */
#define SENT_SDS6	(*( SENT_SDS0_type *) 0xf0003290u)	/* Serial Data and Status Register 6 */
#define SENT_SDS7	(*( SENT_SDS0_type *) 0xf00032d0u)	/* Serial Data and Status Register 7 */
#define SENT_SDS8	(*( SENT_SDS0_type *) 0xf0003310u)	/* Serial Data and Status Register 8 */
#define SENT_SDS9	(*( SENT_SDS0_type *) 0xf0003350u)	/* Serial Data and Status Register 9 */

