svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TDIV           : 20;	/* Divider Factor of Pre Divider for TSR */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} SENT_TPD_type;
#define SENT_TPD	(*( SENT_TPD_type *) 0xf000301cu)	/* Time Stamp Predivider Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CTS            : 32;	/* Current Time Stamp for the Module */
	} B;
	int I;
	unsigned int U;

} SENT_TSR_type;
#define SENT_TSR	(*( SENT_TSR_type *) 0xf0003018u)	/* Time Stamp Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RDNP0          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP1          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP2          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP3          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP4          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP5          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP6          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
		unsigned int RDNP7          : 3;	/* Receive Data Target Nibble Pointer y */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} SENT_VIEW0_type;
#define SENT_VIEW0	(*( SENT_VIEW0_type *) 0xf000311cu)	/* Receive Data View Register 0 */
#define SENT_VIEW1	(*( SENT_VIEW0_type *) 0xf000315cu)	/* Receive Data View Register 1 */
#define SENT_VIEW2	(*( SENT_VIEW0_type *) 0xf000319cu)	/* Receive Data View Register 2 */
#define SENT_VIEW3	(*( SENT_VIEW0_type *) 0xf00031dcu)	/* Receive Data View Register 3 */
#define SENT_VIEW4	(*( SENT_VIEW0_type *) 0xf000321cu)	/* Receive Data View Register 4 */
#define SENT_VIEW5	(*( SENT_VIEW0_type *) 0xf000325cu)	/* Receive Data View Register 5 */
#define SENT_VIEW6	(*( SENT_VIEW0_type *) 0xf000329cu)	/* Receive Data View Register 6 */
#define SENT_VIEW7	(*( SENT_VIEW0_type *) 0xf00032dcu)	/* Receive Data View Register 7 */
#define SENT_VIEW8	(*( SENT_VIEW0_type *) 0xf000331cu)	/* Receive Data View Register 8 */
#define SENT_VIEW9	(*( SENT_VIEW0_type *) 0xf000335cu)	/* Receive Data View Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int WDLx           : 16;	/* Watch Dog Timer Limit */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} SENT_WDT0_type;
#define SENT_WDT0	(*( SENT_WDT0_type *) 0xf0003134u)	/* Watch Dog Timer Register 0 */
#define SENT_WDT1	(*( SENT_WDT0_type *) 0xf0003174u)	/* Watch Dog Timer Register 1 */
#define SENT_WDT2	(*( SENT_WDT0_type *) 0xf00031b4u)	/* Watch Dog Timer Register 2 */
#define SENT_WDT3	(*( SENT_WDT0_type *) 0xf00031f4u)	/* Watch Dog Timer Register 3 */
#define SENT_WDT4	(*( SENT_WDT0_type *) 0xf0003234u)	/* Watch Dog Timer Register 4 */
#define SENT_WDT5	(*( SENT_WDT0_type *) 0xf0003274u)	/* Watch Dog Timer Register 5 */
#define SENT_WDT6	(*( SENT_WDT0_type *) 0xf00032b4u)	/* Watch Dog Timer Register 6 */
#define SENT_WDT7	(*( SENT_WDT0_type *) 0xf00032f4u)	/* Watch Dog Timer Register 7 */
#define SENT_WDT8	(*( SENT_WDT0_type *) 0xf0003334u)	/* Watch Dog Timer Register 8 */
#define SENT_WDT9	(*( SENT_WDT0_type *) 0xf0003374u)	/* Watch Dog Timer Register 9 */


/* ERAY */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} ERAY_ACCEN0_type;
#define ERAY_ACCEN0	(*( ERAY_ACCEN0_type *) 0xf001c8fcu)	/* Access Enable Register 0 */

