svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} ERAY_ACCEN1_type;
#define ERAY_ACCEN1	(*( ERAY_ACCEN1_type *) 0xf001c8f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int VFRA           : 1;	/* Valid Frame Received on Channel A (vSS!ValidFrameA) */
		unsigned int SEDA           : 1;	/* Syntax Error Detected on Channel A (vSS!SyntaxErrorA) */
		unsigned int CEDA           : 1;	/* Content Error Detected on Channel A (vSS!ContentErrorA) */
		unsigned int CIA            : 1;	/* Communication Indicator Channel A */
		unsigned int SBVA           : 1;	/* Slot Boundary Violation on Channel A (vSS!BViolationA) */
		unsigned int                : 3;
		unsigned int VFRB           : 1;	/* Valid Frame Received on Channel B (vSS!ValidFrameB) */
		unsigned int SEDB           : 1;	/* Syntax Error Detected on Channel B (vSS!SyntaxErrorB) */
		unsigned int CEDB           : 1;	/* Content Error Detected on Channel B (vSS!ContentErrorB) */
		unsigned int CIB            : 1;	/* Communication Indicator Channel B */
		unsigned int SBVB           : 1;	/* Slot Boundary Violation on Channel B (vSS!BViolationB) */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} ERAY_ACS_type;
#define ERAY_ACS	(*( ERAY_ACS_type *) 0xf001c128u)	/* Aggregated Channel Status */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CCFC           : 4;	/* Clock Correction Failed Counter (vClockCorrectionFailed) */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int ERRM           : 2;	/* Error Mode (vPOC!ErrorMode) */
		/* const */ unsigned int PTAC           : 5;	/* Passive to Active Count (vAllowPassiveToActive) */
		/* const */ unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} ERAY_CCEV_type;
#define ERAY_CCEV	(*( ERAY_CCEV_type *) 0xf001c104u)	/* Communication Controller Error Vector */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int POCS           : 6;	/* Protocol Operation Control Status */
		/* const */ unsigned int FSI            : 1;	/* Freeze Status Indicator (vPOC!Freeze) */
		/* const */ unsigned int HRQ            : 1;	/* Halt Request (vPOC!CHIHaltRequest) */
		/* const */ unsigned int SLM            : 2;	/* Slot Mode (vPOC!SlotMode) */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int CSNI           : 1;	/* Coldstart Noise Indicator (vPOC!ColdstartNoise) */
		/* const */ unsigned int CSAI           : 1;	/* Coldstart Abort Indicator */
		/* const */ unsigned int CSI            : 1;	/* Cold Start Inhibit (vColdStartInhibit) */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int WSV            : 3;	/* Wakeup Status (vPOC!WakeupStatus) */
		/* const */ unsigned int RCA            : 5;	/* Remaining Coldstart Attempts (vRemainingColdstartAttempts) */
		/* const */ unsigned int PSL            : 6;	/* POC Status Log */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_CCSV_type;
#define ERAY_CCSV	(*( ERAY_CCSV_type *) 0xf001c100u)	/* Communication Controller Status Vector */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 4;
		unsigned int RMC            : 8;	/* 8-bit Clock Divider Value in RUN Mode */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} ERAY_CLC_type;
#define ERAY_CLC	(*( ERAY_CLC_type *) 0xf001c000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DAY            : 8;	/* Design Time Stamp, Day */
		/* const */ unsigned int MON            : 8;	/* Design Time Stamp, Month */
		/* const */ unsigned int YEAR           : 4;	/* Design Time Stamp, Year */
		/* const */ unsigned int SUBSTEP        : 4;	/* Sub-Step of Core Release */
		/* const */ unsigned int STEP           : 4;	/* Step of Core Release */
		/* const */ unsigned int REL            : 4;	/* Core Release */
	} B;
	int I;
	unsigned int U;

} ERAY_CREL_type;
#define ERAY_CREL	(*( ERAY_CREL_type *) 0xf001c3f0u)	/* Core Release Register */

typedef volatile union
{
	struct
	{ 
		unsigned int INT0           : 1;	/* CIF Timeout Service Request Status */
		unsigned int OEN            : 1;	/* Enable auto delay scheme for Output Buffer Control Register (OBCR) */
		unsigned int IEN            : 1;	/* Enable auto delay scheme for Input Buffer Control Register (IBCR) */
		/* const */ unsigned int IBFS           : 1;	/* Input Buffer Status Register */
		unsigned int IBF1PAG        : 1;	/* Input Buffer 1 Page Select Register */
		unsigned int                : 2;
		unsigned int IBF2PAG        : 1;	/* Input Buffer 2 Page Select Register */
		unsigned int                : 2;
		unsigned int RISA           : 2;	/* Receive Input Select Channel A */
		unsigned int RISB           : 2;	/* Receive Input Select Channel B */
		unsigned int STPWTS         : 2;	/* Stop Watch Trigger Input Select */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} ERAY_CUST1_type;
#define ERAY_CUST1	(*( ERAY_CUST1_type *) 0xf001c004u)	/* Busy and Input Buffer Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TO             : 32;	/* CIF Timeout Reload Value */
	} B;
	int I;
	unsigned int U;

} ERAY_CUST3_type;
#define ERAY_CUST3	(*( ERAY_CUST3_type *) 0xf001c00cu)	/* Customer Interface Timeout Counter */

typedef volatile union
{
	struct
	{ 
		unsigned int PEMCE          : 1;	/* POC Error Mode Changed Service Request Enable */
		unsigned int CNAE           : 1;	/* Command Not Accepted Service Request Enable */
		unsigned int SFBME          : 1;	/* SYNC Frames Below Minimum Service Request Enable */
		unsigned int SFOE           : 1;	/* SYNC Frame Overflow Service Request Enable */
		unsigned int CCFE           : 1;	/* Clock Correction Failure Service Request Enable */
		unsigned int CCLE           : 1;	/* CHI Command Locked Service Request Enable */
		unsigned int EERRE          : 1;	/* ECC Error Service Request Enable */
		unsigned int RFOE           : 1;	/* Receive FIFO Overrun Service Request Enable */
		unsigned int EFAE           : 1;	/* Empty FIFO Access Service Request Enable */
		unsigned int IIBAE          : 1;	/* Illegal Input Buffer Access Service Request Enable */
		unsigned int IOBAE          : 1;	/* Illegal Output Buffer Access Service Request Enable */
		unsigned int MHFE           : 1;	/* Message Handler Constraints Flag Service Request Enable */
		unsigned int                : 4;
		unsigned int EDAE           : 1;	/* Error Detected on Channel A Service Request Enable */
		unsigned int LTVAE          : 1;	/* Latest Transmit Violation Channel A Service Request Enable */
		unsigned int TABAE          : 1;	/* Transmission Across Boundary Channel A Service Request Enable */
		unsigned int                : 5;
		unsigned int EDBE           : 1;	/* Error Detected on Channel B Service Request Enable */
		unsigned int LTVBE          : 1;	/* Latest Transmit Violation Channel B Service Request Enable */
		unsigned int TABBE          : 1;	/* Transmission Across Boundary Channel B Service Request Enable */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

