svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ERAY_EIER_type;
#define ERAY_EIER	(*( ERAY_EIER_type *) 0xf001c034u)	/* Error Service Request Enable Reset */

typedef volatile union
{
	struct
	{ 
		unsigned int PEMCE          : 1;	/* POC Error Mode Changed Service Request Enable */
		unsigned int CNAE           : 1;	/* Command Not Accepted Service Request Enable */
		unsigned int SFBME          : 1;	/* SYNC Frames Below Minimum Service Request Enable */
		unsigned int SFOE           : 1;	/* SYNC Frame Overflow Service Request Enable */
		unsigned int CCFE           : 1;	/* Clock Correction Failure Service Request Enable */
		unsigned int CCLE           : 1;	/* CHI Command Locked Service Request Enable */
		unsigned int EERRE          : 1;	/* ECC Error Service Request Enable */
		unsigned int RFOE           : 1;	/* Receive FIFO Overrun Service Request Enable */
		unsigned int EFAE           : 1;	/* Empty FIFO Access Service Request Enable */
		unsigned int IIBAE          : 1;	/* Illegal Input Buffer Access Service Request Enable */
		unsigned int IOBAE          : 1;	/* Illegal Output Buffer Access Service Request Enable */
		unsigned int MHFE           : 1;	/* Message Handler Constraints Flag Service Request Enable */
		unsigned int                : 4;
		unsigned int EDAE           : 1;	/* Error Detected on Channel A Service Request Enable */
		unsigned int LTVAE          : 1;	/* Latest Transmit Violation Channel A Service Request Enable */
		unsigned int TABAE          : 1;	/* Transmission Across Boundary Channel A Service Request Enable */
		unsigned int                : 5;
		unsigned int EDBE           : 1;	/* Error Detected on Channel B Service Request Enable */
		unsigned int LTVBE          : 1;	/* Latest Transmit Violation Channel B Service Request Enable */
		unsigned int TABBE          : 1;	/* Transmission Across Boundary Channel B Service Request Enable */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_EIES_type;
#define ERAY_EIES	(*( ERAY_EIES_type *) 0xf001c030u)	/* Error Service Request Enable Set */

typedef volatile union
{
	struct
	{ 
		unsigned int PEMCL          : 1;	/* POC Error Mode Changed Service Request Line */
		unsigned int CNAL           : 1;	/* Command Not Accepted Service Request Line */
		unsigned int SFBML          : 1;	/* SYNC Frames Below Minimum Service Request Line */
		unsigned int SFOL           : 1;	/* SYNC Frame Overflow Service Request Line */
		unsigned int CCFL           : 1;	/* Clock Correction Failure Service Request Line */
		unsigned int CCLL           : 1;	/* CHI Command Locked Service Request Line */
		unsigned int EERRL          : 1;	/* ECC Error Service Request Line */
		unsigned int RFOL           : 1;	/* Receive FIFO Overrun Service Request Line */
		unsigned int EFAL           : 1;	/* Empty FIFO Access Service Request Line */
		unsigned int IIBAL          : 1;	/* Illegal Input Buffer Access Service Request Line */
		unsigned int IOBAL          : 1;	/* Illegal Output Buffer Access Service Request Line */
		unsigned int MHFL           : 1;	/* Message Handler Constrains Flag Service Request Line */
		unsigned int                : 4;
		unsigned int EDAL           : 1;	/* Error Detected on Channel A Service Request Line */
		unsigned int LTVAL          : 1;	/* Latest Transmit Violation Channel A Service Request Line */
		unsigned int TABAL          : 1;	/* Transmission Across Boundary Channel A Service Request Line */
		unsigned int                : 5;
		unsigned int EDBL           : 1;	/* Error Detected on Channel B Service Request Line */
		unsigned int LTVBL          : 1;	/* Latest Transmit Violation Channel B Service Request Line */
		unsigned int TABBL          : 1;	/* Transmission Across Boundary Channel A Service Request Line */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_EILS_type;
#define ERAY_EILS	(*( ERAY_EILS_type *) 0xf001c028u)	/* Error Service Request Line Select */

typedef volatile union
{
	struct
	{ 
		unsigned int PEMC           : 1;	/* POC Error Mode Changed */
		unsigned int CNA            : 1;	/* Command Not Accepted */
		unsigned int SFBM           : 1;	/* SYNC Frames Below Minimum */
		unsigned int SFO            : 1;	/* SYNC Frame Overflow */
		unsigned int CCF            : 1;	/* Clock Correction Failure */
		unsigned int CCL            : 1;	/* CHI Command Locked */
		/* const */ unsigned int EERR           : 1;	/* ECC Error */
		/* const */ unsigned int RFO            : 1;	/* Receive FIFO Overrun */
		unsigned int EFA            : 1;	/* Empty FIFO Access */
		unsigned int IIBA           : 1;	/* Illegal Input Buffer Access */
		unsigned int IOBA           : 1;	/* Illegal Output Buffer Access */
		unsigned int MHF            : 1;	/* Message Handler Constraints Flag */
		unsigned int                : 4;
		unsigned int EDA            : 1;	/* Error Detected on Channel A */
		unsigned int LTVA           : 1;	/* Latest Transmit Violation Channel A */
		unsigned int TABA           : 1;	/* Transmission Across Boundary Channel A */
		unsigned int                : 5;
		unsigned int EDB            : 1;	/* Error Detected on Channel B */
		unsigned int LTVB           : 1;	/* Latest Transmit Violation Channel B */
		unsigned int TABB           : 1;	/* Transmission Across Boundary Channel B */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_EIR_type;
#define ERAY_EIR	(*( ERAY_EIR_type *) 0xf001c020u)	/* Error Service Request Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ETV            : 32;	/* Endianness Test Value */
	} B;
	int I;
	unsigned int U;

} ERAY_ENDN_type;
#define ERAY_ENDN	(*( ERAY_ENDN_type *) 0xf001c3f4u)	/* Endian Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EID            : 10;	/* Even Sync ID (vsSyncIDListA,B even) */
		/* const */ unsigned int                : 4;
		/* const */ unsigned int RXEA           : 1;	/* Received/Configured Even Sync ID on Channel A */
		/* const */ unsigned int RXEB           : 1;	/* Received/Configured Even Sync ID on Channel B */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} ERAY_ESID01_type;
#define ERAY_ESID01	(*( ERAY_ESID01_type *) 0xf001c130u)	/* Even Sync ID Symbol Window 01 */
#define ERAY_ESID02	(*( ERAY_ESID01_type *) 0xf001c134u)	/* Even Sync ID Symbol Window 02 */
#define ERAY_ESID03	(*( ERAY_ESID01_type *) 0xf001c138u)	/* Even Sync ID Symbol Window 03 */
#define ERAY_ESID04	(*( ERAY_ESID01_type *) 0xf001c13cu)	/* Even Sync ID Symbol Window 04 */
#define ERAY_ESID05	(*( ERAY_ESID01_type *) 0xf001c140u)	/* Even Sync ID Symbol Window 05 */
#define ERAY_ESID06	(*( ERAY_ESID01_type *) 0xf001c144u)	/* Even Sync ID Symbol Window 06 */
#define ERAY_ESID07	(*( ERAY_ESID01_type *) 0xf001c148u)	/* Even Sync ID Symbol Window 07 */
#define ERAY_ESID08	(*( ERAY_ESID01_type *) 0xf001c14cu)	/* Even Sync ID Symbol Window 08 */
#define ERAY_ESID09	(*( ERAY_ESID01_type *) 0xf001c150u)	/* Even Sync ID Symbol Window 09 */
#define ERAY_ESID10	(*( ERAY_ESID01_type *) 0xf001c154u)	/* Even Sync ID Symbol Window 10 */
#define ERAY_ESID11	(*( ERAY_ESID01_type *) 0xf001c158u)	/* Even Sync ID Symbol Window 11 */
#define ERAY_ESID12	(*( ERAY_ESID01_type *) 0xf001c15cu)	/* Even Sync ID Symbol Window 12 */
#define ERAY_ESID13	(*( ERAY_ESID01_type *) 0xf001c160u)	/* Even Sync ID Symbol Window 13 */
#define ERAY_ESID14	(*( ERAY_ESID01_type *) 0xf001c164u)	/* Even Sync ID Symbol Window 14 */
#define ERAY_ESID15	(*( ERAY_ESID01_type *) 0xf001c168u)	/* Even Sync ID Symbol Window 15 */

