svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CL             : 8;	/* Critical Level */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} ERAY_FCL_type;
#define ERAY_FCL	(*( ERAY_FCL_type *) 0xf001c30cu)	/* FIFO Critical Level */

typedef volatile union
{
	struct
	{ 
		unsigned int CH             : 2;	/* Channel Filter */
		unsigned int FID            : 11;	/* Frame ID Filter */
		unsigned int                : 3;
		unsigned int CYF            : 7;	/* Cycle Counter Filter */
		unsigned int RSS            : 1;	/* Reject in Static Segment */
		unsigned int RNF            : 1;	/* Reject NULL Frames */
		unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} ERAY_FRF_type;
#define ERAY_FRF	(*( ERAY_FRF_type *) 0xf001c304u)	/* FIFO Rejection Filter */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 2;
		unsigned int MFID           : 11;	/* Mask Frame ID Filter */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} ERAY_FRFM_type;
#define ERAY_FRFM	(*( ERAY_FRFM_type *) 0xf001c308u)	/* FIFO Rejection Filter Mask */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RFNE           : 1;	/* Receive FIFO Not Empty */
		/* const */ unsigned int RFCL           : 1;	/* Receive FIFO Critical Level */
		/* const */ unsigned int RFO            : 1;	/* Receive FIFO Overrun */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int RFFL           : 8;	/* Receive FIFO Fill Level */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} ERAY_FSR_type;
#define ERAY_FSR	(*( ERAY_FSR_type *) 0xf001c318u)	/* FIFO Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int UT             : 20;	/* Microtick per Cycle (pMicroPerCycle)This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC01_type;
#define ERAY_GTUC01	(*( ERAY_GTUC01_type *) 0xf001c0a0u)	/* GTU Configuration Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int MPC            : 14;	/* Macrotick Per Cycle (gMacroPerCycle)This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! */
		unsigned int                : 2;
		unsigned int SNM            : 4;	/* Sync Node Max (gSyncNodeMax) */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC02_type;
#define ERAY_GTUC02	(*( ERAY_GTUC02_type *) 0xf001c0a4u)	/* GTU Configuration Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int UIOA           : 8;	/* Microtick Initial Offset Channel AThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (pMicroInitialOffset[A]) */
		unsigned int UIOB           : 8;	/* Microtick Initial Offset Channel B (pMicroInitialOffset[B]) */
		unsigned int MIOA           : 7;	/* Macrotick Initial Offset Channel A (gMacroInitialOffset[A]) */
		unsigned int                : 1;
		unsigned int MIOB           : 7;	/* Macrotick Initial Offset Channel B (gMacroInitialOffset[B]) */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC03_type;
#define ERAY_GTUC03	(*( ERAY_GTUC03_type *) 0xf001c0a8u)	/* GTU Configuration Register 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int NIT            : 14;	/* Network Idle Time Start This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (gMacroPerCycle - gdNIT - 1) */
		unsigned int                : 2;
		unsigned int OCS            : 14;	/* Offset Correction Start (gOffsetCorrectionStart - 1) */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC04_type;
#define ERAY_GTUC04	(*( ERAY_GTUC04_type *) 0xf001c0acu)	/* GTU Configuration Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int DCA            : 8;	/* Delay Compensation Channel AThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (pDelayCompensation[A]) */
		unsigned int DCB            : 8;	/* Delay Compensation Channel B (pDelayCompensation[B]) */
		unsigned int CDD            : 5;	/* Cluster Drift Damping (pClusterDriftDamping) */
		unsigned int                : 3;
		unsigned int DEC            : 8;	/* Decoding Correction (pDecodingCorrection) */
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC05_type;
#define ERAY_GTUC05	(*( ERAY_GTUC05_type *) 0xf001c0b0u)	/* GTU Configuration Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int ASR            : 11;	/* Accepted Startup RangeThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (pdAcceptedStartupRange) */
		unsigned int                : 5;
		unsigned int MOD            : 11;	/* Maximum Oscillator Drift (pdMaxDrift) */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC06_type;
#define ERAY_GTUC06	(*( ERAY_GTUC06_type *) 0xf001c0b4u)	/* GTU Configuration Register 6 */

typedef volatile union
{
	struct
	{ 
		unsigned int SSL            : 10;	/* Static Slot Length (gdStaticSlot)This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! */
		unsigned int                : 6;
		unsigned int NSS            : 10;	/* Number of Static Slots (gNumberOfStaticSlots) */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC07_type;
#define ERAY_GTUC07	(*( ERAY_GTUC07_type *) 0xf001c0b8u)	/* GTU Configuration Register 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int MSL            : 6;	/* Minislot Length (gdMinislot)This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! */
		unsigned int                : 10;
		unsigned int NMS            : 13;	/* Number of Minislots (gNumberOfMinislots) */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC08_type;
#define ERAY_GTUC08	(*( ERAY_GTUC08_type *) 0xf001c0bcu)	/* GTU Configuration Register 8 */

