svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int APO            : 6;	/* Action Point Offset (gdActionPointOffset)This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! */
		unsigned int                : 2;
		unsigned int MAPO           : 5;	/* Minislot Action Point Offset (gd Minislot Action Point Offset) */
		unsigned int                : 3;
		unsigned int DSI            : 2;	/* Dynamic Slot Idle Phase (gdDynamicSlotIdlePhase) */
		unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC09_type;
#define ERAY_GTUC09	(*( ERAY_GTUC09_type *) 0xf001c0c0u)	/* GTU Configuration Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int MOC            : 14;	/* Maximum Offset CorrectionThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (pOffsetCorrectionOut) */
		unsigned int                : 2;
		unsigned int MRC            : 11;	/* Maximum Rate Correction (pRateCorrectionOut) */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC10_type;
#define ERAY_GTUC10	(*( ERAY_GTUC10_type *) 0xf001c0c4u)	/* GTU Configuration Register 10 */

typedef volatile union
{
	struct
	{ 
		unsigned int EOCC           : 2;	/* External Offset Correction Control (pExternOffsetControl) */
		unsigned int                : 6;
		unsigned int ERCC           : 2;	/* External Rate Correction Control (pExternRateControl) */
		unsigned int                : 6;
		unsigned int EOC            : 3;	/* External Offset CorrectionThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (pExternOffsetCorrection) */
		unsigned int                : 5;
		unsigned int ERC            : 3;	/* External Rate Correction (pExternRateCorrection) */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_GTUC11_type;
#define ERAY_GTUC11	(*( ERAY_GTUC11_type *) 0xf001c0c8u)	/* GTU Configuration Register 11 */

typedef volatile union
{
	struct
	{ 
		unsigned int LHSH           : 1;	/* Load Header Section Host */
		unsigned int LDSH           : 1;	/* Load Data Section Host */
		unsigned int STXRH          : 1;	/* Set Transmission Request Host */
		unsigned int                : 13;
		/* const */ unsigned int LHSS           : 1;	/* Load Header Section Shadow */
		/* const */ unsigned int LDSS           : 1;	/* Load Data Section Shadow */
		/* const */ unsigned int STXRS          : 1;	/* Transmission Request Shadow */
		unsigned int                : 13;
	} B;
	int I;
	unsigned int U;

} ERAY_IBCM_type;
#define ERAY_IBCM	(*( ERAY_IBCM_type *) 0xf001c510u)	/* Input Buffer Command Mask */

typedef volatile union
{
	struct
	{ 
		unsigned int IBRH           : 7;	/* Input Buffer Request Host */
		unsigned int                : 8;
		/* const */ unsigned int IBSYH          : 1;	/* Input Buffer Busy Host */
		/* const */ unsigned int IBRS           : 7;	/* Input Buffer Request Shadow */
		unsigned int                : 8;
		/* const */ unsigned int IBSYS          : 1;	/* Input Buffer Busy Shadow */
	} B;
	int I;
	unsigned int U;

} ERAY_IBCR_type;
#define ERAY_IBCR	(*( ERAY_IBCR_type *) 0xf001c514u)	/* Input Buffer Command Request */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} ERAY_ID_type;
#define ERAY_ID	(*( ERAY_ID_type *) 0xf001c008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EINT0          : 1;	/* Enable Service Request Line 0 (INT0SRC) */
		unsigned int EINT1          : 1;	/* Enable Service Request Line 1 (INT1SRC) */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} ERAY_ILE_type;
#define ERAY_ILE	(*( ERAY_ILE_type *) 0xf001c040u)	/* Service Request Line Enable */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} ERAY_KRST0_type;
#define ERAY_KRST0	(*( ERAY_KRST0_type *) 0xf001c8f4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} ERAY_KRST1_type;
#define ERAY_KRST1	(*( ERAY_KRST1_type *) 0xf001c8f0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} ERAY_KRSTCLR_type;
#define ERAY_KRSTCLR	(*( ERAY_KRSTCLR_type *) 0xf001c8ecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLK            : 8;	/* Configuration Lock Key */
		unsigned int TMK            : 8;	/* Test Mode Key */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} ERAY_LCK_type;
#define ERAY_LCK	(*( ERAY_LCK_type *) 0xf001c01cu)	/* Lock Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LDTA           : 11;	/* Last Dynamic Transmission Channel A */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int LDTB           : 11;	/* Last Dynamic Transmission Channel B */
		/* const */ unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_LDTS_type;
#define ERAY_LDTS	(*( ERAY_LDTS_type *) 0xf001c314u)	/* Last Dynamic Transmit Slot */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int VFRA           : 1;	/* Valid Frame Received on Channel A (vSS!ValidFrameA) */
		/* const */ unsigned int VFRB           : 1;	/* Valid Frame Received on Channel B (vSS!ValidFrameB) */
		/* const */ unsigned int SEOA           : 1;	/* Syntax Error Observed on Channel A (vSS!SyntaxErrorA) */
		/* const */ unsigned int SEOB           : 1;	/* Syntax Error Observed on Channel B (vSS!SyntaxErrorB) */
		/* const */ unsigned int CEOA           : 1;	/* Content Error Observed on Channel A (vSS!ContentErrorA) */
		/* const */ unsigned int CEOB           : 1;	/* Content Error Observed on Channel B (vSS!ContentErrorB) */
		/* const */ unsigned int SVOA           : 1;	/* Slot Boundary Violation Observed on Channel A (vSS!BViolationA) */
		/* const */ unsigned int SVOB           : 1;	/* Slot Boundary Violation Observed on Channel B (vSS!BViolationB) */
		/* const */ unsigned int TCIA           : 1;	/* Transmission Conflict Indication Channel A (vSS!TxConflictA) */
		/* const */ unsigned int TCIB           : 1;	/* Transmission Conflict Indication Channel B (vSS!TxConflictB) */
		/* const */ unsigned int ESA            : 1;	/* Empty Slot Channel A */
		/* const */ unsigned int ESB            : 1;	/* Empty Slot Channel B */
		/* const */ unsigned int MLST           : 1;	/* Message Lost */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int FTA            : 1;	/* Frame Transmitted on Channel A */
		/* const */ unsigned int FTB            : 1;	/* Frame Transmitted on Channel B */
		/* const */ unsigned int CCS            : 6;	/* Cycle Count Status */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int RCIS           : 1;	/* Received on Channel Indicator Status (vSS!Channel) */
		/* const */ unsigned int SFIS           : 1;	/* Startup Frame Indicator Status (vRF!Header!SuFIndicator) */
		/* const */ unsigned int SYNS           : 1;	/* SYNC Frame Indicator Status (vRF!Header!SyFIndicator) */
		/* const */ unsigned int NFIS           : 1;	/* NULL Frame Indicator Status (vRF!Header!NFIndicator) */
		/* const */ unsigned int PPIS           : 1;	/* Payload Preamble Indictor Status (vRF!Header!PPIndicator) */
		/* const */ unsigned int RESS           : 1;	/* Reserved Bit Status (vRF!Header!Reserved) */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_MBS_type;
