svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define ERAY_MBS	(*( ERAY_MBS_type *) 0xf001c70cu)	/* Message Buffer Status */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MBC0           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC1           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC2           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC3           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC4           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC5           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC6           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC7           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC8           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC9           : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC10          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC11          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC12          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC13          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC14          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC15          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC16          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC17          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC18          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC19          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC20          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC21          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC22          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC23          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC24          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC25          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC26          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC27          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC28          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC29          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC30          : 1;	/* Message Buffer Status Changed n (n=0-31) */
		/* const */ unsigned int MBC31          : 1;	/* Message Buffer Status Changed n (n=0-31) */
	} B;
	int I;
	unsigned int U;

} ERAY_MBSC1_type;
#define ERAY_MBSC1	(*( ERAY_MBSC1_type *) 0xf001c340u)	/* Message Buffer Status Changed 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MBC32          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC33          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC34          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC35          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC36          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC37          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC38          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC39          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC40          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC41          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC42          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC43          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC44          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC45          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC46          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC47          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC48          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC49          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC50          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC51          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC52          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC53          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC54          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC55          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC56          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC57          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC58          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC59          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC60          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC61          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC62          : 1;	/* Message Buffer Status Changed n (n=32-63) */
		/* const */ unsigned int MBC63          : 1;	/* Message Buffer Status Changed n (n=32-63) */
	} B;
	int I;
	unsigned int U;

} ERAY_MBSC2_type;
#define ERAY_MBSC2	(*( ERAY_MBSC2_type *) 0xf001c344u)	/* Message Buffer Status Changed 2 */

