svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MBC64          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC65          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC66          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC67          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC68          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC69          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC70          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC71          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC72          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC73          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC74          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC75          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC76          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC77          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC78          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC79          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC80          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC81          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC82          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC83          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC84          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC85          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC86          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC87          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC88          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC89          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC90          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC91          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC92          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC93          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC94          : 1;	/* Message Buffer Status Changed n (n=64-95) */
		/* const */ unsigned int MBC95          : 1;	/* Message Buffer Status Changed n (n=64-95) */
	} B;
	int I;
	unsigned int U;

} ERAY_MBSC3_type;
#define ERAY_MBSC3	(*( ERAY_MBSC3_type *) 0xf001c348u)	/* Message Buffer Status Changed 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MBC96          : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC97          : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC98          : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC99          : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC100         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC101         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC102         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC103         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC104         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC105         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC106         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC107         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC108         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC109         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC110         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC111         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC112         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC113         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC114         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC115         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC116         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC117         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC118         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC119         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC120         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC121         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC122         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC123         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC124         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC125         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC126         : 1;	/* Message Buffer Status Changed n (n=96-127) */
		/* const */ unsigned int MBC127         : 1;	/* Message Buffer Status Changed n (n=96-127) */
	} B;
	int I;
	unsigned int U;

