svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ERAY_MBSC4_type;
#define ERAY_MBSC4	(*( ERAY_MBSC4_type *) 0xf001c34cu)	/* Message Buffer Status Changed 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int SFDL           : 7;	/* Static Frame Data Length (gPayloadLengthStatic)This bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! */
		unsigned int                : 9;
		unsigned int SLT            : 13;	/* Start of Latest Transmit (pLatestTx) */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} ERAY_MHDC_type;
#define ERAY_MHDC	(*( ERAY_MHDC_type *) 0xf001c098u)	/* MHD Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SNUA           : 1;	/* Status Not Updated Channel A */
		unsigned int SNUB           : 1;	/* Status Not Updated Channel B */
		unsigned int FNFA           : 1;	/* Find Sequence Not Finished Channel A */
		unsigned int FNFB           : 1;	/* Find Sequence Not Finished Channel B */
		unsigned int TBFA           : 1;	/* Transient Buffer Access Failure A */
		unsigned int TBFB           : 1;	/* Transient Buffer Access Failure B */
		unsigned int TNSA           : 1;	/* Transmission Not Started Channel A */
		unsigned int TNSB           : 1;	/* Transmission Not Started Channel B */
		unsigned int WAHP           : 1;	/* Write Attempt to Header Partition */
		unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} ERAY_MHDF_type;
#define ERAY_MHDF	(*( ERAY_MHDF_type *) 0xf001c31cu)	/* Message Handler Constraints Flags */

typedef volatile union
{
	struct
	{ 
		unsigned int EIBF           : 1;	/* ECC Error Input Buffer RAM 1,2 */
		unsigned int EOBF           : 1;	/* ECC Error Output Buffer RAM 1,2 */
		unsigned int EMR            : 1;	/* ECC Error Message RAM */
		unsigned int ETBF1          : 1;	/* ECC Error Transient Buffer RAM A */
		unsigned int ETBF2          : 1;	/* ECC Error Transient Buffer RAM B */
		unsigned int FMBD           : 1;	/* Faulty Message Buffer Detected */
		unsigned int MFMB           : 1;	/* Multiple Faulty Message Buffers detected */
		/* const */ unsigned int CRAM           : 1;	/* Clear all internal RAM?s */
		/* const */ unsigned int FMB            : 7;	/* Faulty Message Buffer */
		unsigned int                : 1;
		/* const */ unsigned int MBT            : 7;	/* Message Buffer Transmitted */
		unsigned int                : 1;
		/* const */ unsigned int MBU            : 7;	/* Message Buffer Updated */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} ERAY_MHDS_type;
#define ERAY_MHDS	(*( ERAY_MHDS_type *) 0xf001c310u)	/* Message Handler Status */

typedef volatile union
{
	struct
	{ 
		unsigned int FDB            : 8;	/* First Dynamic Buffer */
		unsigned int FFB            : 8;	/* First Buffer of FIFO */
		unsigned int LCB            : 8;	/* Last Configured Buffer */
		unsigned int SEC            : 2;	/* Secure Buffers */
		unsigned int SPLM           : 1;	/* SYNC Frame Payload Multiplex */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_MRC_type;
#define ERAY_MRC	(*( ERAY_MRC_type *) 0xf001c300u)	/* Message RAM Configuration */

typedef volatile union
{
	struct
	{ 
		unsigned int MSIP0          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP1          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP2          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP3          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP4          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP5          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP6          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP7          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP8          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP9          : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP10         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP11         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP12         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP13         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP14         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP15         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP16         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP17         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP18         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP19         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP20         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP21         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP22         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP23         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP24         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP25         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP26         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP27         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP28         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP29         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP30         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
		unsigned int MSIP31         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=0-31) */
	} B;
	int I;
	unsigned int U;

} ERAY_MSIC1_type;
#define ERAY_MSIC1	(*( ERAY_MSIC1_type *) 0xf001c3b8u)	/* Message Buffer Status Changed Interrupt Control 1 */

