svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MSIP32         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP33         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP34         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP35         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP36         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP37         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP38         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP39         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP40         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP41         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP42         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP43         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP44         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP45         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP46         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP47         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP48         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP49         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP50         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP51         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP52         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP53         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP54         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP55         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP56         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP57         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP58         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP59         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP60         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP61         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP62         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
		/* const */ unsigned int MSIP63         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=32-63) */
	} B;
	int I;
	unsigned int U;

} ERAY_MSIC2_type;
#define ERAY_MSIC2	(*( ERAY_MSIC2_type *) 0xf001c3bcu)	/* Message Buffer Status Changed Interrupt Control 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int MSIP64         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP65         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP66         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP67         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP68         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP69         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP70         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP71         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP72         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP73         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP74         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP75         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP76         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP77         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP78         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP79         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP80         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP81         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP82         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP83         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP84         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP85         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP86         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP87         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP88         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP89         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP90         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP91         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP92         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP93         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP94         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
		unsigned int MSIP95         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=64-95) */
	} B;
	int I;
	unsigned int U;

} ERAY_MSIC3_type;
