svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define ERAY_MSIC3	(*( ERAY_MSIC3_type *) 0xf001c3c0u)	/* Message Buffer Status Changed Interrupt Control 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int MSIP96         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP97         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP98         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP99         : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP100        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP101        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP102        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP103        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP104        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP105        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP106        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP107        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP108        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP109        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP110        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP111        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP112        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP113        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP114        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP115        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP116        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP117        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP118        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP119        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP120        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP121        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP122        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP123        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP124        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP125        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP126        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
		unsigned int MSIP127        : 1;	/* Message Buffer Status Changed Interrupt Pointern (n=96-127) */
	} B;
	int I;
	unsigned int U;

} ERAY_MSIC4_type;
#define ERAY_MSIC4	(*( ERAY_MSIC4_type *) 0xf001c3c4u)	/* Message Buffer Status Changed Interrupt Control 4 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MTV            : 14;	/* Macrotick Value (vMacrotick) */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int CCV            : 6;	/* Cycle Counter Value (vCycleCounter) */
		/* const */ unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} ERAY_MTCCV_type;
#define ERAY_MTCCV	(*( ERAY_MTCCV_type *) 0xf001c114u)	/* Macrotick and Cycle Counter Value */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ND0            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND1            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND2            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND3            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND4            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND5            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND6            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND7            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND8            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND9            : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND10           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND11           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND12           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND13           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND14           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND15           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND16           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND17           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND18           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND19           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND20           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND21           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND22           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND23           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND24           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND25           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND26           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND27           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND28           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND29           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND30           : 1;	/* New Data n (n=0-31) */
		/* const */ unsigned int ND31           : 1;	/* New Data n (n=0-31) */
	} B;
	int I;
	unsigned int U;

