svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ERAY_NDAT1_type;
#define ERAY_NDAT1	(*( ERAY_NDAT1_type *) 0xf001c330u)	/* New Data Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ND32           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND33           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND34           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND35           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND36           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND37           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND38           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND39           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND40           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND41           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND42           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND43           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND44           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND45           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND46           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND47           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND48           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND49           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND50           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND51           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND52           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND53           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND54           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND55           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND56           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND57           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND58           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND59           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND60           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND61           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND62           : 1;	/* New Data n (n=32-63) */
		/* const */ unsigned int ND63           : 1;	/* New Data n (n=32-63) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDAT2_type;
#define ERAY_NDAT2	(*( ERAY_NDAT2_type *) 0xf001c334u)	/* New Data Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ND64           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND65           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND66           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND67           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND68           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND69           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND70           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND71           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND72           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND73           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND74           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND75           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND76           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND77           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND78           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND79           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND80           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND81           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND82           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND83           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND84           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND85           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND86           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND87           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND88           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND89           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND90           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND91           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND92           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND93           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND94           : 1;	/* New Data n (n=64-95) */
		/* const */ unsigned int ND95           : 1;	/* New Data n (n=64-95) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDAT3_type;
#define ERAY_NDAT3	(*( ERAY_NDAT3_type *) 0xf001c338u)	/* New Data Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ND96           : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND97           : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND98           : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND99           : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND100          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND101          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND102          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND103          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND104          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND105          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND106          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND107          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND108          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND109          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND110          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND111          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND112          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND113          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND114          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND115          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND116          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND117          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND118          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND119          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND120          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND121          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND122          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND123          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND124          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND125          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND126          : 1;	/* New Data n (n=96-127) */
		/* const */ unsigned int ND127          : 1;	/* New Data n (n=96-127) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDAT4_type;
