svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define ERAY_NDAT4	(*( ERAY_NDAT4_type *) 0xf001c33cu)	/* New Data Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int NDIP0          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP1          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP2          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP3          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP4          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP5          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP6          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP7          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP8          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP9          : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP10         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP11         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP12         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP13         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP14         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP15         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP16         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP17         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP18         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP19         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP20         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP21         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP22         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP23         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP24         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP25         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP26         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP27         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP28         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP29         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP30         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
		unsigned int NDIP31         : 1;	/* New Data Interrupt Pointer n (n=0-31) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDIC1_type;
#define ERAY_NDIC1	(*( ERAY_NDIC1_type *) 0xf001c3a8u)	/* New Data Interrupt Control 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int NDIP32         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP33         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP34         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP35         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP36         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP37         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP38         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP39         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP40         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP41         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP42         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP43         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP44         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP45         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP46         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP47         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP48         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP49         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP50         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP51         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP52         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP53         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP54         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP55         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP56         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP57         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP58         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP59         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP60         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP61         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP62         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
		unsigned int NDIP63         : 1;	/* New Data Interrupt Pointer n (n=32-63) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDIC2_type;
#define ERAY_NDIC2	(*( ERAY_NDIC2_type *) 0xf001c3acu)	/* New Data Interrupt Control 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int NDIP64         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP65         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP66         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP67         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP68         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP69         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP70         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP71         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP72         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP73         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP74         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP75         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP76         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP77         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP78         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP79         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP80         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP81         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP82         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP83         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP84         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP85         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP86         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP87         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP88         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP89         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP90         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP91         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP92         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP93         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP94         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
		unsigned int NDIP95         : 1;	/* New Data Interrupt Pointer n (n=64-95) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDIC3_type;
#define ERAY_NDIC3	(*( ERAY_NDIC3_type *) 0xf001c3b0u)	/* New Data Interrupt Control 3 */

