svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int NDIP96         : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP97         : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP98         : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP99         : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP100        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP101        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP102        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP103        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP104        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP105        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP106        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP107        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP108        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP109        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP110        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP111        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP112        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP113        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP114        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP115        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP116        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP117        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP118        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP119        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP120        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP121        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP122        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP123        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP124        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP125        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP126        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
		unsigned int NDIP127        : 1;	/* New Data Interrupt Pointer n (n=96-127) */
	} B;
	int I;
	unsigned int U;

} ERAY_NDIC4_type;
#define ERAY_NDIC4	(*( ERAY_NDIC4_type *) 0xf001c3b4u)	/* New Data Interrupt Control 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int NML            : 4;	/* Network Management Vector LengthThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (gNetworkManagementVectorLength) */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} ERAY_NEMC_type;
#define ERAY_NEMC	(*( ERAY_NEMC_type *) 0xf001c08cu)	/* NEM Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NM             : 32;	/* Network Management Vector */
	} B;
	int I;
	unsigned int U;

} ERAY_NMV1_type;
#define ERAY_NMV1	(*( ERAY_NMV1_type *) 0xf001c1b0u)	/* Network Management Vector 1 */
#define ERAY_NMV2	(*( ERAY_NMV1_type *) 0xf001c1b4u)	/* Network Management Vector 2 */
#define ERAY_NMV3	(*( ERAY_NMV1_type *) 0xf001c1b8u)	/* Network Management Vector 3 */

typedef volatile union
{
	struct
	{ 
		unsigned int RHSS           : 1;	/* Read Header Section Shadow */
		unsigned int RDSS           : 1;	/* Read Data Section Shadow */
		unsigned int                : 14;
		/* const */ unsigned int RHSH           : 1;	/* Read Header Section Host */
		/* const */ unsigned int RDSH           : 1;	/* Read Data Section Host */
		unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} ERAY_OBCM_type;
#define ERAY_OBCM	(*( ERAY_OBCM_type *) 0xf001c710u)	/* Output Buffer Command Mask */

typedef volatile union
{
	struct
	{ 
		unsigned int OBRS           : 7;	/* Output Buffer Request Shadow */
		unsigned int                : 1;
		unsigned int VIEW           : 1;	/* View Shadow Buffer */
		unsigned int REQ            : 1;	/* Request Message RAM Transfer */
		unsigned int                : 5;
		/* const */ unsigned int OBSYS          : 1;	/* Output Buffer Busy Shadow */
		/* const */ unsigned int OBRH           : 7;	/* Output Buffer Request Host */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} ERAY_OBCR_type;
#define ERAY_OBCR	(*( ERAY_OBCR_type *) 0xf001c714u)	/* Output Buffer Command Request */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_OCS_type;
#define ERAY_OCS	(*( ERAY_OCS_type *) 0xf001c8e8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OCV            : 19;	/* Offset Correction Value (vOffsetCorrection) */
		/* const */ unsigned int                : 13;
	} B;
	int I;
	unsigned int U;

} ERAY_OCV_type;
#define ERAY_OCV	(*( ERAY_OCV_type *) 0xf001c11cu)	/* Offset Correction Value */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OID            : 10;	/* Odd Sync ID (vsSyncIDListA,B odd) */
		/* const */ unsigned int                : 4;
		/* const */ unsigned int RXOA           : 1;	/* Received Odd Sync ID on Channel A */
		/* const */ unsigned int RXOB           : 1;	/* Received Odd Sync ID on Channel B */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} ERAY_OSID01_type;
#define ERAY_OSID01	(*( ERAY_OSID01_type *) 0xf001c170u)	/* Odd Sync ID Symbol Window 01 */
#define ERAY_OSID02	(*( ERAY_OSID01_type *) 0xf001c174u)	/* Odd Sync ID Symbol Window 02 */
#define ERAY_OSID03	(*( ERAY_OSID01_type *) 0xf001c178u)	/* Odd Sync ID Symbol Window 03 */
#define ERAY_OSID04	(*( ERAY_OSID01_type *) 0xf001c17cu)	/* Odd Sync ID Symbol Window 04 */
#define ERAY_OSID05	(*( ERAY_OSID01_type *) 0xf001c180u)	/* Odd Sync ID Symbol Window 05 */
#define ERAY_OSID06	(*( ERAY_OSID01_type *) 0xf001c184u)	/* Odd Sync ID Symbol Window 06 */
#define ERAY_OSID07	(*( ERAY_OSID01_type *) 0xf001c188u)	/* Odd Sync ID Symbol Window 07 */
#define ERAY_OSID08	(*( ERAY_OSID01_type *) 0xf001c18cu)	/* Odd Sync ID Symbol Window 08 */
#define ERAY_OSID09	(*( ERAY_OSID01_type *) 0xf001c190u)	/* Odd Sync ID Symbol Window 09 */
#define ERAY_OSID10	(*( ERAY_OSID01_type *) 0xf001c194u)	/* Odd Sync ID Symbol Window 10 */
#define ERAY_OSID11	(*( ERAY_OSID01_type *) 0xf001c198u)	/* Odd Sync ID Symbol Window 11 */
#define ERAY_OSID12	(*( ERAY_OSID01_type *) 0xf001c19cu)	/* Odd Sync ID Symbol Window 12 */
#define ERAY_OSID13	(*( ERAY_OSID01_type *) 0xf001c1a0u)	/* Odd Sync ID Symbol Window 13 */
#define ERAY_OSID14	(*( ERAY_OSID01_type *) 0xf001c1a4u)	/* Odd Sync ID Symbol Window 14 */
#define ERAY_OSID15	(*( ERAY_OSID01_type *) 0xf001c1a8u)	/* Odd Sync ID Symbol Window 15 */

