svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int OTGB0          : 2;	/* Trigger Set for OTGB0 */
		unsigned int                : 6;
		unsigned int OTGB1          : 2;	/* Trigger Set for OTGB1 */
		unsigned int                : 6;
		unsigned int OTGB2          : 1;	/* Trigger Set for OTGB2 */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} ERAY_OTSS_type;
#define ERAY_OTSS	(*( ERAY_OTSS_type *) 0xf001c870u)	/* OCDS Trigger Set Select */

typedef volatile union
{
	struct
	{ 
		unsigned int TSST           : 4;	/* Transmission Start Sequence TransmitterThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (gdTSSTransmitter) */
		unsigned int CASM           : 7;	/* Collision Avoidance Symbol Maximum(gdCASRxLowMax) */
		unsigned int                : 1;
		unsigned int SPP            : 2;	/* Strobe Point Position */
		unsigned int BRP            : 2;	/* Baud Rate Prescaler(gdSampleClockPeriod, pSamplePerMicrotick) */
		unsigned int RXW            : 9;	/* Wakeup Symbol Receive Window Length (gdWakeupSymbolRxWindow) */
		unsigned int                : 1;
		unsigned int RWP            : 6;	/* Repetitions of Tx Wakeup Pattern (pWakeupPattern) */
	} B;
	int I;
	unsigned int U;

} ERAY_PRTC1_type;
#define ERAY_PRTC1	(*( ERAY_PRTC1_type *) 0xf001c090u)	/* PRT Configuration Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int RXI            : 6;	/* Wakeup Symbol Receive IdleThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (gdWakeupSymbolRxIdle) */
		unsigned int                : 2;
		unsigned int RXL            : 6;	/* Wakeup Symbol Receive Low(gdWakeupSymbolRxLow) */
		unsigned int                : 2;
		unsigned int TXI            : 8;	/* Wakeup Symbol Transmit Idle (gdWakeupSymbolTxIdle) */
		unsigned int TXL            : 6;	/* Wakeup Symbol Transmit Low (gdWakeupSymbolTxLow) */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_PRTC2_type;
#define ERAY_PRTC2	(*( ERAY_PRTC2_type *) 0xf001c094u)	/* PRT Configuration Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RCV            : 12;	/* Rate Correction Value (vRateCorrection) */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} ERAY_RCV_type;
#define ERAY_RCV	(*( ERAY_RCV_type *) 0xf001c118u)	/* Rate Correction Value */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MDRB0          : 8;	/* 32-Bit Word nn, Byte 0 */
		/* const */ unsigned int MDRB1          : 8;	/* 32-Bit Word nn, Byte 1 */
		/* const */ unsigned int MDRB2          : 8;	/* 32-Bit Word nn, Byte 2 */
		/* const */ unsigned int MDRB3          : 8;	/* 32-Bit Word nn, Byte 3 */
	} B;
	int I;
	unsigned int U;

} ERAY_RDDS01_type;
#define ERAY_RDDS01	(*( ERAY_RDDS01_type *) 0xf001c600u)	/* Read Data Section 01 */
#define ERAY_RDDS02	(*( ERAY_RDDS01_type *) 0xf001c604u)	/* Read Data Section 02 */
#define ERAY_RDDS03	(*( ERAY_RDDS01_type *) 0xf001c608u)	/* Read Data Section 03 */
#define ERAY_RDDS04	(*( ERAY_RDDS01_type *) 0xf001c60cu)	/* Read Data Section 04 */
#define ERAY_RDDS05	(*( ERAY_RDDS01_type *) 0xf001c610u)	/* Read Data Section 05 */
#define ERAY_RDDS06	(*( ERAY_RDDS01_type *) 0xf001c614u)	/* Read Data Section 06 */
#define ERAY_RDDS07	(*( ERAY_RDDS01_type *) 0xf001c618u)	/* Read Data Section 07 */
#define ERAY_RDDS08	(*( ERAY_RDDS01_type *) 0xf001c61cu)	/* Read Data Section 08 */
#define ERAY_RDDS09	(*( ERAY_RDDS01_type *) 0xf001c620u)	/* Read Data Section 09 */
#define ERAY_RDDS10	(*( ERAY_RDDS01_type *) 0xf001c624u)	/* Read Data Section 10 */
#define ERAY_RDDS11	(*( ERAY_RDDS01_type *) 0xf001c628u)	/* Read Data Section 11 */
#define ERAY_RDDS12	(*( ERAY_RDDS01_type *) 0xf001c62cu)	/* Read Data Section 12 */
#define ERAY_RDDS13	(*( ERAY_RDDS01_type *) 0xf001c630u)	/* Read Data Section 13 */
#define ERAY_RDDS14	(*( ERAY_RDDS01_type *) 0xf001c634u)	/* Read Data Section 14 */
#define ERAY_RDDS15	(*( ERAY_RDDS01_type *) 0xf001c638u)	/* Read Data Section 15 */
#define ERAY_RDDS16	(*( ERAY_RDDS01_type *) 0xf001c63cu)	/* Read Data Section 16 */
#define ERAY_RDDS17	(*( ERAY_RDDS01_type *) 0xf001c640u)	/* Read Data Section 17 */
#define ERAY_RDDS18	(*( ERAY_RDDS01_type *) 0xf001c644u)	/* Read Data Section 18 */
#define ERAY_RDDS19	(*( ERAY_RDDS01_type *) 0xf001c648u)	/* Read Data Section 19 */
#define ERAY_RDDS20	(*( ERAY_RDDS01_type *) 0xf001c64cu)	/* Read Data Section 20 */
#define ERAY_RDDS21	(*( ERAY_RDDS01_type *) 0xf001c650u)	/* Read Data Section 21 */
#define ERAY_RDDS22	(*( ERAY_RDDS01_type *) 0xf001c654u)	/* Read Data Section 22 */
#define ERAY_RDDS23	(*( ERAY_RDDS01_type *) 0xf001c658u)	/* Read Data Section 23 */
#define ERAY_RDDS24	(*( ERAY_RDDS01_type *) 0xf001c65cu)	/* Read Data Section 24 */
#define ERAY_RDDS25	(*( ERAY_RDDS01_type *) 0xf001c660u)	/* Read Data Section 25 */
#define ERAY_RDDS26	(*( ERAY_RDDS01_type *) 0xf001c664u)	/* Read Data Section 26 */
#define ERAY_RDDS27	(*( ERAY_RDDS01_type *) 0xf001c668u)	/* Read Data Section 27 */
#define ERAY_RDDS28	(*( ERAY_RDDS01_type *) 0xf001c66cu)	/* Read Data Section 28 */
#define ERAY_RDDS29	(*( ERAY_RDDS01_type *) 0xf001c670u)	/* Read Data Section 29 */
#define ERAY_RDDS30	(*( ERAY_RDDS01_type *) 0xf001c674u)	/* Read Data Section 30 */
#define ERAY_RDDS31	(*( ERAY_RDDS01_type *) 0xf001c678u)	/* Read Data Section 31 */
#define ERAY_RDDS32	(*( ERAY_RDDS01_type *) 0xf001c67cu)	/* Read Data Section 32 */
#define ERAY_RDDS33	(*( ERAY_RDDS01_type *) 0xf001c680u)	/* Read Data Section 33 */
#define ERAY_RDDS34	(*( ERAY_RDDS01_type *) 0xf001c684u)	/* Read Data Section 34 */
#define ERAY_RDDS35	(*( ERAY_RDDS01_type *) 0xf001c688u)	/* Read Data Section 35 */
#define ERAY_RDDS36	(*( ERAY_RDDS01_type *) 0xf001c68cu)	/* Read Data Section 36 */
#define ERAY_RDDS37	(*( ERAY_RDDS01_type *) 0xf001c690u)	/* Read Data Section 37 */
#define ERAY_RDDS38	(*( ERAY_RDDS01_type *) 0xf001c694u)	/* Read Data Section 38 */
#define ERAY_RDDS39	(*( ERAY_RDDS01_type *) 0xf001c698u)	/* Read Data Section 39 */
#define ERAY_RDDS40	(*( ERAY_RDDS01_type *) 0xf001c69cu)	/* Read Data Section 40 */
#define ERAY_RDDS41	(*( ERAY_RDDS01_type *) 0xf001c6a0u)	/* Read Data Section 41 */
#define ERAY_RDDS42	(*( ERAY_RDDS01_type *) 0xf001c6a4u)	/* Read Data Section 42 */
#define ERAY_RDDS43	(*( ERAY_RDDS01_type *) 0xf001c6a8u)	/* Read Data Section 43 */
#define ERAY_RDDS44	(*( ERAY_RDDS01_type *) 0xf001c6acu)	/* Read Data Section 44 */
#define ERAY_RDDS45	(*( ERAY_RDDS01_type *) 0xf001c6b0u)	/* Read Data Section 45 */
#define ERAY_RDDS46	(*( ERAY_RDDS01_type *) 0xf001c6b4u)	/* Read Data Section 46 */
#define ERAY_RDDS47	(*( ERAY_RDDS01_type *) 0xf001c6b8u)	/* Read Data Section 47 */
#define ERAY_RDDS48	(*( ERAY_RDDS01_type *) 0xf001c6bcu)	/* Read Data Section 48 */
#define ERAY_RDDS49	(*( ERAY_RDDS01_type *) 0xf001c6c0u)	/* Read Data Section 49 */
#define ERAY_RDDS50	(*( ERAY_RDDS01_type *) 0xf001c6c4u)	/* Read Data Section 50 */
#define ERAY_RDDS51	(*( ERAY_RDDS01_type *) 0xf001c6c8u)	/* Read Data Section 51 */
#define ERAY_RDDS52	(*( ERAY_RDDS01_type *) 0xf001c6ccu)	/* Read Data Section 52 */
#define ERAY_RDDS53	(*( ERAY_RDDS01_type *) 0xf001c6d0u)	/* Read Data Section 53 */
#define ERAY_RDDS54	(*( ERAY_RDDS01_type *) 0xf001c6d4u)	/* Read Data Section 54 */
#define ERAY_RDDS55	(*( ERAY_RDDS01_type *) 0xf001c6d8u)	/* Read Data Section 55 */
#define ERAY_RDDS56	(*( ERAY_RDDS01_type *) 0xf001c6dcu)	/* Read Data Section 56 */
#define ERAY_RDDS57	(*( ERAY_RDDS01_type *) 0xf001c6e0u)	/* Read Data Section 57 */
#define ERAY_RDDS58	(*( ERAY_RDDS01_type *) 0xf001c6e4u)	/* Read Data Section 58 */
#define ERAY_RDDS59	(*( ERAY_RDDS01_type *) 0xf001c6e8u)	/* Read Data Section 59 */
#define ERAY_RDDS60	(*( ERAY_RDDS01_type *) 0xf001c6ecu)	/* Read Data Section 60 */
#define ERAY_RDDS61	(*( ERAY_RDDS01_type *) 0xf001c6f0u)	/* Read Data Section 61 */
#define ERAY_RDDS62	(*( ERAY_RDDS01_type *) 0xf001c6f4u)	/* Read Data Section 62 */
#define ERAY_RDDS63	(*( ERAY_RDDS01_type *) 0xf001c6f8u)	/* Read Data Section 63 */
#define ERAY_RDDS64	(*( ERAY_RDDS01_type *) 0xf001c6fcu)	/* Read Data Section 64 */

