svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FID            : 11;	/* Frame ID */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int CYC            : 7;	/* Cycle Code */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int CHA            : 1;	/* Channel Filter Control A */
		/* const */ unsigned int CHB            : 1;	/* Channel Filter Control B */
		/* const */ unsigned int CFG            : 1;	/* Message Buffer Direction Configuration Bit */
		/* const */ unsigned int PPIT           : 1;	/* Payload Preamble Indicator Transmit */
		/* const */ unsigned int TXM            : 1;	/* Transmission Mode */
		/* const */ unsigned int MBI            : 1;	/* Message Buffer Service Request */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_RDHS1_type;
#define ERAY_RDHS1	(*( ERAY_RDHS1_type *) 0xf001c700u)	/* Read Header Section 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CRC            : 11;	/* Header CRC (vRF!Header!HeaderCRC) */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int PLC            : 7;	/* Payload Length Configured */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int PLR            : 7;	/* Payload Length Received (vRF!Header!Length) */
		/* const */ unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} ERAY_RDHS2_type;
#define ERAY_RDHS2	(*( ERAY_RDHS2_type *) 0xf001c704u)	/* Read Header Section 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DP             : 11;	/* Data Pointer */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int RCC            : 6;	/* Receive Cycle Count (vRF!Header!CycleCount) */
		/* const */ unsigned int                : 2;
		/* const */ unsigned int RCI            : 1;	/* Received on Channel Indicator (vSS!Channel) */
		/* const */ unsigned int SFI            : 1;	/* Startup Frame Indicator (vRF!Header!SuFIndicator) */
		/* const */ unsigned int SYN            : 1;	/* SYNC Frame Indicator (vRF!Header!SyFIndicator) */
		/* const */ unsigned int NFI            : 1;	/* NULL Frame Indicator (vRF!Header!NFIndicator) */
		/* const */ unsigned int PPI            : 1;	/* Payload Preamble Indicator (vRF!Header!PPIndicator) */
		/* const */ unsigned int RES            : 1;	/* Reserved Bit (vRF!Header!Reserved) */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_RDHS3_type;
#define ERAY_RDHS3	(*( ERAY_RDHS3_type *) 0xf001c708u)	/* Read Header Section 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SCCA           : 11;	/* Slot Counter Channel A (vSlotCounter[A]) */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int SCCB           : 11;	/* Slot Counter Channel B (vSlotCounter[B]) */
		/* const */ unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_SCV_type;
#define ERAY_SCV	(*( ERAY_SCV_type *) 0xf001c110u)	/* Slot Counter Value */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int VSAE           : 4;	/* Valid SYNC Frames Channel A, even communication cycle */
		/* const */ unsigned int VSAO           : 4;	/* Valid SYNC Frames Channel A, odd communication cycle */
		/* const */ unsigned int VSBE           : 4;	/* Valid SYNC Frames Channel B, even communication cycle */
		/* const */ unsigned int VSBO           : 4;	/* Valid SYNC Frames Channel B, odd communication cycle */
		/* const */ unsigned int MOCS           : 1;	/* Missing Offset Correction Signal */
		/* const */ unsigned int OCLR           : 1;	/* Offset Correction Limit Reached */
		/* const */ unsigned int MRCS           : 1;	/* Missing Rate Correction Signal */
		/* const */ unsigned int RCLR           : 1;	/* Rate Correction Limit Reached */
		/* const */ unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} ERAY_SFS_type;
#define ERAY_SFS	(*( ERAY_SFS_type *) 0xf001c120u)	/* SYNC Frame Status */

typedef volatile union
{
	struct
	{ 
		unsigned int WSTE           : 1;	/* Wakeup Status Service Request Enable */
		unsigned int CASE           : 1;	/* Collision Avoidance Symbol Service Request Enable */
		unsigned int CYCSE          : 1;	/* Cycle Start Service Request Enable */
		unsigned int TXIE           : 1;	/* Transmit Service Request Enable */
		unsigned int RXIE           : 1;	/* Receive Service Request Enable */
		unsigned int RFNEE          : 1;	/* Receive FIFO Not Empty Service Request Enable */
		unsigned int RFCLE          : 1;	/* Receive FIFO Critical Level Service Request Enable */
		unsigned int NMVCE          : 1;	/* Network Management Vector Changed Service Request Enable */
		unsigned int TI0E           : 1;	/* Timer Service Request 0 Enable */
		unsigned int TI1E           : 1;	/* Timer Service Request 1 Enable */
		unsigned int TIBCE          : 1;	/* Transfer Input Buffer Completed Service Request Enable */
		unsigned int TOBCE          : 1;	/* Transfer Output Buffer Completed Service Request Enable */
		unsigned int SWEE           : 1;	/* Stop Watch Event Service Request Enable */
		unsigned int SUCSE          : 1;	/* Startup Completed Successfully Service Request Enable */
		unsigned int MBSIE          : 1;	/* Message Buffer Status Service Request Enable */
		unsigned int SDSE           : 1;	/* Start of Dynamic Segment Service Request Enable */
		unsigned int WUPAE          : 1;	/* Wakeup Pattern Channel A Service Request Enable */
		unsigned int MTSAE          : 1;	/* Media Access Test Symbol Channel A Service Request Enable */
		unsigned int                : 6;
		unsigned int WUPBE          : 1;	/* Wakeup Pattern Channel B Service Request Enable */
		unsigned int MTSBE          : 1;	/* Media Access Test Symbol Channel B Service Request Enable */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} ERAY_SIER_type;
#define ERAY_SIER	(*( ERAY_SIER_type *) 0xf001c03cu)	/* Status Service Request Enable Reset */

