svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int WSTE           : 1;	/* Wakeup Status Service Request Enable */
		unsigned int CASE           : 1;	/* Collision Avoidance Symbol Service Request Enable */
		unsigned int CYCSE          : 1;	/* Cycle Start Service Request Enable */
		unsigned int TXIE           : 1;	/* Transmit Service Request Enable */
		unsigned int RXIE           : 1;	/* Receive Service Request Enable */
		unsigned int RFNEE          : 1;	/* Receive FIFO Not Empty Service Request Enable */
		unsigned int RFCLE          : 1;	/* Receive FIFO Critical Level Service Request Enable */
		unsigned int NMVCE          : 1;	/* Network Management Vector Changed Service Request Enable */
		unsigned int TI0E           : 1;	/* Timer Service Request 0 Enable */
		unsigned int TI1E           : 1;	/* Timer Service Request 1 Enable */
		unsigned int TIBCE          : 1;	/* Transfer Input Buffer Completed Service Request Enable */
		unsigned int TOBCE          : 1;	/* Transfer Output Buffer Completed Service Request Enable */
		unsigned int SWEE           : 1;	/* Stop Watch Event Service Request Enable */
		unsigned int SUCSE          : 1;	/* Startup Completed Successfully Service Request Enable */
		unsigned int MBSIE          : 1;	/* Message Buffer Status Service Request Enable */
		unsigned int SDSE           : 1;	/* Start of Dynamic Segment Service Request Enable */
		unsigned int WUPAE          : 1;	/* Wakeup Pattern Channel A Service Request Enable */
		unsigned int MTSAE          : 1;	/* Media Access Test Symbol Channel A Service Request Enable */
		unsigned int                : 6;
		unsigned int WUPBE          : 1;	/* Wakeup Pattern Channel B Service Request Enable */
		unsigned int MTSBE          : 1;	/* Media Access Test Symbol Channel B Service Request Enable */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} ERAY_SIES_type;
#define ERAY_SIES	(*( ERAY_SIES_type *) 0xf001c038u)	/* Status Service Request Enable Set */

typedef volatile union
{
	struct
	{ 
		unsigned int WSTL           : 1;	/* Wakeup Status Service Request Line */
		unsigned int CASL           : 1;	/* Collision Avoidance Symbol Service Request Line */
		unsigned int CYCSL          : 1;	/* Cycle Start Service Request Line */
		unsigned int TXIL           : 1;	/* Transmit Service Request Line */
		unsigned int RXIL           : 1;	/* Receive Service Request Line */
		unsigned int RFNEL          : 1;	/* Receive FIFO Not Empty Service Request Line */
		unsigned int RFCLL          : 1;	/* Receive FIFO Critical Level Service Request Line */
		unsigned int NMVCL          : 1;	/* Network Management Vector Changed Service Request Line */
		unsigned int TI0L           : 1;	/* Timer Service Request 0 Line */
		unsigned int TI1L           : 1;	/* Timer Service Request 1 Line */
		unsigned int TIBCL          : 1;	/* Transfer Input Buffer Completed Service Request Line */
		unsigned int TOBCL          : 1;	/* Transfer Output Buffer Completed Service Request Line */
		unsigned int SWEL           : 1;	/* Stop Watch Event Service Request Line */
		unsigned int SUCSL          : 1;	/* Startup Completed Successfully Service Request Line */
		unsigned int MBSIL          : 1;	/* Message Buffer Status Service Request Line */
		unsigned int SDSL           : 1;	/* Start of Dynamic Segment Service Request Line */
		unsigned int WUPAL          : 1;	/* Wakeup Pattern Channel A Service Request Line */
		unsigned int MTSAL          : 1;	/* Media Access Test Symbol Channel A Service Request Line */
		unsigned int                : 6;
		unsigned int WUPBL          : 1;	/* Wakeup Pattern Channel B Service Request Line */
		unsigned int MTSBL          : 1;	/* Media Access Test Symbol Channel B Service Request Line */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} ERAY_SILS_type;
#define ERAY_SILS	(*( ERAY_SILS_type *) 0xf001c02cu)	/* Status Service Request Line Select */

typedef volatile union
{
	struct
	{ 
		unsigned int WST            : 1;	/* Wakeup Status */
		unsigned int CAS            : 1;	/* Collision Avoidance Symbol */
		unsigned int CYCS           : 1;	/* Cycle Start Service Request */
		unsigned int TXI            : 1;	/* Transmit Service Request */
		unsigned int RXI            : 1;	/* Receive Service Request */
		/* const */ unsigned int RFNE           : 1;	/* Receive FIFO Not Empty */
		/* const */ unsigned int RFCL           : 1;	/* Receive FIFO Critical Level */
		unsigned int NMVC           : 1;	/* Network Management Vector Changed */
		unsigned int TI0            : 1;	/* Timer Service Request 0 */
		unsigned int TI1            : 1;	/* Timer Service Request 1 */
		unsigned int TIBC           : 1;	/* Transfer Input Buffer Completed */
		unsigned int TOBC           : 1;	/* Transfer Output Buffer Completed */
		unsigned int SWE            : 1;	/* Stop Watch Event */
		unsigned int SUCS           : 1;	/* Startup Completed Successfully */
		unsigned int MBSI           : 1;	/* Message Buffer Status Service Request */
		unsigned int SDS            : 1;	/* Start of Dynamic Segment */
		unsigned int WUPA           : 1;	/* Wakeup Pattern Channel A */
		unsigned int MTSA           : 1;	/* MTS Received on Channel A (vSS!ValidMTSA) */
		unsigned int                : 6;
		unsigned int WUPB           : 1;	/* Wakeup Pattern Channel B */
		unsigned int MTSB           : 1;	/* MTS Received on Channel B (vSS!ValidMTSB) */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} ERAY_SIR_type;
#define ERAY_SIR	(*( ERAY_SIR_type *) 0xf001c024u)	/* Status Service Request Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ESWT           : 1;	/* Enable Stop Watch Trigger */
		unsigned int SWMS           : 1;	/* Stop Watch Mode Select */
		unsigned int EDGE           : 1;	/* Stop Watch Trigger Edge Select */
		unsigned int SSWT           : 1;	/* Software Stop Watch Trigger */
		unsigned int EETP           : 1;	/* Enable External Trigger Pin */
		unsigned int EINT0          : 1;	/* Enable Service Request 0 Trigger */
		unsigned int EINT1          : 1;	/* Enable Service Request 1 Trigger */
		unsigned int                : 1;
		/* const */ unsigned int SCCV           : 6;	/* Stopped Cycle Counter Value */
		unsigned int                : 2;
		/* const */ unsigned int SMTV           : 14;	/* Stopped Macrotick Value */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_STPW1_type;
#define ERAY_STPW1	(*( ERAY_STPW1_type *) 0xf001c04cu)	/* Stop Watch Register 1 */

