svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SSCVA          : 11;	/* Stop Watch Captured Slot Counter Value Channel A */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int SSCVB          : 11;	/* Stop Watch Captured Slot Counter Value Channel B */
		/* const */ unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} ERAY_STPW2_type;
#define ERAY_STPW2	(*( ERAY_STPW2_type *) 0xf001c050u)	/* Stop Watch Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int CMD            : 4;	/* CHI Command Vector */
		unsigned int                : 3;
		/* const */ unsigned int PBSY           : 1;	/* POC Busy */
		unsigned int TXST           : 1;	/* Transmit Startup Frame in Key SlotThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only!The protocol requires that both bits TXST and TXSY are set for coldstart nodes. (pKeySlotUsedForStartup) */
		unsigned int TXSY           : 1;	/* Transmit SYNC Frame in Key Slot(pKeySlotUsedForSync) */
		unsigned int                : 1;
		unsigned int CSA            : 5;	/* Cold Start Attempts(gColdStartAttempts) */
		unsigned int PTA            : 5;	/* Passive to Active (pAllowPassiveToActive) */
		unsigned int WUCS           : 1;	/* Wakeup Channel Select (pWakeupChannel) */
		unsigned int TSM            : 1;	/* Transmission Slot Mode (pSingleSlotEnabled) */
		unsigned int HCSE           : 1;	/* Halt due to Clock Sync Error (pAllowHaltDueToClock) */
		unsigned int MTSA           : 1;	/* Select Channel A for MTS TransmissionMTSA and MTSB may also be changed outside 'DEFAULT_CONFIG' or 'CONFIG' state when the write to SUCC1 register is directly preceded by the unlock sequence as described in Lock Register (LCK). This may be combined with CHI command 'SEND_MTS'. If both bits MTSA and MTSB are set to 1 an MTS symbol will be transmitted on both channels when requested by writing SUCC1.CMD = 1000B. */
		unsigned int MTSB           : 1;	/* Select Channel B for MTS Transmission */
		unsigned int CCHA           : 1;	/* Connected to Channel A (pChannels) */
		unsigned int CCHB           : 1;	/* Connected to Channel B (pChannels) */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} ERAY_SUCC1_type;
#define ERAY_SUCC1	(*( ERAY_SUCC1_type *) 0xf001c080u)	/* SUC Configuration Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int LT             : 21;	/* Listen TimeoutThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (pdListenTimeout) */
		unsigned int                : 3;
		unsigned int LTN            : 4;	/* Listen Time-out Noise (gListenNoise - 1) */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} ERAY_SUCC2_type;
#define ERAY_SUCC2	(*( ERAY_SUCC2_type *) 0xf001c084u)	/* SUC Configuration Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int WCP            : 4;	/* Maximum Without Clock Correction PassiveThis bit can be updated in 'DEFAULT_CONFIG' or 'CONFIG' state only! (gMaxWithoutClockCorrectionPassive) */
		unsigned int WCF            : 4;	/* Maximum Without Clock Correction Fatal (gMaxWithoutClockCorrecti on Fatal) */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} ERAY_SUCC3_type;
#define ERAY_SUCC3	(*( ERAY_SUCC3_type *) 0xf001c088u)	/* SUC Configuration Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SESA           : 1;	/* Syntax Error in Symbol Window Channel A (vSS!SyntaxErrorA) */
		/* const */ unsigned int SBSA           : 1;	/* Slot Boundary Violation in Symbol Window Channel A (vSS!BViolationA) */
		/* const */ unsigned int TCSA           : 1;	/* Transmission Conflict in Symbol Window Channel A (vSS!TxConflictA) */
		/* const */ unsigned int SESB           : 1;	/* Syntax Error in Symbol Window Channel B (vSS!SyntaxErrorB) */
		/* const */ unsigned int SBSB           : 1;	/* Slot Boundary Violation in Symbol Window Channel B (vSS!BViolationB) */
		/* const */ unsigned int TCSB           : 1;	/* Transmission Conflict in Symbol Window Channel B (vSS!TxConflictB) */
		/* const */ unsigned int MTSA           : 1;	/* MTS Received on Channel A (vSS!ValidMTSA)MTSA and MTSB may also be changed outside 'DEFAULT_CONFIG' or 'CONFIG' state when the write to SUCC1 register is directly preceded by the unlock sequence as described in 'Lock Register (LCK)'. This may be combined with CHI command SEND_MTS. If both bits MTSA and MTSB are set to 1 an MTS symbol will be transmitted on both channels when requested by writing SUCC1.CMD=1000B. */
		/* const */ unsigned int MTSB           : 1;	/* MTS Received on Channel B (vSS!ValidMTSB) */
		/* const */ unsigned int SENA           : 1;	/* Syntax Error during network idle time (NIT) Channel A (vSS!SyntaxErrorA) */
		/* const */ unsigned int SBNA           : 1;	/* Slot Boundary Violation during network idle time (NIT) Channel A (vSS!BViolationA) */
		/* const */ unsigned int SENB           : 1;	/* Syntax Error during network idle time (NIT) Channel B (vSS!SyntaxErrorB) */
		/* const */ unsigned int SBNB           : 1;	/* Slot Boundary Violation during network idle time (NIT) Channel B (vSS!BViolationB) */
		/* const */ unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} ERAY_SWNIT_type;
#define ERAY_SWNIT	(*( ERAY_SWNIT_type *) 0xf001c124u)	/* Symbol Window and Network Idle Time Status */

typedef volatile union
{
	struct
	{ 
		unsigned int T0RC           : 1;	/* Timer 0 Run Control */
		unsigned int T0MS           : 1;	/* Timer 0 Mode Select */
		unsigned int                : 6;
		unsigned int T0CC           : 7;	/* Timer 0 Cycle Code */
		unsigned int                : 1;
		unsigned int T0MO           : 14;	/* Timer 0 Macrotick Offset */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_T0C_type;
#define ERAY_T0C	(*( ERAY_T0C_type *) 0xf001c044u)	/* Timer 0 Configuration */

typedef volatile union
{
	struct
	{ 
		unsigned int T1RC           : 1;	/* Timer 1 Run Control */
		unsigned int T1MS           : 1;	/* Timer 1 Mode Select */
		unsigned int                : 14;
		unsigned int T1MC           : 14;	/* Timer 1 Macrotick Count */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_T1C_type;
#define ERAY_T1C	(*( ERAY_T1C_type *) 0xf001c048u)	/* Timer 1 Configuration */

