svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int WRTEN          : 1;	/* Write Test Register Enable */
		unsigned int ELBE           : 1;	/* External Loop Back Enable */
		unsigned int                : 2;
		unsigned int TMC            : 2;	/* Test Multiplexer Control */
		unsigned int                : 2;
		/* const */ unsigned int AOA            : 1;	/* Activity on A */
		/* const */ unsigned int AOB            : 1;	/* Activity on B */
		unsigned int                : 6;
		/* const */ unsigned int RXA            : 1;	/* Read Channel A Receive Pin */
		/* const */ unsigned int RXB            : 1;	/* Read Channel B Receive Pin */
		unsigned int TXA            : 1;	/* Read or Write to Channel A Transmit Pin */
		unsigned int TXB            : 1;	/* Read or Write to Channel B Transmit Pin */
		unsigned int TXENA          : 1;	/* Read or Write to Channel A Transmit Enable Pin */
		unsigned int TXENB          : 1;	/* Read or Write to Channel B Transmit Enable Pin */
		unsigned int                : 2;
		/* const */ unsigned int CERA           : 4;	/* Coding Error Report Channel ACoding errors are also signalled when the Communication Controller is in 'MONITOR_MODE'. The error codes regarding CAS / MTS symbols concern only the monitored bit pattern, irrelevant whether those bit patterns are seen in the symbol window or elsewhere. */
		/* const */ unsigned int CERB           : 4;	/* Coding Error Report Channel B */
	} B;
	int I;
	unsigned int U;

} ERAY_TEST1_type;
#define ERAY_TEST1	(*( ERAY_TEST1_type *) 0xf001c010u)	/* Test Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int RS             : 3;	/* RAM Select */
		unsigned int                : 1;
		unsigned int SSEL           : 3;	/* Segment Select */
		unsigned int                : 7;
		unsigned int WRECC          : 1;	/* Write ECC Data Enable */
		unsigned int                : 17;
	} B;
	int I;
	unsigned int U;

} ERAY_TEST2_type;
#define ERAY_TEST2	(*( ERAY_TEST2_type *) 0xf001c014u)	/* Test Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXR0           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR1           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR2           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR3           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR4           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR5           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR6           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR7           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR8           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR9           : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR10          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR11          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR12          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR13          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR14          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR15          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR16          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR17          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR18          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR19          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR20          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR21          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR22          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR23          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR24          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR25          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR26          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR27          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR28          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR29          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR30          : 1;	/* Transmission Request n (n= 0-31) */
		/* const */ unsigned int TXR31          : 1;	/* Transmission Request n (n= 0-31) */
	} B;
	int I;
	unsigned int U;

} ERAY_TXRQ1_type;
#define ERAY_TXRQ1	(*( ERAY_TXRQ1_type *) 0xf001c320u)	/* Transmission Request Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXR32          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR33          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR34          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR35          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR36          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR37          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR38          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR39          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR40          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR41          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR42          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR43          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR44          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR45          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR46          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR47          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR48          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR49          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR50          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR51          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR52          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR53          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR54          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR55          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR56          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR57          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR58          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR59          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR60          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR61          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR62          : 1;	/* Transmission Request n (n=32-63) */
		/* const */ unsigned int TXR63          : 1;	/* Transmission Request n (n=32-63) */
	} B;
	int I;
	unsigned int U;

