svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ERAY_TXRQ2_type;
#define ERAY_TXRQ2	(*( ERAY_TXRQ2_type *) 0xf001c324u)	/* Transmission Request Register 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXR64          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR65          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR66          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR67          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR68          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR69          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR70          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR71          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR72          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR73          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR74          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR75          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR76          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR77          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR78          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR79          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR80          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR81          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR82          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR83          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR84          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR85          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR86          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR87          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR88          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR89          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR90          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR91          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR92          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR93          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR94          : 1;	/* Transmission Request n (n=64-95) */
		/* const */ unsigned int TXR95          : 1;	/* Transmission Request n (n=64-95) */
	} B;
	int I;
	unsigned int U;

} ERAY_TXRQ3_type;
#define ERAY_TXRQ3	(*( ERAY_TXRQ3_type *) 0xf001c328u)	/* Transmission Request Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXR96          : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR97          : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR98          : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR99          : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR100         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR101         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR102         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR103         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR104         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR105         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR106         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR107         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR108         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR109         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR110         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR111         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR112         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR113         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR114         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR115         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR116         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR117         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR118         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR119         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR120         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR121         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR122         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR123         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR124         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR125         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR126         : 1;	/* Transmission Request n (n=96-127) */
		/* const */ unsigned int TXR127         : 1;	/* Transmission Request n (n=96-127) */
	} B;
	int I;
	unsigned int U;

} ERAY_TXRQ4_type;
#define ERAY_TXRQ4	(*( ERAY_TXRQ4_type *) 0xf001c32cu)	/* Transmission Request Register 4 */

