svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MDWB0          : 8;	/* 32-Bit Word nn, Byte 0 */
		unsigned int MDWB1          : 8;	/* 32-Bit Word nn, Byte 1 */
		unsigned int MDWB2          : 8;	/* 32-Bit Word nn, Byte 2 */
		unsigned int MDWB3          : 8;	/* 32-Bit Word nn, Byte 3 */
	} B;
	int I;
	unsigned int U;

} ERAY_WRDS01_type;
#define ERAY_WRDS01	(*( ERAY_WRDS01_type *) 0xf001c400u)	/* Write Data Section 01 */
#define ERAY_WRDS02	(*( ERAY_WRDS01_type *) 0xf001c404u)	/* Write Data Section 02 */
#define ERAY_WRDS03	(*( ERAY_WRDS01_type *) 0xf001c408u)	/* Write Data Section 03 */
#define ERAY_WRDS04	(*( ERAY_WRDS01_type *) 0xf001c40cu)	/* Write Data Section 04 */
#define ERAY_WRDS05	(*( ERAY_WRDS01_type *) 0xf001c410u)	/* Write Data Section 05 */
#define ERAY_WRDS06	(*( ERAY_WRDS01_type *) 0xf001c414u)	/* Write Data Section 06 */
#define ERAY_WRDS07	(*( ERAY_WRDS01_type *) 0xf001c418u)	/* Write Data Section 07 */
#define ERAY_WRDS08	(*( ERAY_WRDS01_type *) 0xf001c41cu)	/* Write Data Section 08 */
#define ERAY_WRDS09	(*( ERAY_WRDS01_type *) 0xf001c420u)	/* Write Data Section 09 */
#define ERAY_WRDS10	(*( ERAY_WRDS01_type *) 0xf001c424u)	/* Write Data Section 10 */
#define ERAY_WRDS11	(*( ERAY_WRDS01_type *) 0xf001c428u)	/* Write Data Section 11 */
#define ERAY_WRDS12	(*( ERAY_WRDS01_type *) 0xf001c42cu)	/* Write Data Section 12 */
#define ERAY_WRDS13	(*( ERAY_WRDS01_type *) 0xf001c430u)	/* Write Data Section 13 */
#define ERAY_WRDS14	(*( ERAY_WRDS01_type *) 0xf001c434u)	/* Write Data Section 14 */
#define ERAY_WRDS15	(*( ERAY_WRDS01_type *) 0xf001c438u)	/* Write Data Section 15 */
#define ERAY_WRDS16	(*( ERAY_WRDS01_type *) 0xf001c43cu)	/* Write Data Section 16 */
#define ERAY_WRDS17	(*( ERAY_WRDS01_type *) 0xf001c440u)	/* Write Data Section 17 */
#define ERAY_WRDS18	(*( ERAY_WRDS01_type *) 0xf001c444u)	/* Write Data Section 18 */
#define ERAY_WRDS19	(*( ERAY_WRDS01_type *) 0xf001c448u)	/* Write Data Section 19 */
#define ERAY_WRDS20	(*( ERAY_WRDS01_type *) 0xf001c44cu)	/* Write Data Section 20 */
#define ERAY_WRDS21	(*( ERAY_WRDS01_type *) 0xf001c450u)	/* Write Data Section 21 */
#define ERAY_WRDS22	(*( ERAY_WRDS01_type *) 0xf001c454u)	/* Write Data Section 22 */
#define ERAY_WRDS23	(*( ERAY_WRDS01_type *) 0xf001c458u)	/* Write Data Section 23 */
#define ERAY_WRDS24	(*( ERAY_WRDS01_type *) 0xf001c45cu)	/* Write Data Section 24 */
#define ERAY_WRDS25	(*( ERAY_WRDS01_type *) 0xf001c460u)	/* Write Data Section 25 */
#define ERAY_WRDS26	(*( ERAY_WRDS01_type *) 0xf001c464u)	/* Write Data Section 26 */
#define ERAY_WRDS27	(*( ERAY_WRDS01_type *) 0xf001c468u)	/* Write Data Section 27 */
#define ERAY_WRDS28	(*( ERAY_WRDS01_type *) 0xf001c46cu)	/* Write Data Section 28 */
#define ERAY_WRDS29	(*( ERAY_WRDS01_type *) 0xf001c470u)	/* Write Data Section 29 */
#define ERAY_WRDS30	(*( ERAY_WRDS01_type *) 0xf001c474u)	/* Write Data Section 30 */
#define ERAY_WRDS31	(*( ERAY_WRDS01_type *) 0xf001c478u)	/* Write Data Section 31 */
#define ERAY_WRDS32	(*( ERAY_WRDS01_type *) 0xf001c47cu)	/* Write Data Section 32 */
#define ERAY_WRDS33	(*( ERAY_WRDS01_type *) 0xf001c480u)	/* Write Data Section 33 */
#define ERAY_WRDS34	(*( ERAY_WRDS01_type *) 0xf001c484u)	/* Write Data Section 34 */
#define ERAY_WRDS35	(*( ERAY_WRDS01_type *) 0xf001c488u)	/* Write Data Section 35 */
#define ERAY_WRDS36	(*( ERAY_WRDS01_type *) 0xf001c48cu)	/* Write Data Section 36 */
#define ERAY_WRDS37	(*( ERAY_WRDS01_type *) 0xf001c490u)	/* Write Data Section 37 */
#define ERAY_WRDS38	(*( ERAY_WRDS01_type *) 0xf001c494u)	/* Write Data Section 38 */
#define ERAY_WRDS39	(*( ERAY_WRDS01_type *) 0xf001c498u)	/* Write Data Section 39 */
#define ERAY_WRDS40	(*( ERAY_WRDS01_type *) 0xf001c49cu)	/* Write Data Section 40 */
#define ERAY_WRDS41	(*( ERAY_WRDS01_type *) 0xf001c4a0u)	/* Write Data Section 41 */
#define ERAY_WRDS42	(*( ERAY_WRDS01_type *) 0xf001c4a4u)	/* Write Data Section 42 */
#define ERAY_WRDS43	(*( ERAY_WRDS01_type *) 0xf001c4a8u)	/* Write Data Section 43 */
#define ERAY_WRDS44	(*( ERAY_WRDS01_type *) 0xf001c4acu)	/* Write Data Section 44 */
#define ERAY_WRDS45	(*( ERAY_WRDS01_type *) 0xf001c4b0u)	/* Write Data Section 45 */
#define ERAY_WRDS46	(*( ERAY_WRDS01_type *) 0xf001c4b4u)	/* Write Data Section 46 */
#define ERAY_WRDS47	(*( ERAY_WRDS01_type *) 0xf001c4b8u)	/* Write Data Section 47 */
#define ERAY_WRDS48	(*( ERAY_WRDS01_type *) 0xf001c4bcu)	/* Write Data Section 48 */
#define ERAY_WRDS49	(*( ERAY_WRDS01_type *) 0xf001c4c0u)	/* Write Data Section 49 */
#define ERAY_WRDS50	(*( ERAY_WRDS01_type *) 0xf001c4c4u)	/* Write Data Section 50 */
#define ERAY_WRDS51	(*( ERAY_WRDS01_type *) 0xf001c4c8u)	/* Write Data Section 51 */
#define ERAY_WRDS52	(*( ERAY_WRDS01_type *) 0xf001c4ccu)	/* Write Data Section 52 */
#define ERAY_WRDS53	(*( ERAY_WRDS01_type *) 0xf001c4d0u)	/* Write Data Section 53 */
#define ERAY_WRDS54	(*( ERAY_WRDS01_type *) 0xf001c4d4u)	/* Write Data Section 54 */
#define ERAY_WRDS55	(*( ERAY_WRDS01_type *) 0xf001c4d8u)	/* Write Data Section 55 */
#define ERAY_WRDS56	(*( ERAY_WRDS01_type *) 0xf001c4dcu)	/* Write Data Section 56 */
#define ERAY_WRDS57	(*( ERAY_WRDS01_type *) 0xf001c4e0u)	/* Write Data Section 57 */
#define ERAY_WRDS58	(*( ERAY_WRDS01_type *) 0xf001c4e4u)	/* Write Data Section 58 */
#define ERAY_WRDS59	(*( ERAY_WRDS01_type *) 0xf001c4e8u)	/* Write Data Section 59 */
#define ERAY_WRDS60	(*( ERAY_WRDS01_type *) 0xf001c4ecu)	/* Write Data Section 60 */
#define ERAY_WRDS61	(*( ERAY_WRDS01_type *) 0xf001c4f0u)	/* Write Data Section 61 */
#define ERAY_WRDS62	(*( ERAY_WRDS01_type *) 0xf001c4f4u)	/* Write Data Section 62 */
#define ERAY_WRDS63	(*( ERAY_WRDS01_type *) 0xf001c4f8u)	/* Write Data Section 63 */
#define ERAY_WRDS64	(*( ERAY_WRDS01_type *) 0xf001c4fcu)	/* Write Data Section 64 */

typedef volatile union
{
	struct
	{ 
		unsigned int FID            : 11;	/* Frame ID */
		unsigned int                : 5;
		unsigned int CYC            : 7;	/* Cycle Code */
		unsigned int                : 1;
		unsigned int CHA            : 1;	/* Channel Filter Control A */
		unsigned int CHB            : 1;	/* Channel Filter Control B */
		unsigned int CFG            : 1;	/* Message Buffer Direction Configuration Bit */
		unsigned int PPIT           : 1;	/* Payload Preamble Indicator Transmit */
		unsigned int TXM            : 1;	/* Transmission Mode */
		unsigned int MBI            : 1;	/* Message Buffer Service Request */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} ERAY_WRHS1_type;
#define ERAY_WRHS1	(*( ERAY_WRHS1_type *) 0xf001c500u)	/* Write Header Section 1 */

