svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CRC            : 11;	/* Header CRC (vRF!Header!HeaderCRC) */
		unsigned int                : 5;
		unsigned int PLC            : 7;	/* Payload Length Configured */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} ERAY_WRHS2_type;
#define ERAY_WRHS2	(*( ERAY_WRHS2_type *) 0xf001c504u)	/* Write Header Section 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int DP             : 11;	/* Data Pointer */
		unsigned int                : 21;
	} B;
	int I;
	unsigned int U;

} ERAY_WRHS3_type;
#define ERAY_WRHS3	(*( ERAY_WRHS3_type *) 0xf001c508u)	/* Write Header Section 3 */


/* GTM */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} GTM_ACCEN0_type;
#define GTM_ACCEN0	(*( GTM_ACCEN0_type *) 0xf019fdfcu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ACCEN1_type;
#define GTM_ACCEN1	(*( GTM_ACCEN1_type *) 0xf019fdf8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL1           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL2           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL3           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL4           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL5           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL6           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int SEL7           : 4;	/* Output Selection for ADCx GTM connection */
	} B;
	int I;
	unsigned int U;

} GTM_ADCTRIG0OUT0_type;
#define GTM_ADCTRIG0OUT0	(*( GTM_ADCTRIG0OUT0_type *) 0xf019fdb0u)	/* ADC Trigger 0 Output Select 0 Register */
#define GTM_ADCTRIG1OUT0	(*( GTM_ADCTRIG0OUT0_type *) 0xf019fdb8u)	/* ADC Trigger 1 Output Select 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 4;	/* Output Selection for ADCx GTM connection */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} GTM_ADCTRIG0OUT1_type;
#define GTM_ADCTRIG0OUT1	(*( GTM_ADCTRIG0OUT1_type *) 0xf019fdb4u)	/* ADC Trigger 0 Output Select 1 Register */
#define GTM_ADCTRIG1OUT1	(*( GTM_ADCTRIG0OUT1_type *) 0xf019fdbcu)	/* ADC Trigger 1 Output Select 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADD_IN_LD_1    : 24;	/* Input value for SUB_INC1 generation */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ADD_IN_LD1_type;
#define GTM_ADD_IN_LD1	(*( GTM_ADD_IN_LD1_type *) 0xf01280c8u)	/* DPLL Direct Load Input Value for SUB_INC1 */

typedef volatile union
{
	struct
	{ 
		unsigned int ADD_IN_LD_2    : 24;	/* Input value for SUB_INC2 generation */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ADD_IN_LD2_type;
#define GTM_ADD_IN_LD2	(*( GTM_ADD_IN_LD2_type *) 0xf01280ccu)	/* DPLL Direct Load Input Value for SUB_INC1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TO_ADDR        : 20;	/* AEI Timeout address */
		/* const */ unsigned int TO_W1R0        : 1;	/* AEI Timeout Read/Write flag */
		/* const */ unsigned int Reserved       : 11;	/* Reserved */
	} B;
	int I;
	unsigned int U;

