svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} GTM_AEI_ADDR_XPT_type;
#define GTM_AEI_ADDR_XPT	(*( GTM_AEI_ADDR_XPT_type *) 0xf010000cu)	/* GTM AEI Timeout Exception Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 29;	/* Read/write data from/to FIFO */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_AFD0_CH0_BUF_ACC_type;
#define GTM_AFD0_CH0_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf0118080u)	/* AFD0 FIFO0 Channel0 Buffer Access Register */
#define GTM_AFD0_CH1_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf0118090u)	/* AFD0 FIFO0 Channel1 Buffer Access Register */
#define GTM_AFD0_CH2_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf01180a0u)	/* AFD0 FIFO0 Channel2 Buffer Access Register */
#define GTM_AFD0_CH3_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf01180b0u)	/* AFD0 FIFO0 Channel3 Buffer Access Register */
#define GTM_AFD0_CH4_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf01180c0u)	/* AFD0 FIFO0 Channel4 Buffer Access Register */
#define GTM_AFD0_CH5_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf01180d0u)	/* AFD0 FIFO0 Channel5 Buffer Access Register */
#define GTM_AFD0_CH6_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf01180e0u)	/* AFD0 FIFO0 Channel6 Buffer Access Register */
#define GTM_AFD0_CH7_BUF_ACC	(*( GTM_AFD0_CH0_BUF_ACC_type *) 0xf01180f0u)	/* AFD0 FIFO0 Channel7 Buffer Access Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 9;	/* ARU address */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
		unsigned int RREQ           : 1;	/* Initiate read request */
		unsigned int WREQ           : 1;	/* Initiate write request */
		/* const */ unsigned int Reserved_5     : 18;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_ACCESS_type;
#define GTM_ARU_ACCESS	(*( GTM_ARU_ACCESS_type *) 0xf0100280u)	/* ARU Access Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 29;	/* Upper ARU data word */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_DATA_H_type;
#define GTM_ARU_DATA_H	(*( GTM_ARU_DATA_H_type *) 0xf0100284u)	/* ARU Access Register Upper Data Word */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 29;	/* Lower ARU data word */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_DATA_L_type;
#define GTM_ARU_DATA_L	(*( GTM_ARU_DATA_L_type *) 0xf0100288u)	/* ARU Access Register Lower Data Word */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 9;	/* ARU debugging address */
		/* const */ unsigned int Reserved       : 23;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_DBG_ACCESS0_type;
#define GTM_ARU_DBG_ACCESS0	(*( GTM_ARU_DBG_ACCESS0_type *) 0xf010028cu)	/* Debug Access Channel 0 */
#define GTM_ARU_DBG_ACCESS1	(*( GTM_ARU_DBG_ACCESS0_type *) 0xf0100298u)	/* Debug Access Channel 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DATA           : 29;	/* Upper debug data word */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_DBG_DATA0_H_type;
#define GTM_ARU_DBG_DATA0_H	(*( GTM_ARU_DBG_DATA0_H_type *) 0xf0100290u)	/* Debug Access 0 Transfer Register Upper Data Word */
#define GTM_ARU_DBG_DATA1_H	(*( GTM_ARU_DBG_DATA0_H_type *) 0xf010029cu)	/* Debug Access 1 Transfer Register Upper Data Word */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DATA           : 29;	/* Lower debug data word */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_DBG_DATA0_L_type;
#define GTM_ARU_DBG_DATA0_L	(*( GTM_ARU_DBG_DATA0_L_type *) 0xf0100294u)	/* Debug Access 0 Transfer Register Lower Data Word */
#define GTM_ARU_DBG_DATA1_L	(*( GTM_ARU_DBG_DATA0_L_type *) 0xf01002a0u)	/* Debug Access 1 Transfer Register Lower Data Word */

typedef volatile union
{
	struct
	{ 
		unsigned int NEW_DATA0_IRQ_EN: 1;	/* ARU_NEW_DATA0_IRQ interrupt enable */
		unsigned int NEW_DATA1_IRQ_EN: 1;	/* ARU_NEW_DATA1_IRQ interrupt enable */
		unsigned int ACC_ACK_IRQ_EN : 1;	/* ACC_ACK_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_IRQ_EN_type;
#define GTM_ARU_IRQ_EN	(*( GTM_ARU_IRQ_EN_type *) 0xf01002a8u)	/* ARU Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG_NEW_DATA0  : 1;	/* Trigger new data 0 interrupt */
		unsigned int TRG_NEW_DATA   : 1;	/* 1 Trigger new data 1 interrupt */
		unsigned int TRG_ACC_ACK    : 1;	/* Trigger ACC_ACK interrupt */
		/* const */ unsigned int Reserved       : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_IRQ_FORCINT_type;
#define GTM_ARU_IRQ_FORCINT	(*( GTM_ARU_IRQ_FORCINT_type *) 0xf01002acu)	/* ARU_NEW_DATA_IRQ Forcing Interrupt Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IRQ_MODE       : 2;	/* IRQ mode selection */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_IRQ_MODE_type;
#define GTM_ARU_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01002b0u)	/* IRQ Mode Configuration Register */
#define GTM_ATOM0_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d0acu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d12cu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d1acu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d22cu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d2acu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d32cu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d3acu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM0_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d42cu)	/* ATOM0 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d8acu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d92cu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010d9acu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010da2cu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010daacu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010db2cu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010dbacu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM1_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010dc2cu)	/* ATOM1 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e0acu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e12cu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e1acu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e22cu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e2acu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e32cu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e3acu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM2_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e42cu)	/* ATOM2 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e8acu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e92cu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010e9acu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010ea2cu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010eaacu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010eb2cu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010ebacu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM3_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010ec2cu)	/* ATOM3 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f0acu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f12cu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f1acu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f22cu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f2acu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f32cu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f3acu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_ATOM4_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010f42cu)	/* ATOM4 IRQ Mode Configuration Register */
#define GTM_BRC_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010046cu)	/* BRC IRQ Mode Configuration Register */
#define GTM_CMP_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0100210u)	/* CMP IRQ Mode Configuration Register */
#define GTM_DPLL_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf012804cu)	/* DPLL Interrupt Mode Register */
#define GTM_MCS0_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0130038u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01300b8u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0130138u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01301b8u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0130238u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01302b8u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0130338u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS0_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01303b8u)	/* MCS0 IRQ Mode Configuration Register */
#define GTM_MCS1_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0140038u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01400b8u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0140138u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01401b8u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0140238u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01402b8u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0140338u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS1_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01403b8u)	/* MCS1 IRQ Mode Configuration Register */
#define GTM_MCS2_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0150038u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01500b8u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0150138u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01501b8u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0150238u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01502b8u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0150338u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS2_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01503b8u)	/* MCS2 IRQ Mode Configuration Register */
#define GTM_MCS3_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0160038u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01600b8u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0160138u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01601b8u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0160238u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01602b8u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0160338u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_MCS3_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01603b8u)	/* MCS3 IRQ Mode Configuration Register */
#define GTM_SPE0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0100838u)	/* SPE0 IRQ Mode Configuration Register */
#define GTM_SPE1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01008b8u)	/* SPE1 IRQ Mode Configuration Register */
#define GTM_TIM0_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010102cu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01010acu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010112cu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01011acu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010122cu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01012acu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010132cu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM0_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01013acu)	/* TIM0 IRQ Mode Configuration Register */
#define GTM_TIM1_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010182cu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01018acu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010192cu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01019acu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0101a2cu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0101aacu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0101b2cu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM1_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0101bacu)	/* TIM1 IRQ Mode Configuration Register */
#define GTM_TIM2_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010202cu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01020acu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010212cu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01021acu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010222cu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01022acu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010232cu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM2_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01023acu)	/* TIM2 IRQ Mode Configuration Register */
#define GTM_TIM3_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010282cu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01028acu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf010292cu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01029acu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0102a2cu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0102aacu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0102b2cu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TIM3_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0102bacu)	/* TIM3 IRQ Mode Configuration Register */
#define GTM_TOM0_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01080a8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH10_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108328u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH11_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108368u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH12_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01083a8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH13_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01083e8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH14_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108428u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH15_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108468u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01080e8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108128u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108168u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01081a8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01081e8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108228u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108268u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH8_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01082a8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM0_CH9_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01082e8u)	/* TOM0 IRQ Mode Configuration Register */
#define GTM_TOM1_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01088a8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH10_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108b28u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH11_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108b68u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH12_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108ba8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH13_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108be8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH14_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108c28u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH15_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108c68u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01088e8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108928u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108968u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01089a8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01089e8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108a28u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108a68u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH8_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108aa8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM1_CH9_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0108ae8u)	/* TOM1 IRQ Mode Configuration Register */
#define GTM_TOM2_CH0_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01090a8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH10_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109328u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH11_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109368u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH12_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01093a8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH13_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01093e8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH14_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109428u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH15_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109468u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH1_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01090e8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH2_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109128u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH3_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109168u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH4_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01091a8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH5_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01091e8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH6_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109228u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH7_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf0109268u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH8_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01092a8u)	/* TOM2 IRQ Mode Configuration Register */
#define GTM_TOM2_CH9_IRQ_MODE	(*( GTM_ARU_IRQ_MODE_type *) 0xf01092e8u)	/* TOM2 IRQ Mode Configuration Register */

