svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int NEW_DATA0      : 1;	/* Data was transferred for addr ARU_DBG_ACCESS0 */
		unsigned int NEW_DATA1      : 1;	/* Data was transferred for addr ARU_DBG_ACCESS1 */
		unsigned int ACC_ACK        : 1;	/* AEI to ARU access finished, on read access data are valid */
		/* const */ unsigned int Reserved       : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ARU_IRQ_NOTIFY_type;
#define GTM_ARU_IRQ_NOTIFY	(*( GTM_ARU_IRQ_NOTIFY_type *) 0xf01002a4u)	/* ARU Interrupt Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ACT_TB         : 24;	/* Time base value */
		unsigned int TB_TRIG        : 1;	/* Set trigger request */
		unsigned int TBU_SEL        : 2;	/* Selection of time base used for comparison */
		/* const */ unsigned int Reserved       : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_ACT_TB_type;
#define GTM_ATOM0_AGC_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010d00cu)	/* TOM0 TGC0 Action Time Base Register */
#define GTM_ATOM1_AGC_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010d80cu)	/* TOM1 TGC0 Action Time Base Register */
#define GTM_ATOM2_AGC_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010e00cu)	/* TOM2 TGC0 Action Time Base Register */
#define GTM_ATOM3_AGC_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010e80cu)	/* TOM3 TGC0 Action Time Base Register */
#define GTM_ATOM4_AGC_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010f00cu)	/* TOM4 TGC0 Action Time Base Register */
#define GTM_TOM0_TGC0_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010800cu)	/* TOM0 TGC0 Action Time Base Register */
#define GTM_TOM0_TGC1_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010804cu)	/* TOM0 TGC1 Action Time Base Register */
#define GTM_TOM1_TGC0_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010880cu)	/* TOM1 TGC0 Action Time Base Register */
#define GTM_TOM1_TGC1_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010884cu)	/* TOM1 TGC1 Action Time Base Register */
#define GTM_TOM2_TGC0_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010900cu)	/* TOM2 TGC0 Action Time Base Register */
#define GTM_TOM2_TGC1_ACT_TB	(*( GTM_ATOM0_AGC_ACT_TB_type *) 0xf010904cu)	/* TOM2 TGC1 Action Time Base Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENDIS_CTRL0    : 2;	/* (A)TOM channel 0 enable/disable update value */
		unsigned int ENDIS_CTRL1    : 2;	/* (A)TOM channel 1 enable/disable update value */
		unsigned int ENDIS_CTRL2    : 2;	/* (A)TOM channel 2 enable/disable update value */
		unsigned int ENDIS_CTRL3    : 2;	/* (A)TOM channel 3 enable/disable update value */
		unsigned int ENDIS_CTRL4    : 2;	/* (A)TOM channel 4 enable/disable update value */
		unsigned int ENDIS_CTRL5    : 2;	/* (A)TOM channel 5 enable/disable update value */
		unsigned int ENDIS_CTRL6    : 2;	/* (A)TOM channel 6 enable/disable update value */
		unsigned int ENDIS_CTRL7    : 2;	/* (A)TOM channel 7 enable/disable update value */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_ENDIS_CTRL_type;
#define GTM_ATOM0_AGC_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf010d004u)	/* ATOM0 AGC Enable/Disable Control Register */
#define GTM_ATOM1_AGC_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf010d804u)	/* ATOM1 AGC Enable/Disable Control Register */
#define GTM_ATOM2_AGC_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf010e004u)	/* ATOM2 AGC Enable/Disable Control Register */
#define GTM_ATOM3_AGC_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf010e804u)	/* ATOM3 AGC Enable/Disable Control Register */
#define GTM_ATOM4_AGC_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf010f004u)	/* ATOM4 AGC Enable/Disable Control Register */
#define GTM_TOM0_TGC0_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf0108004u)	/* TOM0 TGC0 Enable/Disable Control Register */
#define GTM_TOM0_TGC1_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf0108044u)	/* TOM0 TGC1 Enable/Disable Control Register */
#define GTM_TOM1_TGC0_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf0108804u)	/* TOM1 TGC0 Enable/Disable Control Register */
#define GTM_TOM1_TGC1_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf0108844u)	/* TOM1 TGC1 Enable/Disable Control Register */
#define GTM_TOM2_TGC0_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf0109004u)	/* TOM2 TGC0 Enable/Disable Control Register */
#define GTM_TOM2_TGC1_ENDIS_CTRL	(*( GTM_ATOM0_AGC_ENDIS_CTRL_type *) 0xf0109044u)	/* TOM2 TGC1 Enable/Disable Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENDIS_STAT0    : 2;	/* (A)TOM channel 0 enable/disable */
		unsigned int ENDIS_STAT1    : 2;	/* (A)TOM channel 1 enable/disable */
		unsigned int ENDIS_STAT2    : 2;	/* (A)TOM channel 2 enable/disable */
		unsigned int ENDIS_STAT3    : 2;	/* (A)TOM channel 3 enable/disable */
		unsigned int ENDIS_STAT4    : 2;	/* (A)TOM channel 4 enable/disable */
		unsigned int ENDIS_STAT5    : 2;	/* (A)TOM channel 5 enable/disable */
		unsigned int ENDIS_STAT6    : 2;	/* (A)TOM channel 6 enable/disable */
		unsigned int ENDIS_STAT7    : 2;	/* (A)TOM channel 7 enable/disable */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_ENDIS_STAT_type;
#define GTM_ATOM0_AGC_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf010d008u)	/* ATOM0 AGC Enable/Disable Status Register */
#define GTM_ATOM1_AGC_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf010d808u)	/* ATOM1 AGC Enable/Disable Status Register */
#define GTM_ATOM2_AGC_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf010e008u)	/* ATOM2 AGC Enable/Disable Status Register */
#define GTM_ATOM3_AGC_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf010e808u)	/* ATOM3 AGC Enable/Disable Status Register */
#define GTM_ATOM4_AGC_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf010f008u)	/* ATOM4 AGC Enable/Disable Status Register */
#define GTM_TOM0_TGC0_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf0108008u)	/* TOM0 TGC0 Enable/Disable Status Register */
#define GTM_TOM0_TGC1_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf0108048u)	/* TOM0 TGC1 Enable/Disable Status Register */
#define GTM_TOM1_TGC0_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf0108808u)	/* TOM1 TGC0 Enable/Disable Status Register */
#define GTM_TOM1_TGC1_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf0108848u)	/* TOM1 TGC1 Enable/Disable Status Register */
#define GTM_TOM2_TGC0_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf0109008u)	/* TOM2 TGC0 Enable/Disable Status Register */
#define GTM_TOM2_TGC1_ENDIS_STAT	(*( GTM_ATOM0_AGC_ENDIS_STAT_type *) 0xf0109048u)	/* TOM2 TGC1 Enable/Disable Status Register */

