svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int FUPD_CTRL0     : 2;	/* Force update of (A)TOM channel 0 operation registers */
		unsigned int FUPD_CTRL1     : 2;	/* Force update of (A)TOM channel 1 operation registers */
		unsigned int FUPD_CTRL2     : 2;	/* Force update of (A)TOM channel 2 operation registers */
		unsigned int FUPD_CTRL3     : 2;	/* Force update of (A)TOM channel 3 operation registers */
		unsigned int FUPD_CTRL4     : 2;	/* Force update of (A)TOM channel 4 operation registers */
		unsigned int FUPD_CTRL5     : 2;	/* Force update of (A)TOM channel 5 operation registers */
		unsigned int FUPD_CTRL6     : 2;	/* Force update of (A)TOM channel 6 operation registers */
		unsigned int FUPD_CTRL7     : 2;	/* Force update of (A)TOM channel 7 operation registers */
		unsigned int RSTCN0_CH0     : 2;	/* Reset CN0 of channel 0 on force update event */
		unsigned int RSTCN0_CH1     : 2;	/* Reset CN0 of channel 1 on force update event */
		unsigned int RSTCN0_CH2     : 2;	/* Reset CN0 of channel 2 on force update event */
		unsigned int RSTCN0_CH3     : 2;	/* Reset CN0 of channel 3 on force update event */
		unsigned int RSTCN0_CH4     : 2;	/* Reset CN0 of channel 4 on force update event */
		unsigned int RSTCN0_CH5     : 2;	/* Reset CN0 of channel 5 on force update event */
		unsigned int RSTCN0_CH6     : 2;	/* Reset CN0 of channel 6 on force update event */
		unsigned int RSTCN0_CH7     : 2;	/* Reset CN0 of channel 7 on force update event */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_FUPD_CTRL_type;
#define GTM_ATOM0_AGC_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf010d018u)	/* ATOM0 AGC Force Update Control Register */
#define GTM_ATOM1_AGC_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf010d818u)	/* ATOM1 AGC Force Update Control Register */
#define GTM_ATOM2_AGC_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf010e018u)	/* ATOM2 AGC Force Update Control Register */
#define GTM_ATOM3_AGC_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf010e818u)	/* ATOM3 AGC Force Update Control Register */
#define GTM_ATOM4_AGC_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf010f018u)	/* ATOM4 AGC Force Update Control Register */
#define GTM_TOM0_TGC0_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf0108018u)	/* TOM0 TGC0 Force Update Control Register */
#define GTM_TOM0_TGC1_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf0108058u)	/* TOM0 TGC1 Force Update Control Register */
#define GTM_TOM1_TGC0_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf0108818u)	/* TOM1 TGC0 Force Update Control Register */
#define GTM_TOM1_TGC1_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf0108858u)	/* TOM1 TGC1 Force Update Control Register */
#define GTM_TOM2_TGC0_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf0109018u)	/* TOM2 TGC0 Force Update Control Register */
#define GTM_TOM2_TGC1_FUPD_CTRL	(*( GTM_ATOM0_AGC_FUPD_CTRL_type *) 0xf0109058u)	/* TOM2 TGC1 Force Update Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HOST_TRIG      : 1;	/* Trigger request signal (see AGC) to update the register ENDIS_STAT and OUTEN_STAT */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
		unsigned int RST_CH0        : 1;	/* Software reset of channel 0 */
		unsigned int RST_CH1        : 1;	/* Software reset of channel 1 */
		unsigned int RST_CH2        : 1;	/* Software reset of channel 2 */
		unsigned int RST_CH3        : 1;	/* Software reset of channel 3 */
		unsigned int RST_CH4        : 1;	/* Software reset of channel 4 */
		unsigned int RST_CH5        : 1;	/* Software reset of channel 5 */
		unsigned int RST_CH6        : 1;	/* Software reset of channel 6 */
		unsigned int RST_CH7        : 1;	/* Software reset of channel 7 */
		unsigned int UPEN_CTRL0     : 2;	/* ATOM channel 0 enable update of register CM0, CM1 and CLK_SRC_STAT from SR0, SR1 and CLK_SRC */
		unsigned int UPEN_CTRL1     : 2;	/* ATOM channel 1 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL2     : 2;	/* ATOM channel 2 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL3     : 2;	/* ATOM channel 3 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL4     : 2;	/* ATOM channel 4 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL5     : 2;	/* ATOM channel 5 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL6     : 2;	/* ATOM channel 6 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL7     : 2;	/* ATOM channel 7 enable update of register CM0, CM1 and CLK_SRC_STAT */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_GLB_CTRL_type;
#define GTM_ATOM0_AGC_GLB_CTRL	(*( GTM_ATOM0_AGC_GLB_CTRL_type *) 0xf010d000u)	/* ATOM0 AGC Global control register */
#define GTM_ATOM1_AGC_GLB_CTRL	(*( GTM_ATOM0_AGC_GLB_CTRL_type *) 0xf010d800u)	/* ATOM1 AGC Global control register */
#define GTM_ATOM2_AGC_GLB_CTRL	(*( GTM_ATOM0_AGC_GLB_CTRL_type *) 0xf010e000u)	/* ATOM2 AGC Global control register */
#define GTM_ATOM3_AGC_GLB_CTRL	(*( GTM_ATOM0_AGC_GLB_CTRL_type *) 0xf010e800u)	/* ATOM3 AGC Global control register */
#define GTM_ATOM4_AGC_GLB_CTRL	(*( GTM_ATOM0_AGC_GLB_CTRL_type *) 0xf010f000u)	/* ATOM4 AGC Global control register */

typedef volatile union
{
	struct
	{ 
		unsigned int INT_TRIG0      : 2;	/* Select input signal TRIG_0 as a trigger source */
		unsigned int INT_TRIG1      : 2;	/* Select input signal TRIG_1 as a trigger source */
		unsigned int INT_TRIG2      : 2;	/* Select input signal TRIG_2 as a trigger source */
		unsigned int INT_TRIG3      : 2;	/* Select input signal TRIG_3 as a trigger source */
		unsigned int INT_TRIG4      : 2;	/* Select input signal TRIG_4 as a trigger source */
		unsigned int INT_TRIG5      : 2;	/* Select input signal TRIG_5 as a trigger source */
		unsigned int INT_TRIG6      : 2;	/* Select input signal TRIG_6 as a trigger source */
		unsigned int INT_TRIG7      : 2;	/* Select input signal TRIG_7 as a trigger source */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_INT_TRIG_type;
#define GTM_ATOM0_AGC_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010d01cu)	/* ATOM0 AGC Internal Trigger Control Register */
#define GTM_ATOM1_AGC_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010d81cu)	/* ATOM1 AGC Internal Trigger Control Register */
#define GTM_ATOM2_AGC_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010e01cu)	/* ATOM2 AGC Internal Trigger Control Register */
#define GTM_ATOM3_AGC_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010e81cu)	/* ATOM3 AGC Internal Trigger Control Register */
#define GTM_ATOM4_AGC_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010f01cu)	/* ATOM4 AGC Internal Trigger Control Register */
#define GTM_TOM0_TGC0_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010801cu)	/* TOM0 TGC0 Internal Trigger Control Register */
#define GTM_TOM0_TGC1_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010805cu)	/* TOM0 TGC1 Internal Trigger Control Register */
#define GTM_TOM1_TGC0_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010881cu)	/* TOM1 TGC0 Internal Trigger Control Register */
#define GTM_TOM1_TGC1_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010885cu)	/* TOM1 TGC1 Internal Trigger Control Register */
#define GTM_TOM2_TGC0_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010901cu)	/* TOM2 TGC0 Internal Trigger Control Register */
#define GTM_TOM2_TGC1_INT_TRIG	(*( GTM_ATOM0_AGC_INT_TRIG_type *) 0xf010905cu)	/* TOM2 TGC1 Internal Trigger Control Register */

