svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int OUTEN_CTRL0    : 2;	/* Output (A)TOM_OUT(0) enable/disable update value */
		unsigned int OUTEN_CTRL1    : 2;	/* Output (A)TOM_OUT(1)enable/disable update value */
		unsigned int OUTEN_CTRL2    : 2;	/* Output (A)TOM_OUT(2) enable/disable update value */
		unsigned int OUTEN_CTRL3    : 2;	/* Output (A)TOM_OUT(3) enable/disable update value */
		unsigned int OUTEN_CTRL4    : 2;	/* Output (A)TOM_OUT(4) enable/disable update value */
		unsigned int OUTEN_CTRL5    : 2;	/* Output (A)TOM_OUT(5) enable/disable update value */
		unsigned int OUTEN_CTRL6    : 2;	/* Output (A)TOM_OUT(6) enable/disable update value */
		unsigned int OUTEN_CTRL7    : 2;	/* Output (A)TOM_OUT(7) enable/disable update value */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_OUTEN_CTRL_type;
#define GTM_ATOM0_AGC_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf010d010u)	/* ATOM0 AGC Output Enable Control Register */
#define GTM_ATOM1_AGC_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf010d810u)	/* ATOM1 AGC Output Enable Control Register */
#define GTM_ATOM2_AGC_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf010e010u)	/* ATOM2 AGC Output Enable Control Register */
#define GTM_ATOM3_AGC_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf010e810u)	/* ATOM3 AGC Output Enable Control Register */
#define GTM_ATOM4_AGC_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf010f010u)	/* ATOM4 AGC Output Enable Control Register */
#define GTM_TOM0_TGC0_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf0108010u)	/* TOM0 TGC0 Output Enable Control Register */
#define GTM_TOM0_TGC1_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf0108050u)	/* TOM0 TGC1 Output Enable Control Register */
#define GTM_TOM1_TGC0_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf0108810u)	/* TOM1 TGC0 Output Enable Control Register */
#define GTM_TOM1_TGC1_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf0108850u)	/* TOM1 TGC1 Output Enable Control Register */
#define GTM_TOM2_TGC0_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf0109010u)	/* TOM2 TGC0 Output Enable Control Register */
#define GTM_TOM2_TGC1_OUTEN_CTRL	(*( GTM_ATOM0_AGC_OUTEN_CTRL_type *) 0xf0109050u)	/* TOM2 TGC1 Output Enable Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OUTEN_STAT0    : 2;	/* Control/status of output (A)TOM_OUT(0) */
		unsigned int OUTEN_STAT1    : 2;	/* Control/status of output (A)TOM_OUT(1) */
		unsigned int OUTEN_STAT2    : 2;	/* Control/status of output (A)TOM_OUT(2) */
		unsigned int OUTEN_STAT3    : 2;	/* Control/status of output (A)TOM_OUT(3) */
		unsigned int OUTEN_STAT4    : 2;	/* Control/status of output (A)TOM_OUT(4) */
		unsigned int OUTEN_STAT5    : 2;	/* Control/status of output (A)TOM_OUT(5) */
		unsigned int OUTEN_STAT6    : 2;	/* Control/status of output (A)TOM_OUT(6) */
		unsigned int OUTEN_STAT7    : 2;	/* Control/status of output (A)TOM_OUT(7) */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_AGC_OUTEN_STAT_type;
#define GTM_ATOM0_AGC_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf010d014u)	/* ATOM0 AGC Output Enable Status Register */
#define GTM_ATOM1_AGC_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf010d814u)	/* ATOM1 AGC Output Enable Status Register */
#define GTM_ATOM2_AGC_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf010e014u)	/* ATOM2 AGC Output Enable Status Register */
#define GTM_ATOM3_AGC_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf010e814u)	/* ATOM3 AGC Output Enable Status Register */
#define GTM_ATOM4_AGC_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf010f014u)	/* ATOM4 AGC Output Enable Status Register */
#define GTM_TOM0_TGC0_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf0108014u)	/* TOM0 TGC0 Output Enable Status Register */
#define GTM_TOM0_TGC1_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf0108054u)	/* TOM0 TGC1 Output Enable Status Register */
#define GTM_TOM1_TGC0_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf0108814u)	/* TOM1 TGC0 Output Enable Status Register */
#define GTM_TOM1_TGC1_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf0108854u)	/* TOM1 TGC1 Output Enable Status Register */
#define GTM_TOM2_TGC0_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf0109014u)	/* TOM2 TGC0 Output Enable Status Register */
#define GTM_TOM2_TGC1_OUTEN_STAT	(*( GTM_ATOM0_AGC_OUTEN_STAT_type *) 0xf0109054u)	/* TOM2 TGC1 Output Enable Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CM0            : 24;	/* ATOM CCU0 compare register */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_CM0_type;
#define GTM_ATOM0_CH0_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d090u)	/* ATOM0 Channel 0 CCU0 Compare Register */
#define GTM_ATOM0_CH1_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d110u)	/* ATOM0 Channel 1 CCU0 Compare Register */
#define GTM_ATOM0_CH2_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d190u)	/* ATOM0 Channel 2 CCU0 Compare Register */
#define GTM_ATOM0_CH3_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d210u)	/* ATOM0 Channel 3 CCU0 Compare Register */
#define GTM_ATOM0_CH4_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d290u)	/* ATOM0 Channel 4 CCU0 Compare Register */
#define GTM_ATOM0_CH5_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d310u)	/* ATOM0 Channel 5 CCU0 Compare Register */
#define GTM_ATOM0_CH6_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d390u)	/* ATOM0 Channel 6 CCU0 Compare Register */
#define GTM_ATOM0_CH7_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d410u)	/* ATOM0 Channel 7 CCU0 Compare Register */
#define GTM_ATOM1_CH0_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d890u)	/* ATOM1 Channel 0 CCU0 Compare Register */
#define GTM_ATOM1_CH1_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d910u)	/* ATOM1 Channel 1 CCU0 Compare Register */
#define GTM_ATOM1_CH2_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010d990u)	/* ATOM1 Channel 2 CCU0 Compare Register */
#define GTM_ATOM1_CH3_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010da10u)	/* ATOM1 Channel 3 CCU0 Compare Register */
#define GTM_ATOM1_CH4_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010da90u)	/* ATOM1 Channel 4 CCU0 Compare Register */
#define GTM_ATOM1_CH5_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010db10u)	/* ATOM1 Channel 5 CCU0 Compare Register */
#define GTM_ATOM1_CH6_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010db90u)	/* ATOM1 Channel 6 CCU0 Compare Register */
#define GTM_ATOM1_CH7_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010dc10u)	/* ATOM1 Channel 7 CCU0 Compare Register */
#define GTM_ATOM2_CH0_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e090u)	/* ATOM2 Channel 0 CCU0 Compare Register */
#define GTM_ATOM2_CH1_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e110u)	/* ATOM2 Channel 1 CCU0 Compare Register */
#define GTM_ATOM2_CH2_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e190u)	/* ATOM2 Channel 2 CCU0 Compare Register */
#define GTM_ATOM2_CH3_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e210u)	/* ATOM2 Channel 3 CCU0 Compare Register */
#define GTM_ATOM2_CH4_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e290u)	/* ATOM2 Channel 4 CCU0 Compare Register */
#define GTM_ATOM2_CH5_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e310u)	/* ATOM2 Channel 5 CCU0 Compare Register */
#define GTM_ATOM2_CH6_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e390u)	/* ATOM2 Channel 6 CCU0 Compare Register */
#define GTM_ATOM2_CH7_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e410u)	/* ATOM2 Channel 7 CCU0 Compare Register */
#define GTM_ATOM3_CH0_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e890u)	/* ATOM3 Channel 0 CCU0 Compare Register */
#define GTM_ATOM3_CH1_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e910u)	/* ATOM3 Channel 1 CCU0 Compare Register */
#define GTM_ATOM3_CH2_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010e990u)	/* ATOM3 Channel 2 CCU0 Compare Register */
#define GTM_ATOM3_CH3_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010ea10u)	/* ATOM3 Channel 3 CCU0 Compare Register */
#define GTM_ATOM3_CH4_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010ea90u)	/* ATOM3 Channel 4 CCU0 Compare Register */
#define GTM_ATOM3_CH5_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010eb10u)	/* ATOM3 Channel 5 CCU0 Compare Register */
#define GTM_ATOM3_CH6_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010eb90u)	/* ATOM3 Channel 6 CCU0 Compare Register */
#define GTM_ATOM3_CH7_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010ec10u)	/* ATOM3 Channel 7 CCU0 Compare Register */
#define GTM_ATOM4_CH0_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f090u)	/* ATOM4 Channel 0 CCU0 Compare Register */
#define GTM_ATOM4_CH1_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f110u)	/* ATOM4 Channel 1 CCU0 Compare Register */
#define GTM_ATOM4_CH2_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f190u)	/* ATOM4 Channel 2 CCU0 Compare Register */
#define GTM_ATOM4_CH3_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f210u)	/* ATOM4 Channel 3 CCU0 Compare Register */
#define GTM_ATOM4_CH4_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f290u)	/* ATOM4 Channel 4 CCU0 Compare Register */
#define GTM_ATOM4_CH5_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f310u)	/* ATOM4 Channel 5 CCU0 Compare Register */
#define GTM_ATOM4_CH6_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f390u)	/* ATOM4 Channel 6 CCU0 Compare Register */
#define GTM_ATOM4_CH7_CM0	(*( GTM_ATOM0_CH0_CM0_type *) 0xf010f410u)	/* ATOM4 Channel 7 CCU0 Compare Register */

