svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CM1            : 24;	/* ATOM CCU1 compare register */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_CM1_type;
#define GTM_ATOM0_CH0_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d098u)	/* ATOM0 Channel 0 CCU1 Compare Register */
#define GTM_ATOM0_CH1_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d118u)	/* ATOM0 Channel 1 CCU1 Compare Register */
#define GTM_ATOM0_CH2_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d198u)	/* ATOM0 Channel 2 CCU1 Compare Register */
#define GTM_ATOM0_CH3_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d218u)	/* ATOM0 Channel 3 CCU1 Compare Register */
#define GTM_ATOM0_CH4_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d298u)	/* ATOM0 Channel 4 CCU1 Compare Register */
#define GTM_ATOM0_CH5_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d318u)	/* ATOM0 Channel 5 CCU1 Compare Register */
#define GTM_ATOM0_CH6_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d398u)	/* ATOM0 Channel 6 CCU1 Compare Register */
#define GTM_ATOM0_CH7_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d418u)	/* ATOM0 Channel 7 CCU1 Compare Register */
#define GTM_ATOM1_CH0_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d898u)	/* ATOM1 Channel 0 CCU1 Compare Register */
#define GTM_ATOM1_CH1_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d918u)	/* ATOM1 Channel 1 CCU1 Compare Register */
#define GTM_ATOM1_CH2_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010d998u)	/* ATOM1 Channel 2 CCU1 Compare Register */
#define GTM_ATOM1_CH3_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010da18u)	/* ATOM1 Channel 3 CCU1 Compare Register */
#define GTM_ATOM1_CH4_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010da98u)	/* ATOM1 Channel 4 CCU1 Compare Register */
#define GTM_ATOM1_CH5_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010db18u)	/* ATOM1 Channel 5 CCU1 Compare Register */
#define GTM_ATOM1_CH6_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010db98u)	/* ATOM1 Channel 6 CCU1 Compare Register */
#define GTM_ATOM1_CH7_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010dc18u)	/* ATOM1 Channel 7 CCU1 Compare Register */
#define GTM_ATOM2_CH0_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e098u)	/* ATOM2 Channel 0 CCU1 Compare Register */
#define GTM_ATOM2_CH1_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e118u)	/* ATOM2 Channel 1 CCU1 Compare Register */
#define GTM_ATOM2_CH2_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e198u)	/* ATOM2 Channel 2 CCU1 Compare Register */
#define GTM_ATOM2_CH3_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e218u)	/* ATOM2 Channel 3 CCU1 Compare Register */
#define GTM_ATOM2_CH4_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e298u)	/* ATOM2 Channel 4 CCU1 Compare Register */
#define GTM_ATOM2_CH5_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e318u)	/* ATOM2 Channel 5 CCU1 Compare Register */
#define GTM_ATOM2_CH6_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e398u)	/* ATOM2 Channel 6 CCU1 Compare Register */
#define GTM_ATOM2_CH7_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e418u)	/* ATOM2 Channel 7 CCU1 Compare Register */
#define GTM_ATOM3_CH0_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e898u)	/* ATOM3 Channel 0 CCU1 Compare Register */
#define GTM_ATOM3_CH1_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e918u)	/* ATOM3 Channel 1 CCU1 Compare Register */
#define GTM_ATOM3_CH2_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010e998u)	/* ATOM3 Channel 2 CCU1 Compare Register */
#define GTM_ATOM3_CH3_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010ea18u)	/* ATOM3 Channel 3 CCU1 Compare Register */
#define GTM_ATOM3_CH4_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010ea98u)	/* ATOM3 Channel 4 CCU1 Compare Register */
#define GTM_ATOM3_CH5_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010eb18u)	/* ATOM3 Channel 5 CCU1 Compare Register */
#define GTM_ATOM3_CH6_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010eb98u)	/* ATOM3 Channel 6 CCU1 Compare Register */
#define GTM_ATOM3_CH7_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010ec18u)	/* ATOM3 Channel 7 CCU1 Compare Register */
#define GTM_ATOM4_CH0_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f098u)	/* ATOM4 Channel 0 CCU1 Compare Register */
#define GTM_ATOM4_CH1_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f118u)	/* ATOM4 Channel 1 CCU1 Compare Register */
#define GTM_ATOM4_CH2_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f198u)	/* ATOM4 Channel 2 CCU1 Compare Register */
#define GTM_ATOM4_CH3_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f218u)	/* ATOM4 Channel 3 CCU1 Compare Register */
#define GTM_ATOM4_CH4_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f298u)	/* ATOM4 Channel 4 CCU1 Compare Register */
#define GTM_ATOM4_CH5_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f318u)	/* ATOM4 Channel 5 CCU1 Compare Register */
#define GTM_ATOM4_CH6_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f398u)	/* ATOM4 Channel 6 CCU1 Compare Register */
#define GTM_ATOM4_CH7_CM1	(*( GTM_ATOM0_CH0_CM1_type *) 0xf010f418u)	/* ATOM4 Channel 7 CCU1 Compare Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CN0            : 24;	/* ATOM CCU0 counter register */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_CN0_type;
#define GTM_ATOM0_CH0_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d08cu)	/* ATOM0 Channel 0 CCU0 Counter Register */
#define GTM_ATOM0_CH1_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d10cu)	/* ATOM0 Channel 1 CCU0 Counter Register */
#define GTM_ATOM0_CH2_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d18cu)	/* ATOM0 Channel 2 CCU0 Counter Register */
#define GTM_ATOM0_CH3_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d20cu)	/* ATOM0 Channel 3 CCU0 Counter Register */
#define GTM_ATOM0_CH4_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d28cu)	/* ATOM0 Channel 4 CCU0 Counter Register */
#define GTM_ATOM0_CH5_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d30cu)	/* ATOM0 Channel 5 CCU0 Counter Register */
#define GTM_ATOM0_CH6_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d38cu)	/* ATOM0 Channel 6 CCU0 Counter Register */
#define GTM_ATOM0_CH7_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d40cu)	/* ATOM0 Channel 7 CCU0 Counter Register */
#define GTM_ATOM1_CH0_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d88cu)	/* ATOM1 Channel 0 CCU0 Counter Register */
#define GTM_ATOM1_CH1_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d90cu)	/* ATOM1 Channel 1 CCU0 Counter Register */
#define GTM_ATOM1_CH2_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010d98cu)	/* ATOM1 Channel 2 CCU0 Counter Register */
#define GTM_ATOM1_CH3_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010da0cu)	/* ATOM1 Channel 3 CCU0 Counter Register */
#define GTM_ATOM1_CH4_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010da8cu)	/* ATOM1 Channel 4 CCU0 Counter Register */
#define GTM_ATOM1_CH5_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010db0cu)	/* ATOM1 Channel 5 CCU0 Counter Register */
#define GTM_ATOM1_CH6_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010db8cu)	/* ATOM1 Channel 6 CCU0 Counter Register */
#define GTM_ATOM1_CH7_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010dc0cu)	/* ATOM1 Channel 7 CCU0 Counter Register */
#define GTM_ATOM2_CH0_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e08cu)	/* ATOM2 Channel 0 CCU0 Counter Register */
#define GTM_ATOM2_CH1_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e10cu)	/* ATOM2 Channel 1 CCU0 Counter Register */
#define GTM_ATOM2_CH2_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e18cu)	/* ATOM2 Channel 2 CCU0 Counter Register */
#define GTM_ATOM2_CH3_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e20cu)	/* ATOM2 Channel 3 CCU0 Counter Register */
#define GTM_ATOM2_CH4_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e28cu)	/* ATOM2 Channel 4 CCU0 Counter Register */
#define GTM_ATOM2_CH5_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e30cu)	/* ATOM2 Channel 5 CCU0 Counter Register */
#define GTM_ATOM2_CH6_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e38cu)	/* ATOM2 Channel 6 CCU0 Counter Register */
#define GTM_ATOM2_CH7_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e40cu)	/* ATOM2 Channel 7 CCU0 Counter Register */
#define GTM_ATOM3_CH0_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e88cu)	/* ATOM3 Channel 0 CCU0 Counter Register */
#define GTM_ATOM3_CH1_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e90cu)	/* ATOM3 Channel 1 CCU0 Counter Register */
#define GTM_ATOM3_CH2_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010e98cu)	/* ATOM3 Channel 2 CCU0 Counter Register */
#define GTM_ATOM3_CH3_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010ea0cu)	/* ATOM3 Channel 3 CCU0 Counter Register */
#define GTM_ATOM3_CH4_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010ea8cu)	/* ATOM3 Channel 4 CCU0 Counter Register */
#define GTM_ATOM3_CH5_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010eb0cu)	/* ATOM3 Channel 5 CCU0 Counter Register */
#define GTM_ATOM3_CH6_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010eb8cu)	/* ATOM3 Channel 6 CCU0 Counter Register */
#define GTM_ATOM3_CH7_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010ec0cu)	/* ATOM3 Channel 7 CCU0 Counter Register */
#define GTM_ATOM4_CH0_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f08cu)	/* ATOM4 Channel 0 CCU0 Counter Register */
#define GTM_ATOM4_CH1_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f10cu)	/* ATOM4 Channel 1 CCU0 Counter Register */
#define GTM_ATOM4_CH2_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f18cu)	/* ATOM4 Channel 2 CCU0 Counter Register */
#define GTM_ATOM4_CH3_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f20cu)	/* ATOM4 Channel 3 CCU0 Counter Register */
#define GTM_ATOM4_CH4_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f28cu)	/* ATOM4 Channel 4 CCU0 Counter Register */
#define GTM_ATOM4_CH5_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f30cu)	/* ATOM4 Channel 5 CCU0 Counter Register */
#define GTM_ATOM4_CH6_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f38cu)	/* ATOM4 Channel 6 CCU0 Counter Register */
#define GTM_ATOM4_CH7_CN0	(*( GTM_ATOM0_CH0_CN0_type *) 0xf010f40cu)	/* ATOM4 Channel 7 CCU0 Counter Register */

