svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MODE           : 2;	/* ATOM channel mode select */
		unsigned int TB12_SEL       : 1;	/* Select time base value TBU_TS1 or TBU_TS2. */
		unsigned int ARU_EN         : 1;	/* ARU Input stream enable */
		unsigned int ACB            : 5;	/* ATOM Mode control bits */
		unsigned int CMP_CTRL       : 1;	/* CCUx compare strategy select */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int SL             : 1;	/* Initial signal level */
		unsigned int CLK_SRC        : 3;	/* actual CMU clock source (SOMS)/ shadow register for CMU clock source (SOMP) */
		/* const */ unsigned int Reserved_9     : 1;	/* Reserved */
		unsigned int WR_REQ         : 1;	/* CPU Write request bit for late compare register update */
		/* const */ unsigned int Reserved_11    : 3;	/* Reserved */
		unsigned int RST_CCU0       : 1;	/* Reset source of CCU0 */
		/* const */ unsigned int Reserved_13    : 3;	/* Reserved */
		unsigned int TRIGOUT        : 1;	/* Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx. */
		unsigned int SLA            : 1;	/* Serve last ARU communication strategy */
		unsigned int OSM            : 1;	/* One-shot mode */
		unsigned int ABM            : 1;	/* ARU blocking mode */
		/* const */ unsigned int Reserved_18    : 4;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_CTRL_type;
#define GTM_ATOM0_CH0_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d080u)	/* ATOM0 Channel 0 Control Register */
#define GTM_ATOM0_CH1_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d100u)	/* ATOM0 Channel 1 Control Register */
#define GTM_ATOM0_CH2_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d180u)	/* ATOM0 Channel 2 Control Register */
#define GTM_ATOM0_CH3_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d200u)	/* ATOM0 Channel 3 Control Register */
#define GTM_ATOM0_CH4_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d280u)	/* ATOM0 Channel 4 Control Register */
#define GTM_ATOM0_CH5_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d300u)	/* ATOM0 Channel 5 Control Register */
#define GTM_ATOM0_CH6_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d380u)	/* ATOM0 Channel 6 Control Register */
#define GTM_ATOM0_CH7_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d400u)	/* ATOM0 Channel 7 Control Register */
#define GTM_ATOM1_CH0_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d880u)	/* ATOM1 Channel 0 Control Register */
#define GTM_ATOM1_CH1_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d900u)	/* ATOM1 Channel 1 Control Register */
#define GTM_ATOM1_CH2_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010d980u)	/* ATOM1 Channel 2 Control Register */
#define GTM_ATOM1_CH3_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010da00u)	/* ATOM1 Channel 3 Control Register */
#define GTM_ATOM1_CH4_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010da80u)	/* ATOM1 Channel 4 Control Register */
#define GTM_ATOM1_CH5_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010db00u)	/* ATOM1 Channel 5 Control Register */
#define GTM_ATOM1_CH6_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010db80u)	/* ATOM1 Channel 6 Control Register */
#define GTM_ATOM1_CH7_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010dc00u)	/* ATOM1 Channel 7 Control Register */
#define GTM_ATOM2_CH0_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e080u)	/* ATOM2 Channel 0 Control Register */
#define GTM_ATOM2_CH1_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e100u)	/* ATOM2 Channel 1 Control Register */
#define GTM_ATOM2_CH2_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e180u)	/* ATOM2 Channel 2 Control Register */
#define GTM_ATOM2_CH3_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e200u)	/* ATOM2 Channel 3 Control Register */
#define GTM_ATOM2_CH4_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e280u)	/* ATOM2 Channel 4 Control Register */
#define GTM_ATOM2_CH5_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e300u)	/* ATOM2 Channel 5 Control Register */
#define GTM_ATOM2_CH6_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e380u)	/* ATOM2 Channel 6 Control Register */
#define GTM_ATOM2_CH7_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e400u)	/* ATOM2 Channel 7 Control Register */
#define GTM_ATOM3_CH0_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e880u)	/* ATOM3 Channel 0 Control Register */
#define GTM_ATOM3_CH1_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e900u)	/* ATOM3 Channel 1 Control Register */
#define GTM_ATOM3_CH2_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010e980u)	/* ATOM3 Channel 2 Control Register */
#define GTM_ATOM3_CH3_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010ea00u)	/* ATOM3 Channel 3 Control Register */
#define GTM_ATOM3_CH4_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010ea80u)	/* ATOM3 Channel 4 Control Register */
#define GTM_ATOM3_CH5_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010eb00u)	/* ATOM3 Channel 5 Control Register */
#define GTM_ATOM3_CH6_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010eb80u)	/* ATOM3 Channel 6 Control Register */
#define GTM_ATOM3_CH7_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010ec00u)	/* ATOM3 Channel 7 Control Register */
#define GTM_ATOM4_CH0_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f080u)	/* ATOM4 Channel 0 Control Register */
#define GTM_ATOM4_CH1_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f100u)	/* ATOM4 Channel 1 Control Register */
#define GTM_ATOM4_CH2_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f180u)	/* ATOM4 Channel 2 Control Register */
#define GTM_ATOM4_CH3_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f200u)	/* ATOM4 Channel 3 Control Register */
#define GTM_ATOM4_CH4_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f280u)	/* ATOM4 Channel 4 Control Register */
#define GTM_ATOM4_CH5_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f300u)	/* ATOM4 Channel 5 Control Register */
#define GTM_ATOM4_CH6_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f380u)	/* ATOM4 Channel 6 Control Register */
#define GTM_ATOM4_CH7_CTRL	(*( GTM_ATOM0_CH0_CTRL_type *) 0xf010f400u)	/* ATOM4 Channel 7 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CCU0TC_IRQ_EN  : 1;	/* ATOM_CCU0TC_IRQ interrupt enable */
		unsigned int CCU1TC_IRQ_EN  : 1;	/* ATOM_CCU1TC_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_IRQ_EN_type;
#define GTM_ATOM0_CH0_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d0a4u)	/* ATOM0 Channel 0 Interrupt Enable Register */
#define GTM_ATOM0_CH1_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d124u)	/* ATOM0 Channel 1 Interrupt Enable Register */
#define GTM_ATOM0_CH2_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d1a4u)	/* ATOM0 Channel 2 Interrupt Enable Register */
#define GTM_ATOM0_CH3_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d224u)	/* ATOM0 Channel 3 Interrupt Enable Register */
#define GTM_ATOM0_CH4_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d2a4u)	/* ATOM0 Channel 4 Interrupt Enable Register */
#define GTM_ATOM0_CH5_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d324u)	/* ATOM0 Channel 5 Interrupt Enable Register */
#define GTM_ATOM0_CH6_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d3a4u)	/* ATOM0 Channel 6 Interrupt Enable Register */
#define GTM_ATOM0_CH7_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d424u)	/* ATOM0 Channel 7 Interrupt Enable Register */
#define GTM_ATOM1_CH0_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d8a4u)	/* ATOM1 Channel 0 Interrupt Enable Register */
#define GTM_ATOM1_CH1_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d924u)	/* ATOM1 Channel 1 Interrupt Enable Register */
#define GTM_ATOM1_CH2_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010d9a4u)	/* ATOM1 Channel 2 Interrupt Enable Register */
#define GTM_ATOM1_CH3_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010da24u)	/* ATOM1 Channel 3 Interrupt Enable Register */
#define GTM_ATOM1_CH4_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010daa4u)	/* ATOM1 Channel 4 Interrupt Enable Register */
#define GTM_ATOM1_CH5_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010db24u)	/* ATOM1 Channel 5 Interrupt Enable Register */
#define GTM_ATOM1_CH6_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010dba4u)	/* ATOM1 Channel 6 Interrupt Enable Register */
#define GTM_ATOM1_CH7_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010dc24u)	/* ATOM1 Channel 7 Interrupt Enable Register */
#define GTM_ATOM2_CH0_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e0a4u)	/* ATOM2 Channel 0 Interrupt Enable Register */
#define GTM_ATOM2_CH1_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e124u)	/* ATOM2 Channel 1 Interrupt Enable Register */
#define GTM_ATOM2_CH2_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e1a4u)	/* ATOM2 Channel 2 Interrupt Enable Register */
#define GTM_ATOM2_CH3_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e224u)	/* ATOM2 Channel 3 Interrupt Enable Register */
#define GTM_ATOM2_CH4_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e2a4u)	/* ATOM2 Channel 4 Interrupt Enable Register */
#define GTM_ATOM2_CH5_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e324u)	/* ATOM2 Channel 5 Interrupt Enable Register */
#define GTM_ATOM2_CH6_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e3a4u)	/* ATOM2 Channel 6 Interrupt Enable Register */
#define GTM_ATOM2_CH7_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e424u)	/* ATOM2 Channel 7 Interrupt Enable Register */
#define GTM_ATOM3_CH0_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e8a4u)	/* ATOM3 Channel 0 Interrupt Enable Register */
#define GTM_ATOM3_CH1_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e924u)	/* ATOM3 Channel 1 Interrupt Enable Register */
#define GTM_ATOM3_CH2_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010e9a4u)	/* ATOM3 Channel 2 Interrupt Enable Register */
#define GTM_ATOM3_CH3_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010ea24u)	/* ATOM3 Channel 3 Interrupt Enable Register */
#define GTM_ATOM3_CH4_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010eaa4u)	/* ATOM3 Channel 4 Interrupt Enable Register */
#define GTM_ATOM3_CH5_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010eb24u)	/* ATOM3 Channel 5 Interrupt Enable Register */
#define GTM_ATOM3_CH6_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010eba4u)	/* ATOM3 Channel 6 Interrupt Enable Register */
#define GTM_ATOM3_CH7_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010ec24u)	/* ATOM3 Channel 7 Interrupt Enable Register */
#define GTM_ATOM4_CH0_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f0a4u)	/* ATOM4 Channel 0 Interrupt Enable Register */
#define GTM_ATOM4_CH1_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f124u)	/* ATOM4 Channel 1 Interrupt Enable Register */
#define GTM_ATOM4_CH2_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f1a4u)	/* ATOM4 Channel 2 Interrupt Enable Register */
#define GTM_ATOM4_CH3_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f224u)	/* ATOM4 Channel 3 Interrupt Enable Register */
#define GTM_ATOM4_CH4_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f2a4u)	/* ATOM4 Channel 4 Interrupt Enable Register */
#define GTM_ATOM4_CH5_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f324u)	/* ATOM4 Channel 5 Interrupt Enable Register */
#define GTM_ATOM4_CH6_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f3a4u)	/* ATOM4 Channel 6 Interrupt Enable Register */
#define GTM_ATOM4_CH7_IRQ_EN	(*( GTM_ATOM0_CH0_IRQ_EN_type *) 0xf010f424u)	/* ATOM4 Channel 7 Interrupt Enable Register */

