svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TRG_CCU0TC     : 1;	/* Trigger ATOM_CCU0TC_IRQ interrupt by software */
		unsigned int TRG_CCU1TC     : 1;	/* Trigger ATOM_CCU1TC_IRQ interrupt by software */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_IRQ_FORCINT_type;
#define GTM_ATOM0_CH0_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d0a8u)	/* ATOM0 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM0_CH1_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d128u)	/* ATOM0 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM0_CH2_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d1a8u)	/* ATOM0 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM0_CH3_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d228u)	/* ATOM0 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM0_CH4_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d2a8u)	/* ATOM0 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM0_CH5_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d328u)	/* ATOM0 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM0_CH6_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d3a8u)	/* ATOM0 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM0_CH7_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d428u)	/* ATOM0 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM1_CH0_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d8a8u)	/* ATOM1 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM1_CH1_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d928u)	/* ATOM1 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM1_CH2_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010d9a8u)	/* ATOM1 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM1_CH3_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010da28u)	/* ATOM1 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM1_CH4_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010daa8u)	/* ATOM1 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM1_CH5_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010db28u)	/* ATOM1 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM1_CH6_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010dba8u)	/* ATOM1 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM1_CH7_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010dc28u)	/* ATOM1 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM2_CH0_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e0a8u)	/* ATOM2 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM2_CH1_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e128u)	/* ATOM2 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM2_CH2_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e1a8u)	/* ATOM2 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM2_CH3_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e228u)	/* ATOM2 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM2_CH4_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e2a8u)	/* ATOM2 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM2_CH5_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e328u)	/* ATOM2 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM2_CH6_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e3a8u)	/* ATOM2 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM2_CH7_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e428u)	/* ATOM2 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM3_CH0_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e8a8u)	/* ATOM3 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM3_CH1_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e928u)	/* ATOM3 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM3_CH2_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010e9a8u)	/* ATOM3 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM3_CH3_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010ea28u)	/* ATOM3 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM3_CH4_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010eaa8u)	/* ATOM3 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM3_CH5_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010eb28u)	/* ATOM3 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM3_CH6_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010eba8u)	/* ATOM3 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM3_CH7_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010ec28u)	/* ATOM3 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM4_CH0_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f0a8u)	/* ATOM4 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM4_CH1_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f128u)	/* ATOM4 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM4_CH2_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f1a8u)	/* ATOM4 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM4_CH3_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f228u)	/* ATOM4 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM4_CH4_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f2a8u)	/* ATOM4 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM4_CH5_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f328u)	/* ATOM4 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM4_CH6_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f3a8u)	/* ATOM4 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM4_CH7_IRQ_FORCINT	(*( GTM_ATOM0_CH0_IRQ_FORCINT_type *) 0xf010f428u)	/* ATOM4 Channel 7 Software Interrupt Generation Register */

