svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CCU0TC         : 1;	/* CCU0 Trigger condition interrupt for channel x */
		unsigned int CCU1TC         : 1;	/* CCU1 Trigger condition interrupt for channel x */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_IRQ_NOTIFY_type;
#define GTM_ATOM0_CH0_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d0a0u)	/* ATOM0 Channel 0 Interrupt Notification Register */
#define GTM_ATOM0_CH1_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d120u)	/* ATOM0 Channel 1 Interrupt Notification Register */
#define GTM_ATOM0_CH2_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d1a0u)	/* ATOM0 Channel 2 Interrupt Notification Register */
#define GTM_ATOM0_CH3_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d220u)	/* ATOM0 Channel 3 Interrupt Notification Register */
#define GTM_ATOM0_CH4_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d2a0u)	/* ATOM0 Channel 4 Interrupt Notification Register */
#define GTM_ATOM0_CH5_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d320u)	/* ATOM0 Channel 5 Interrupt Notification Register */
#define GTM_ATOM0_CH6_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d3a0u)	/* ATOM0 Channel 6 Interrupt Notification Register */
#define GTM_ATOM0_CH7_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d420u)	/* ATOM0 Channel 7 Interrupt Notification Register */
#define GTM_ATOM1_CH0_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d8a0u)	/* ATOM1 Channel 0 Interrupt Notification Register */
#define GTM_ATOM1_CH1_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d920u)	/* ATOM1 Channel 1 Interrupt Notification Register */
#define GTM_ATOM1_CH2_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010d9a0u)	/* ATOM1 Channel 2 Interrupt Notification Register */
#define GTM_ATOM1_CH3_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010da20u)	/* ATOM1 Channel 3 Interrupt Notification Register */
#define GTM_ATOM1_CH4_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010daa0u)	/* ATOM1 Channel 4 Interrupt Notification Register */
#define GTM_ATOM1_CH5_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010db20u)	/* ATOM1 Channel 5 Interrupt Notification Register */
#define GTM_ATOM1_CH6_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010dba0u)	/* ATOM1 Channel 6 Interrupt Notification Register */
#define GTM_ATOM1_CH7_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010dc20u)	/* ATOM1 Channel 7 Interrupt Notification Register */
#define GTM_ATOM2_CH0_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e0a0u)	/* ATOM2 Channel 0 Interrupt Notification Register */
#define GTM_ATOM2_CH1_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e120u)	/* ATOM2 Channel 1 Interrupt Notification Register */
#define GTM_ATOM2_CH2_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e1a0u)	/* ATOM2 Channel 2 Interrupt Notification Register */
#define GTM_ATOM2_CH3_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e220u)	/* ATOM2 Channel 3 Interrupt Notification Register */
#define GTM_ATOM2_CH4_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e2a0u)	/* ATOM2 Channel 4 Interrupt Notification Register */
#define GTM_ATOM2_CH5_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e320u)	/* ATOM2 Channel 5 Interrupt Notification Register */
#define GTM_ATOM2_CH6_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e3a0u)	/* ATOM2 Channel 6 Interrupt Notification Register */
#define GTM_ATOM2_CH7_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e420u)	/* ATOM2 Channel 7 Interrupt Notification Register */
#define GTM_ATOM3_CH0_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e8a0u)	/* ATOM3 Channel 0 Interrupt Notification Register */
#define GTM_ATOM3_CH1_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e920u)	/* ATOM3 Channel 1 Interrupt Notification Register */
#define GTM_ATOM3_CH2_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010e9a0u)	/* ATOM3 Channel 2 Interrupt Notification Register */
#define GTM_ATOM3_CH3_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010ea20u)	/* ATOM3 Channel 3 Interrupt Notification Register */
#define GTM_ATOM3_CH4_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010eaa0u)	/* ATOM3 Channel 4 Interrupt Notification Register */
#define GTM_ATOM3_CH5_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010eb20u)	/* ATOM3 Channel 5 Interrupt Notification Register */
#define GTM_ATOM3_CH6_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010eba0u)	/* ATOM3 Channel 6 Interrupt Notification Register */
#define GTM_ATOM3_CH7_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010ec20u)	/* ATOM3 Channel 7 Interrupt Notification Register */
#define GTM_ATOM4_CH0_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f0a0u)	/* ATOM4 Channel 0 Interrupt Notification Register */
#define GTM_ATOM4_CH1_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f120u)	/* ATOM4 Channel 1 Interrupt Notification Register */
#define GTM_ATOM4_CH2_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f1a0u)	/* ATOM4 Channel 2 Interrupt Notification Register */
#define GTM_ATOM4_CH3_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f220u)	/* ATOM4 Channel 3 Interrupt Notification Register */
#define GTM_ATOM4_CH4_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f2a0u)	/* ATOM4 Channel 4 Interrupt Notification Register */
#define GTM_ATOM4_CH5_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f320u)	/* ATOM4 Channel 5 Interrupt Notification Register */
#define GTM_ATOM4_CH6_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f3a0u)	/* ATOM4 Channel 6 Interrupt Notification Register */
#define GTM_ATOM4_CH7_IRQ_NOTIFY	(*( GTM_ATOM0_CH0_IRQ_NOTIFY_type *) 0xf010f420u)	/* ATOM4 Channel 7 Interrupt Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RDADDR0        : 9;	/* ARU Read address 0 */
		/* const */ unsigned int Reserved       : 7;	/* Read as zero, should be written as zero */
		unsigned int RDADDR1        : 9;	/* ARU Read address 1 */
		/* const */ unsigned int Reserved_4     : 7;	/* Reserved */
	} B;
	int I;
	unsigned int U;

