svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} GTM_ATOM0_CH0_RDADDR_type;
#define GTM_ATOM0_CH0_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d088u)	/* ATOM0 Channel 0 ARU Read Address Register */
#define GTM_ATOM0_CH1_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d108u)	/* ATOM0 Channel 1 ARU Read Address Register */
#define GTM_ATOM0_CH2_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d188u)	/* ATOM0 Channel 2 ARU Read Address Register */
#define GTM_ATOM0_CH3_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d208u)	/* ATOM0 Channel 3 ARU Read Address Register */
#define GTM_ATOM0_CH4_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d288u)	/* ATOM0 Channel 4 ARU Read Address Register */
#define GTM_ATOM0_CH5_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d308u)	/* ATOM0 Channel 5 ARU Read Address Register */
#define GTM_ATOM0_CH6_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d388u)	/* ATOM0 Channel 6 ARU Read Address Register */
#define GTM_ATOM0_CH7_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d408u)	/* ATOM0 Channel 7 ARU Read Address Register */
#define GTM_ATOM1_CH0_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d888u)	/* ATOM1 Channel 0 ARU Read Address Register */
#define GTM_ATOM1_CH1_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d908u)	/* ATOM1 Channel 1 ARU Read Address Register */
#define GTM_ATOM1_CH2_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010d988u)	/* ATOM1 Channel 2 ARU Read Address Register */
#define GTM_ATOM1_CH3_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010da08u)	/* ATOM1 Channel 3 ARU Read Address Register */
#define GTM_ATOM1_CH4_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010da88u)	/* ATOM1 Channel 4 ARU Read Address Register */
#define GTM_ATOM1_CH5_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010db08u)	/* ATOM1 Channel 5 ARU Read Address Register */
#define GTM_ATOM1_CH6_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010db88u)	/* ATOM1 Channel 6 ARU Read Address Register */
#define GTM_ATOM1_CH7_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010dc08u)	/* ATOM1 Channel 7 ARU Read Address Register */
#define GTM_ATOM2_CH0_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e088u)	/* ATOM2 Channel 0 ARU Read Address Register */
#define GTM_ATOM2_CH1_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e108u)	/* ATOM2 Channel 1 ARU Read Address Register */
#define GTM_ATOM2_CH2_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e188u)	/* ATOM2 Channel 2 ARU Read Address Register */
#define GTM_ATOM2_CH3_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e208u)	/* ATOM2 Channel 3 ARU Read Address Register */
#define GTM_ATOM2_CH4_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e288u)	/* ATOM2 Channel 4 ARU Read Address Register */
#define GTM_ATOM2_CH5_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e308u)	/* ATOM2 Channel 5 ARU Read Address Register */
#define GTM_ATOM2_CH6_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e388u)	/* ATOM2 Channel 6 ARU Read Address Register */
#define GTM_ATOM2_CH7_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e408u)	/* ATOM2 Channel 7 ARU Read Address Register */
#define GTM_ATOM3_CH0_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e888u)	/* ATOM3 Channel 0 ARU Read Address Register */
#define GTM_ATOM3_CH1_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e908u)	/* ATOM3 Channel 1 ARU Read Address Register */
#define GTM_ATOM3_CH2_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010e988u)	/* ATOM3 Channel 2 ARU Read Address Register */
#define GTM_ATOM3_CH3_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010ea08u)	/* ATOM3 Channel 3 ARU Read Address Register */
#define GTM_ATOM3_CH4_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010ea88u)	/* ATOM3 Channel 4 ARU Read Address Register */
#define GTM_ATOM3_CH5_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010eb08u)	/* ATOM3 Channel 5 ARU Read Address Register */
#define GTM_ATOM3_CH6_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010eb88u)	/* ATOM3 Channel 6 ARU Read Address Register */
#define GTM_ATOM3_CH7_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010ec08u)	/* ATOM3 Channel 7 ARU Read Address Register */
#define GTM_ATOM4_CH0_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f088u)	/* ATOM4 Channel 0 ARU Read Address Register */
#define GTM_ATOM4_CH1_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f108u)	/* ATOM4 Channel 1 ARU Read Address Register */
#define GTM_ATOM4_CH2_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f188u)	/* ATOM4 Channel 2 ARU Read Address Register */
#define GTM_ATOM4_CH3_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f208u)	/* ATOM4 Channel 3 ARU Read Address Register */
#define GTM_ATOM4_CH4_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f288u)	/* ATOM4 Channel 4 ARU Read Address Register */
#define GTM_ATOM4_CH5_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f308u)	/* ATOM4 Channel 5 ARU Read Address Register */
#define GTM_ATOM4_CH6_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f388u)	/* ATOM4 Channel 6 ARU Read Address Register */
#define GTM_ATOM4_CH7_RDADDR	(*( GTM_ATOM0_CH0_RDADDR_type *) 0xf010f408u)	/* ATOM4 Channel 7 ARU Read Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SR0            : 24;	/* ATOM channel x shadow register SR0 */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_SR0_type;
#define GTM_ATOM0_CH0_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d094u)	/* ATOM0 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH1_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d114u)	/* ATOM0 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH2_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d194u)	/* ATOM0 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH3_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d214u)	/* ATOM0 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH4_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d294u)	/* ATOM0 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH5_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d314u)	/* ATOM0 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH6_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d394u)	/* ATOM0 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM0_CH7_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d414u)	/* ATOM0 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH0_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d894u)	/* ATOM1 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH1_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d914u)	/* ATOM1 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH2_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010d994u)	/* ATOM1 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH3_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010da14u)	/* ATOM1 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH4_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010da94u)	/* ATOM1 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH5_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010db14u)	/* ATOM1 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH6_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010db94u)	/* ATOM1 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM1_CH7_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010dc14u)	/* ATOM1 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH0_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e094u)	/* ATOM2 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH1_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e114u)	/* ATOM2 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH2_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e194u)	/* ATOM2 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH3_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e214u)	/* ATOM2 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH4_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e294u)	/* ATOM2 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH5_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e314u)	/* ATOM2 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH6_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e394u)	/* ATOM2 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM2_CH7_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e414u)	/* ATOM2 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH0_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e894u)	/* ATOM3 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH1_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e914u)	/* ATOM3 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH2_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010e994u)	/* ATOM3 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH3_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010ea14u)	/* ATOM3 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH4_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010ea94u)	/* ATOM3 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH5_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010eb14u)	/* ATOM3 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH6_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010eb94u)	/* ATOM3 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM3_CH7_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010ec14u)	/* ATOM3 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f094u)	/* ATOM4 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f114u)	/* ATOM4 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f194u)	/* ATOM4 Channel 2 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f214u)	/* ATOM4 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f294u)	/* ATOM4 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f314u)	/* ATOM4 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f394u)	/* ATOM4 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR0	(*( GTM_ATOM0_CH0_SR0_type *) 0xf010f414u)	/* ATOM4 Channel 7 CCU0 Compare Shadow Register */

