svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SR1            : 24;	/* ATOM channel x shadow register SR0 */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_SR1_type;
#define GTM_ATOM0_CH0_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d09cu)	/* ATOM0 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH1_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d11cu)	/* ATOM0 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH2_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d19cu)	/* ATOM0 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH3_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d21cu)	/* ATOM0 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH4_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d29cu)	/* ATOM0 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH5_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d31cu)	/* ATOM0 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH6_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d39cu)	/* ATOM0 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM0_CH7_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d41cu)	/* ATOM0 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH0_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d89cu)	/* ATOM1 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH1_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d91cu)	/* ATOM1 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH2_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010d99cu)	/* ATOM1 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH3_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010da1cu)	/* ATOM1 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH4_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010da9cu)	/* ATOM1 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH5_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010db1cu)	/* ATOM1 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH6_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010db9cu)	/* ATOM1 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM1_CH7_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010dc1cu)	/* ATOM1 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH0_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e09cu)	/* ATOM2 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH1_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e11cu)	/* ATOM2 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH2_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e19cu)	/* ATOM2 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH3_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e21cu)	/* ATOM2 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH4_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e29cu)	/* ATOM2 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH5_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e31cu)	/* ATOM2 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH6_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e39cu)	/* ATOM2 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM2_CH7_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e41cu)	/* ATOM2 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH0_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e89cu)	/* ATOM3 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH1_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e91cu)	/* ATOM3 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH2_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010e99cu)	/* ATOM3 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH3_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010ea1cu)	/* ATOM3 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH4_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010ea9cu)	/* ATOM3 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH5_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010eb1cu)	/* ATOM3 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH6_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010eb9cu)	/* ATOM3 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM3_CH7_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010ec1cu)	/* ATOM3 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f09cu)	/* ATOM4 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f11cu)	/* ATOM4 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f19cu)	/* ATOM4 Channel 2 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f21cu)	/* ATOM4 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f29cu)	/* ATOM4 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f31cu)	/* ATOM4 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f39cu)	/* ATOM4 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR1	(*( GTM_ATOM0_CH0_SR1_type *) 0xf010f41cu)	/* ATOM4 Channel 7 CCU1 Compare Shadow Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OL             : 1;	/* Actual output signal level of ATOM_CHx_OUT */
		/* const */ unsigned int Reserved       : 15;	/* Reserved */
		/* const */ unsigned int ACBI           : 5;	/* ATOM Mode control bits received through ARU */
		/* const */ unsigned int DV             : 1;	/* Valid ARU Data stored in compare registers */
		unsigned int WRF            : 1;	/* Write request of CPU failed for late update */
		/* const */ unsigned int Reserved_6     : 1;	/* Reserved */
		/* const */ unsigned int ACBO           : 5;	/* ATOM Internal status bits */
		/* const */ unsigned int Reserved_8     : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ATOM0_CH0_STAT_type;
#define GTM_ATOM0_CH0_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d084u)	/* ATOM0 Channel 0 Status Register */
#define GTM_ATOM0_CH1_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d104u)	/* ATOM0 Channel 1 Status Register */
#define GTM_ATOM0_CH2_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d184u)	/* ATOM0 Channel 2 Status Register */
#define GTM_ATOM0_CH3_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d204u)	/* ATOM0 Channel 3 Status Register */
#define GTM_ATOM0_CH4_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d284u)	/* ATOM0 Channel 4 Status Register */
#define GTM_ATOM0_CH5_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d304u)	/* ATOM0 Channel 5 Status Register */
#define GTM_ATOM0_CH6_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d384u)	/* ATOM0 Channel 6 Status Register */
#define GTM_ATOM0_CH7_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d404u)	/* ATOM0 Channel 7 Status Register */
#define GTM_ATOM1_CH0_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d884u)	/* ATOM1 Channel 0 Status Register */
#define GTM_ATOM1_CH1_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d904u)	/* ATOM1 Channel 1 Status Register */
#define GTM_ATOM1_CH2_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010d984u)	/* ATOM1 Channel 2 Status Register */
#define GTM_ATOM1_CH3_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010da04u)	/* ATOM1 Channel 3 Status Register */
#define GTM_ATOM1_CH4_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010da84u)	/* ATOM1 Channel 4 Status Register */
#define GTM_ATOM1_CH5_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010db04u)	/* ATOM1 Channel 5 Status Register */
#define GTM_ATOM1_CH6_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010db84u)	/* ATOM1 Channel 6 Status Register */
#define GTM_ATOM1_CH7_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010dc04u)	/* ATOM1 Channel 7 Status Register */
#define GTM_ATOM2_CH0_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e084u)	/* ATOM2 Channel 0 Status Register */
#define GTM_ATOM2_CH1_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e104u)	/* ATOM2 Channel 1 Status Register */
#define GTM_ATOM2_CH2_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e184u)	/* ATOM2 Channel 2 Status Register */
#define GTM_ATOM2_CH3_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e204u)	/* ATOM2 Channel 3 Status Register */
#define GTM_ATOM2_CH4_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e284u)	/* ATOM2 Channel 4 Status Register */
#define GTM_ATOM2_CH5_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e304u)	/* ATOM2 Channel 5 Status Register */
#define GTM_ATOM2_CH6_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e384u)	/* ATOM2 Channel 6 Status Register */
#define GTM_ATOM2_CH7_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e404u)	/* ATOM2 Channel 7 Status Register */
#define GTM_ATOM3_CH0_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e884u)	/* ATOM3 Channel 0 Status Register */
#define GTM_ATOM3_CH1_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e904u)	/* ATOM3 Channel 1 Status Register */
#define GTM_ATOM3_CH2_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010e984u)	/* ATOM3 Channel 2 Status Register */
#define GTM_ATOM3_CH3_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010ea04u)	/* ATOM3 Channel 3 Status Register */
#define GTM_ATOM3_CH4_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010ea84u)	/* ATOM3 Channel 4 Status Register */
#define GTM_ATOM3_CH5_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010eb04u)	/* ATOM3 Channel 5 Status Register */
#define GTM_ATOM3_CH6_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010eb84u)	/* ATOM3 Channel 6 Status Register */
#define GTM_ATOM3_CH7_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010ec04u)	/* ATOM3 Channel 7 Status Register */
#define GTM_ATOM4_CH0_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f084u)	/* ATOM4 Channel 0 Status Register */
#define GTM_ATOM4_CH1_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f104u)	/* ATOM4 Channel 1 Status Register */
#define GTM_ATOM4_CH2_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f184u)	/* ATOM4 Channel 2 Status Register */
#define GTM_ATOM4_CH3_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f204u)	/* ATOM4 Channel 3 Status Register */
#define GTM_ATOM4_CH4_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f284u)	/* ATOM4 Channel 4 Status Register */
#define GTM_ATOM4_CH5_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f304u)	/* ATOM4 Channel 5 Status Register */
#define GTM_ATOM4_CH6_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f384u)	/* ATOM4 Channel 6 Status Register */
#define GTM_ATOM4_CH7_STAT	(*( GTM_ATOM0_CH0_STAT_type *) 0xf010f404u)	/* ATOM4 Channel 7 Status Register */

