svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int DEST_ERR_EN    : 1;	/* BRC_DEST_ERR_IRQ interrupt enable */
		unsigned int DID_ENx        : 12;	/* BRC_DID_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 19;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRC_IRQ_EN_type;
#define GTM_BRC_IRQ_EN	(*( GTM_BRC_IRQ_EN_type *) 0xf0100464u)	/* BRC Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG_DEST_ERR   : 1;	/* Trigger destination error interrupt */
		unsigned int TRG_DIDx       : 12;	/* Trigger data inconsistency error interrupt */
		/* const */ unsigned int Reserved       : 19;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRC_IRQ_FORCINT_type;
#define GTM_BRC_IRQ_FORCINT	(*( GTM_BRC_IRQ_FORCINT_type *) 0xf0100468u)	/* BRC_DEST_ERR Forcing Interrupt Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DEST_ERR       : 1;	/* Configuration error interrupt for BRC submodule */
		unsigned int DIDx           : 12;	/* Data inconsistency occurred in MTM mode */
		/* const */ unsigned int Reserved       : 19;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRC_IRQ_NOTIFY_type;
#define GTM_BRC_IRQ_NOTIFY	(*( GTM_BRC_IRQ_NOTIFY_type *) 0xf0100460u)	/* BRC Interrupt Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Software reset */
		/* const */ unsigned int Reserved       : 31;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRC_RST_type;
#define GTM_BRC_RST	(*( GTM_BRC_RST_type *) 0xf0100470u)	/* BRC Software Reset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 9;	/* Source ARU address */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
		unsigned int BRC_MODE       : 1;	/* BRC Operation mode select */
		/* const */ unsigned int Reserved_4     : 19;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRC_SRC0_ADDR_type;
#define GTM_BRC_SRC0_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100400u)	/* Read Address For Input Channel 0 */
#define GTM_BRC_SRC10_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100450u)	/* Read Address For Input Channel 10 */
#define GTM_BRC_SRC11_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100458u)	/* Read Address For Input Channel 11 */
#define GTM_BRC_SRC1_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100408u)	/* Read Address For Input Channel 1 */
#define GTM_BRC_SRC2_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100410u)	/* Read Address For Input Channel 2 */
#define GTM_BRC_SRC3_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100418u)	/* Read Address For Input Channel 3 */
#define GTM_BRC_SRC4_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100420u)	/* Read Address For Input Channel 4 */
#define GTM_BRC_SRC5_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100428u)	/* Read Address For Input Channel 5 */
#define GTM_BRC_SRC6_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100430u)	/* Read Address For Input Channel 6 */
#define GTM_BRC_SRC7_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100438u)	/* Read Address For Input Channel 7 */
#define GTM_BRC_SRC8_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100440u)	/* Read Address For Input Channel 8 */
#define GTM_BRC_SRC9_ADDR	(*( GTM_BRC_SRC0_ADDR_type *) 0xf0100448u)	/* Read Address For Input Channel 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int EN_DEST0       : 1;	/* Enable BRC destination address 0 */
		unsigned int EN_DEST1       : 1;	/* Enable BRC destination address 1 */
		unsigned int EN_DEST2       : 1;	/* Enable BRC destination address 2 */
		unsigned int EN_DEST3       : 1;	/* Enable BRC destination address 3 */
		unsigned int EN_DEST4       : 1;	/* Enable BRC destination address 4 */
		unsigned int EN_DEST5       : 1;	/* Enable BRC destination address 5 */
		unsigned int EN_DEST6       : 1;	/* Enable BRC destination address 6 */
		unsigned int EN_DEST7       : 1;	/* Enable BRC destination address 7 */
		unsigned int EN_DEST8       : 1;	/* Enable BRC destination address 8 */
		unsigned int EN_DEST9       : 1;	/* Enable BRC destination address 9 */
		unsigned int EN_DEST10      : 1;	/* Enable BRC destination address 10 */
		unsigned int EN_DEST11      : 1;	/* Enable BRC destination address 11 */
		unsigned int EN_DEST12      : 1;	/* Enable BRC destination address 12 */
		unsigned int EN_DEST13      : 1;	/* Enable BRC destination address 13 */
		unsigned int EN_DEST14      : 1;	/* Enable BRC destination address 14 */
		unsigned int EN_DEST15      : 1;	/* Enable BRC destination address 15 */
		unsigned int EN_DEST16      : 1;	/* Enable BRC destination address 16 */
		unsigned int EN_DEST17      : 1;	/* Enable BRC destination address 17 */
		unsigned int EN_DEST18      : 1;	/* Enable BRC destination address 18 */
		unsigned int EN_DEST19      : 1;	/* Enable BRC destination address 19 */
		unsigned int EN_DEST20      : 1;	/* Enable BRC destination address 20 */
		unsigned int EN_DEST21      : 1;	/* Enable BRC destination address 21 */
		unsigned int EN_TRASHBIN    : 1;	/* Control trash bin functionality */
		/* const */ unsigned int Reserved       : 9;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRC_SRC0_DEST_type;
#define GTM_BRC_SRC0_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf0100404u)	/* Destination Channels For Input Channel 0 */
#define GTM_BRC_SRC10_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf0100454u)	/* Destination Channels For Input Channel 10 */
#define GTM_BRC_SRC11_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf010045cu)	/* Destination Channels For Input Channel 11 */
#define GTM_BRC_SRC1_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf010040cu)	/* Destination Channels For Input Channel 1 */
#define GTM_BRC_SRC2_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf0100414u)	/* Destination Channels For Input Channel 2 */
#define GTM_BRC_SRC3_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf010041cu)	/* Destination Channels For Input Channel 3 */
#define GTM_BRC_SRC4_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf0100424u)	/* Destination Channels For Input Channel 4 */
#define GTM_BRC_SRC5_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf010042cu)	/* Destination Channels For Input Channel 5 */
#define GTM_BRC_SRC6_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf0100434u)	/* Destination Channels For Input Channel 6 */
#define GTM_BRC_SRC7_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf010043cu)	/* Destination Channels For Input Channel 7 */
#define GTM_BRC_SRC8_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf0100444u)	/* Destination Channels For Input Channel 8 */
#define GTM_BRC_SRC9_DEST	(*( GTM_BRC_SRC0_DEST_type *) 0xf010044cu)	/* Destination Channels For Input Channel 9 */

