svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int BRG_MODE       : 1;	/* Defines the operation mode for the AEI bridge */
		unsigned int MSK_WR_RSP     : 1;	/* Mask write response */
		unsigned int                : 6;
		/* const */ unsigned int MODE_UP_PGR    : 1;	/* Mode update in progress */
		unsigned int BUFF_OVL       : 1;	/* Buffer overflow register */
		/* const */ unsigned int Reserved       : 6;	/* Reserved */
		unsigned int BRG_RST        : 1;	/* Bridge software reset */
		/* const */ unsigned int Reserved_7     : 7;	/* Reserved */
		/* const */ unsigned int BUFF_DPT       : 8;	/* Buffer depth of AEI bridge */
	} B;
	int I;
	unsigned int U;

} GTM_BRIDGE_MODE_type;
#define GTM_BRIDGE_MODE	(*( GTM_BRIDGE_MODE_type *) 0xf0100030u)	/* GTM to SPB BRIDGE MODE */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NEW_TRAN_PTR   : 5;	/* New transaction pointer */
		/* const */ unsigned int FIRST_RSP_PTR  : 5;	/* First response pointer */
		/* const */ unsigned int TRAN_IN_PGR    : 5;	/* Transaction in progress pointer (aquire) */
		/* const */ unsigned int ABT_TRAN_PGR   : 5;	/* Aborted transaction in progress pointer */
		/* const */ unsigned int FBC            : 6;	/* Free buffer count */
		/* const */ unsigned int RSP_TRAN_RDY   : 6;	/* Response transactions ready */
	} B;
	int I;
	unsigned int U;

} GTM_BRIDGE_PTR1_type;
#define GTM_BRIDGE_PTR1	(*( GTM_BRIDGE_PTR1_type *) 0xf0100034u)	/* GTM to SPB BRIDGE PTR1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TRAN_IN_PGR2   : 5;	/* Transaction in progress pointer (aquire2) */
		/* const */ unsigned int Reserved       : 27;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_BRIDGE_PTR2_type;
#define GTM_BRIDGE_PTR2	(*( GTM_BRIDGE_PTR2_type *) 0xf0100038u)	/* GTM to SPB BRIDGE PTR2 */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 4;	/* Output Selection for (TT)CAN GTM connection */
		unsigned int SEL1           : 4;	/* Output Selection for (TT)CAN GTM connection */
		unsigned int SEL2           : 4;	/* Output Selection for CAN GTM connection */
		unsigned int SEL3           : 4;	/* Output Selection for CAN GTM connection */
		unsigned int SEL4           : 4;	/* Output Selection for CAN GTM connection */
		unsigned int SEL5           : 4;	/* Output Selection for CAN GTM connection */
		unsigned int SEL6           : 4;	/* Output Selection for CAN GTM connection */
		unsigned int SEL7           : 4;	/* Output Selection for CAN GTM connection */
	} B;
	int I;
	unsigned int U;

} GTM_CANOUTSEL_type;
#define GTM_CANOUTSEL	(*( GTM_CANOUTSEL_type *) 0xf019fda0u)	/* CAN Output Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} GTM_CLC_type;
#define GTM_CLC	(*( GTM_CLC_type *) 0xf019fd00u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ABWC0_EN       : 1;	/* Enable comparator 0 in ABWC */
		unsigned int ABWC1_EN       : 1;	/* Enable comparator 1 in ABWC */
		unsigned int ABWC2_EN       : 1;	/* Enable comparator 2 in ABWC */
		unsigned int ABWC3_EN       : 1;	/* Enable comparator 3 in ABWC */
		unsigned int ABWC4_EN       : 1;	/* Enable comparator 4 in ABWC */
		unsigned int ABWC5_EN       : 1;	/* Enable comparator 5 in ABWC */
		unsigned int ABWC6_EN       : 1;	/* Enable comparator 6 in ABWC */
		unsigned int ABWC7_EN       : 1;	/* Enable comparator 7 in ABWC */
		unsigned int ABWC8_EN       : 1;	/* Enable comparator 8 in ABWC */
		unsigned int ABWC9_EN       : 1;	/* Enable comparator 9 in ABW */
		unsigned int ABWC10_EN      : 1;	/* Enable comparator 10 in ABWC */
		unsigned int ABWC11_EN      : 1;	/* Enable comparator 11 in ABWC */
		unsigned int TBWC0_EN       : 1;	/* Enable comparator 0 in TBWC */
		unsigned int TBWC1_EN       : 1;	/* Enable comparator 1 in TBWC */
		unsigned int TBWC2_EN       : 1;	/* Enable comparator 2 in TBWC */
		unsigned int TBWC3_EN       : 1;	/* Enable comparator 3 in TBWC */
		unsigned int TBWC4_EN       : 1;	/* Enable comparator 4 in TBWC */
		unsigned int TBWC5_EN       : 1;	/* Enable comparator 5 in TBWC */
		unsigned int TBWC6_EN       : 1;	/* Enable comparator 6 in TBWC */
		unsigned int TBWC7_EN       : 1;	/* Enable comparator 7 in TBWC */
		unsigned int TBWC8_EN       : 1;	/* Enable comparator 8 in TBWC */
		unsigned int TBWC9_EN       : 1;	/* Enable comparator 9 in TBWC */
		unsigned int TBWC10_EN      : 1;	/* Enable comparator 10 in TBWC */
		unsigned int TBWC11_EN      : 1;	/* Enable comparator 11 in TBWC */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMP_EN_type;
#define GTM_CMP_EN	(*( GTM_CMP_EN_type *) 0xf0100200u)	/* CMP Comparator Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ABWC0_EN_IRQ   : 1;	/* Enable ABWC0 interrupt source for CMP_IRQ line */
		unsigned int ABWC1_EN_IRQ   : 1;	/* Enable ABWC1 interrupt source for CMP_IRQ line */
		unsigned int ABWC2_EN_IRQ   : 1;	/* Enable ABWC2 interrupt source for CMP_IRQ line */
		unsigned int ABWC3_EN_IRQ   : 1;	/* Enable ABWC3 interrupt source for CMP_IRQ line */
		unsigned int ABWC4_EN_IRQ   : 1;	/* Enable ABWC4 interrupt source for CMP_IRQ line */
		unsigned int ABWC5_EN_IRQ   : 1;	/* Enable ABWC5 interrupt source for CMP_IRQ line */
		unsigned int ABWC6_EN_IRQ   : 1;	/* Enable ABWC6 interrupt source for CMP_IRQ line */
		unsigned int ABWC7_EN_IRQ   : 1;	/* Enable ABWC7 interrupt source for CMP_IRQ line */
		unsigned int ABWC8_EN_IRQ   : 1;	/* Enable ABWC8 interrupt source for CMP_IRQ line */
		unsigned int ABWC9_EN_IRQ   : 1;	/* Enable ABWC9 interrupt source for CMP_IRQ line */
		unsigned int ABWC10_EN_IRQ  : 1;	/* Enable ABWC10 interrupt source for CMP_IRQ line */
		unsigned int ABWC11_EN_IRQ  : 1;	/* Enable ABWC11 interrupt source for CMP_IRQ line */
		unsigned int TBWC0_EN_IRQ   : 1;	/* Enable TBWC0 interrupt source for CMP_IRQ line */
		unsigned int TBWC1_EN_IRQ   : 1;	/* Enable TBWC1 interrupt source for CMP_IRQ line */
		unsigned int TBWC2_EN_IRQ   : 1;	/* Enable TBWC2 interrupt source for CMP_IRQ line */
		unsigned int TBWC3_EN_IRQ   : 1;	/* Enable TBWC3 interrupt source for CMP_IRQ line */
		unsigned int TBWC4_EN_IRQ   : 1;	/* Enable TBWC4 interrupt source for CMP_IRQ line */
		unsigned int TBWC5_EN_IRQ   : 1;	/* Enable TBWC5 interrupt source for CMP_IRQ line */
		unsigned int TBWC6_EN_IRQ   : 1;	/* Enable TBWC6 interrupt source for CMP_IRQ line */
		unsigned int TBWC7_EN_IRQ   : 1;	/* Enable TBWC7 interrupt source for CMP_IRQ line */
		unsigned int TBWC8_EN_IRQ   : 1;	/* Enable TBWC8 interrupt source for CMP_IRQ line */
		unsigned int TBWC9_EN_IRQ   : 1;	/* Enable TBWC9 interrupt source for CMP_IRQ line */
		unsigned int TBWC10_EN_IRQ  : 1;	/* Enable TBWC10 interrupt source for CMP_IRQ line */
		unsigned int TBWC11_EN_IRQ  : 1;	/* Enable TBWC11 interrupt source for CMP_IRQ line */
		unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMP_IRQ_EN_type;
#define GTM_CMP_IRQ_EN	(*( GTM_CMP_IRQ_EN_type *) 0xf0100208u)	/* CMP Interrupt Enable Register */

