svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TRG_ABWC0      : 1;	/* Trigger ABWC0 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC1      : 1;	/* Trigger ABWC1 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC2      : 1;	/* Trigger ABWC2 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC3      : 1;	/* Trigger ABWC3 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC4      : 1;	/* Trigger ABWC4 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC5      : 1;	/* Trigger ABWC5 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC6      : 1;	/* Trigger ABWC6 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC7      : 1;	/* Trigger ABWC7 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC8      : 1;	/* Trigger ABWC8 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC9      : 1;	/* Trigger ABWC9 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC10     : 1;	/* Trigger ABWC10 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_ABWC11     : 1;	/* Trigger ABWC11 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC0      : 1;	/* Trigger TBWC0 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC1      : 1;	/* Trigger TBWC1 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC2      : 1;	/* Trigger TBWC2 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC3      : 1;	/* Trigger TBWC3 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC4      : 1;	/* Trigger TBWC4 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC5      : 1;	/* Trigger TBWC5 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC6      : 1;	/* Trigger TBWC6 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC7      : 1;	/* Trigger TBWC7 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC8      : 1;	/* Trigger TBWC8 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC9      : 1;	/* Trigger TBWC9 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC10     : 1;	/* Trigger TBWC10 bit in CMP_IRQ_NOTIFY register by software */
		unsigned int TRG_TBWC11     : 1;	/* Trigger TBWC11 bit in CMP_IRQ_NOTIFY register by software */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMP_IRQ_FORCINT_type;
#define GTM_CMP_IRQ_FORCINT	(*( GTM_CMP_IRQ_FORCINT_type *) 0xf010020cu)	/* CMP Interrupt Force Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ABWC0          : 1;	/* ATOM sub modules outputs bitwise comparator 0 error indication */
		unsigned int ABWC1          : 1;	/* ATOM sub modules outputs bitwise comparator 1 error indication */
		unsigned int ABWC2          : 1;	/* ATOM sub modules outputs bitwise comparator 2 error indication */
		unsigned int ABWC3          : 1;	/* ATOM sub modules outputs bitwise comparator 3 error indication */
		unsigned int ABWC4          : 1;	/* ATOM sub modules outputs bitwise comparator 4 error indication */
		unsigned int ABWC5          : 1;	/* ATOM sub modules outputs bitwise comparator 5 error indication */
		unsigned int ABWC6          : 1;	/* ATOM sub modules outputs bitwise comparator 6 error indication */
		unsigned int ABWC7          : 1;	/* ATOM sub modules outputs bitwise comparator 7 error indication */
		unsigned int ABWC8          : 1;	/* ATOM sub modules outputs bitwise comparator 8 error indication */
		unsigned int ABWC9          : 1;	/* ATOM sub modules outputs bitwise comparator 9 error indication */
		unsigned int ABWC10         : 1;	/* ATOM sub modules outputs bitwise comparator 10 error indication */
		unsigned int ABWC11         : 1;	/* ATOM sub modules outputs bitwise comparator 11 error indication */
		unsigned int TBWC0          : 1;	/* TOM sub modules outputs bitwise comparator 0 error indication */
		unsigned int TBWC1          : 1;	/* TOM sub modules outputs bitwise comparator 1 error indication */
		unsigned int TBWC2          : 1;	/* TOM sub modules outputs bitwise comparator 2 error indication */
		unsigned int TBWC3          : 1;	/* TOM sub modules outputs bitwise comparator 3 error indication */
		unsigned int TBWC4          : 1;	/* TOM sub modules outputs bitwise comparator 4 error indication */
		unsigned int TBWC5          : 1;	/* TOM sub modules outputs bitwise comparator 5 error indication */
		unsigned int TBWC6          : 1;	/* TOM sub modules outputs bitwise comparator 6 error indication */
		unsigned int TBWC7          : 1;	/* TOM sub modules outputs bitwise comparator 7 error indication */
		unsigned int TBWC8          : 1;	/* TOM sub modules outputs bitwise comparator 8 error indication */
		unsigned int TBWC9          : 1;	/* TOM sub modules outputs bitwise comparator 9 error indication */
		unsigned int TBWC10         : 1;	/* TOM sub modules outputs bitwise comparator 10 error indication */
		unsigned int TBWC11         : 1;	/* TOM sub modules outputs bitwise comparator 11 error indication */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMP_IRQ_NOTIFY_type;
#define GTM_CMP_IRQ_NOTIFY	(*( GTM_CMP_IRQ_NOTIFY_type *) 0xf0100204u)	/* CMP Event Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLK_CNT        : 24;	/* Clock count Defines count value for the clock divider of clock source CMU_CLK[x] (x:0...4) */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_CLK_0_CTRL_type;
#define GTM_CMU_CLK_0_CTRL	(*( GTM_CMU_CLK_0_CTRL_type *) 0xf010030cu)	/* CMU Control For Clock Source 0 Register */
#define GTM_CMU_CLK_1_CTRL	(*( GTM_CMU_CLK_0_CTRL_type *) 0xf0100310u)	/* CMU Control For Clock Source 1 Register */
#define GTM_CMU_CLK_2_CTRL	(*( GTM_CMU_CLK_0_CTRL_type *) 0xf0100314u)	/* CMU Control For Clock Source 2 Register */
#define GTM_CMU_CLK_3_CTRL	(*( GTM_CMU_CLK_0_CTRL_type *) 0xf0100318u)	/* CMU Control For Clock Source 3 Register */
#define GTM_CMU_CLK_4_CTRL	(*( GTM_CMU_CLK_0_CTRL_type *) 0xf010031cu)	/* CMU Control For Clock Source 4 Register */

