svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CLK_CNT        : 24;	/* Clock count Defines count value for the clock divider of clock source CMU_CLK[5] */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
		unsigned int FXCLK_SEL      : 1;	/* Clock source selection for CMU_FXCLKs */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_CLK_5_CTRL_type;
#define GTM_CMU_CLK_5_CTRL	(*( GTM_CMU_CLK_5_CTRL_type *) 0xf0100320u)	/* CMU Control For Clock Source 5 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLK_CNT        : 24;	/* Clock count. Define count value for the clock divider of clock source CMU_CLK6 */
		unsigned int CLK6_SEL       : 1;	/* Clock source selection for CMU_CLK6 */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_CLK_6_CTRL_type;
#define GTM_CMU_CLK_6_CTRL	(*( GTM_CMU_CLK_6_CTRL_type *) 0xf0100324u)	/* CMU Control For Clock Source 6 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CLK_CNT        : 24;	/* Clock count. Define count value for the clock divider of clock source CMU_CLK7 */
		unsigned int CLK7_SEL       : 1;	/* Clock source selection for CMU_CLK7 */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_CLK_7_CTRL_type;
#define GTM_CMU_CLK_7_CTRL	(*( GTM_CMU_CLK_7_CTRL_type *) 0xf0100328u)	/* CMU Control For Clock Source 7 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EN_CLK0        : 2;	/* Enable clock source 0 */
		unsigned int EN_CLK1        : 2;	/* Enable clock source 1 */
		unsigned int EN_CLK2        : 2;	/* Enable clock source 2 */
		unsigned int EN_CLK3        : 2;	/* Enable clock source 3 */
		unsigned int EN_CLK4        : 2;	/* Enable clock source 4 */
		unsigned int EN_CLK5        : 2;	/* Enable clock source 5 */
		unsigned int EN_CLK6        : 2;	/* Enable clock source 6 */
		unsigned int EN_CLK7        : 2;	/* Enable clock source 7 */
		unsigned int EN_ECLK0       : 2;	/* Enable ECLK 0 generation subunit */
		unsigned int EN_ECLK1       : 2;	/* Enable ECLK 1 generation subunit */
		unsigned int EN_ECLK2       : 2;	/* Enable ECLK 2 generation subunit */
		unsigned int EN_FXCLK       : 2;	/* Enable all CMU_FXCLK */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_CLK_EN_type;
#define GTM_CMU_CLK_EN	(*( GTM_CMU_CLK_EN_type *) 0xf0100300u)	/* CMU Clock Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ECLK_DEN       : 24;	/* Denominator for external clock divider */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_ECLK_0_DEN_type;
#define GTM_CMU_ECLK_0_DEN	(*( GTM_CMU_ECLK_0_DEN_type *) 0xf0100330u)	/* CMU External Clock 0 Control Denominator Register */
#define GTM_CMU_ECLK_1_DEN	(*( GTM_CMU_ECLK_0_DEN_type *) 0xf0100338u)	/* CMU External Clock 1 Control Denominator Register */
#define GTM_CMU_ECLK_2_DEN	(*( GTM_CMU_ECLK_0_DEN_type *) 0xf0100340u)	/* CMU External Clock 2 Control Denominator Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ECLK_NUM       : 24;	/* Numerator for external clock divider */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_ECLK_0_NUM_type;
#define GTM_CMU_ECLK_0_NUM	(*( GTM_CMU_ECLK_0_NUM_type *) 0xf010032cu)	/* CMU External Clock 0 Control Numerator Register */
#define GTM_CMU_ECLK_1_NUM	(*( GTM_CMU_ECLK_0_NUM_type *) 0xf0100334u)	/* CMU External Clock 1 Control Numerator Register */
#define GTM_CMU_ECLK_2_NUM	(*( GTM_CMU_ECLK_0_NUM_type *) 0xf010033cu)	/* CMU External Clock 2 Control Numerator Register */

typedef volatile union
{
	struct
	{ 
		unsigned int GCLK_DEN       : 24;	/* Denominator for global clock divider */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_GCLK_DEN_type;
#define GTM_CMU_GCLK_DEN	(*( GTM_CMU_GCLK_DEN_type *) 0xf0100308u)	/* CMU Global Clock Control Denominator Register */

typedef volatile union
{
	struct
	{ 
		unsigned int GCLK_NUM       : 24;	/* Numerator for global clock divider */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CMU_GCLK_NUM_type;
#define GTM_CMU_GCLK_NUM	(*( GTM_CMU_GCLK_NUM_type *) 0xf0100304u)	/* CMU Global Clock Control Numerator Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RF_PROT        : 1;	/* RST and FORCINT protection */
		unsigned int TO_MODE        : 1;	/* AEI Timeout mode */
		/* const */ unsigned int Reserved       : 2;	/* Reserved */
		unsigned int TO_VAL         : 5;	/* AEI Timeout value */
		/* const */ unsigned int Reserved_5     : 23;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_CTRL_type;
#define GTM_CTRL	(*( GTM_CTRL_type *) 0xf0100008u)	/* GTM Global Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ACBj_0         : 5;	/* Action Control Bits of ACTION_i */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
		unsigned int ACBj_1         : 5;	/* Action Control Bits of ACTION_(i + 1), reflects ACT_D[i+1](5248) */
		/* const */ unsigned int Reserved_4     : 3;	/* Reserved */
		unsigned int ACBj_2         : 5;	/* Action Control Bits of ACTION_(i + 2), reflects ACT_D[i+2](5248) */
		/* const */ unsigned int Reserved_6     : 3;	/* Reserved */
		unsigned int ACBj_3         : 5;	/* Action Control Bits of ACTION_(i + 3), reflects ACT_D[i+3](5248) */
		/* const */ unsigned int Reserved_8     : 3;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_ACB_0_type;
#define GTM_DPLL_ACB_0	(*( GTM_DPLL_ACB_0_type *) 0xf01281c0u)	/* Control Bits For Actions Register i */
#define GTM_DPLL_ACB_1	(*( GTM_DPLL_ACB_0_type *) 0xf01281c4u)	/* Control Bits For Actions Register i */
#define GTM_DPLL_ACB_2	(*( GTM_DPLL_ACB_0_type *) 0xf01281c8u)	/* Control Bits For Actions Register i */
#define GTM_DPLL_ACB_3	(*( GTM_DPLL_ACB_0_type *) 0xf01281ccu)	/* Control Bits For Actions Register i */
#define GTM_DPLL_ACB_4	(*( GTM_DPLL_ACB_0_type *) 0xf01281d0u)	/* Control Bits For Actions Register i */
#define GTM_DPLL_ACB_5	(*( GTM_DPLL_ACB_0_type *) 0xf01281d4u)	/* Control Bits For Actions Register i */

