svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ACT_Ni         : 24;	/* New output data values concerning to action i provided */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_ACT_STA_type;
#define GTM_DPLL_ACT_STA	(*( GTM_DPLL_ACT_STA_type *) 0xf0128018u)	/* DPLL ACTION Status Register With Shadow Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int AOSV_2a        : 8;	/* Address offset value of the RAM 2a region */
		/* const */ unsigned int AOSV_2b        : 8;	/* Address offset value of the RAM 2b region */
		/* const */ unsigned int AOSV_2c        : 8;	/* Address offset value of the RAM 2c region */
		/* const */ unsigned int AOSV_2d        : 8;	/* Address offset value of the RAM 2d region */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_AOSV_2_type;
#define GTM_DPLL_AOSV_2	(*( GTM_DPLL_AOSV_2_type *) 0xf0128020u)	/* DPLL Address Offset Register For APT In RAM Region 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int WAPS           : 1;	/* Write bit for address pointer APS */
		unsigned int APS            : 6;	/* Address pointer STATE */
		/* const */ unsigned int Reserved_4     : 5;	/* Reserved */
		unsigned int WAPS_1c2       : 1;	/* Write bit for address pointer APS_1c2 */
		unsigned int APS_1c2        : 6;	/* Address pointer STATE for RAM region 1c2 */
		/* const */ unsigned int Reserved_7     : 12;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_APS_type;
#define GTM_DPLL_APS	(*( GTM_DPLL_APS_type *) 0xf0128028u)	/* DPLL Actual RAM Pointer to RAM Regions 1c1, 1c2 and 1c4 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 2;	/* Reserved */
		unsigned int APS_1c3        : 6;	/* Address pointer STATE for RAM region 1c3 */
		/* const */ unsigned int Reserved_3     : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_APS_1c3_type;
#define GTM_DPLL_APS_1c3	(*( GTM_DPLL_APS_1c3_type *) 0xf0128030u)	/* DPLL Actual RAM Pointer to RAM Region 1c3 */

typedef volatile union
{
	struct
	{ 
		unsigned int APS_1c2_ext    : 6;	/* Address pointer 1c2 extension */
		unsigned int APS_1c2_status : 1;	/* Address pointer 1c2 status */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
		unsigned int APS_1c2_old    : 6;	/* Address pointer STATE for RAM region 1c2 at synchronization time */
		/* const */ unsigned int Reserved_5     : 12;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_APS_SYNC_type;
#define GTM_DPLL_APS_SYNC	(*( GTM_DPLL_APS_SYNC_type *) 0xf01280bcu)	/* DPLL Old RAM Pointer and Offset Value for STATE */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int WAPT           : 1;	/* Write bit for address pointer APT */
		unsigned int APT            : 10;	/* Address pointer TRIGGER */
		/* const */ unsigned int Reserved_4     : 1;	/* Reserved */
		unsigned int WAPT_2b        : 1;	/* Write bit for address pointer APT_2b */
		unsigned int APT_2b         : 10;	/* Address pointer TRIGGER for RAM region 2b */
		/* const */ unsigned int Reserved_7     : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_APT_type;
#define GTM_DPLL_APT	(*( GTM_DPLL_APT_type *) 0xf0128024u)	/* DPLL Actual RAM Pointer to RAM Regions 2a, b and d */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 2;	/* Reserved */
		unsigned int APT_2c         : 10;	/* Address pointer TRIGGER for RAM region 2c */
		/* const */ unsigned int Reserved_3     : 20;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_APT_2c_type;
#define GTM_DPLL_APT_2c	(*( GTM_DPLL_APT_2c_type *) 0xf012802cu)	/* DPLL Actual RAM Pointer to RAM Region 2c */

typedef volatile union
{
	struct
	{ 
		unsigned int APT_2b_ext     : 6;	/* Address pointer 2b extension */
		unsigned int APT_2b_status  : 1;	/* Address pointer 2b status */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
		unsigned int APT_2b_old     : 10;	/* Address pointer TRIGGER for RAM region 2b at synchronization time */
		/* const */ unsigned int Reserved_5     : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_APT_SYNC_type;
#define GTM_DPLL_APT_SYNC	(*( GTM_DPLL_APT_SYNC_type *) 0xf01280b8u)	/* DPLL Old RAM Pointer and Offset Value for TRIGGER */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DMO            : 1;	/* DPLL mode select */
		/* const */ unsigned int DEN            : 1;	/* DPLL enable */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		/* const */ unsigned int COA            : 1;	/* Correction strategy in automatic end mode (DMO=0) */
		/* const */ unsigned int PIT            : 1;	/* Plausibility */
		/* const */ unsigned int SGE1           : 1;	/* SUB_INC1 generator enable */
		/* const */ unsigned int DLM1           : 1;	/* Direct Load Mode */
		/* const */ unsigned int PCM1           : 1;	/* Pulse Correction Mode */
		/* const */ unsigned int SGE2           : 1;	/* SUB_INC2 generator enable */
		/* const */ unsigned int DLM2           : 1;	/* Direct Load Mode */
		/* const */ unsigned int PCM2           : 1;	/* Pulse Correction Mode */
		/* const */ unsigned int SYN_NS         : 5;	/* Synchronization number of STATE */
		/* const */ unsigned int SYN_NT         : 5;	/* Synchronization number of TRIGGER */
		/* const */ unsigned int Reserved_14    : 2;	/* Reserved */
		/* const */ unsigned int SWR            : 1;	/* Software Reset */
		/* const */ unsigned int SYSF           : 1;	/* SYN_NS for FULL_SCALE */
		/* const */ unsigned int TS0_HRS        : 1;	/* Time stamp high resolution STATE */
		/* const */ unsigned int TS0_HRT        : 1;	/* Time stamp high resolution TRIGGER */
		/* const */ unsigned int SMC            : 1;	/* Synchronous Motor Control */
		/* const */ unsigned int SSL            : 2;	/* STATE slope select */
		/* const */ unsigned int TSL            : 2;	/* TRIGGER slope selected */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CRTL_1_SHADOW_STATE_type;
#define GTM_DPLL_CRTL_1_SHADOW_STATE	(*( GTM_DPLL_CRTL_1_SHADOW_STATE_type *) 0xf01281ecu)	/* DPLL Control 1 Shadow STATE Register */
#define GTM_DPLL_CTRL_1_SHADOW_TRIGGER	(*( GTM_DPLL_CRTL_1_SHADOW_STATE_type *) 0xf01281e8u)	/* DPLL Control 1 Shadow TRIGGER Register */

