svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MLT            : 10;	/* Multiplier for TRIGGER */
		unsigned int IFP            : 1;	/* Input filter position */
		unsigned int SNU            : 5;	/* STATE number */
		unsigned int TNU            : 9;	/* TRIGGER number */
		unsigned int AMS            : 1;	/* Adapt mode STATE */
		unsigned int AMT            : 1;	/* Adapt mode TRIGGER */
		unsigned int IDS            : 1;	/* Input delay STATE */
		unsigned int IDT            : 1;	/* Input delay TRIGGER */
		unsigned int SEN            : 1;	/* STATE enable */
		unsigned int TEN            : 1;	/* TRIGGER enable */
		unsigned int RMO            : 1;	/* Reference mode */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_0_type;
#define GTM_DPLL_CTRL_0	(*( GTM_DPLL_CTRL_0_type *) 0xf0128000u)	/* DPLL Control Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MLT            : 10;	/* Multipler for TRIGGER */
		/* const */ unsigned int IFP            : 1;	/* Input filter position */
		/* const */ unsigned int SNU            : 5;	/* STATE number */
		/* const */ unsigned int TNU            : 9;	/* TRIGGER number */
		/* const */ unsigned int AMS            : 1;	/* Adapt mode STATE */
		/* const */ unsigned int AMT            : 1;	/* Adapt mode TRIGGER */
		/* const */ unsigned int IDS            : 1;	/* Input delay STATE */
		/* const */ unsigned int IDT            : 1;	/* Input delay TRIGGER */
		/* const */ unsigned int SEN            : 1;	/* STATE enable */
		/* const */ unsigned int TEN            : 1;	/* TRIGGER enable */
		/* const */ unsigned int RMO            : 1;	/* Reference mode; selection of the relevant the input signal for generation of SUB_INC1 */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_0_SHADOW_STATE_type;
#define GTM_DPLL_CTRL_0_SHADOW_STATE	(*( GTM_DPLL_CTRL_0_SHADOW_STATE_type *) 0xf01281e4u)	/* DPLL Control 0 Shadow STATE Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MLT            : 10;	/* multipler for TRIGGER */
		/* const */ unsigned int IFP            : 1;	/* Input filter position */
		/* const */ unsigned int SNU            : 5;	/* STATE number */
		/* const */ unsigned int TNU            : 9;	/* TRIGGER number */
		/* const */ unsigned int AMS            : 1;	/* Adapt mode STATE */
		/* const */ unsigned int AMT            : 1;	/* Adapt mode TRIGGER */
		/* const */ unsigned int IDS            : 1;	/* Input delay STATE */
		/* const */ unsigned int IDT            : 1;	/* Input delay TRIGGER */
		/* const */ unsigned int SEN            : 1;	/* STATE enable */
		/* const */ unsigned int TEN            : 1;	/* TRIGGER enable */
		/* const */ unsigned int RMO            : 1;	/* Reference mode */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_0_SHADOW_TRIGGER_type;
#define GTM_DPLL_CTRL_0_SHADOW_TRIGGER	(*( GTM_DPLL_CTRL_0_SHADOW_TRIGGER_type *) 0xf01281e0u)	/* DPLL Control0 Shadow Trigger Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DMO            : 1;	/* DPLL mode select */
		unsigned int DEN            : 1;	/* DPLL enable */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int COA            : 1;	/* Correction strategy in automatic end mode (DMO=0) */
		unsigned int PIT            : 1;	/* Plausibility value PVT to next valid TRIGGER is time related */
		unsigned int SGE1           : 1;	/* SUB_INC1 generator enable */
		unsigned int DLM1           : 1;	/* Direct Load Mode for SUB_INC1 generation */
		unsigned int PCM1           : 1;	/* Pulse Correction Mode for SUB_INC1 generation */
		unsigned int SGE2           : 1;	/* SUB_INC2 generator enable */
		unsigned int DLM2           : 1;	/* Direct Load Mode for SUB_INC2 generation */
		unsigned int PCM2           : 1;	/* Pulse Correction Mode for SUB_INC2 generation */
		unsigned int SYN_NS         : 5;	/* Synchronization number of STATE */
		unsigned int SYN_NT         : 5;	/* Synchronization number of TRIGGER */
		/* const */ unsigned int Reserved_14    : 2;	/* Reserved */
		unsigned int SWR            : 1;	/* Software Reset */
		unsigned int SYSF           : 1;	/* SYN_NS for FULL_SCALE */
		unsigned int TS0_HRS        : 1;	/* TS0_HRS */
		unsigned int TS0_HRT        : 1;	/* TS0_HRT */
		unsigned int SMC            : 1;	/* Synchronous Motor Control */
		unsigned int SSL            : 2;	/* STATE slope select */
		unsigned int TSL            : 2;	/* Definition of active slope for signal TRIGGER each active slope is an event defined by TNU */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_1_type;
#define GTM_DPLL_CTRL_1	(*( GTM_DPLL_CTRL_1_type *) 0xf0128004u)	/* DPLL Control Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
		unsigned int AEN0           : 1;	/* ACTION_0 enable */
		unsigned int AEN1           : 1;	/* ACTION_1 enable */
		unsigned int AEN2           : 1;	/* ACTION_2 enable */
		unsigned int AEN3           : 1;	/* ACTION_3 enable */
		unsigned int AEN4           : 1;	/* ACTION_4 enable */
		unsigned int AEN5           : 1;	/* ACTION_5 enable */
		unsigned int AEN6           : 1;	/* ACTION_6 enable */
		unsigned int AEN7           : 1;	/* ACTION_7 enable */
		unsigned int WAD0           : 1;	/* Write control bit of Action_0 */
		unsigned int WAD1           : 1;	/* Write control bit of Action_1 */
		unsigned int WAD2           : 1;	/* Write control bit of Action_2 */
		unsigned int WAD3           : 1;	/* Write control bit of Action_3 */
		unsigned int WAD4           : 1;	/* Write control bit of Action_4 */
		unsigned int WAD5           : 1;	/* Write control bit of Action_5 */
		unsigned int WAD6           : 1;	/* Write control bit of Action_6 */
		unsigned int WAD7           : 1;	/* Write control bit of Action_7 */
		/* const */ unsigned int Reserved_18    : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_2_type;
#define GTM_DPLL_CTRL_2	(*( GTM_DPLL_CTRL_2_type *) 0xf0128008u)	/* DPLL Control Register 2 */

