svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
		unsigned int AEN8           : 1;	/* ACTION_8 enable */
		unsigned int AEN9           : 1;	/* ACTION_9 enable */
		unsigned int AEN10          : 1;	/* ACTION_10enable */
		unsigned int AEN11          : 1;	/* ACTION_11 enable */
		unsigned int AEN12          : 1;	/* ACTION_12 enable */
		unsigned int AEN13          : 1;	/* ACTION_13 enable */
		unsigned int AEN14          : 1;	/* ACTION_14 enable */
		unsigned int AEN15          : 1;	/* ACTION_15 enable */
		unsigned int WAD8           : 1;	/* Write control bit of Action_8 */
		unsigned int WAD9           : 1;	/* Write control bit of Action_9 */
		unsigned int WAD10          : 1;	/* Write control bit of Action_10 */
		unsigned int WAD11          : 1;	/* Write control bit of Action_11 */
		unsigned int WAD12          : 1;	/* Write control bit of Action_12 */
		unsigned int WAD13          : 1;	/* Write control bit of Action_13 */
		unsigned int WAD14          : 1;	/* Write control bit of Action_14 */
		unsigned int WAD15          : 1;	/* Write control bit of Action_15 */
		/* const */ unsigned int Reserved_18    : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_3_type;
#define GTM_DPLL_CTRL_3	(*( GTM_DPLL_CTRL_3_type *) 0xf012800cu)	/* DPLL Control Register 3 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
		unsigned int AEN16          : 1;	/* ACTION_16 enable */
		unsigned int AEN17          : 1;	/* ACTION_17 enable */
		unsigned int AEN18          : 1;	/* ACTION_18 enable */
		unsigned int AEN19          : 1;	/* ACTION_19 enable */
		unsigned int AEN20          : 1;	/* ACTION_20 enable */
		unsigned int AEN21          : 1;	/* ACTION_21 enable */
		unsigned int AEN22          : 1;	/* ACTION_22 enable */
		unsigned int AEN23          : 1;	/* ACTION_23 enable */
		unsigned int WAD16          : 1;	/* Write control bit of Action_16 */
		unsigned int WAD17          : 1;	/* Write control bit of Action_17 */
		unsigned int WAD18          : 1;	/* Write control bit of Action_18 */
		unsigned int WAD19          : 1;	/* Write control bit of Action_19 */
		unsigned int WAD20          : 1;	/* Write control bit of Action_20 */
		unsigned int WAD21          : 1;	/* Write control bit of Action_21 */
		unsigned int WAD22          : 1;	/* Write control bit of Action_22 */
		unsigned int WAD23          : 1;	/* Write control bit of Action_23 */
		/* const */ unsigned int Reserved_18    : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_CTRL_4_type;
#define GTM_DPLL_CTRL_4	(*( GTM_DPLL_CTRL_4_type *) 0xf0128010u)	/* DPLL Control Register 4 */

typedef volatile union
{
	struct
	{ 
		unsigned int ID_PMTR_x      : 9;	/* ID information to the input signal PMTR_x from the ARU */
		/* const */ unsigned int Reserved       : 23;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_ID_PMTR_0_type;
#define GTM_DPLL_ID_PMTR_0	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128050u)	/* DPLL ID Information For Input Signal PMTR 0 Register */
#define GTM_DPLL_ID_PMTR_1	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128054u)	/* DPLL ID Information For Input Signal PMTR 1 Register */
#define GTM_DPLL_ID_PMTR_10	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128078u)	/* DPLL ID Information For Input Signal PMTR 10 Register */
#define GTM_DPLL_ID_PMTR_11	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf012807cu)	/* DPLL ID Information For Input Signal PMTR 11 Register */
#define GTM_DPLL_ID_PMTR_12	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128080u)	/* DPLL ID Information For Input Signal PMTR 12 Register */
#define GTM_DPLL_ID_PMTR_13	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128084u)	/* DPLL ID Information For Input Signal PMTR 13 Register */
#define GTM_DPLL_ID_PMTR_14	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128088u)	/* DPLL ID Information For Input Signal PMTR 14 Register */
#define GTM_DPLL_ID_PMTR_15	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf012808cu)	/* DPLL ID Information For Input Signal PMTR 15 Register */
#define GTM_DPLL_ID_PMTR_16	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128090u)	/* DPLL ID Information For Input Signal PMTR 16 Register */
#define GTM_DPLL_ID_PMTR_17	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128094u)	/* DPLL ID Information For Input Signal PMTR 17 Register */
#define GTM_DPLL_ID_PMTR_18	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128098u)	/* DPLL ID Information For Input Signal PMTR 18 Register */
#define GTM_DPLL_ID_PMTR_19	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf012809cu)	/* DPLL ID Information For Input Signal PMTR 19 Register */
#define GTM_DPLL_ID_PMTR_2	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128058u)	/* DPLL ID Information For Input Signal PMTR 2 Register */
#define GTM_DPLL_ID_PMTR_20	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf01280a0u)	/* DPLL ID Information For Input Signal PMTR 20 Register */
#define GTM_DPLL_ID_PMTR_21	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf01280a4u)	/* DPLL ID Information For Input Signal PMTR 21 Register */
#define GTM_DPLL_ID_PMTR_22	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf01280a8u)	/* DPLL ID Information For Input Signal PMTR 22 Register */
#define GTM_DPLL_ID_PMTR_23	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf01280acu)	/* DPLL ID Information For Input Signal PMTR 23 Register */
#define GTM_DPLL_ID_PMTR_3	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf012805cu)	/* DPLL ID Information For Input Signal PMTR 3 Register */
#define GTM_DPLL_ID_PMTR_4	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128060u)	/* DPLL ID Information For Input Signal PMTR 4 Register */
#define GTM_DPLL_ID_PMTR_5	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128064u)	/* DPLL ID Information For Input Signal PMTR 5 Register */
#define GTM_DPLL_ID_PMTR_6	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128068u)	/* DPLL ID Information For Input Signal PMTR 6 Register */
#define GTM_DPLL_ID_PMTR_7	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf012806cu)	/* DPLL ID Information For Input Signal PMTR 7 Register */
#define GTM_DPLL_ID_PMTR_8	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128070u)	/* DPLL ID Information For Input Signal PMTR 8 Register */
#define GTM_DPLL_ID_PMTR_9	(*( GTM_DPLL_ID_PMTR_0_type *) 0xf0128074u)	/* DPLL ID Information For Input Signal PMTR 9 Register */

