svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int INC_CNT1       : 24;	/* Actual number of pulses to be still sent out at the current increment until the next valid input signal in automatic end mode */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_INC_CNT1_type;
#define GTM_DPLL_INC_CNT1	(*( GTM_DPLL_INC_CNT1_type *) 0xf01280b0u)	/* DPLL Counter for Pulses for TBU_TS1 to be sent in Automatic End Mode */

typedef volatile union
{
	struct
	{ 
		unsigned int INC_CNT2       : 24;	/* Actual number of pulses to be still sent out at the current increment until the next valid input signal in automatic end mode */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_INC_CNT2_type;
#define GTM_DPLL_INC_CNT2	(*( GTM_DPLL_INC_CNT2_type *) 0xf01280b4u)	/* DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End Mode when SMC=RMO=1 */

typedef volatile union
{
	struct
	{ 
		unsigned int PDI_IRQ_EN     : 1;	/* DPLL disable interrupt enable, when switch off of the DEN bit */
		unsigned int PEI_IRQ_EN     : 1;	/* DPLL enable interrupt enable, when switch on of the DEN bit */
		unsigned int TINI_IRQ_EN    : 1;	/* TRIGGER minimum hold time violation interrupt enable bit */
		unsigned int TAXI_IRQ_EN    : 1;	/* TRIGGER maximum hold time violation interrupt enable bit */
		unsigned int SISI_IRQ_EN    : 1;	/* STATE inactive slope interrupt enable bit */
		unsigned int TISI_IRQ_EN    : 1;	/* TRIGGER inactive slope interrupt enable bit */
		unsigned int MSI_IRQ_EN     : 1;	/* Missing STATE interrupt enable */
		unsigned int MTI_IRQ_EN     : 1;	/* Missing TRIGGER interrupt enable */
		unsigned int SASI_IRQ_EN    : 1;	/* STATE active slope interrupt enable */
		unsigned int TASI_IRQ_EN    : 1;	/* TRIGGER active slope interrupt enable */
		unsigned int PWI_IRQ_EN     : 1;	/* Plausibility window (PVT) violation interrupt of TRIGGER enable */
		unsigned int W2I_IRQ_EN     : 1;	/* RAM write access to RAM region 2 interrupt enable */
		unsigned int W1I_IRQ_EN     : 1;	/* Write access to RAM region 1b or 1c interrupt */
		unsigned int GL1I_IRQ_EN    : 1;	/* Get of lock interrupt enable, when lock arises */
		unsigned int LL1I_IRQ_EN    : 1;	/* Lost of lock interrupt enable */
		unsigned int EI_IRQ_EN      : 1;	/* Error interrupt enable (see status register) */
		unsigned int GL2I_IRQ_EN    : 1;	/* Get of lock interrupt enable for SUB_INC2 */
		unsigned int LL2I_IRQ_EN    : 1;	/* Lost of lock interrupt enable for SUB_INC2 */
		unsigned int TE0I_IRQ_EN    : 1;	/* TRIGGER event interrupt 0 enable */
		unsigned int TE1I_IRQ_EN    : 1;	/* TRIGGER event interrupt 1 enable */
		unsigned int TE2I_IRQ_EN    : 1;	/* TRIGGER event interrupt 2 enable */
		unsigned int TE3I_IRQ_EN    : 1;	/* TRIGGER event interrupt 3 enable */
		unsigned int TE4I_IRQ_EN    : 1;	/* TRIGGER event interrupt 4 enable */
		unsigned int CDTI_IRQ_EN    : 1;	/* Enable interrupt when calculation of TRIGGER duration done */
		unsigned int CDSI_IRQ_EN    : 1;	/* Enable interrupt when calculation of TRIGGER duration done */
		unsigned int TORI           : 1;	/* TRIGGER out of range interrupt */
		unsigned int SORI           : 1;	/* STATE out of range */
		unsigned int DCGI           : 1;	/* Direction change interrupt */
		/* const */ unsigned int Reserved       : 4;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_IRQ_EN_type;
#define GTM_DPLL_IRQ_EN	(*( GTM_DPLL_IRQ_EN_type *) 0xf0128044u)	/* DPLL Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG_PDI        : 1;	/* Force Interrupt PDI */
		unsigned int TRG_PEI        : 1;	/* Force Interrupt PEI */
		unsigned int TRG_TINI       : 1;	/* Force Interrupt TINI */
		unsigned int TRG_TAXI       : 1;	/* Force Interrupt TAXI */
		unsigned int TRG_SISI       : 1;	/* Force Interrupt SISI */
		unsigned int TRG_TISI       : 1;	/* Force Interrupt TISI */
		unsigned int TRG_MSI        : 1;	/* Force Interrupt MSI */
		unsigned int TRG_MTI        : 1;	/* Force Interrupt MTI */
		unsigned int TRG_SASI       : 1;	/* Force Interrupt SASI */
		unsigned int TRG_TASI       : 1;	/* Force Interrupt TASI */
		unsigned int TRG_PWI        : 1;	/* Force Interrupt PWI */
		unsigned int TRG_W2I        : 1;	/* Force Interrupt W2IF */
		unsigned int TRG_W1I        : 1;	/* Force Interrupt W1I */
		unsigned int TRG_GL1I       : 1;	/* Force Interrupt GL1I */
		unsigned int TRG_LL1I       : 1;	/* Force Interrupt LL1I */
		unsigned int TRG_EI         : 1;	/* Force Interrupt EI */
		unsigned int TRG_GL2I       : 1;	/* Force Interrupt GL2I */
		unsigned int TRG_LL2I       : 1;	/* Force Interrupt LL2I */
		unsigned int TRG_TE0I       : 1;	/* Force Interrupt TE0I */
		unsigned int TRG_TE1I       : 1;	/* Force Interrupt TE1I */
		unsigned int TRG_TE2I       : 1;	/* Force Interrupt TE2I */
		unsigned int TRG_TE3I       : 1;	/* Force Interrupt TE3I */
		unsigned int TRG_TE4I       : 1;	/* Force Interrupt TE4I */
		unsigned int TRG_CDTI       : 1;	/* Force Interrupt CDTI */
		unsigned int TRG_CDSI       : 1;	/* Force Interrupt CDSI */
		unsigned int TRG_TORI       : 1;	/* Force Interrupt TORI */
		unsigned int TRG_SORI       : 1;	/* Force Interrupt SORI */
		/* const */ unsigned int Reserved       : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_IRQ_FORCINT_type;
#define GTM_DPLL_IRQ_FORCINT	(*( GTM_DPLL_IRQ_FORCINT_type *) 0xf0128048u)	/* DPLL Interrupt Force Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PDI            : 1;	/* DPLL disable interrupt */
		unsigned int PEI            : 1;	/* DPLL enable interrupt */
		unsigned int TINI           : 1;	/* TRIGGER minimum hold time violation interrupt (?T) */
		unsigned int TAXI           : 1;	/* TRIGGER maximum hold time violation interrupt (?T'gt'THMA'gt'0) */
		unsigned int SISI           : 1;	/* STATE inactive slope interrupt */
		unsigned int TISI           : 1;	/* TRIGGER inactive slope interrupt */
		unsigned int MSI            : 1;	/* Missing STATE interrupt */
		unsigned int MTI            : 1;	/* Missing TRIGGER interrupt */
		unsigned int SASI           : 1;	/* STATE active slope interrupt */
		unsigned int TASI           : 1;	/* TRIGGER active slope interrupt */
		unsigned int PWI            : 1;	/* Plausibility window (PVT) violation interrupt of TRIGGER */
		unsigned int W2I            : 1;	/* RAM write access to RAM region 2 interrupt */
		unsigned int W1I            : 1;	/* Write access to RAM region 1b or 1c interrupt */
		unsigned int GL1I           : 1;	/* Get of lock interrupt, for SUB_INC1 */
		unsigned int LL1I           : 1;	/* Lost of lock interrupt for SUB_INC1 */
		unsigned int EI             : 1;	/* Error interrupt (see status register bit 31) */
		unsigned int GL2I           : 1;	/* Get of lock interrupt, for SUB_INC2 */
		unsigned int LL2I           : 1;	/* Lost of lock interrupt for SUB_INC2 */
		unsigned int TE0I           : 1;	/* TRIGGER event interrupt 0 */
		unsigned int TE1I           : 1;	/* TRIGGER event interrupt 1 */
		unsigned int TE2I           : 1;	/* TRIGGER event interrupt 2 */
		unsigned int TE3I           : 1;	/* TRIGGER event interrupt 3 */
		unsigned int TE4I           : 1;	/* TRIGGER event interrupt 4 */
		unsigned int CDTI           : 1;	/* Calculation of TRIGGER duration done, only while NTI_CNT is zero */
		unsigned int CDSI           : 1;	/* Calculation of STATE duration done */
		unsigned int TORI           : 1;	/* TRIGGER out of range interrupt */
		unsigned int SORI           : 1;	/* STATE out of range */
		unsigned int DCGI           : 1;	/* Direction change interrupt */
		/* const */ unsigned int Reserved       : 4;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_IRQ_NOTIFY_type;
#define GTM_DPLL_IRQ_NOTIFY	(*( GTM_DPLL_IRQ_NOTIFY_type *) 0xf0128040u)	/* DPLL Interrupt Notification Register */

