svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int NTI_CNT        : 10;	/* Number of TRIGGERs to interrupt */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_NTI_CNT_type;
#define GTM_DPLL_NTI_CNT	(*( GTM_DPLL_NTI_CNT_type *) 0xf012803cu)	/* DPLL Number of Active TRIGGER Events to Interrupt */

typedef volatile union
{
	struct
	{ 
		unsigned int NUSE           : 6;	/* Number of recent STATE events used for SUB_INCx calculations modulo 2*(SNUmax+1) */
		unsigned int FSS            : 1;	/* this value is to be set, when NUSE is set to FULL_SCALE */
		unsigned int SYN_S          : 6;	/* Number of real and virtual events to be considered for the current increment */
		unsigned int SYN_S_old      : 6;	/* Number of real and virtual events to be considered for the last increment */
		unsigned int VSN            : 6;	/* Virtual STATE number */
		/* const */ unsigned int Reserved       : 4;	/* Reserved */
		unsigned int WNUS           : 1;	/* Write control bit for NUSE; read as zero */
		unsigned int WSYN           : 1;	/* Write control bit for SYN_S and SYN_S_old; read as zero */
		unsigned int WVSN           : 1;	/* Write control bit for VSN; read as zero */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_NUSC_type;
#define GTM_DPLL_NUSC	(*( GTM_DPLL_NUSC_type *) 0xf0128038u)	/* DPLL Number of Recent STATE Events Used for Calculations */

typedef volatile union
{
	struct
	{ 
		unsigned int NUTE           : 10;	/* Number of recent TRIGGER events used for SUB_INC1 and action calculations modulo 2*(TNUmax+1) */
		unsigned int FST            : 1;	/* this value is to be set, when NUTE is set to FULL_SCALE */
		/* const */ unsigned int Reserved       : 2;	/* Reserved */
		unsigned int SYN_T          : 3;	/* Number of real and virtual events to be considered for the current increment */
		unsigned int SYN_T_old      : 3;	/* Number of real and virtual events to be considered for the last increment */
		unsigned int VTN            : 6;	/* Virtual TRIGGER number */
		/* const */ unsigned int Reserved_7     : 4;	/* Reserved */
		unsigned int WNUT           : 1;	/* Write control bit for NUTE */
		unsigned int WSYN           : 1;	/* Write control bit for SYN_T and SYN_T_old */
		unsigned int WVTN           : 1;	/* Write control bit for VTN */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_NUTC_type;
#define GTM_DPLL_NUTC	(*( GTM_DPLL_NUTC_type *) 0xf0128034u)	/* DPLL Number of Recent TRIGGER Events Used for Calculations */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SWON_S         : 1;	/* Switch of new STATE */
		/* const */ unsigned int SWON_T         : 1;	/* Switch of new TRIGGER */
		/* const */ unsigned int Reserved       : 6;	/* Reserved */
		unsigned int OSS            : 2;	/* Offset size of RAM region 2 */
		/* const */ unsigned int Reserved_5     : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_OSW_type;
#define GTM_DPLL_OSW	(*( GTM_DPLL_OSW_type *) 0xf012801cu)	/* DPLL Offset And Switch Old/New Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PSAC           : 24;	/* Calculated position value for the start of ACTION_i in normal or emergency mode according to equations 1617 or 1620 respectively */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_PSAC_0_type;
#define GTM_DPLL_PSAC_0	(*( GTM_DPLL_PSAC_0_type *) 0xf0128160u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_1	(*( GTM_DPLL_PSAC_0_type *) 0xf0128164u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_10	(*( GTM_DPLL_PSAC_0_type *) 0xf0128188u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_11	(*( GTM_DPLL_PSAC_0_type *) 0xf012818cu)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_12	(*( GTM_DPLL_PSAC_0_type *) 0xf0128190u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_13	(*( GTM_DPLL_PSAC_0_type *) 0xf0128194u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_14	(*( GTM_DPLL_PSAC_0_type *) 0xf0128198u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_15	(*( GTM_DPLL_PSAC_0_type *) 0xf012819cu)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_16	(*( GTM_DPLL_PSAC_0_type *) 0xf01281a0u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_17	(*( GTM_DPLL_PSAC_0_type *) 0xf01281a4u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_18	(*( GTM_DPLL_PSAC_0_type *) 0xf01281a8u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_19	(*( GTM_DPLL_PSAC_0_type *) 0xf01281acu)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_2	(*( GTM_DPLL_PSAC_0_type *) 0xf0128168u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_20	(*( GTM_DPLL_PSAC_0_type *) 0xf01281b0u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_21	(*( GTM_DPLL_PSAC_0_type *) 0xf01281b4u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_22	(*( GTM_DPLL_PSAC_0_type *) 0xf01281b8u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_23	(*( GTM_DPLL_PSAC_0_type *) 0xf01281bcu)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_3	(*( GTM_DPLL_PSAC_0_type *) 0xf012816cu)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_4	(*( GTM_DPLL_PSAC_0_type *) 0xf0128170u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_5	(*( GTM_DPLL_PSAC_0_type *) 0xf0128174u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_6	(*( GTM_DPLL_PSAC_0_type *) 0xf0128178u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_7	(*( GTM_DPLL_PSAC_0_type *) 0xf012817cu)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_8	(*( GTM_DPLL_PSAC_0_type *) 0xf0128180u)	/* Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC_9	(*( GTM_DPLL_PSAC_0_type *) 0xf0128184u)	/* Calculated Position Value for ACTION_i Register */

