svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int INIT_1a        : 1;	/* RAM region 1a initialization in progress */
		/* const */ unsigned int INIT_1b        : 1;	/* RAM region 1b initialization in progress */
		/* const */ unsigned int INIT_2         : 1;	/* RAM region 2 initialization in progress */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int INIT_RAM       : 1;	/* RAM regions 1a, 1b and 2 are to be initialized */
		/* const */ unsigned int Reserved_6     : 27;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_RAM_INI_type;
#define GTM_DPLL_RAM_INI	(*( GTM_DPLL_RAM_INI_type *) 0xf01281fcu)	/* DPLL RAM Initatlisation Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CSON           : 1;	/* Calculated STATE duration overflow nominal */
		unsigned int CSO            : 1;	/* Calculated STATE duration overflow */
		unsigned int CTON           : 1;	/* Calculated TRIGGER duration overflow nominal */
		unsigned int CTO            : 1;	/* Calculated TRIGGER duration overflow */
		unsigned int CRO            : 1;	/* Calculated Reciprocal value overflow */
		/* const */ unsigned int RCS            : 1;	/* Resolution conflict STATE */
		/* const */ unsigned int RCT            : 1;	/* Resolution conflict TRIGGER */
		/* const */ unsigned int PSE            : 1;	/* Prediction space configuration error */
		unsigned int SOR            : 1;	/* STATE out of range The SOR Bit is set, when the time to the next active STATE slope exceeds the value of the last nominal STATE duration multiplied with the value of the SLR register (see ) and is reset, when at the current or last valid input event a direction change was detected. */
		unsigned int MS             : 1;	/* Missing STATE detected */
		unsigned int TOR            : 1;	/* TRIGGER out of range The TOR Bit is set, when the time to the next active TRIGGER slope exceeds the value of the last nominal TRIGGER duration multiplied with the value of the TLR register (see ) and is reset, when at the current or last vaild input event a direction change was detected. The DPLL_STATUS register is reset, when DPLL is disabled (switching DEN from 1 for 0). */
		unsigned int MT             : 1;	/* Missing TRIGGER detected */
		unsigned int RAM2_ERR       : 1;	/* DPLL internal access to not configured RAM2 memory */
		/* const */ unsigned int Reserved       : 2;	/* Reserved */
		/* const */ unsigned int LOW_RES        : 1;	/* Low resolution of TBU_TS0 is used for DPLL input */
		/* const */ unsigned int CSVS           : 1;	/* Current signal value STATE */
		/* const */ unsigned int CSVT           : 1;	/* Current signal value TRIGGER */
		/* const */ unsigned int CAIP2          : 1;	/* Calculation of actions 12 to 23 in progress (2nd part) */
		/* const */ unsigned int CAIP1          : 1;	/* Calculation of actions 0 to 11 in progress (1st part) */
		/* const */ unsigned int ISN            : 1;	/* Increment number of STATE is not plausible */
		/* const */ unsigned int ITN            : 1;	/* Increment number of TRIGGER is not plausible */
		/* const */ unsigned int BWD2           : 1;	/* Backwards drive of SUB_INC2 */
		/* const */ unsigned int BWD1           : 1;	/* Backwards drive of SUB_INC1 */
		/* const */ unsigned int Reserved_24    : 1;	/* Reserved */
		/* const */ unsigned int LOCK2          : 1;	/* DPLL Lock status concerning SUB_INC2 */
		/* const */ unsigned int SYS            : 1;	/* Synchronization condition of STATE fixed */
		/* const */ unsigned int SYT            : 1;	/* Synchronization condition of TRIGGER fixed */
		/* const */ unsigned int FSD            : 1;	/* First STATE detected */
		/* const */ unsigned int FTD            : 1;	/* First TRIGGER detected */
		/* const */ unsigned int LOCK1          : 1;	/* DPLL Lock status concerning SUB_INC1 */
		/* const */ unsigned int ERR            : 1;	/* Error during configuration or operation resulting in unexpected values */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_STATUS_type;
#define GTM_DPLL_STATUS	(*( GTM_DPLL_STATUS_type *) 0xf0128014u)	/* DPLL Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSAC           : 24;	/* Calculated time stamp for ACTION_i */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_DPLL_TSA_0_type;
#define GTM_DPLL_TSA_0	(*( GTM_DPLL_TSA_0_type *) 0xf0128100u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_1	(*( GTM_DPLL_TSA_0_type *) 0xf0128104u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_10	(*( GTM_DPLL_TSA_0_type *) 0xf0128128u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_11	(*( GTM_DPLL_TSA_0_type *) 0xf012812cu)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_12	(*( GTM_DPLL_TSA_0_type *) 0xf0128130u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_13	(*( GTM_DPLL_TSA_0_type *) 0xf0128134u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_14	(*( GTM_DPLL_TSA_0_type *) 0xf0128138u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_15	(*( GTM_DPLL_TSA_0_type *) 0xf012813cu)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_16	(*( GTM_DPLL_TSA_0_type *) 0xf0128140u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_17	(*( GTM_DPLL_TSA_0_type *) 0xf0128144u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_18	(*( GTM_DPLL_TSA_0_type *) 0xf0128148u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_19	(*( GTM_DPLL_TSA_0_type *) 0xf012814cu)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_2	(*( GTM_DPLL_TSA_0_type *) 0xf0128108u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_20	(*( GTM_DPLL_TSA_0_type *) 0xf0128150u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_21	(*( GTM_DPLL_TSA_0_type *) 0xf0128154u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_22	(*( GTM_DPLL_TSA_0_type *) 0xf0128158u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_23	(*( GTM_DPLL_TSA_0_type *) 0xf012815cu)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_3	(*( GTM_DPLL_TSA_0_type *) 0xf012810cu)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_4	(*( GTM_DPLL_TSA_0_type *) 0xf0128110u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_5	(*( GTM_DPLL_TSA_0_type *) 0xf0128114u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_6	(*( GTM_DPLL_TSA_0_type *) 0xf0128118u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_7	(*( GTM_DPLL_TSA_0_type *) 0xf012811cu)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_8	(*( GTM_DPLL_TSA_0_type *) 0xf0128120u)	/* Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA_9	(*( GTM_DPLL_TSA_0_type *) 0xf0128124u)	/* Calculated Time Stamp For ACTION_i Register */

