svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int INSEL0         : 4;	/* In Selection for DSADCx GTM connection */
		unsigned int INSEL1         : 4;	/* In Selection for DSADCx GTM connection */
		unsigned int INSEL2         : 4;	/* In Selection for DSADCx GTM connection */
		unsigned int INSEL3         : 4;	/* In Selection for DSADCx GTM connection */
		unsigned int INSEL4         : 4;	/* In Selection for DSADCx GTM connection */
		unsigned int INSEL5         : 4;	/* In Selection for DSADCx GTM connection */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} GTM_DSADCINSEL1_type;
#define GTM_DSADCINSEL1	(*( GTM_DSADCINSEL1_type *) 0xf019fd80u)	/* DSADC Input Select 1 Register */
#define GTM_DSADCINSEL2	(*( GTM_DSADCINSEL1_type *) 0xf019fd84u)	/* DSADC Input Select 2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL1           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL2           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL3           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL4           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL5           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} GTM_DSADCOUTSEL00_type;
#define GTM_DSADCOUTSEL00	(*( GTM_DSADCOUTSEL00_type *) 0xf019fd88u)	/* DSADC Output Select 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL1           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL2           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL3           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL4           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 1;
		unsigned int SEL5           : 3;	/* Output Selection for DSADCx GTM connection */
		unsigned int                : 9;
	} B;
	int I;
	unsigned int U;

} GTM_DSADCOUTSEL10_type;
#define GTM_DSADCOUTSEL10	(*( GTM_DSADCOUTSEL10_type *) 0xf019fd90u)	/* DSADC Output Select 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 9;	/* ARU Read address */
		/* const */ unsigned int Reserved       : 23;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_F2A0_CH0_ARU_RD_FIFO_type;
#define GTM_F2A0_CH0_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf0118000u)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH1_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf0118004u)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH2_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf0118008u)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH3_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf011800cu)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH4_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf0118010u)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH5_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf0118014u)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH6_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf0118018u)	/* F2A Read Channel Address Register */
#define GTM_F2A0_CH7_ARU_RD_FIFO	(*( GTM_F2A0_CH0_ARU_RD_FIFO_type *) 0xf011801cu)	/* F2A Read Channel Address Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
		unsigned int TMODE          : 2;	/* Transfer mode for 53 bit ARU data from/to FIFO */
		unsigned int DIR            : 1;	/* Data transfer direction */
		/* const */ unsigned int Reserved_4     : 13;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_F2A0_CH0_STR_CFG_type;
#define GTM_F2A0_CH0_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf0118020u)	/* F2A Stream 0 Configuration Register */
#define GTM_F2A0_CH1_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf0118024u)	/* F2A Stream 1 Configuration Register */
#define GTM_F2A0_CH2_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf0118028u)	/* F2A Stream 2 Configuration Register */
#define GTM_F2A0_CH3_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf011802cu)	/* F2A Stream 3 Configuration Register */
#define GTM_F2A0_CH4_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf0118030u)	/* F2A Stream 4 Configuration Register */
#define GTM_F2A0_CH5_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf0118034u)	/* F2A Stream 5 Configuration Register */
#define GTM_F2A0_CH6_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf0118038u)	/* F2A Stream 6 Configuration Register */
#define GTM_F2A0_CH7_STR_CFG	(*( GTM_F2A0_CH0_STR_CFG_type *) 0xf011803cu)	/* F2A Stream 7 Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int STR0_EN        : 2;	/* Enable/disable stream 0 */
		unsigned int STR1_EN        : 2;	/* Enable/disable stream 1 */
		unsigned int STR2_EN        : 2;	/* Enable/disable stream 2 */
		unsigned int STR3_EN        : 2;	/* Enable/disable stream 3 */
		unsigned int STR4_EN        : 2;	/* Enable/disable stream 4 */
		unsigned int STR5_EN        : 2;	/* Enable/disable stream 5 */
		unsigned int STR6_EN        : 2;	/* Enable/disable stream 6 */
		unsigned int STR7_EN        : 2;	/* Enable/disable stream 7 */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_F2A0_ENABLE_type;
#define GTM_F2A0_ENABLE	(*( GTM_F2A0_ENABLE_type *) 0xf0118040u)	/* F2A0 Stream Activation Register */

