svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RBM            : 1;	/* Ring buffer mode enable */
		unsigned int RAP            : 1;	/* RAM access priority */
		unsigned int FLUSH          : 1;	/* FIFO Flush control */
		unsigned int WULOCK         : 1;	/* RAM write unlock Enable/disable direct RAM write access to the memory mapped FIFO region */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_CTRL_type;
#define GTM_FIFO0_CH0_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf0118400u)	/* FIFO0 Channel 0 Control Register */
#define GTM_FIFO0_CH1_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf0118420u)	/* FIFO0 Channel 1 Control Register */
#define GTM_FIFO0_CH2_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf0118440u)	/* FIFO0 Channel 2 Control Register */
#define GTM_FIFO0_CH3_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf0118460u)	/* FIFO0 Channel 3 Control Register */
#define GTM_FIFO0_CH4_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf0118480u)	/* FIFO0 Channel 4 Control Register */
#define GTM_FIFO0_CH5_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf01184a0u)	/* FIFO0 Channel 5 Control Register */
#define GTM_FIFO0_CH6_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf01184c0u)	/* FIFO0 Channel 6 Control Register */
#define GTM_FIFO0_CH7_CTRL	(*( GTM_FIFO0_CH0_CTRL_type *) 0xf01184e0u)	/* FIFO0 Channel 7 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 10;	/* End address for FIFOi channel x, (x:0...7) */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_END_ADDR_type;
#define GTM_FIFO0_CH0_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf0118404u)	/* FIFO0 Channel 0 End Address Register */
#define GTM_FIFO0_CH1_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf0118424u)	/* FIFO0 Channel 1 End Address Register */
#define GTM_FIFO0_CH2_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf0118444u)	/* FIFO0 Channel 2 End Address Register */
#define GTM_FIFO0_CH3_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf0118464u)	/* FIFO0 Channel 3 End Address Register */
#define GTM_FIFO0_CH4_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf0118484u)	/* FIFO0 Channel 4 End Address Register */
#define GTM_FIFO0_CH5_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf01184a4u)	/* FIFO0 Channel 5 End Address Register */
#define GTM_FIFO0_CH6_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf01184c4u)	/* FIFO0 Channel 6 End Address Register */
#define GTM_FIFO0_CH7_END_ADDR	(*( GTM_FIFO0_CH0_END_ADDR_type *) 0xf01184e4u)	/* FIFO0 Channel 7 End Address Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LEVEL          : 11;	/* Fill level of the current FIFO */
		/* const */ unsigned int Reserved       : 21;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_FILL_LEVEL_type;
#define GTM_FIFO0_CH0_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf0118418u)	/* FIFO0 Channel 0 Fill Level Register */
#define GTM_FIFO0_CH1_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf0118438u)	/* FIFO0 Channel 1 Fill Level Register */
#define GTM_FIFO0_CH2_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf0118458u)	/* FIFO0 Channel 2 Fill Level Register */
#define GTM_FIFO0_CH3_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf0118478u)	/* FIFO0 Channel 3 Fill Level Register */
#define GTM_FIFO0_CH4_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf0118498u)	/* FIFO0 Channel 4 Fill Level Register */
#define GTM_FIFO0_CH5_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf01184b8u)	/* FIFO0 Channel 5 Fill Level Register */
#define GTM_FIFO0_CH6_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf01184d8u)	/* FIFO0 Channel 6 Fill Level Register */
#define GTM_FIFO0_CH7_FILL_LEVEL	(*( GTM_FIFO0_CH0_FILL_LEVEL_type *) 0xf01184f8u)	/* FIFO0 Channel 7 Fill Level Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FIFO_EMPTY_IRQ_EN: 1;	/* interrupt enable */
		unsigned int FIFO_FULL_IRQ_EN: 1;	/* interrupt enable */
		unsigned int FIFO_LWM_IRQ_EN: 1;	/* interrupt enable */
		unsigned int FIFO_UWM_IRQ_EN: 1;	/* interrupt enable */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_IRQ_EN_type;
#define GTM_FIFO0_CH0_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf0118604u)	/* FIFO0 Channel 0 Interrupt Enable Register */
#define GTM_FIFO0_CH1_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf0118624u)	/* FIFO0 Channel 1 Interrupt Enable Register */
#define GTM_FIFO0_CH2_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf0118644u)	/* FIFO0 Channel 2 Interrupt Enable Register */
#define GTM_FIFO0_CH3_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf0118664u)	/* FIFO0 Channel 3 Interrupt Enable Register */
#define GTM_FIFO0_CH4_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf0118684u)	/* FIFO0 Channel 4 Interrupt Enable Register */
#define GTM_FIFO0_CH5_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf01186a4u)	/* FIFO0 Channel 5 Interrupt Enable Register */
#define GTM_FIFO0_CH6_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf01186c4u)	/* FIFO0 Channel 6 Interrupt Enable Register */
#define GTM_FIFO0_CH7_IRQ_EN	(*( GTM_FIFO0_CH0_IRQ_EN_type *) 0xf01186e4u)	/* FIFO0 Channel 7 Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG_FIFO_EMPTY : 1;	/* Force interrupt of FIFO empty status */
		unsigned int TRG_FIFO_FULL  : 1;	/* Force interrupt of FIFO full status */
		unsigned int TRG_FIFO_LWM   : 1;	/* Force interrupt of lower watermark */
		unsigned int TRG_FIFO_UWM   : 1;	/* Force interrupt of upper watermark */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_IRQ_FORCINT_type;
#define GTM_FIFO0_CH0_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf0118608u)	/* FIFO0 Channel0 Force Interrupt By Software Register */
#define GTM_FIFO0_CH1_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf0118628u)	/* FIFO0 Channel1 Force Interrupt By Software Register */
#define GTM_FIFO0_CH2_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf0118648u)	/* FIFO0 Channel2 Force Interrupt By Software Register */
#define GTM_FIFO0_CH3_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf0118668u)	/* FIFO0 Channel3 Force Interrupt By Software Register */
#define GTM_FIFO0_CH4_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf0118688u)	/* FIFO0 Channel4 Force Interrupt By Software Register */
#define GTM_FIFO0_CH5_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf01186a8u)	/* FIFO0 Channel5 Force Interrupt By Software Register */
#define GTM_FIFO0_CH6_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf01186c8u)	/* FIFO0 Channel6 Force Interrupt By Software Register */
#define GTM_FIFO0_CH7_IRQ_FORCINT	(*( GTM_FIFO0_CH0_IRQ_FORCINT_type *) 0xf01186e8u)	/* FIFO0 Channel7 Force Interrupt By Software Register */

