svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int IRQ_MODE       : 2;	/* IRQ mode selection */
		unsigned int DMA_HYSTERESIS : 1;	/* Enable DMA hysteresis mode */
		unsigned int DMA_HYST_DIR   : 1;	/* DMA direction in hysteresis mode */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_IRQ_MODE_type;
#define GTM_FIFO0_CH0_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf011860cu)	/* FIFO0 Channel0 IRQ Mode Control Register */
#define GTM_FIFO0_CH1_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf011862cu)	/* FIFO0 Channel1 IRQ Mode Control Register */
#define GTM_FIFO0_CH2_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf011864cu)	/* FIFO0 Channel2 IRQ Mode Control Register */
#define GTM_FIFO0_CH3_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf011866cu)	/* FIFO0 Channel3 IRQ Mode Control Register */
#define GTM_FIFO0_CH4_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf011868cu)	/* FIFO0 Channel4 IRQ Mode Control Register */
#define GTM_FIFO0_CH5_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf01186acu)	/* FIFO0 Channel5 IRQ Mode Control Register */
#define GTM_FIFO0_CH6_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf01186ccu)	/* FIFO0 Channel6 IRQ Mode Control Register */
#define GTM_FIFO0_CH7_IRQ_MODE	(*( GTM_FIFO0_CH0_IRQ_MODE_type *) 0xf01186ecu)	/* FIFO0 Channel7 IRQ Mode Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FIFO_EMPTY     : 1;	/* FIFO is empty */
		unsigned int FIFO_FULL      : 1;	/* FIFO is full */
		unsigned int FIFO_LWM       : 1;	/* FIFO Lower watermark was under-run */
		unsigned int FIFO_UWM       : 1;	/* FIFO Upper watermark was over-run */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_IRQ_NOTIFY_type;
#define GTM_FIFO0_CH0_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf0118600u)	/* FIFO0 Channel0 Interrupt Notification Register */
#define GTM_FIFO0_CH1_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf0118620u)	/* FIFO0 Channel1 Interrupt Notification Register */
#define GTM_FIFO0_CH2_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf0118640u)	/* FIFO0 Channel2 Interrupt Notification Register */
#define GTM_FIFO0_CH3_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf0118660u)	/* FIFO0 Channel3 Interrupt Notification Register */
#define GTM_FIFO0_CH4_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf0118680u)	/* FIFO0 Channel4 Interrupt Notification Register */
#define GTM_FIFO0_CH5_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf01186a0u)	/* FIFO0 Channel5 Interrupt Notification Register */
#define GTM_FIFO0_CH6_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf01186c0u)	/* FIFO0 Channel6 Interrupt Notification Register */
#define GTM_FIFO0_CH7_IRQ_NOTIFY	(*( GTM_FIFO0_CH0_IRQ_NOTIFY_type *) 0xf01186e0u)	/* FIFO0 Channel7 Interrupt Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 10;	/* Normal Operation mode Upper watermark Ring buffer operation mode Gate pointer from LWU to UWE */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_LOWER_WM_type;
#define GTM_FIFO0_CH0_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf0118410u)	/* FIFO0 Channel 0 Lower Watermark Register */
#define GTM_FIFO0_CH1_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf0118430u)	/* FIFO0 Channel 1 Lower Watermark Register */
#define GTM_FIFO0_CH2_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf0118450u)	/* FIFO0 Channel 2 Lower Watermark Register */
#define GTM_FIFO0_CH3_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf0118470u)	/* FIFO0 Channel 3 Lower Watermark Register */
#define GTM_FIFO0_CH4_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf0118490u)	/* FIFO0 Channel 4 Lower Watermark Register */
#define GTM_FIFO0_CH5_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf01184b0u)	/* FIFO0 Channel 5 Lower Watermark Register */
#define GTM_FIFO0_CH6_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf01184d0u)	/* FIFO0 Channel 6 Lower Watermark Register */
#define GTM_FIFO0_CH7_LOWER_WM	(*( GTM_FIFO0_CH0_LOWER_WM_type *) 0xf01184f0u)	/* FIFO0 Channel 7 Lower Watermark Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ADDR           : 10;	/* Position of the read pointer */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_RD_PTR_type;
#define GTM_FIFO0_CH0_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf0118504u)	/* FIFO0 Channel 0 Read Pointer Register */
#define GTM_FIFO0_CH1_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf0118524u)	/* FIFO0 Channel 1 Read Pointer Register */
#define GTM_FIFO0_CH2_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf0118544u)	/* FIFO0 Channel 2 Read Pointer Register */
#define GTM_FIFO0_CH3_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf0118564u)	/* FIFO0 Channel 3 Read Pointer Register */
#define GTM_FIFO0_CH4_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf0118584u)	/* FIFO0 Channel 4 Read Pointer Register */
#define GTM_FIFO0_CH5_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf01185a4u)	/* FIFO0 Channel 5 Read Pointer Register */
#define GTM_FIFO0_CH6_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf01185c4u)	/* FIFO0 Channel 6 Read Pointer Register */
#define GTM_FIFO0_CH7_RD_PTR	(*( GTM_FIFO0_CH0_RD_PTR_type *) 0xf01185e4u)	/* FIFO0 Channel 7 Read Pointer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 10;	/* End address for FIFOi channel x, (x07) */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_START_ADDR_type;
#define GTM_FIFO0_CH0_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf0118408u)	/* FIFO0 Channel 0 Start Address Register */
#define GTM_FIFO0_CH1_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf0118428u)	/* FIFO0 Channel 1 Start Address Register */
#define GTM_FIFO0_CH2_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf0118448u)	/* FIFO0 Channel 2 Start Address Register */
#define GTM_FIFO0_CH3_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf0118468u)	/* FIFO0 Channel 3 Start Address Register */
#define GTM_FIFO0_CH4_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf0118488u)	/* FIFO0 Channel 4 Start Address Register */
#define GTM_FIFO0_CH5_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf01184a8u)	/* FIFO0 Channel 5 Start Address Register */
#define GTM_FIFO0_CH6_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf01184c8u)	/* FIFO0 Channel 6 Start Address Register */
#define GTM_FIFO0_CH7_START_ADDR	(*( GTM_FIFO0_CH0_START_ADDR_type *) 0xf01184e8u)	/* FIFO0 Channel 7 Start Address Register */

