svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int EMPTY          : 1;	/* FIFO x fill level status (x07) */
		/* const */ unsigned int FULL           : 1;	/* FIFO x fill level status (x07) */
		/* const */ unsigned int LOW_WM         : 1;	/* Lower watermark reached */
		/* const */ unsigned int UP_WM          : 1;	/* Upper watermark reached */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_STATUS_type;
#define GTM_FIFO0_CH0_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf0118414u)	/* FIFO0 Channel 0 Status Register */
#define GTM_FIFO0_CH1_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf0118434u)	/* FIFO0 Channel 1 Status Register */
#define GTM_FIFO0_CH2_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf0118454u)	/* FIFO0 Channel 2 Status Register */
#define GTM_FIFO0_CH3_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf0118474u)	/* FIFO0 Channel 3 Status Register */
#define GTM_FIFO0_CH4_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf0118494u)	/* FIFO0 Channel 4 Status Register */
#define GTM_FIFO0_CH5_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf01184b4u)	/* FIFO0 Channel 5 Status Register */
#define GTM_FIFO0_CH6_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf01184d4u)	/* FIFO0 Channel 6 Status Register */
#define GTM_FIFO0_CH7_STATUS	(*( GTM_FIFO0_CH0_STATUS_type *) 0xf01184f4u)	/* FIFO0 Channel 7 Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDR           : 10;	/* Normal Operation mode Upper watermark Ring buffer operation mode Gate pointer from SLW to LWU */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_UPPER_WM_type;
#define GTM_FIFO0_CH0_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf011840cu)	/* FIFO0 Channel 0 Upper Watermark Register */
#define GTM_FIFO0_CH1_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf011842cu)	/* FIFO0 Channel 1 Upper Watermark Register */
#define GTM_FIFO0_CH2_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf011844cu)	/* FIFO0 Channel 2 Upper Watermark Register */
#define GTM_FIFO0_CH3_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf011846cu)	/* FIFO0 Channel 3 Upper Watermark Register */
#define GTM_FIFO0_CH4_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf011848cu)	/* FIFO0 Channel 4 Upper Watermark Register */
#define GTM_FIFO0_CH5_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf01184acu)	/* FIFO0 Channel 5 Upper Watermark Register */
#define GTM_FIFO0_CH6_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf01184ccu)	/* FIFO0 Channel 6 Upper Watermark Register */
#define GTM_FIFO0_CH7_UPPER_WM	(*( GTM_FIFO0_CH0_UPPER_WM_type *) 0xf01184ecu)	/* FIFO0 Channel 7 Upper Watermark Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ADDR           : 10;	/* Position of the write pointer */
		/* const */ unsigned int Reserved       : 22;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_FIFO0_CH0_WR_PTR_type;
#define GTM_FIFO0_CH0_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf0118500u)	/* FIFO0 Channel 0 Write Pointer Register */
#define GTM_FIFO0_CH1_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf0118520u)	/* FIFO0 Channel 1 Write Pointer Register */
#define GTM_FIFO0_CH2_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf0118540u)	/* FIFO0 Channel 2 Write Pointer Register */
#define GTM_FIFO0_CH3_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf0118560u)	/* FIFO0 Channel 3 Write Pointer Register */
#define GTM_FIFO0_CH4_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf0118580u)	/* FIFO0 Channel 4 Write Pointer Register */
#define GTM_FIFO0_CH5_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf01185a0u)	/* FIFO0 Channel 5 Write Pointer Register */
#define GTM_FIFO0_CH6_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf01185c0u)	/* FIFO0 Channel 6 Write Pointer Register */
#define GTM_FIFO0_CH7_WR_PTR	(*( GTM_FIFO0_CH0_WR_PTR_type *) 0xf01185e0u)	/* FIFO0 Channel 7 Write Pointer Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ARU_NEW_DATA0_IRQ: 1;	/* ARU_NEW_DATA0 interrupt */
		/* const */ unsigned int ARU_NEW_DATA1_IRQ: 1;	/* ARU_NEW_DATA1 interrupt */
		/* const */ unsigned int ARU_ACC_ACK_IRQ: 1;	/* ARU_ACC_ACK interrupt */
		/* const */ unsigned int BRC_IRQ        : 1;	/* BRC shared submodule interrupt */
		/* const */ unsigned int AEI_IRQ        : 1;	/* AEI_IRQ interrupt */
		/* const */ unsigned int CMP_IRQ        : 1;	/* CMP shared submodule interrupt */
		/* const */ unsigned int SPE0_IRQ       : 1;	/* SPE0 shared submodule interrupt */
		/* const */ unsigned int SPE1_IRQ       : 1;	/* SPE1 shared submodule interrupt */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
		/* const */ unsigned int PSM0_CH0_IRQ   : 1;	/* PSM0 shared submodule channel 0 interrupt */
		/* const */ unsigned int PSM0_CH1_IRQ   : 1;	/* PSM0 shared submodule channel 1 interrupt */
		/* const */ unsigned int PSM0_CH2_IRQ   : 1;	/* PSM0 shared submodule channel 2 interrupt */
		/* const */ unsigned int PSM0_CH3_IRQ   : 1;	/* PSM0 shared submodule channel 3 interrupt */
		/* const */ unsigned int PSM0_CH4_IRQ   : 1;	/* PSM0 shared submodule channel 4 interrupt */
		/* const */ unsigned int PSM0_CH5_IRQ   : 1;	/* PSM0 shared submodule channel 5 interrupt */
		/* const */ unsigned int PSM0_CH6_IRQ   : 1;	/* PSM0 shared submodule channel 6 interrupt */
		/* const */ unsigned int PSM0_CH7_IRQ   : 1;	/* PSM0 shared submodule channel 7 interrupt */
		/* const */ unsigned int Reserved_18    : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_0_type;
#define GTM_ICM_IRQG_0	(*( GTM_ICM_IRQG_0_type *) 0xf0100600u)	/* GTM Infrastructure Interrupt Group */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int DPLL_DCG_IRQ   : 1;	/* TRIGGER direction change detected. */
		/* const */ unsigned int DPLL_EDI_IRQ   : 1;	/* DPLL enable/disable interrupt */
		/* const */ unsigned int DPLL_TIN_IRQ   : 1;	/* TRIGGER minimum hold time (THMI) violation detected interrupt */
		/* const */ unsigned int DPLL_TAX_IRQ   : 1;	/* TRIGGER maximum hold time (THMA) violation detected interrupt */
		/* const */ unsigned int DPLL_SIS_IRQ   : 1;	/* STATE inactive slope detected interrupt. See bit 0. */
		/* const */ unsigned int DPLL_TIS_IRQ   : 1;	/* TRIGGER inactive slope detected interrupt. See bit 0. */
		/* const */ unsigned int DPLL_MSI_IRQ   : 1;	/* Missing STATE interrupt */
		/* const */ unsigned int DPLL_MTI_IRQ   : 1;	/* Missing TRIGGER interrupt */
		/* const */ unsigned int DPLL_SAS_IRQ   : 1;	/* STATE active slope detected */
		/* const */ unsigned int DPLL_TAS_IRQ   : 1;	/* TRIGGER active slope detected while NTI_CNT is zero */
		/* const */ unsigned int DPLL_PWI_IRQ   : 1;	/* Plausibility window (PVT) violation interrupt of TRIGGER */
		/* const */ unsigned int DPLL_W2I_IRQ   : 1;	/* Write access to RAM region 2 interrupt */
		/* const */ unsigned int DPLL_W1I_IRQ   : 1;	/* Write access to RAM region 1b or 1c interrupt */
		/* const */ unsigned int DPLL_GLI_IRQ   : 1;	/* Get of lock interrupt for SUB_INC1 */
		/* const */ unsigned int DPLL_LLI_IRQ   : 1;	/* Lost of lock interrupt for SUB_INC1 */
		/* const */ unsigned int DPLL_EI_IRQ    : 1;	/* Error interrupt See bit 0 */
		/* const */ unsigned int DPLL_GL2I_IRQ  : 1;	/* Get of lock interrupt for SUB_INC2 */
		/* const */ unsigned int DPLL_LL2I_IRQ  : 1;	/* Lost of lock interrupt for SUB_INC2 */
		/* const */ unsigned int DPLL_TE0_IRQ   : 1;	/* TRIGGER event interrupt 0 */
		/* const */ unsigned int DPLL_TE1_IRQ   : 1;	/* TRIGGER event interrupt 1 */
		/* const */ unsigned int DPLL_TE2_IRQ   : 1;	/* TRIGGER event interrupt 2 */
		/* const */ unsigned int DPLL_TE3_IRQ   : 1;	/* TRIGGER event interrupt 3 */
		/* const */ unsigned int DPLL_TE4_IRQ   : 1;	/* TRIGGER event interrupt 4 */
		/* const */ unsigned int DPLL_CDIT_IRQ  : 1;	/* DPLL calculated duration interrupt for trigger */
		/* const */ unsigned int DPLL_CDIS_IRQ  : 1;	/* DPLL calculated duration interrupt for state */
		/* const */ unsigned int DPLL_TORI_IRQ  : 1;	/* DPLL calculated duration interrupt for state */
		/* const */ unsigned int DPLL_SORI_IRQ  : 1;	/* DPLL calculated duration interrupt for state */
		/* const */ unsigned int Reserved       : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

