svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} GTM_ICM_IRQG_1_type;
#define GTM_ICM_IRQG_1	(*( GTM_ICM_IRQG_1_type *) 0xf0100604u)	/* GTM DPLL Interrupt Group */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ATOM4_CH0_IRQ  : 1;	/* ATOM4 channel 0 shared interrupt */
		/* const */ unsigned int ATOM4_CH1_IRQ  : 1;	/* ATOM4 channel 1 shared interrupt */
		/* const */ unsigned int ATOM4_CH2_IRQ  : 1;	/* ATOM4 channel 2 shared interrupt */
		/* const */ unsigned int ATOM4_CH3_IRQ  : 1;	/* ATOM4 channel 3 shared interrupt */
		/* const */ unsigned int ATOM4_CH4_IRQ  : 1;	/* ATOM4 channel 4 shared interrupt */
		/* const */ unsigned int ATOM4_CH5_IRQ  : 1;	/* ATOM4 channel 5 shared interrupt */
		/* const */ unsigned int ATOM4_CH6_IRQ  : 1;	/* ATOM4 channel 6 shared interrupt */
		/* const */ unsigned int ATOM4_CH7_IRQ  : 1;	/* ATOM4 channel 7 shared interrupt */
		/* const */ unsigned int Reserved       : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_10_type;
#define GTM_ICM_IRQG_10	(*( GTM_ICM_IRQG_10_type *) 0xf0100628u)	/* ATOM Interrupt Group 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TIM0_CH0_IRQ   : 1;	/* TIM0 shared interrupt channel 0. */
		/* const */ unsigned int TIM0_CH1_IRQ   : 1;	/* TIM0 shared interrupt channel 1 */
		/* const */ unsigned int TIM0_CH2_IRQ   : 1;	/* TIM0 shared interrupt channel 2 */
		/* const */ unsigned int TIM0_CH3_IRQ   : 1;	/* TIM0 shared interrupt channel 3 */
		/* const */ unsigned int TIM0_CH4_IRQ   : 1;	/* TIM0 shared interrupt channel 4 */
		/* const */ unsigned int TIM0_CH5_IRQ   : 1;	/* TIM0 shared interrupt channel 5 */
		/* const */ unsigned int TIM0_CH6_IRQ   : 1;	/* TIM0 shared interrupt channel 6 */
		/* const */ unsigned int TIM0_CH7_IRQ   : 1;	/* TIM0 shared interrupt channel 7 */
		/* const */ unsigned int TIM1_CH0_IRQ   : 1;	/* TIM1 shared interrupt channel 0 */
		/* const */ unsigned int TIM1_CH1_IRQ   : 1;	/* TIM1 shared interrupt channel 1 */
		/* const */ unsigned int TIM1_CH2_IRQ   : 1;	/* TIM1 shared interrupt channel 2 */
		/* const */ unsigned int TIM1_CH3_IRQ   : 1;	/* TIM1 shared interrupt channel 3 */
		/* const */ unsigned int TIM1_CH4_IRQ   : 1;	/* TIM1 shared interrupt channel 4 */
		/* const */ unsigned int TIM1_CH5_IRQ   : 1;	/* TIM1 shared interrupt channel 5 */
		/* const */ unsigned int TIM1_CH6_IRQ   : 1;	/* TIM1 shared interrupt channel 6 */
		/* const */ unsigned int TIM1_CH7_IRQ   : 1;	/* TIM1 shared interrupt channel 7 */
		/* const */ unsigned int TIM2_CH0_IRQ   : 1;	/* TIM2 shared interrupt channel 0 */
		/* const */ unsigned int TIM2_CH1_IRQ   : 1;	/* TIM2 shared interrupt channel 1 */
		/* const */ unsigned int TIM2_CH2_IRQ   : 1;	/* TIM2 shared interrupt channel 2 */
		/* const */ unsigned int TIM2_CH3_IRQ   : 1;	/* TIM2 shared interrupt channel 3 */
		/* const */ unsigned int TIM2_CH4_IRQ   : 1;	/* TIM2 shared interrupt channel 4 */
		/* const */ unsigned int TIM2_CH5_IRQ   : 1;	/* TIM2 shared interrupt channel 5 */
		/* const */ unsigned int TIM2_CH6_IRQ   : 1;	/* TIM2 shared interrupt channel 6 */
		/* const */ unsigned int TIM2_CH7_IRQ   : 1;	/* TIM2 shared interrupt channel 7 */
		/* const */ unsigned int TIM3_CH0_IRQ   : 1;	/* TIM3 shared interrupt channel 0 */
		/* const */ unsigned int TIM3_CH1_IRQ   : 1;	/* TIM3 shared interrupt channel 1 */
		/* const */ unsigned int TIM3_CH2_IRQ   : 1;	/* TIM3 shared interrupt channel 2 */
		/* const */ unsigned int TIM3_CH3_IRQ   : 1;	/* TIM3 shared interrupt channel 3 */
		/* const */ unsigned int TIM3_CH4_IRQ   : 1;	/* TIM3 shared interrupt channel 4 */
		/* const */ unsigned int TIM3_CH5_IRQ   : 1;	/* TIM3 shared interrupt channel 5 */
		/* const */ unsigned int TIM3_CH6_IRQ   : 1;	/* TIM3 shared interrupt channel 6 */
		/* const */ unsigned int TIM3_CH7_IRQ   : 1;	/* TIM3 shared interrupt channel 7 */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_2_type;
#define GTM_ICM_IRQG_2	(*( GTM_ICM_IRQG_2_type *) 0xf0100608u)	/* TIM Interrupt Group 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MCS0_CH0_IRQ   : 1;	/* MCS0 channel 0 interrupt */
		/* const */ unsigned int MCS0_CH1_IRQ   : 1;	/* MCS0 channel 1 interrupt */
		/* const */ unsigned int MCS0_CH2_IRQ   : 1;	/* MCS0 channel 2 interrupt */
		/* const */ unsigned int MCS0_CH3_IRQ   : 1;	/* MCS0 channel 3 interrupt */
		/* const */ unsigned int MCS0_CH4_IRQ   : 1;	/* MCS0 channel 4 interrupt */
		/* const */ unsigned int MCS0_CH5_IRQ   : 1;	/* MCS0 channel 5 interrupt */
		/* const */ unsigned int MCS0_CH6_IRQ   : 1;	/* MCS0 channel 6 interrupt */
		/* const */ unsigned int MCS0_CH7_IRQ   : 1;	/* MCS0 channel 7 interrupt */
		/* const */ unsigned int MCS1_CH0_IRQ   : 1;	/* MCS1 channel 0 interrupt */
		/* const */ unsigned int MCS1_CH1_IRQ   : 1;	/* MCS1 channel 1 interrupt */
		/* const */ unsigned int MCS1_CH2_IRQ   : 1;	/* MCS1 channel 2 interrupt */
		/* const */ unsigned int MCS1_CH3_IRQ   : 1;	/* MCS1 channel 3 interrupt */
		/* const */ unsigned int MCS1_CH4_IRQ   : 1;	/* MCS1 channel 4 interrupt */
		/* const */ unsigned int MCS1_CH5_IRQ   : 1;	/* MCS1 channel 5 interrupt */
		/* const */ unsigned int MCS1_CH6_IRQ   : 1;	/* MCS1 channel 6 interrupt */
		/* const */ unsigned int MCS1_CH7_IRQ   : 1;	/* MCS1 channel 7 interrupt */
		/* const */ unsigned int MCS2_CH0_IRQ   : 1;	/* MCS1 channel 0 interrupt */
		/* const */ unsigned int MCS2_CH1_IRQ   : 1;	/* MCS2 channel 1 interrupt */
		/* const */ unsigned int MCS2_CH2_IRQ   : 1;	/* MCS2 channel 2 interrupt */
		/* const */ unsigned int MCS2_CH3_IRQ   : 1;	/* MCS2 channel 3 interrupt */
		/* const */ unsigned int MCS2_CH4_IRQ   : 1;	/* MCS2 channel 4 interrupt */
		/* const */ unsigned int MCS2_CH5_IRQ   : 1;	/* MCS2 channel 5 interrupt */
		/* const */ unsigned int MCS2_CH6_IRQ   : 1;	/* MCS2 channel 6 interrupt */
		/* const */ unsigned int MCS2_CH7_IRQ   : 1;	/* MCS2 channel 7 interrupt */
		/* const */ unsigned int MCS3_CH0_IRQ   : 1;	/* MCS3 channel 0 interrupt */
		/* const */ unsigned int MCS3_CH1_IRQ   : 1;	/* MCS3 channel 1 interrupt */
		/* const */ unsigned int MCS3_CH2_IRQ   : 1;	/* MCS3 channel 2 interrupt */
		/* const */ unsigned int MCS3_CH3_IRQ   : 1;	/* MCS3 channel 3 interrupt */
		/* const */ unsigned int MCS3_CH4_IRQ   : 1;	/* MCS3 channel 4 interrupt */
		/* const */ unsigned int MCS3_CH5_IRQ   : 1;	/* MCS3 channel 5 interrupt */
		/* const */ unsigned int MCS3_CH6_IRQ   : 1;	/* MCS3 channel 6 interrupt */
		/* const */ unsigned int MCS3_CH7_IRQ   : 1;	/* MCS3 channel 7 interrupt */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_4_type;
#define GTM_ICM_IRQG_4	(*( GTM_ICM_IRQG_4_type *) 0xf0100610u)	/* MCS Interrupt Group 0 */

