svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TOM0_CH0_IRQ   : 1;	/* TOM0 channel 0 shared interrupt */
		/* const */ unsigned int TOM0_CH1_IRQ   : 1;	/* TOM0 channel 1 shared interrupt */
		/* const */ unsigned int TOM0_CH2_IRQ   : 1;	/* TOM0 channel 2 shared interrupt */
		/* const */ unsigned int TOM0_CH3_IRQ   : 1;	/* TOM0 channel 3 shared interrupt */
		/* const */ unsigned int TOM0_CH4_IRQ   : 1;	/* TOM0 channel 4 shared interrupt */
		/* const */ unsigned int TOM0_CH5_IRQ   : 1;	/* TOM0 channel 5 shared interrupt */
		/* const */ unsigned int TOM0_CH6_IRQ   : 1;	/* TOM0 channel 6 shared interrupt */
		/* const */ unsigned int TOM0_CH7_IRQ   : 1;	/* TOM0 channel 7 shared interrupt */
		/* const */ unsigned int TOM0_CH8_IRQ   : 1;	/* TOM0 channel 8 shared interrupt */
		/* const */ unsigned int TOM0_CH9_IRQ   : 1;	/* TOM0 channel 9 shared interrupt */
		/* const */ unsigned int TOM0_CH10_IRQ  : 1;	/* TOM0 channel 10 shared interrupt */
		/* const */ unsigned int TOM0_CH11_IRQ  : 1;	/* TOM0 channel 11 shared interrupt */
		/* const */ unsigned int TOM0_CH12_IRQ  : 1;	/* TOM0 channel 12 shared interrupt */
		/* const */ unsigned int TOM0_CH13_IRQ  : 1;	/* TOM0 channel 13 shared interrupt */
		/* const */ unsigned int TOM0_CH14_IRQ  : 1;	/* TOM0 channel 14 shared interrupt */
		/* const */ unsigned int TOM0_CH15_IRQ  : 1;	/* TOM0 channel 15 shared interrupt */
		/* const */ unsigned int TOM1_CH0_IRQ   : 1;	/* TOM1 channel 0 shared interrupt */
		/* const */ unsigned int TOM1_CH1_IRQ   : 1;	/* TOM1 channel 1 shared interrupt */
		/* const */ unsigned int TOM1_CH2_IRQ   : 1;	/* TOM1 channel 2 shared interrupt */
		/* const */ unsigned int TOM1_CH3_IRQ   : 1;	/* TOM1 channel 3 shared interrupt */
		/* const */ unsigned int TOM1_CH4_IRQ   : 1;	/* TOM1 channel 4 shared interrupt */
		/* const */ unsigned int TOM1_CH5_IRQ   : 1;	/* TOM1 channel 5 shared interrupt */
		/* const */ unsigned int TOM1_CH6_IRQ   : 1;	/* TOM1 channel 6 shared interrupt */
		/* const */ unsigned int TOM1_CH7_IRQ   : 1;	/* TOM1 channel 7 shared interrupt */
		/* const */ unsigned int TOM1_CH8_IRQ   : 1;	/* TOM1 channel 8 shared interrupt */
		/* const */ unsigned int TOM1_CH9_IRQ   : 1;	/* TOM1 channel 9 shared interrupt */
		/* const */ unsigned int TOM1_CH10_IRQ  : 1;	/* TOM1 channel 10 shared interrupt */
		/* const */ unsigned int TOM1_CH11_IRQ  : 1;	/* TOM1 channel 11 shared interrupt */
		/* const */ unsigned int TOM1_CH12_IRQ  : 1;	/* TOM1 channel 12 shared interrupt */
		/* const */ unsigned int TOM1_CH13_IRQ  : 1;	/* TOM1 channel 13 shared interrupt */
		/* const */ unsigned int TOM1_CH14_IRQ  : 1;	/* TOM1 channel 14 shared interrupt */
		/* const */ unsigned int TOM1_CH15_IRQ  : 1;	/* TOM1 channel 15 shared interrupt */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_6_type;
#define GTM_ICM_IRQG_6	(*( GTM_ICM_IRQG_6_type *) 0xf0100618u)	/* TOM Interrupt Group 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TOM2_CH0_IRQ   : 1;	/* TOM2 channel 0 shared interrupt */
		/* const */ unsigned int TOM2_CH1_IRQ   : 1;	/* TOM2 channel 1 shared interrupt */
		/* const */ unsigned int TOM2_CH2_IRQ   : 1;	/* TOM2 channel 2 shared interrupt */
		/* const */ unsigned int TOM2_CH3_IRQ   : 1;	/* TOM2 channel 3 shared interrupt */
		/* const */ unsigned int TOM2_CH4_IRQ   : 1;	/* TOM2 channel 4 shared interrupt */
		/* const */ unsigned int TOM2_CH5_IRQ   : 1;	/* TOM2 channel 5 shared interrupt */
		/* const */ unsigned int TOM2_CH6_IRQ   : 1;	/* TOM2 channel 6 shared interrupt */
		/* const */ unsigned int TOM2_CH7_IRQ   : 1;	/* TOM2 channel 7 shared interrupt */
		/* const */ unsigned int TOM2_CH8_IRQ   : 1;	/* TOM2 channel 8 shared interrupt */
		/* const */ unsigned int TOM2_CH9_IRQ   : 1;	/* TOM2 channel 9 shared interrupt */
		/* const */ unsigned int TOM2_CH10_IRQ  : 1;	/* TOM2 channel 10 shared interrupt */
		/* const */ unsigned int TOM2_CH11_IRQ  : 1;	/* TOM2 channel 11 shared interrupt */
		/* const */ unsigned int TOM2_CH12_IRQ  : 1;	/* TOM2 channel 12 shared interrupt */
		/* const */ unsigned int TOM2_CH13_IRQ  : 1;	/* TOM2 channel 13 shared interrupt */
		/* const */ unsigned int TOM2_CH14_IRQ  : 1;	/* TOM2 channel 14 shared interrupt */
		/* const */ unsigned int TOM2_CH15_IRQ  : 1;	/* TOM2 channel 15 shared interrupt */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_7_type;
#define GTM_ICM_IRQG_7	(*( GTM_ICM_IRQG_7_type *) 0xf010061cu)	/* ITOM Interrupt Group 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ATOM0_CH0_IRQ  : 1;	/* ATOM0 channel 0 shared interrupt */
		/* const */ unsigned int ATOM0_CH1_IRQ  : 1;	/* ATOM0 channel 1 shared interrupt */
		/* const */ unsigned int ATOM0_CH2_IRQ  : 1;	/* ATOM0 channel 2 shared interrupt */
		/* const */ unsigned int ATOM0_CH3_IRQ  : 1;	/* ATOM0 channel 3 shared interrupt */
		/* const */ unsigned int ATOM0_CH4_IRQ  : 1;	/* ATOM0 channel 4 shared interrupt */
		/* const */ unsigned int ATOM0_CH5_IRQ  : 1;	/* ATOM0 channel 5 shared interrupt */
		/* const */ unsigned int ATOM0_CH6_IRQ  : 1;	/* ATOM0 channel 6 shared interrupt */
		/* const */ unsigned int ATOM0_CH7_IRQ  : 1;	/* ATOM0 channel 7 shared interrupt */
		/* const */ unsigned int ATOM1_CH0_IRQ  : 1;	/* ATOM1 channel 0 shared interrupt */
		/* const */ unsigned int ATOM1_CH1_IRQ  : 1;	/* ATOM1 channel 1 shared interrupt */
		/* const */ unsigned int ATOM1_CH2_IRQ  : 1;	/* ATOM1 channel 2 shared interrupt */
		/* const */ unsigned int ATOM1_CH3_IRQ  : 1;	/* ATOM1 channel 3 shared interrupt */
		/* const */ unsigned int ATOM1_CH4_IRQ  : 1;	/* ATOM1 channel 4 shared interrupt */
		/* const */ unsigned int ATOM1_CH5_IRQ  : 1;	/* ATOM1 channel 5 shared interrupt */
		/* const */ unsigned int ATOM1_CH6_IRQ  : 1;	/* ATOM1 channel 6 shared interrupt */
		/* const */ unsigned int ATOM1_CH7_IRQ  : 1;	/* ATOM1 channel 7 shared interrupt */
		/* const */ unsigned int ATOM2_CH0_IRQ  : 1;	/* ATOM2 channel 0 shared interrupt */
		/* const */ unsigned int ATOM2_CH1_IRQ  : 1;	/* ATOM2 channel 1 shared interrupt */
		/* const */ unsigned int ATOM2_CH2_IRQ  : 1;	/* ATOM2 channel 2 shared interrupt */
		/* const */ unsigned int ATOM2_CH3_IRQ  : 1;	/* ATOM2 channel 3 shared interrupt */
		/* const */ unsigned int ATOM2_CH4_IRQ  : 1;	/* ATOM2 channel 4 shared interrupt */
		/* const */ unsigned int ATOM2_CH5_IRQ  : 1;	/* ATOM2 channel 5 shared interrupt */
		/* const */ unsigned int ATOM2_CH6_IRQ  : 1;	/* ATOM2 channel 6 shared interrupt */
		/* const */ unsigned int ATOM2_CH7_IRQ  : 1;	/* ATOM2 channel 7 shared interrupt */
		/* const */ unsigned int ATOM3_CH0_IRQ  : 1;	/* ATOM3 channel 0 shared interrupt */
		/* const */ unsigned int ATOM3_CH1_IRQ  : 1;	/* ATOM3 channel 1 shared interrupt */
		/* const */ unsigned int ATOM3_CH2_IRQ  : 1;	/* ATOM3 channel 2 shared interrupt */
		/* const */ unsigned int ATOM3_CH3_IRQ  : 1;	/* ATOM3 channel 3 shared interrupt */
		/* const */ unsigned int ATOM3_CH4_IRQ  : 1;	/* ATOM3 channel 4 shared interrupt */
		/* const */ unsigned int ATOM3_CH5_IRQ  : 1;	/* ATOM3 channel 5 shared interrupt */
		/* const */ unsigned int ATOM3_CH6_IRQ  : 1;	/* ATOM3 channel 6 shared interrupt */
		/* const */ unsigned int ATOM3_CH7_IRQ  : 1;	/* ATOM3 channel 7 shared interrupt */
	} B;
	int I;
	unsigned int U;

} GTM_ICM_IRQG_9_type;
#define GTM_ICM_IRQG_9	(*( GTM_ICM_IRQG_9_type *) 0xf0100624u)	/* ATOM Interrupt Group 0 */

