svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int AEI_TO_XPT_IRQ_EN: 1;	/* AEI_TO_XPT_IRQ interrupt enable. */
		unsigned int AEI_USP_ADDR_IRQ_EN: 1;	/* AEI_USP_ADDR_IRQ interrupt enable. */
		unsigned int AEI_IM_ADDR_IRQ_EN: 1;	/* AEI_IM_ADDR_IRQ interrupt enable. */
		unsigned int AEI_USP_BE_IRQ_EN: 1;	/* AEI_USP_BE_IRQ interrupt enable. */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_IRQ_EN_type;
#define GTM_IRQ_EN	(*( GTM_IRQ_EN_type *) 0xf0100014u)	/* GTM Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG_AEI_TO_XPT : 1;	/* Trigger AEI_TO_XPT_IRQ interrupt by software. */
		unsigned int TRG_AEI_USP_ADDR: 1;	/* Trigger AEI_USP_ADDR_IRQ interrupt by software. */
		unsigned int TRG_AEI_IM_ADDR: 1;	/* Trigger AEI_IM_ADDR_IRQ interrupt by software. */
		unsigned int TRG_AEI_USP_BE : 1;	/* Trigger AEI_USP_BE_IRQ interrupt by software. */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_IRQ_FORCINT_type;
#define GTM_IRQ_FORCINT	(*( GTM_IRQ_FORCINT_type *) 0xf0100018u)	/* GTM Software Interrupt Generation Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IRQ_MODE       : 2;	/* Interrupt strategy mode selection for the AEI timeout and address monitoring interrupts */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_IRQ_MODE_type;
#define GTM_IRQ_MODE	(*( GTM_IRQ_MODE_type *) 0xf010001cu)	/* GTM Top Level Interrupts Mode Selection */

typedef volatile union
{
	struct
	{ 
		unsigned int AEI_TO_XPT     : 1;	/* AEI Timeout exception occurred */
		unsigned int AEI_USP_ADDR   : 1;	/* AEI Unsupported address interrupt */
		unsigned int AEI_IM_ADDR    : 1;	/* AEI Illegal Module address interrupt */
		unsigned int AEI_USP_BE     : 1;	/* AEI Unsupported byte enable interrupt */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_IRQ_NOTIFY_type;
#define GTM_IRQ_NOTIFY	(*( GTM_IRQ_NOTIFY_type *) 0xf0100010u)	/* GTM Interrupt Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} GTM_KRST0_type;
#define GTM_KRST0	(*( GTM_KRST0_type *) 0xf019fdf4u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} GTM_KRST1_type;
#define GTM_KRST1	(*( GTM_KRST1_type *) 0xf019fdf0u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} GTM_KRSTCLR_type;
#define GTM_KRSTCLR	(*( GTM_KRSTCLR_type *) 0xf019fdecu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSEL           : 1;	/* TRIGGER signal output select. */
		unsigned int SSL            : 3;	/* STATE signal output select. */
		/* const */ unsigned int Reserved       : 12;	/* Reserved */
		unsigned int TSPP0_EN       : 1;	/* Enable of TSPP0 subunit */
		unsigned int TSPP0_DLD      : 1;	/* DIR level definition bit */
		/* const */ unsigned int Reserved_6     : 2;	/* Reserved */
		unsigned int TSPP0_I0V      : 1;	/* Disable of TSPP0 TIM0_CHx(48) input line. */
		unsigned int TSPP0_I1V      : 1;	/* Disable of TSPP0 TIM0_CHy(48) input line. */
		unsigned int TSPP0_I2V      : 1;	/* Disable of TSPP0 TIM0_CHz(48) input line. */
		/* const */ unsigned int Reserved_10    : 1;	/* Reserved */
		unsigned int TSPP1_EN       : 1;	/* Enable of TSPP1 subunit */
		unsigned int TSPP1_DLD      : 1;	/* DIR level definition bit */
		/* const */ unsigned int Reserved_13    : 2;	/* Reserved */
		unsigned int TSPP1_I0V      : 1;	/* Disable of TSPP1 TIM0_CHx(48) input line */
		unsigned int TSPP1_I1V      : 1;	/* Disable of TSPP1 TIM0_CHy(48) input line */
		unsigned int TSPP1_I2V      : 1;	/* Disable of TSPP1 TIM0_CHz(48) input line. */
		/* const */ unsigned int Reserved_17    : 1;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MAP_CTRL_type;
#define GTM_MAP_CTRL	(*( GTM_MAP_CTRL_type *) 0xf0100040u)	/* MAP Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MEM0           : 2;	/* Configure Memory pages for MCS-instance MCS0 */
		unsigned int MEM1           : 2;	/* Configure Memory pages for MCS-instance MCS1 */
		unsigned int MEM2           : 2;	/* Configure Memory pages for MCS-instance MCS2 */
		unsigned int MEM3           : 2;	/* Configure Memory pages for MCS-instance MCS3 */
		/* const */ unsigned int Reserved       : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCFG_CTRL_type;
#define GTM_MCFG_CTRL	(*( GTM_MCFG_CTRL_type *) 0xf0100080u)	/* Memory Layout Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int ACB0           : 1;	/* ARU Control bit 0 */
		/* const */ unsigned int ACB1           : 1;	/* ARU Control bit 1 */
		/* const */ unsigned int ACB2           : 1;	/* ARU Control bit 2 */
		/* const */ unsigned int ACB3           : 1;	/* ARU Control bit 3 */
		/* const */ unsigned int ACB4           : 1;	/* ARU Control bit 4 */
		/* const */ unsigned int Reserved       : 27;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_ACB_type;
#define GTM_MCS0_CH0_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0130028u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH1_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01300a8u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH2_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0130128u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH3_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01301a8u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH4_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0130228u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH5_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01302a8u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH6_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0130328u)	/* MCS0 Channel ACB Register */
#define GTM_MCS0_CH7_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01303a8u)	/* MCS0 Channel ACB Register */
#define GTM_MCS1_CH0_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0140028u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH1_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01400a8u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH2_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0140128u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH3_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01401a8u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH4_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0140228u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH5_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01402a8u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH6_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0140328u)	/* MCS1 Channel ACB Register */
#define GTM_MCS1_CH7_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01403a8u)	/* MCS1 Channel ACB Register */
#define GTM_MCS2_CH0_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0150028u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH1_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01500a8u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH2_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0150128u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH3_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01501a8u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH4_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0150228u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH5_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01502a8u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH6_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0150328u)	/* MCS2 Channel ACB Register */
#define GTM_MCS2_CH7_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01503a8u)	/* MCS2 Channel ACB Register */
#define GTM_MCS3_CH0_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0160028u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH1_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01600a8u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH2_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0160128u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH3_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01601a8u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH4_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0160228u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH5_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01602a8u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH6_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf0160328u)	/* MCS3 Channel ACB Register */
#define GTM_MCS3_CH7_ACB	(*( GTM_MCS0_CH0_ACB_type *) 0xf01603a8u)	/* MCS3 Channel ACB Register */

