svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EN             : 1;	/* Enable MCS-channel */
		/* const */ unsigned int IRQ            : 1;	/* Interrupt state */
		/* const */ unsigned int ERR            : 1;	/* Error state */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		/* const */ unsigned int CY             : 1;	/* Carry bit state */
		/* const */ unsigned int Z              : 1;	/* Zero bit state */
		/* const */ unsigned int V              : 1;	/* Overflow bit state */
		/* const */ unsigned int N              : 1;	/* Negative bit state */
		/* const */ unsigned int CAT            : 1;	/* Cancel ARU transfer state */
		/* const */ unsigned int CWT            : 1;	/* Cancel WURM instruction state */
		/* const */ unsigned int Reserved_11    : 6;	/* Reserved */
		/* const */ unsigned int SP_CNT         : 3;	/* Stack pointer counter value */
		/* const */ unsigned int Reserved_13    : 13;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_CTRL_type;
#define GTM_MCS0_CH0_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130000u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH1_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130080u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH2_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130100u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH3_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130180u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH4_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130200u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH5_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130280u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH6_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130300u)	/* MCS0 Channel Control Register */
#define GTM_MCS0_CH7_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0130380u)	/* MCS0 Channel Control Register */
#define GTM_MCS1_CH0_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140000u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH1_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140080u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH2_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140100u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH3_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140180u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH4_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140200u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH5_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140280u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH6_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140300u)	/* MCS1 Channel Control Register */
#define GTM_MCS1_CH7_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0140380u)	/* MCS1 Channel Control Register */
#define GTM_MCS2_CH0_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150000u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH1_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150080u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH2_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150100u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH3_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150180u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH4_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150200u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH5_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150280u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH6_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150300u)	/* MCS2 Channel Control Register */
#define GTM_MCS2_CH7_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0150380u)	/* MCS2 Channel Control Register */
#define GTM_MCS3_CH0_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160000u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH1_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160080u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH2_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160100u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH3_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160180u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH4_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160200u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH5_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160280u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH6_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160300u)	/* MCS3 Channel Control Register */
#define GTM_MCS3_CH7_CTRL	(*( GTM_MCS0_CH0_CTRL_type *) 0xf0160380u)	/* MCS3 Channel Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MCS_IRQ_EN     : 1;	/* MCS channel x MCS_IRQ interrupt enable */
		unsigned int STK_ERR_IRQ_EN : 1;	/* MCS channel x STK_ERR_IRQ interrupt enable */
		unsigned int MEM_ERR_IRQ_EN : 1;	/* MCS channel x MEM_ERR_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_IRQ_EN_type;
#define GTM_MCS0_CH0_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0130030u)	/* MCS0 Channel 0 Interrupt Enable Register */
#define GTM_MCS0_CH1_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01300b0u)	/* MCS0 Channel 1 Interrupt Enable Register */
#define GTM_MCS0_CH2_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0130130u)	/* MCS0 Channel 2 Interrupt Enable Register */
#define GTM_MCS0_CH3_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01301b0u)	/* MCS0 Channel 3 Interrupt Enable Register */
#define GTM_MCS0_CH4_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0130230u)	/* MCS0 Channel 4 Interrupt Enable Register */
#define GTM_MCS0_CH5_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01302b0u)	/* MCS0 Channel 5 Interrupt Enable Register */
#define GTM_MCS0_CH6_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0130330u)	/* MCS0 Channel 6 Interrupt Enable Register */
#define GTM_MCS0_CH7_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01303b0u)	/* MCS0 Channel 7 Interrupt Enable Register */
#define GTM_MCS1_CH0_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0140030u)	/* MCS1 Channel 0 Interrupt Enable Register */
#define GTM_MCS1_CH1_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01400b0u)	/* MCS1 Channel 1 Interrupt Enable Register */
#define GTM_MCS1_CH2_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0140130u)	/* MCS1 Channel 2 Interrupt Enable Register */
#define GTM_MCS1_CH3_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01401b0u)	/* MCS1 Channel 3 Interrupt Enable Register */
#define GTM_MCS1_CH4_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0140230u)	/* MCS1 Channel 4 Interrupt Enable Register */
#define GTM_MCS1_CH5_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01402b0u)	/* MCS1 Channel 5 Interrupt Enable Register */
#define GTM_MCS1_CH6_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0140330u)	/* MCS1 Channel 6 Interrupt Enable Register */
#define GTM_MCS1_CH7_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01403b0u)	/* MCS1 Channel 7 Interrupt Enable Register */
#define GTM_MCS2_CH0_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0150030u)	/* MCS2 Channel 0 Interrupt Enable Register */
#define GTM_MCS2_CH1_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01500b0u)	/* MCS2 Channel 1 Interrupt Enable Register */
#define GTM_MCS2_CH2_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0150130u)	/* MCS2 Channel 2 Interrupt Enable Register */
#define GTM_MCS2_CH3_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01501b0u)	/* MCS2 Channel 3 Interrupt Enable Register */
#define GTM_MCS2_CH4_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0150230u)	/* MCS2 Channel 4 Interrupt Enable Register */
#define GTM_MCS2_CH5_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01502b0u)	/* MCS2 Channel 5 Interrupt Enable Register */
#define GTM_MCS2_CH6_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0150330u)	/* MCS2 Channel 6 Interrupt Enable Register */
#define GTM_MCS2_CH7_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01503b0u)	/* MCS2 Channel 7 Interrupt Enable Register */
#define GTM_MCS3_CH0_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0160030u)	/* MCS3 Channel 0 Interrupt Enable Register */
#define GTM_MCS3_CH1_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01600b0u)	/* MCS3 Channel 1 Interrupt Enable Register */
#define GTM_MCS3_CH2_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0160130u)	/* MCS3 Channel 2 Interrupt Enable Register */
#define GTM_MCS3_CH3_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01601b0u)	/* MCS3 Channel 3 Interrupt Enable Register */
#define GTM_MCS3_CH4_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0160230u)	/* MCS3 Channel 4 Interrupt Enable Register */
#define GTM_MCS3_CH5_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01602b0u)	/* MCS3 Channel 5 Interrupt Enable Register */
#define GTM_MCS3_CH6_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf0160330u)	/* MCS3 Channel 6 Interrupt Enable Register */
#define GTM_MCS3_CH7_IRQ_EN	(*( GTM_MCS0_CH0_IRQ_EN_type *) 0xf01603b0u)	/* MCS3 Channel 7 Interrupt Enable Register */

