svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TRG_MCS_IRQ    : 1;	/* Trigger IRQ bit in MCS_CH_[x]_IRQ_NOTIFY register by software */
		unsigned int TRG_STK_ERR_IRQ: 1;	/* Trigger IRQ bit in MCS_CH_[x]_IRQ_NOTIFY register by software */
		unsigned int TRG_MEM_ERR_IRQ: 1;	/* Trigger IRQ bit in MCS_CH_[x]_IRQ_NOTIFY register by software */
		/* const */ unsigned int Reserved       : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_IRQ_FORCINT_type;
#define GTM_MCS0_CH0_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0130034u)	/* MCS0 Channel 0 Software Interrupt Generation Register */
#define GTM_MCS0_CH1_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01300b4u)	/* MCS0 Channel 1 Software Interrupt Generation Register */
#define GTM_MCS0_CH2_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0130134u)	/* MCS0 Channel 2 Software Interrupt Generation Register */
#define GTM_MCS0_CH3_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01301b4u)	/* MCS0 Channel 3 Software Interrupt Generation Register */
#define GTM_MCS0_CH4_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0130234u)	/* MCS0 Channel 4 Software Interrupt Generation Register */
#define GTM_MCS0_CH5_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01302b4u)	/* MCS0 Channel 5 Software Interrupt Generation Register */
#define GTM_MCS0_CH6_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0130334u)	/* MCS0 Channel 6 Software Interrupt Generation Register */
#define GTM_MCS0_CH7_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01303b4u)	/* MCS0 Channel 7 Software Interrupt Generation Register */
#define GTM_MCS1_CH0_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0140034u)	/* MCS1 Channel 0 Software Interrupt Generation Register */
#define GTM_MCS1_CH1_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01400b4u)	/* MCS1 Channel 1 Software Interrupt Generation Register */
#define GTM_MCS1_CH2_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0140134u)	/* MCS1 Channel 2 Software Interrupt Generation Register */
#define GTM_MCS1_CH3_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01401b4u)	/* MCS1 Channel 3 Software Interrupt Generation Register */
#define GTM_MCS1_CH4_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0140234u)	/* MCS1 Channel 4 Software Interrupt Generation Register */
#define GTM_MCS1_CH5_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01402b4u)	/* MCS1 Channel 5 Software Interrupt Generation Register */
#define GTM_MCS1_CH6_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0140334u)	/* MCS1 Channel 6 Software Interrupt Generation Register */
#define GTM_MCS1_CH7_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01403b4u)	/* MCS1 Channel 7 Software Interrupt Generation Register */
#define GTM_MCS2_CH0_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0150034u)	/* MCS2 Channel 0 Software Interrupt Generation Register */
#define GTM_MCS2_CH1_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01500b4u)	/* MCS2 Channel 1 Software Interrupt Generation Register */
#define GTM_MCS2_CH2_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0150134u)	/* MCS2 Channel 2 Software Interrupt Generation Register */
#define GTM_MCS2_CH3_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01501b4u)	/* MCS2 Channel 3 Software Interrupt Generation Register */
#define GTM_MCS2_CH4_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0150234u)	/* MCS2 Channel 4 Software Interrupt Generation Register */
#define GTM_MCS2_CH5_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01502b4u)	/* MCS2 Channel 5 Software Interrupt Generation Register */
#define GTM_MCS2_CH6_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0150334u)	/* MCS2 Channel 6 Software Interrupt Generation Register */
#define GTM_MCS2_CH7_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01503b4u)	/* MCS2 Channel 7 Software Interrupt Generation Register */
#define GTM_MCS3_CH0_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0160034u)	/* MCS3 Channel 0 Software Interrupt Generation Register */
#define GTM_MCS3_CH1_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01600b4u)	/* MCS3 Channel 1 Software Interrupt Generation Register */
#define GTM_MCS3_CH2_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0160134u)	/* MCS3 Channel 2 Software Interrupt Generation Register */
#define GTM_MCS3_CH3_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01601b4u)	/* MCS3 Channel 3 Software Interrupt Generation Register */
#define GTM_MCS3_CH4_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0160234u)	/* MCS3 Channel 4 Software Interrupt Generation Register */
#define GTM_MCS3_CH5_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01602b4u)	/* MCS3 Channel 5 Software Interrupt Generation Register */
#define GTM_MCS3_CH6_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf0160334u)	/* MCS3 Channel 6 Software Interrupt Generation Register */
#define GTM_MCS3_CH7_IRQ_FORCINT	(*( GTM_MCS0_CH0_IRQ_FORCINT_type *) 0xf01603b4u)	/* MCS3 Channel 7 Software Interrupt Generation Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MCS_IRQ        : 1;	/* Interrupt request by MCS-channel x */
		unsigned int STK_ERR_IRQ    : 1;	/* Stack counter overflow/underflow of channel x */
		unsigned int MEM_ERR_IRQ    : 1;	/* Memory access out of range in channel x */
		/* const */ unsigned int Reserved       : 29;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_IRQ_NOTIFY_type;
#define GTM_MCS0_CH0_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf013002cu)	/* MCS0 Channel 0 interrupt notification register */
#define GTM_MCS0_CH1_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01300acu)	/* MCS0 Channel 1 interrupt notification register */
#define GTM_MCS0_CH2_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf013012cu)	/* MCS0 Channel 2 interrupt notification register */
#define GTM_MCS0_CH3_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01301acu)	/* MCS0 Channel 3 interrupt notification register */
#define GTM_MCS0_CH4_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf013022cu)	/* MCS0 Channel 4 interrupt notification register */
#define GTM_MCS0_CH5_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01302acu)	/* MCS0 Channel 5 interrupt notification register */
#define GTM_MCS0_CH6_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf013032cu)	/* MCS0 Channel 6 interrupt notification register */
#define GTM_MCS0_CH7_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01303acu)	/* MCS0 Channel 7 interrupt notification register */
#define GTM_MCS1_CH0_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf014002cu)	/* MCS1 Channel 0 interrupt notification register */
#define GTM_MCS1_CH1_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01400acu)	/* MCS1 Channel 1 interrupt notification register */
#define GTM_MCS1_CH2_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf014012cu)	/* MCS1 Channel 2 interrupt notification register */
#define GTM_MCS1_CH3_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01401acu)	/* MCS1 Channel 3 interrupt notification register */
#define GTM_MCS1_CH4_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf014022cu)	/* MCS1 Channel 4 interrupt notification register */
#define GTM_MCS1_CH5_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01402acu)	/* MCS1 Channel 5 interrupt notification register */
#define GTM_MCS1_CH6_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf014032cu)	/* MCS1 Channel 6 interrupt notification register */
#define GTM_MCS1_CH7_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01403acu)	/* MCS1 Channel 7 interrupt notification register */
#define GTM_MCS2_CH0_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf015002cu)	/* MCS2 Channel 0 interrupt notification register */
#define GTM_MCS2_CH1_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01500acu)	/* MCS2 Channel 1 interrupt notification register */
#define GTM_MCS2_CH2_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf015012cu)	/* MCS2 Channel 2 interrupt notification register */
#define GTM_MCS2_CH3_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01501acu)	/* MCS2 Channel 3 interrupt notification register */
#define GTM_MCS2_CH4_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf015022cu)	/* MCS2 Channel 4 interrupt notification register */
#define GTM_MCS2_CH5_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01502acu)	/* MCS2 Channel 5 interrupt notification register */
#define GTM_MCS2_CH6_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf015032cu)	/* MCS2 Channel 6 interrupt notification register */
#define GTM_MCS2_CH7_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01503acu)	/* MCS2 Channel 7 interrupt notification register */
#define GTM_MCS3_CH0_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf016002cu)	/* MCS3 Channel 0 interrupt notification register */
#define GTM_MCS3_CH1_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01600acu)	/* MCS3 Channel 1 interrupt notification register */
#define GTM_MCS3_CH2_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf016012cu)	/* MCS3 Channel 2 interrupt notification register */
#define GTM_MCS3_CH3_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01601acu)	/* MCS3 Channel 3 interrupt notification register */
#define GTM_MCS3_CH4_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf016022cu)	/* MCS3 Channel 4 interrupt notification register */
#define GTM_MCS3_CH5_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01602acu)	/* MCS3 Channel 5 interrupt notification register */
#define GTM_MCS3_CH6_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf016032cu)	/* MCS3 Channel 6 interrupt notification register */
#define GTM_MCS3_CH7_IRQ_NOTIFY	(*( GTM_MCS0_CH0_IRQ_NOTIFY_type *) 0xf01603acu)	/* MCS3 Channel 7 interrupt notification register */

