svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int bPC            : 14;	/* Current Program Counter */
		/* const */ unsigned int Reserved       : 18;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_PC_type;
#define GTM_MCS0_CH0_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130004u)	/* MCS0 Channel 0 Program Counter Register */
#define GTM_MCS0_CH1_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130084u)	/* MCS0 Channel 1 Program Counter Register */
#define GTM_MCS0_CH2_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130104u)	/* MCS0 Channel 2 Program Counter Register */
#define GTM_MCS0_CH3_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130184u)	/* MCS0 Channel 3 Program Counter Register */
#define GTM_MCS0_CH4_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130204u)	/* MCS0 Channel 4 Program Counter Register */
#define GTM_MCS0_CH5_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130284u)	/* MCS0 Channel 5 Program Counter Register */
#define GTM_MCS0_CH6_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130304u)	/* MCS0 Channel 6 Program Counter Register */
#define GTM_MCS0_CH7_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0130384u)	/* MCS0 Channel 7 Program Counter Register */
#define GTM_MCS1_CH0_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140004u)	/* MCS1 Channel 0 Program Counter Register */
#define GTM_MCS1_CH1_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140084u)	/* MCS1 Channel 1 Program Counter Register */
#define GTM_MCS1_CH2_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140104u)	/* MCS1 Channel 2 Program Counter Register */
#define GTM_MCS1_CH3_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140184u)	/* MCS1 Channel 3 Program Counter Register */
#define GTM_MCS1_CH4_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140204u)	/* MCS1 Channel 4 Program Counter Register */
#define GTM_MCS1_CH5_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140284u)	/* MCS1 Channel 5 Program Counter Register */
#define GTM_MCS1_CH6_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140304u)	/* MCS1 Channel 6 Program Counter Register */
#define GTM_MCS1_CH7_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0140384u)	/* MCS1 Channel 7 Program Counter Register */
#define GTM_MCS2_CH0_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150004u)	/* MCS2 Channel 0 Program Counter Register */
#define GTM_MCS2_CH1_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150084u)	/* MCS2 Channel 1 Program Counter Register */
#define GTM_MCS2_CH2_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150104u)	/* MCS2 Channel 2 Program Counter Register */
#define GTM_MCS2_CH3_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150184u)	/* MCS2 Channel 3 Program Counter Register */
#define GTM_MCS2_CH4_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150204u)	/* MCS2 Channel 4 Program Counter Register */
#define GTM_MCS2_CH5_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150284u)	/* MCS2 Channel 5 Program Counter Register */
#define GTM_MCS2_CH6_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150304u)	/* MCS2 Channel 6 Program Counter Register */
#define GTM_MCS2_CH7_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0150384u)	/* MCS2 Channel 7 Program Counter Register */
#define GTM_MCS3_CH0_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160004u)	/* MCS3 Channel 0 Program Counter Register */
#define GTM_MCS3_CH1_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160084u)	/* MCS3 Channel 1 Program Counter Register */
#define GTM_MCS3_CH2_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160104u)	/* MCS3 Channel 2 Program Counter Register */
#define GTM_MCS3_CH3_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160184u)	/* MCS3 Channel 3 Program Counter Register */
#define GTM_MCS3_CH4_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160204u)	/* MCS3 Channel 4 Program Counter Register */
#define GTM_MCS3_CH5_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160284u)	/* MCS3 Channel 5 Program Counter Register */
#define GTM_MCS3_CH6_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160304u)	/* MCS3 Channel 6 Program Counter Register */
#define GTM_MCS3_CH7_PC	(*( GTM_MCS0_CH0_PC_type *) 0xf0160384u)	/* MCS3 Channel 7 Program Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DATA           : 24;	/* Data of MCS general purpose register ry */
		/* const */ unsigned int Reserved       : 8;	/* Read as zero, should be written as zero */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CH0_R0_type;
#define GTM_MCS0_CH0_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130008u)	/* MCS0 Channel 0 Program Counter Register 0 */
#define GTM_MCS0_CH0_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013000cu)	/* MCS0 Channel 0 Program Counter Register 1 */
#define GTM_MCS0_CH0_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130010u)	/* MCS0 Channel 0 Program Counter Register 2 */
#define GTM_MCS0_CH0_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130014u)	/* MCS0 Channel 0 Program Counter Register 3 */
#define GTM_MCS0_CH0_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130018u)	/* MCS0 Channel 0 Program Counter Register 4 */
#define GTM_MCS0_CH0_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013001cu)	/* MCS0 Channel 0 Program Counter Register 5 */
#define GTM_MCS0_CH0_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0130020u)	/* MCS0 Channel 0 Program Counter Register 6 */
#define GTM_MCS0_CH0_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0130024u)	/* MCS0 Channel 0 Program Counter Register 7 */
#define GTM_MCS0_CH1_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130088u)	/* MCS0 Channel 1 Program Counter Register 0 */
#define GTM_MCS0_CH1_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013008cu)	/* MCS0 Channel 1 Program Counter Register 1 */
#define GTM_MCS0_CH1_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130090u)	/* MCS0 Channel 1 Program Counter Register 2 */
#define GTM_MCS0_CH1_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130094u)	/* MCS0 Channel 1 Program Counter Register 3 */
#define GTM_MCS0_CH1_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130098u)	/* MCS0 Channel 1 Program Counter Register 4 */
#define GTM_MCS0_CH1_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013009cu)	/* MCS0 Channel 1 Program Counter Register 5 */
#define GTM_MCS0_CH1_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01300a0u)	/* MCS0 Channel 1 Program Counter Register 6 */
#define GTM_MCS0_CH1_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01300a4u)	/* MCS0 Channel 1 Program Counter Register 7 */
#define GTM_MCS0_CH2_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130108u)	/* MCS0 Channel 2 Program Counter Register 0 */
#define GTM_MCS0_CH2_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013010cu)	/* MCS0 Channel 2 Program Counter Register 1 */
#define GTM_MCS0_CH2_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130110u)	/* MCS0 Channel 2 Program Counter Register 2 */
#define GTM_MCS0_CH2_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130114u)	/* MCS0 Channel 2 Program Counter Register 3 */
#define GTM_MCS0_CH2_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130118u)	/* MCS0 Channel 2 Program Counter Register 4 */
#define GTM_MCS0_CH2_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013011cu)	/* MCS0 Channel 2 Program Counter Register 5 */
#define GTM_MCS0_CH2_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0130120u)	/* MCS0 Channel 2 Program Counter Register 6 */
#define GTM_MCS0_CH2_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0130124u)	/* MCS0 Channel 2 Program Counter Register 7 */
#define GTM_MCS0_CH3_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130188u)	/* MCS0 Channel 3 Program Counter Register 0 */
#define GTM_MCS0_CH3_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013018cu)	/* MCS0 Channel 3 Program Counter Register 1 */
#define GTM_MCS0_CH3_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130190u)	/* MCS0 Channel 3 Program Counter Register 2 */
#define GTM_MCS0_CH3_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130194u)	/* MCS0 Channel 3 Program Counter Register 3 */
#define GTM_MCS0_CH3_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130198u)	/* MCS0 Channel 3 Program Counter Register 4 */
#define GTM_MCS0_CH3_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013019cu)	/* MCS0 Channel 3 Program Counter Register 5 */
#define GTM_MCS0_CH3_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01301a0u)	/* MCS0 Channel 3 Program Counter Register 6 */
#define GTM_MCS0_CH3_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01301a4u)	/* MCS0 Channel 3 Program Counter Register 7 */
#define GTM_MCS0_CH4_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130208u)	/* MCS0 Channel 4 Program Counter Register 0 */
#define GTM_MCS0_CH4_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013020cu)	/* MCS0 Channel 4 Program Counter Register 1 */
#define GTM_MCS0_CH4_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130210u)	/* MCS0 Channel 4 Program Counter Register 2 */
#define GTM_MCS0_CH4_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130214u)	/* MCS0 Channel 4 Program Counter Register 3 */
#define GTM_MCS0_CH4_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130218u)	/* MCS0 Channel 4 Program Counter Register 4 */
#define GTM_MCS0_CH4_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013021cu)	/* MCS0 Channel 4 Program Counter Register 5 */
#define GTM_MCS0_CH4_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0130220u)	/* MCS0 Channel 4 Program Counter Register 6 */
#define GTM_MCS0_CH4_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0130224u)	/* MCS0 Channel 4 Program Counter Register 7 */
#define GTM_MCS0_CH5_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130288u)	/* MCS0 Channel 5 Program Counter Register 0 */
#define GTM_MCS0_CH5_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013028cu)	/* MCS0 Channel 5 Program Counter Register 1 */
#define GTM_MCS0_CH5_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130290u)	/* MCS0 Channel 5 Program Counter Register 2 */
#define GTM_MCS0_CH5_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130294u)	/* MCS0 Channel 5 Program Counter Register 3 */
#define GTM_MCS0_CH5_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130298u)	/* MCS0 Channel 5 Program Counter Register 4 */
#define GTM_MCS0_CH5_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013029cu)	/* MCS0 Channel 5 Program Counter Register 5 */
#define GTM_MCS0_CH5_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01302a0u)	/* MCS0 Channel 5 Program Counter Register 6 */
#define GTM_MCS0_CH5_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01302a4u)	/* MCS0 Channel 5 Program Counter Register 7 */
#define GTM_MCS0_CH6_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130308u)	/* MCS0 Channel 6 Program Counter Register 0 */
#define GTM_MCS0_CH6_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013030cu)	/* MCS0 Channel 6 Program Counter Register 1 */
#define GTM_MCS0_CH6_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130310u)	/* MCS0 Channel 6 Program Counter Register 2 */
#define GTM_MCS0_CH6_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130314u)	/* MCS0 Channel 6 Program Counter Register 3 */
#define GTM_MCS0_CH6_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130318u)	/* MCS0 Channel 6 Program Counter Register 4 */
#define GTM_MCS0_CH6_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013031cu)	/* MCS0 Channel 6 Program Counter Register 5 */
#define GTM_MCS0_CH6_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0130320u)	/* MCS0 Channel 6 Program Counter Register 6 */
#define GTM_MCS0_CH6_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0130324u)	/* MCS0 Channel 6 Program Counter Register 7 */
#define GTM_MCS0_CH7_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0130388u)	/* MCS0 Channel 7 Program Counter Register 0 */
#define GTM_MCS0_CH7_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf013038cu)	/* MCS0 Channel 7 Program Counter Register 1 */
#define GTM_MCS0_CH7_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0130390u)	/* MCS0 Channel 7 Program Counter Register 2 */
#define GTM_MCS0_CH7_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0130394u)	/* MCS0 Channel 7 Program Counter Register 3 */
#define GTM_MCS0_CH7_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0130398u)	/* MCS0 Channel 7 Program Counter Register 4 */
#define GTM_MCS0_CH7_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf013039cu)	/* MCS0 Channel 7 Program Counter Register 5 */
#define GTM_MCS0_CH7_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01303a0u)	/* MCS0 Channel 7 Program Counter Register 6 */
#define GTM_MCS0_CH7_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01303a4u)	/* MCS0 Channel 7 Program Counter Register 7 */
#define GTM_MCS1_CH0_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140008u)	/* MCS1 Channel 0 Program Counter Register 0 */
#define GTM_MCS1_CH0_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014000cu)	/* MCS1 Channel 0 Program Counter Register 1 */
#define GTM_MCS1_CH0_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140010u)	/* MCS1 Channel 0 Program Counter Register 2 */
#define GTM_MCS1_CH0_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140014u)	/* MCS1 Channel 0 Program Counter Register 3 */
#define GTM_MCS1_CH0_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140018u)	/* MCS1 Channel 0 Program Counter Register 4 */
#define GTM_MCS1_CH0_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014001cu)	/* MCS1 Channel 0 Program Counter Register 5 */
#define GTM_MCS1_CH0_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0140020u)	/* MCS1 Channel 0 Program Counter Register 6 */
#define GTM_MCS1_CH0_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0140024u)	/* MCS1 Channel 0 Program Counter Register 7 */
#define GTM_MCS1_CH1_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140088u)	/* MCS1 Channel 1 Program Counter Register 0 */
#define GTM_MCS1_CH1_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014008cu)	/* MCS1 Channel 1 Program Counter Register 1 */
#define GTM_MCS1_CH1_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140090u)	/* MCS1 Channel 1 Program Counter Register 2 */
#define GTM_MCS1_CH1_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140094u)	/* MCS1 Channel 1 Program Counter Register 3 */
#define GTM_MCS1_CH1_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140098u)	/* MCS1 Channel 1 Program Counter Register 4 */
#define GTM_MCS1_CH1_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014009cu)	/* MCS1 Channel 1 Program Counter Register 5 */
#define GTM_MCS1_CH1_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01400a0u)	/* MCS1 Channel 1 Program Counter Register 6 */
#define GTM_MCS1_CH1_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01400a4u)	/* MCS1 Channel 1 Program Counter Register 7 */
#define GTM_MCS1_CH2_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140108u)	/* MCS1 Channel 2 Program Counter Register 0 */
#define GTM_MCS1_CH2_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014010cu)	/* MCS1 Channel 2 Program Counter Register 1 */
#define GTM_MCS1_CH2_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140110u)	/* MCS1 Channel 2 Program Counter Register 2 */
#define GTM_MCS1_CH2_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140114u)	/* MCS1 Channel 2 Program Counter Register 3 */
#define GTM_MCS1_CH2_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140118u)	/* MCS1 Channel 2 Program Counter Register 4 */
#define GTM_MCS1_CH2_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014011cu)	/* MCS1 Channel 2 Program Counter Register 5 */
#define GTM_MCS1_CH2_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0140120u)	/* MCS1 Channel 2 Program Counter Register 6 */
#define GTM_MCS1_CH2_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0140124u)	/* MCS1 Channel 2 Program Counter Register 7 */
#define GTM_MCS1_CH3_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140188u)	/* MCS1 Channel 3 Program Counter Register 0 */
#define GTM_MCS1_CH3_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014018cu)	/* MCS1 Channel 3 Program Counter Register 1 */
#define GTM_MCS1_CH3_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140190u)	/* MCS1 Channel 3 Program Counter Register 2 */
#define GTM_MCS1_CH3_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140194u)	/* MCS1 Channel 3 Program Counter Register 3 */
#define GTM_MCS1_CH3_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140198u)	/* MCS1 Channel 3 Program Counter Register 4 */
#define GTM_MCS1_CH3_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014019cu)	/* MCS1 Channel 3 Program Counter Register 5 */
#define GTM_MCS1_CH3_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01401a0u)	/* MCS1 Channel 3 Program Counter Register 6 */
#define GTM_MCS1_CH3_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01401a4u)	/* MCS1 Channel 3 Program Counter Register 7 */
#define GTM_MCS1_CH4_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140208u)	/* MCS1 Channel 4 Program Counter Register 0 */
#define GTM_MCS1_CH4_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014020cu)	/* MCS1 Channel 4 Program Counter Register 1 */
#define GTM_MCS1_CH4_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140210u)	/* MCS1 Channel 4 Program Counter Register 2 */
#define GTM_MCS1_CH4_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140214u)	/* MCS1 Channel 4 Program Counter Register 3 */
#define GTM_MCS1_CH4_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140218u)	/* MCS1 Channel 4 Program Counter Register 4 */
#define GTM_MCS1_CH4_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014021cu)	/* MCS1 Channel 4 Program Counter Register 5 */
#define GTM_MCS1_CH4_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0140220u)	/* MCS1 Channel 4 Program Counter Register 6 */
#define GTM_MCS1_CH4_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0140224u)	/* MCS1 Channel 4 Program Counter Register 7 */
#define GTM_MCS1_CH5_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140288u)	/* MCS1 Channel 5 Program Counter Register 0 */
#define GTM_MCS1_CH5_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014028cu)	/* MCS1 Channel 5 Program Counter Register 1 */
#define GTM_MCS1_CH5_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140290u)	/* MCS1 Channel 5 Program Counter Register 2 */
#define GTM_MCS1_CH5_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140294u)	/* MCS1 Channel 5 Program Counter Register 3 */
#define GTM_MCS1_CH5_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140298u)	/* MCS1 Channel 5 Program Counter Register 4 */
#define GTM_MCS1_CH5_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014029cu)	/* MCS1 Channel 5 Program Counter Register 5 */
#define GTM_MCS1_CH5_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01402a0u)	/* MCS1 Channel 5 Program Counter Register 6 */
#define GTM_MCS1_CH5_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01402a4u)	/* MCS1 Channel 5 Program Counter Register 7 */
#define GTM_MCS1_CH6_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140308u)	/* MCS1 Channel 6 Program Counter Register 0 */
#define GTM_MCS1_CH6_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014030cu)	/* MCS1 Channel 6 Program Counter Register 1 */
#define GTM_MCS1_CH6_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140310u)	/* MCS1 Channel 6 Program Counter Register 2 */
#define GTM_MCS1_CH6_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140314u)	/* MCS1 Channel 6 Program Counter Register 3 */
#define GTM_MCS1_CH6_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140318u)	/* MCS1 Channel 6 Program Counter Register 4 */
#define GTM_MCS1_CH6_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014031cu)	/* MCS1 Channel 6 Program Counter Register 5 */
#define GTM_MCS1_CH6_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0140320u)	/* MCS1 Channel 6 Program Counter Register 6 */
#define GTM_MCS1_CH6_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0140324u)	/* MCS1 Channel 6 Program Counter Register 7 */
#define GTM_MCS1_CH7_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0140388u)	/* MCS1 Channel 7 Program Counter Register 0 */
#define GTM_MCS1_CH7_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf014038cu)	/* MCS1 Channel 7 Program Counter Register 1 */
#define GTM_MCS1_CH7_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0140390u)	/* MCS1 Channel 7 Program Counter Register 2 */
#define GTM_MCS1_CH7_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0140394u)	/* MCS1 Channel 7 Program Counter Register 3 */
#define GTM_MCS1_CH7_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0140398u)	/* MCS1 Channel 7 Program Counter Register 4 */
#define GTM_MCS1_CH7_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf014039cu)	/* MCS1 Channel 7 Program Counter Register 5 */
#define GTM_MCS1_CH7_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01403a0u)	/* MCS1 Channel 7 Program Counter Register 6 */
#define GTM_MCS1_CH7_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01403a4u)	/* MCS1 Channel 7 Program Counter Register 7 */
#define GTM_MCS2_CH0_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150008u)	/* MCS2 Channel 0 Program Counter Register 0 */
#define GTM_MCS2_CH0_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015000cu)	/* MCS2 Channel 0 Program Counter Register 1 */
#define GTM_MCS2_CH0_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150010u)	/* MCS2 Channel 0 Program Counter Register 2 */
#define GTM_MCS2_CH0_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150014u)	/* MCS2 Channel 0 Program Counter Register 3 */
#define GTM_MCS2_CH0_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150018u)	/* MCS2 Channel 0 Program Counter Register 4 */
#define GTM_MCS2_CH0_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015001cu)	/* MCS2 Channel 0 Program Counter Register 5 */
#define GTM_MCS2_CH0_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0150020u)	/* MCS2 Channel 0 Program Counter Register 6 */
#define GTM_MCS2_CH0_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0150024u)	/* MCS2 Channel 0 Program Counter Register 7 */
#define GTM_MCS2_CH1_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150088u)	/* MCS2 Channel 1 Program Counter Register 0 */
#define GTM_MCS2_CH1_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015008cu)	/* MCS2 Channel 1 Program Counter Register 1 */
#define GTM_MCS2_CH1_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150090u)	/* MCS2 Channel 1 Program Counter Register 2 */
#define GTM_MCS2_CH1_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150094u)	/* MCS2 Channel 1 Program Counter Register 3 */
#define GTM_MCS2_CH1_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150098u)	/* MCS2 Channel 1 Program Counter Register 4 */
#define GTM_MCS2_CH1_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015009cu)	/* MCS2 Channel 1 Program Counter Register 5 */
#define GTM_MCS2_CH1_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01500a0u)	/* MCS2 Channel 1 Program Counter Register 6 */
#define GTM_MCS2_CH1_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01500a4u)	/* MCS2 Channel 1 Program Counter Register 7 */
#define GTM_MCS2_CH2_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150108u)	/* MCS2 Channel 2 Program Counter Register 0 */
#define GTM_MCS2_CH2_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015010cu)	/* MCS2 Channel 2 Program Counter Register 1 */
#define GTM_MCS2_CH2_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150110u)	/* MCS2 Channel 2 Program Counter Register 2 */
#define GTM_MCS2_CH2_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150114u)	/* MCS2 Channel 2 Program Counter Register 3 */
#define GTM_MCS2_CH2_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150118u)	/* MCS2 Channel 2 Program Counter Register 4 */
#define GTM_MCS2_CH2_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015011cu)	/* MCS2 Channel 2 Program Counter Register 5 */
#define GTM_MCS2_CH2_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0150120u)	/* MCS2 Channel 2 Program Counter Register 6 */
#define GTM_MCS2_CH2_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0150124u)	/* MCS2 Channel 2 Program Counter Register 7 */
#define GTM_MCS2_CH3_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150188u)	/* MCS2 Channel 3 Program Counter Register 0 */
#define GTM_MCS2_CH3_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015018cu)	/* MCS2 Channel 3 Program Counter Register 1 */
#define GTM_MCS2_CH3_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150190u)	/* MCS2 Channel 3 Program Counter Register 2 */
#define GTM_MCS2_CH3_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150194u)	/* MCS2 Channel 3 Program Counter Register 3 */
#define GTM_MCS2_CH3_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150198u)	/* MCS2 Channel 3 Program Counter Register 4 */
#define GTM_MCS2_CH3_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015019cu)	/* MCS2 Channel 3 Program Counter Register 5 */
#define GTM_MCS2_CH3_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01501a0u)	/* MCS2 Channel 3 Program Counter Register 6 */
#define GTM_MCS2_CH3_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01501a4u)	/* MCS2 Channel 3 Program Counter Register 7 */
#define GTM_MCS2_CH4_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150208u)	/* MCS2 Channel 4 Program Counter Register 0 */
#define GTM_MCS2_CH4_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015020cu)	/* MCS2 Channel 4 Program Counter Register 1 */
#define GTM_MCS2_CH4_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150210u)	/* MCS2 Channel 4 Program Counter Register 2 */
#define GTM_MCS2_CH4_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150214u)	/* MCS2 Channel 4 Program Counter Register 3 */
#define GTM_MCS2_CH4_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150218u)	/* MCS2 Channel 4 Program Counter Register 4 */
#define GTM_MCS2_CH4_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015021cu)	/* MCS2 Channel 4 Program Counter Register 5 */
#define GTM_MCS2_CH4_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0150220u)	/* MCS2 Channel 4 Program Counter Register 6 */
#define GTM_MCS2_CH4_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0150224u)	/* MCS2 Channel 4 Program Counter Register 7 */
#define GTM_MCS2_CH5_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150288u)	/* MCS2 Channel 5 Program Counter Register 0 */
#define GTM_MCS2_CH5_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015028cu)	/* MCS2 Channel 5 Program Counter Register 1 */
#define GTM_MCS2_CH5_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150290u)	/* MCS2 Channel 5 Program Counter Register 2 */
#define GTM_MCS2_CH5_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150294u)	/* MCS2 Channel 5 Program Counter Register 3 */
#define GTM_MCS2_CH5_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150298u)	/* MCS2 Channel 5 Program Counter Register 4 */
#define GTM_MCS2_CH5_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015029cu)	/* MCS2 Channel 5 Program Counter Register 5 */
