svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define GTM_MCS2_CH5_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01502a0u)	/* MCS2 Channel 5 Program Counter Register 6 */
#define GTM_MCS2_CH5_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01502a4u)	/* MCS2 Channel 5 Program Counter Register 7 */
#define GTM_MCS2_CH6_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150308u)	/* MCS2 Channel 6 Program Counter Register 0 */
#define GTM_MCS2_CH6_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015030cu)	/* MCS2 Channel 6 Program Counter Register 1 */
#define GTM_MCS2_CH6_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150310u)	/* MCS2 Channel 6 Program Counter Register 2 */
#define GTM_MCS2_CH6_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150314u)	/* MCS2 Channel 6 Program Counter Register 3 */
#define GTM_MCS2_CH6_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150318u)	/* MCS2 Channel 6 Program Counter Register 4 */
#define GTM_MCS2_CH6_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015031cu)	/* MCS2 Channel 6 Program Counter Register 5 */
#define GTM_MCS2_CH6_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0150320u)	/* MCS2 Channel 6 Program Counter Register 6 */
#define GTM_MCS2_CH6_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0150324u)	/* MCS2 Channel 6 Program Counter Register 7 */
#define GTM_MCS2_CH7_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0150388u)	/* MCS2 Channel 7 Program Counter Register 0 */
#define GTM_MCS2_CH7_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf015038cu)	/* MCS2 Channel 7 Program Counter Register 1 */
#define GTM_MCS2_CH7_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0150390u)	/* MCS2 Channel 7 Program Counter Register 2 */
#define GTM_MCS2_CH7_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0150394u)	/* MCS2 Channel 7 Program Counter Register 3 */
#define GTM_MCS2_CH7_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0150398u)	/* MCS2 Channel 7 Program Counter Register 4 */
#define GTM_MCS2_CH7_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf015039cu)	/* MCS2 Channel 7 Program Counter Register 5 */
#define GTM_MCS2_CH7_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01503a0u)	/* MCS2 Channel 7 Program Counter Register 6 */
#define GTM_MCS2_CH7_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01503a4u)	/* MCS2 Channel 7 Program Counter Register 7 */
#define GTM_MCS3_CH0_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160008u)	/* MCS3 Channel 0 Program Counter Register 0 */
#define GTM_MCS3_CH0_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016000cu)	/* MCS3 Channel 0 Program Counter Register 1 */
#define GTM_MCS3_CH0_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160010u)	/* MCS3 Channel 0 Program Counter Register 2 */
#define GTM_MCS3_CH0_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160014u)	/* MCS3 Channel 0 Program Counter Register 3 */
#define GTM_MCS3_CH0_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160018u)	/* MCS3 Channel 0 Program Counter Register 4 */
#define GTM_MCS3_CH0_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016001cu)	/* MCS3 Channel 0 Program Counter Register 5 */
#define GTM_MCS3_CH0_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0160020u)	/* MCS3 Channel 0 Program Counter Register 6 */
#define GTM_MCS3_CH0_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0160024u)	/* MCS3 Channel 0 Program Counter Register 7 */
#define GTM_MCS3_CH1_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160088u)	/* MCS3 Channel 1 Program Counter Register 0 */
#define GTM_MCS3_CH1_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016008cu)	/* MCS3 Channel 1 Program Counter Register 1 */
#define GTM_MCS3_CH1_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160090u)	/* MCS3 Channel 1 Program Counter Register 2 */
#define GTM_MCS3_CH1_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160094u)	/* MCS3 Channel 1 Program Counter Register 3 */
#define GTM_MCS3_CH1_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160098u)	/* MCS3 Channel 1 Program Counter Register 4 */
#define GTM_MCS3_CH1_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016009cu)	/* MCS3 Channel 1 Program Counter Register 5 */
#define GTM_MCS3_CH1_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01600a0u)	/* MCS3 Channel 1 Program Counter Register 6 */
#define GTM_MCS3_CH1_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01600a4u)	/* MCS3 Channel 1 Program Counter Register 7 */
#define GTM_MCS3_CH2_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160108u)	/* MCS3 Channel 2 Program Counter Register 0 */
#define GTM_MCS3_CH2_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016010cu)	/* MCS3 Channel 2 Program Counter Register 1 */
#define GTM_MCS3_CH2_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160110u)	/* MCS3 Channel 2 Program Counter Register 2 */
#define GTM_MCS3_CH2_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160114u)	/* MCS3 Channel 2 Program Counter Register 3 */
#define GTM_MCS3_CH2_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160118u)	/* MCS3 Channel 2 Program Counter Register 4 */
#define GTM_MCS3_CH2_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016011cu)	/* MCS3 Channel 2 Program Counter Register 5 */
#define GTM_MCS3_CH2_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0160120u)	/* MCS3 Channel 2 Program Counter Register 6 */
#define GTM_MCS3_CH2_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0160124u)	/* MCS3 Channel 2 Program Counter Register 7 */
#define GTM_MCS3_CH3_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160188u)	/* MCS3 Channel 3 Program Counter Register 0 */
#define GTM_MCS3_CH3_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016018cu)	/* MCS3 Channel 3 Program Counter Register 1 */
#define GTM_MCS3_CH3_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160190u)	/* MCS3 Channel 3 Program Counter Register 2 */
#define GTM_MCS3_CH3_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160194u)	/* MCS3 Channel 3 Program Counter Register 3 */
#define GTM_MCS3_CH3_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160198u)	/* MCS3 Channel 3 Program Counter Register 4 */
#define GTM_MCS3_CH3_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016019cu)	/* MCS3 Channel 3 Program Counter Register 5 */
#define GTM_MCS3_CH3_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01601a0u)	/* MCS3 Channel 3 Program Counter Register 6 */
#define GTM_MCS3_CH3_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01601a4u)	/* MCS3 Channel 3 Program Counter Register 7 */
#define GTM_MCS3_CH4_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160208u)	/* MCS3 Channel 4 Program Counter Register 0 */
#define GTM_MCS3_CH4_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016020cu)	/* MCS3 Channel 4 Program Counter Register 1 */
#define GTM_MCS3_CH4_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160210u)	/* MCS3 Channel 4 Program Counter Register 2 */
#define GTM_MCS3_CH4_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160214u)	/* MCS3 Channel 4 Program Counter Register 3 */
#define GTM_MCS3_CH4_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160218u)	/* MCS3 Channel 4 Program Counter Register 4 */
#define GTM_MCS3_CH4_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016021cu)	/* MCS3 Channel 4 Program Counter Register 5 */
#define GTM_MCS3_CH4_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0160220u)	/* MCS3 Channel 4 Program Counter Register 6 */
#define GTM_MCS3_CH4_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0160224u)	/* MCS3 Channel 4 Program Counter Register 7 */
#define GTM_MCS3_CH5_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160288u)	/* MCS3 Channel 5 Program Counter Register 0 */
#define GTM_MCS3_CH5_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016028cu)	/* MCS3 Channel 5 Program Counter Register 1 */
#define GTM_MCS3_CH5_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160290u)	/* MCS3 Channel 5 Program Counter Register 2 */
#define GTM_MCS3_CH5_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160294u)	/* MCS3 Channel 5 Program Counter Register 3 */
#define GTM_MCS3_CH5_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160298u)	/* MCS3 Channel 5 Program Counter Register 4 */
#define GTM_MCS3_CH5_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016029cu)	/* MCS3 Channel 5 Program Counter Register 5 */
#define GTM_MCS3_CH5_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01602a0u)	/* MCS3 Channel 5 Program Counter Register 6 */
#define GTM_MCS3_CH5_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01602a4u)	/* MCS3 Channel 5 Program Counter Register 7 */
#define GTM_MCS3_CH6_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160308u)	/* MCS3 Channel 6 Program Counter Register 0 */
#define GTM_MCS3_CH6_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016030cu)	/* MCS3 Channel 6 Program Counter Register 1 */
#define GTM_MCS3_CH6_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160310u)	/* MCS3 Channel 6 Program Counter Register 2 */
#define GTM_MCS3_CH6_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160314u)	/* MCS3 Channel 6 Program Counter Register 3 */
#define GTM_MCS3_CH6_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160318u)	/* MCS3 Channel 6 Program Counter Register 4 */
#define GTM_MCS3_CH6_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016031cu)	/* MCS3 Channel 6 Program Counter Register 5 */
#define GTM_MCS3_CH6_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf0160320u)	/* MCS3 Channel 6 Program Counter Register 6 */
#define GTM_MCS3_CH6_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf0160324u)	/* MCS3 Channel 6 Program Counter Register 7 */
#define GTM_MCS3_CH7_R0	(*( GTM_MCS0_CH0_R0_type *) 0xf0160388u)	/* MCS3 Channel 7 Program Counter Register 0 */
#define GTM_MCS3_CH7_R1	(*( GTM_MCS0_CH0_R0_type *) 0xf016038cu)	/* MCS3 Channel 7 Program Counter Register 1 */
#define GTM_MCS3_CH7_R2	(*( GTM_MCS0_CH0_R0_type *) 0xf0160390u)	/* MCS3 Channel 7 Program Counter Register 2 */
#define GTM_MCS3_CH7_R3	(*( GTM_MCS0_CH0_R0_type *) 0xf0160394u)	/* MCS3 Channel 7 Program Counter Register 3 */
#define GTM_MCS3_CH7_R4	(*( GTM_MCS0_CH0_R0_type *) 0xf0160398u)	/* MCS3 Channel 7 Program Counter Register 4 */
#define GTM_MCS3_CH7_R5	(*( GTM_MCS0_CH0_R0_type *) 0xf016039cu)	/* MCS3 Channel 7 Program Counter Register 5 */
#define GTM_MCS3_CH7_R6	(*( GTM_MCS0_CH0_R0_type *) 0xf01603a0u)	/* MCS3 Channel 7 Program Counter Register 6 */
#define GTM_MCS3_CH7_R7	(*( GTM_MCS0_CH0_R0_type *) 0xf01603a4u)	/* MCS3 Channel 7 Program Counter Register 7 */

