svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TRG0           : 1;	/* Trigger bit 0 */
		unsigned int TRG1           : 1;	/* Trigger bit 1 */
		unsigned int TRG2           : 1;	/* Trigger bit 2 */
		unsigned int TRG3           : 1;	/* Trigger bit 3 */
		unsigned int TRG4           : 1;	/* Trigger bit 4 */
		unsigned int TRG5           : 1;	/* Trigger bit 5 */
		unsigned int TRG6           : 1;	/* Trigger bit 6 */
		unsigned int TRG7           : 1;	/* Trigger bit 7 */
		unsigned int TRG8           : 1;	/* Trigger bit 8 */
		unsigned int TRG9           : 1;	/* Trigger bit 9 */
		unsigned int TRG10          : 1;	/* Trigger bit 10 */
		unsigned int TRG11          : 1;	/* Trigger bit 11 */
		unsigned int TRG12          : 1;	/* Trigger bit 12 */
		unsigned int TRG13          : 1;	/* Trigger bit 13 */
		unsigned int TRG14          : 1;	/* Trigger bit 14 */
		unsigned int TRG15          : 1;	/* Trigger bit 15 */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CTRG_type;
#define GTM_MCS0_CTRG	(*( GTM_MCS0_CTRG_type *) 0xf0130404u)	/* MCS0 Clear Trigger Control Register */
#define GTM_MCS1_CTRG	(*( GTM_MCS0_CTRG_type *) 0xf0140404u)	/* MCS1 Clear Trigger Control Register */
#define GTM_MCS2_CTRG	(*( GTM_MCS0_CTRG_type *) 0xf0150404u)	/* MCS2 Clear Trigger Control Register */
#define GTM_MCS3_CTRG	(*( GTM_MCS0_CTRG_type *) 0xf0160404u)	/* MCS3 Clear Trigger Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SCHED          : 1;	/* MCS submodule scheduling scheme */
		unsigned int HLT_SP_OFL     : 1;	/* Halt on stack pointer overflow */
		/* const */ unsigned int Reserved       : 14;	/* Reserved */
		/* const */ unsigned int RAM_RST        : 1;	/* RAM reset bit */
		/* const */ unsigned int Reserved_5     : 15;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_CTRL_type;
#define GTM_MCS0_CTRL	(*( GTM_MCS0_CTRL_type *) 0xf0130400u)	/* MCS0 Control Register */
#define GTM_MCS1_CTRL	(*( GTM_MCS0_CTRL_type *) 0xf0140400u)	/* MCS1 Control Register */
#define GTM_MCS2_CTRL	(*( GTM_MCS0_CTRL_type *) 0xf0150400u)	/* MCS2 Control Register */
#define GTM_MCS3_CTRL	(*( GTM_MCS0_CTRL_type *) 0xf0160400u)	/* MCS3 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ERR0           : 1;	/* Error State of MCS-channel 0 */
		unsigned int ERR1           : 1;	/* Error State of MCS-channel 1 */
		unsigned int ERR2           : 1;	/* Error State of MCS-channel 2 */
		unsigned int ERR3           : 1;	/* Error State of MCS-channel3 */
		unsigned int ERR4           : 1;	/* Error State of MCS-channel 4 */
		unsigned int ERR5           : 1;	/* Error State of MCS-channel 5 */
		unsigned int ERR6           : 1;	/* Error State of MCS-channel 6 */
		unsigned int ERR7           : 1;	/* Error State of MCS-channel 7 */
		/* const */ unsigned int Reserved       : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_ERR_type;
#define GTM_MCS0_ERR	(*( GTM_MCS0_ERR_type *) 0xf0130410u)	/* MCS0 Error Register */
#define GTM_MCS1_ERR	(*( GTM_MCS0_ERR_type *) 0xf0140410u)	/* MCS1 Error Register */
#define GTM_MCS2_ERR	(*( GTM_MCS0_ERR_type *) 0xf0150410u)	/* MCS2 Error Register */
#define GTM_MCS3_ERR	(*( GTM_MCS0_ERR_type *) 0xf0160410u)	/* MCS3 Error Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST0           : 1;	/* Software reset of channel 0 */
		unsigned int RST1           : 1;	/* Software reset of channel 1 */
		unsigned int RST2           : 1;	/* Software reset of channel 2 */
		unsigned int RST3           : 1;	/* Software reset of channel 3 */
		unsigned int RST4           : 1;	/* Software reset of channel 4 */
		unsigned int RST5           : 1;	/* Software reset of channel 5 */
		unsigned int RST6           : 1;	/* Software reset of channel 6 */
		unsigned int RST7           : 1;	/* Software reset of channel 7 */
		unsigned int CAT0           : 1;	/* Cancel ARU transfer for channel 0 */
		unsigned int CAT1           : 1;	/* Cancel ARU transfer for channel 1 */
		unsigned int CAT2           : 1;	/* Cancel ARU transfer for channel 2 */
		unsigned int CAT3           : 1;	/* Cancel ARU transfer for channel 3 */
		unsigned int CAT4           : 1;	/* Cancel ARU transfer for channel 4 */
		unsigned int CAT5           : 1;	/* Cancel ARU transfer for channel 5 */
		unsigned int CAT6           : 1;	/* Cancel ARU transfer for channel 6 */
		unsigned int CAT7           : 1;	/* Cancel ARU transfer for channel 7 */
		unsigned int CWT0           : 1;	/* Cancel WURM instruction for channel 0 */
		unsigned int CWT1           : 1;	/* Cancel WURM instruction for channel 1 */
		unsigned int CWT2           : 1;	/* Cancel WURM instruction for channel 2 */
		unsigned int CWT3           : 1;	/* Cancel WURM instruction for channel 3 */
		unsigned int CWT4           : 1;	/* Cancel WURM instruction for channel 4 */
		unsigned int CWT5           : 1;	/* Cancel WURM instruction for channel 5 */
		unsigned int CWT6           : 1;	/* Cancel WURM instruction for channel 6 */
		unsigned int CWT7           : 1;	/* Cancel WURM instruction for channel 7 */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_RST_type;
#define GTM_MCS0_RST	(*( GTM_MCS0_RST_type *) 0xf013040cu)	/* MCS0 Channel Reset Register */
#define GTM_MCS1_RST	(*( GTM_MCS0_RST_type *) 0xf014040cu)	/* MCS1 Channel Reset Register */
#define GTM_MCS2_RST	(*( GTM_MCS0_RST_type *) 0xf015040cu)	/* MCS2 Channel Reset Register */
#define GTM_MCS3_RST	(*( GTM_MCS0_RST_type *) 0xf016040cu)	/* MCS3 Channel Reset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG0           : 1;	/* Trigger bit 0 */
		unsigned int TRG1           : 1;	/* Trigger bit 1 */
		unsigned int TRG2           : 1;	/* Trigger bit 2 */
		unsigned int TRG3           : 1;	/* Trigger bit 3 */
		unsigned int TRG4           : 1;	/* Trigger bit 4 */
		unsigned int TRG5           : 1;	/* Trigger bit 5 */
		unsigned int TRG6           : 1;	/* Trigger bit 6 */
		unsigned int TRG7           : 1;	/* Trigger bit 7 */
		unsigned int TRG8           : 1;	/* trigger bit 8 */
		unsigned int TRG9           : 1;	/* Trigger bit 9 */
		unsigned int TRG10          : 1;	/* Trigger bit 10 */
		unsigned int TRG11          : 1;	/* Trigger bit 11 */
		unsigned int TRG12          : 1;	/* Trigger bit 12 */
		unsigned int TRG13          : 1;	/* Trigger bit 13 */
		unsigned int TRG14          : 1;	/* Trigger bit 14 */
		unsigned int TRG15          : 1;	/* Trigger bit 15 */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MCS0_STRG_type;
#define GTM_MCS0_STRG	(*( GTM_MCS0_STRG_type *) 0xf0130408u)	/* MCS0 Set Trigger Control Register */
#define GTM_MCS1_STRG	(*( GTM_MCS0_STRG_type *) 0xf0140408u)	/* MCS1 Set Trigger Control Register */
#define GTM_MCS2_STRG	(*( GTM_MCS0_STRG_type *) 0xf0150408u)	/* MCS2 Set Trigger Control Register */
#define GTM_MCS3_STRG	(*( GTM_MCS0_STRG_type *) 0xf0160408u)	/* MCS3 Set Trigger Control Register */

