svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MCA_0_0        : 1;	/* Activity of check performed in module MCS[0] at channel 0 */
		unsigned int MCA_0_1        : 1;	/* Activity of check performed in module MCS[0] at channel 1 */
		unsigned int MCA_0_2        : 1;	/* Activity of check performed in module MCS[0] at channel 2 */
		unsigned int MCA_0_3        : 1;	/* Activity of check performed in module MCS[0] at channel 3 */
		unsigned int MCA_0_4        : 1;	/* Activity of check performed in module MCS[0] at channel 4 */
		unsigned int MCA_0_5        : 1;	/* Activity of check performed in module MCS[0] at channel 5 */
		unsigned int MCA_0_6        : 1;	/* Activity of check performed in module MCS[0] at channel 6 */
		unsigned int MCA_0_7        : 1;	/* Activity of check performed in module MCS[0] at channel 7 */
		unsigned int MCA_1_0        : 1;	/* Activity of check performed in module MCS[1] at channel 0 */
		unsigned int MCA_1_1        : 1;	/* Activity of check performed in module MCS[1] at channel 1 */
		unsigned int MCA_1_2        : 1;	/* Activity of check performed in module MCS[1] at channel 2 */
		unsigned int MCA_1_3        : 1;	/* Activity of check performed in module MCS[1] at channel 3 */
		unsigned int MCA_1_4        : 1;	/* Activity of check performed in module MCS[1] at channel 4 */
		unsigned int MCA_1_5        : 1;	/* Activity of check performed in module MCS[1] at channel 5 */
		unsigned int MCA_1_6        : 1;	/* Activity of check performed in module MCS[1] at channel 6 */
		unsigned int MCA_1_7        : 1;	/* Activity of check performed in module MCS[1] at channel 7 */
		unsigned int MCA_2_0        : 1;	/* Activity of check performed in module MCS[2] at channel 0 */
		unsigned int MCA_2_1        : 1;	/* Activity of check performed in module MCS[2] at channel 1 */
		unsigned int MCA_2_2        : 1;	/* Activity of check performed in module MCS[2] at channel 2 */
		unsigned int MCA_2_3        : 1;	/* Activity of check performed in module MCS[2] at channel 3 */
		unsigned int MCA_2_4        : 1;	/* Activity of check performed in module MCS[2] at channel 4 */
		unsigned int MCA_2_5        : 1;	/* Activity of check performed in module MCS[2] at channel 5 */
		unsigned int MCA_2_6        : 1;	/* Activity of check performed in module MCS[2] at channel 6 */
		unsigned int MCA_2_7        : 1;	/* Activity of check performed in module MCS[2] at channel 7 */
		unsigned int MCA_3_0        : 1;	/* Activity of check performed in module MCS[3] at channel 0 */
		unsigned int MCA_3_1        : 1;	/* Activity of check performed in module MCS[3] at channel 1 */
		unsigned int MCA_3_2        : 1;	/* Activity of check performed in module MCS[3] at channel 2 */
		unsigned int MCA_3_3        : 1;	/* Activity of check performed in module MCS[3] at channel 3 */
		unsigned int MCA_3_4        : 1;	/* Activity of check performed in module MCS[3] at channel 4 */
		unsigned int MCA_3_5        : 1;	/* Activity of check performed in module MCS[3] at channel 5 */
		unsigned int MCA_3_6        : 1;	/* Activity of check performed in module MCS[3] at channel 6 */
		unsigned int MCA_3_7        : 1;	/* Activity of check performed in module MCS[3] at channel 7 */
	} B;
	int I;
	unsigned int U;

} GTM_MON_ACTIVITY_0_type;
#define GTM_MON_ACTIVITY_0	(*( GTM_MON_ACTIVITY_0_type *) 0xf0100184u)	/* Monitor Activity Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int ACT_CMU0       : 1;	/* CMU_CLK0 activity */
		unsigned int ACT_CMU1       : 1;	/* CMU_CLK1 activity */
		unsigned int ACT_CMU2       : 1;	/* CMU_CLK2 activity */
		unsigned int ACT_CMU3       : 1;	/* CMU_CLK3 activity */
		unsigned int ACT_CMU4       : 1;	/* CMU_CLK4 activity */
		unsigned int ACT_CMU5       : 1;	/* CMU_CLK5 activity */
		unsigned int ACT_CMU6       : 1;	/* CMU_CLK6 activity */
		unsigned int ACT_CMU7       : 1;	/* CMU_CLK7 activity */
		unsigned int ACT_CMUFX0     : 1;	/* CMU_CLKFX0 activity */
		unsigned int ACT_CMUFX1     : 1;	/* CMU_CLKFX1 activity */
		unsigned int ACT_CMUFX2     : 1;	/* CMU_CLKFX2 activity */
		unsigned int ACT_CMUFX3     : 1;	/* CMU_CLKFX3 activity */
		unsigned int ACT_CMUFX4     : 1;	/* CMU_CLKFX4 activity */
		/* const */ unsigned int Reserved       : 3;	/* Reserved */
		/* const */ unsigned int CMP_ERR        : 1;	/* Error detected at CMP */
		/* const */ unsigned int Reserved_16    : 3;	/* Reserved */
		/* const */ unsigned int MCS0_ERR       : 1;	/* Error detected at MCS[0] */
		/* const */ unsigned int MCS1_ERR       : 1;	/* Error detected at MCS[1] */
		/* const */ unsigned int MCS2_ERR       : 1;	/* Error detected at MCS[2] */
		/* const */ unsigned int MCS3_ERR       : 1;	/* Error detected at MCS[3] */
		/* const */ unsigned int Reserved_21    : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_MON_STATUS_type;
#define GTM_MON_STATUS	(*( GTM_MON_STATUS_type *) 0xf0100180u)	/* Monitor Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL1           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL2           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL3           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL4           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL5           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL6           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL7           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL8           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL9           : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL10          : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL11          : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL12          : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL13          : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL14          : 2;	/* GTM MSC0 High x Output Selection */
		unsigned int SEL15          : 2;	/* GTM MSC0 High x Output Selection */
	} B;
	int I;
	unsigned int U;

