svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} GTM_MSC0INHCON_type;
#define GTM_MSC0INHCON	(*( GTM_MSC0INHCON_type *) 0xf019ff64u)	/* MSC0 Input High Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL1           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL2           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL3           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL4           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL5           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL6           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL7           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL8           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL9           : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL10          : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL11          : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL12          : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL13          : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL14          : 2;	/* GTM MSC0 Low x Output Selection */
		unsigned int SEL15          : 2;	/* GTM MSC0 Low x Output Selection */
	} B;
	int I;
	unsigned int U;

} GTM_MSC0INLCON_type;
#define GTM_MSC0INLCON	(*( GTM_MSC0INLCON_type *) 0xf019ff60u)	/* MSC0 Input Low Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL1           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL2           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL3           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL4           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL5           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL6           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL7           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL8           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL9           : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL10          : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL11          : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL12          : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL13          : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL14          : 2;	/* GTM MSC1 High x Output Selection */
		unsigned int SEL15          : 2;	/* GTM MSC1 High x Output Selection */
	} B;
	int I;
	unsigned int U;

} GTM_MSC1INHCON_type;
#define GTM_MSC1INHCON	(*( GTM_MSC1INHCON_type *) 0xf019ff6cu)	/* MSC1 Input High Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL1           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL2           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL3           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL4           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL5           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL6           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL7           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL8           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL9           : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL10          : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL11          : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL12          : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL13          : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL14          : 2;	/* GTM MSC1 Low x Output Selection */
		unsigned int SEL15          : 2;	/* GTM MSC1 Low x Output Selection */
	} B;
	int I;
	unsigned int U;

} GTM_MSC1INLCON_type;
#define GTM_MSC1INLCON	(*( GTM_MSC1INLCON_type *) 0xf019ff68u)	/* MSC1 Input Low Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 5;	/* Set 1[0] Input Selection */
		unsigned int                : 3;
		unsigned int SEL1           : 5;	/* Set 1[1] Input Selection */
		unsigned int                : 3;
		unsigned int SEL2           : 5;	/* Set 1[2] Input Selection */
		unsigned int                : 3;
		unsigned int SEL3           : 5;	/* Set 1[3] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET1CON0_type;
#define GTM_MSCSET1CON0	(*( GTM_MSCSET1CON0_type *) 0xf019ff00u)	/* MSC Set 1 Control 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL4           : 5;	/* Set 1[4] Input Selection */
		unsigned int                : 3;
		unsigned int SEL5           : 5;	/* Set 1[5] Input Selection */
		unsigned int                : 3;
		unsigned int SEL6           : 5;	/* Set 1[6] Input Selection */
		unsigned int                : 3;
		unsigned int SEL7           : 5;	/* Set 1[7] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET1CON1_type;
#define GTM_MSCSET1CON1	(*( GTM_MSCSET1CON1_type *) 0xf019ff04u)	/* MSC Set 1 Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL8           : 5;	/* Set 1[8] Input Selection */
		unsigned int                : 3;
		unsigned int SEL9           : 5;	/* Set 1[9] Input Selection */
		unsigned int                : 3;
		unsigned int SEL10          : 5;	/* Set 1[10] Input Selection */
		unsigned int                : 3;
		unsigned int SEL11          : 5;	/* Set 1[11] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET1CON2_type;
