svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define GTM_MSCSET1CON2	(*( GTM_MSCSET1CON2_type *) 0xf019ff08u)	/* MSC Set 1 Control 2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL12          : 5;	/* Set 1[12] Input Selection */
		unsigned int                : 3;
		unsigned int SEL13          : 5;	/* Set 1[13] Input Selection */
		unsigned int                : 3;
		unsigned int SEL14          : 5;	/* Set 1[14] Input Selection */
		unsigned int                : 3;
		unsigned int SEL15          : 5;	/* Set 1[15] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET1CON3_type;
#define GTM_MSCSET1CON3	(*( GTM_MSCSET1CON3_type *) 0xf019ff0cu)	/* MSC Set 1 Control 3 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 5;	/* Set 2[0] Input Selection */
		unsigned int                : 3;
		unsigned int SEL1           : 5;	/* Set 2[1] Input Selection */
		unsigned int                : 3;
		unsigned int SEL2           : 5;	/* Set 2[2] Input Selection */
		unsigned int                : 3;
		unsigned int SEL3           : 5;	/* Set 2[3] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET2CON0_type;
#define GTM_MSCSET2CON0	(*( GTM_MSCSET2CON0_type *) 0xf019ff10u)	/* MSC Set 2 Control 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL4           : 5;	/* Set 2[4] Input Selection */
		unsigned int                : 3;
		unsigned int SEL5           : 5;	/* Set 2[5] Input Selection */
		unsigned int                : 3;
		unsigned int SEL6           : 5;	/* Set 2[6] Input Selection */
		unsigned int                : 3;
		unsigned int SEL7           : 5;	/* Set 2[7] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET2CON1_type;
#define GTM_MSCSET2CON1	(*( GTM_MSCSET2CON1_type *) 0xf019ff14u)	/* MSC Set 2 Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL8           : 5;	/* Set 2[8] Input Selection */
		unsigned int                : 3;
		unsigned int SEL9           : 5;	/* Set 2[9] Input Selection */
		unsigned int                : 3;
		unsigned int SEL10          : 5;	/* Set 2[10] Input Selection */
		unsigned int                : 3;
		unsigned int SEL11          : 5;	/* Set 2[11] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET2CON2_type;
#define GTM_MSCSET2CON2	(*( GTM_MSCSET2CON2_type *) 0xf019ff18u)	/* MSC Set 2 Control 2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL12          : 5;	/* Set 2[12] Input Selection */
		unsigned int                : 3;
		unsigned int SEL13          : 5;	/* Set 2[13] Input Selection */
		unsigned int                : 3;
		unsigned int SEL14          : 5;	/* Set 2[14] Input Selection */
		unsigned int                : 3;
		unsigned int SEL15          : 5;	/* Set 2[15] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET2CON3_type;
#define GTM_MSCSET2CON3	(*( GTM_MSCSET2CON3_type *) 0xf019ff1cu)	/* MSC Set 2 Control 3 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 5;	/* Set 3[0] Input Selection */
		unsigned int                : 3;
		unsigned int SEL1           : 5;	/* Set 3[1] Input Selection */
		unsigned int                : 3;
		unsigned int SEL2           : 5;	/* Set 3[2] Input Selection */
		unsigned int                : 3;
		unsigned int SEL3           : 5;	/* Set 3[3] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET3CON0_type;
#define GTM_MSCSET3CON0	(*( GTM_MSCSET3CON0_type *) 0xf019ff20u)	/* MSC Set 3 Control 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL4           : 5;	/* Set 3[4] Input Selection */
		unsigned int                : 3;
		unsigned int SEL5           : 5;	/* Set 3[5] Input Selection */
		unsigned int                : 3;
		unsigned int SEL6           : 5;	/* Set 3[6] Input Selection */
		unsigned int                : 3;
		unsigned int SEL7           : 5;	/* Set 3[7] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET3CON1_type;
#define GTM_MSCSET3CON1	(*( GTM_MSCSET3CON1_type *) 0xf019ff24u)	/* MSC Set 3 Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL8           : 5;	/* Set 3[8] Input Selection */
		unsigned int                : 3;
		unsigned int SEL9           : 5;	/* Set 3[9] Input Selection */
		unsigned int                : 3;
		unsigned int SEL10          : 5;	/* Set 3[10] Input Selection */
		unsigned int                : 3;
		unsigned int SEL11          : 5;	/* Set 3[11] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET3CON2_type;
#define GTM_MSCSET3CON2	(*( GTM_MSCSET3CON2_type *) 0xf019ff28u)	/* MSC Set 3 Control 2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL12          : 5;	/* Set 3[12] Input Selection */
		unsigned int                : 3;
		unsigned int SEL13          : 5;	/* Set 3[13] Input Selection */
		unsigned int                : 3;
		unsigned int SEL14          : 5;	/* Set 3[14] Input Selection */
		unsigned int                : 3;
		unsigned int SEL15          : 5;	/* Set 3[15] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET3CON3_type;
#define GTM_MSCSET3CON3	(*( GTM_MSCSET3CON3_type *) 0xf019ff2cu)	/* MSC Set 3 Control 3 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 5;	/* Set 4[0] Input Selection */
		unsigned int                : 3;
		unsigned int SEL1           : 5;	/* Set 4[1] Input Selection */
		unsigned int                : 3;
		unsigned int SEL2           : 5;	/* Set 4[2] Input Selection */
		unsigned int                : 3;
		unsigned int SEL3           : 5;	/* Set 4[3] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

