svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} GTM_MSCSET4CON0_type;
#define GTM_MSCSET4CON0	(*( GTM_MSCSET4CON0_type *) 0xf019ff30u)	/* MSC Set 4 Control 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL4           : 5;	/* Set 4[4] Input Selection */
		unsigned int                : 3;
		unsigned int SEL5           : 5;	/* Set 4[5] Input Selection */
		unsigned int                : 3;
		unsigned int SEL6           : 5;	/* Set 4[6] Input Selection */
		unsigned int                : 3;
		unsigned int SEL7           : 5;	/* Set 4[7] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET4CON1_type;
#define GTM_MSCSET4CON1	(*( GTM_MSCSET4CON1_type *) 0xf019ff34u)	/* MSC Set 4 Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL8           : 5;	/* Set 4[8] Input Selection */
		unsigned int                : 3;
		unsigned int SEL9           : 5;	/* Set 4[9] Input Selection */
		unsigned int                : 3;
		unsigned int SEL10          : 5;	/* Set 4[10] Input Selection */
		unsigned int                : 3;
		unsigned int SEL11          : 5;	/* Set 4[11] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET4CON2_type;
#define GTM_MSCSET4CON2	(*( GTM_MSCSET4CON2_type *) 0xf019ff38u)	/* MSC Set 4 Control 2 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL12          : 5;	/* Set 4[12] Input Selection */
		unsigned int                : 3;
		unsigned int SEL13          : 5;	/* Set 4[13] Input Selection */
		unsigned int                : 3;
		unsigned int SEL14          : 5;	/* Set 4[14] Input Selection */
		unsigned int                : 3;
		unsigned int SEL15          : 5;	/* Set 4[15] Input Selection */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_MSCSET4CON3_type;
#define GTM_MSCSET4CON3	(*( GTM_MSCSET4CON3_type *) 0xf019ff3cu)	/* MSC Set 4 Control 3 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} GTM_OCS_type;
#define GTM_OCS	(*( GTM_OCS_type *) 0xf019fde8u)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int DDREN          : 1;	/* Detructive Debug Read Enable */
		unsigned int DREN           : 1;	/* Detructive Read Enable */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} GTM_ODA_type;
#define GTM_ODA	(*( GTM_ODA_type *) 0xf019fddcu)	/* OCDS Debug Access Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CV             : 27;	/* Compare Value */
		unsigned int                : 1;
		unsigned int CM             : 2;	/* Compare Mode */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} GTM_OTBU0T_type;
#define GTM_OTBU0T	(*( GTM_OTBU0T_type *) 0xf019fdc4u)	/* OCDS TBU0 Trigger Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CV             : 24;	/* Compare Value */
		unsigned int                : 4;
		unsigned int EN             : 1;	/* Enable */
		unsigned int                : 3;
	} B;
	int I;
	unsigned int U;

} GTM_OTBU1T_type;
#define GTM_OTBU1T	(*( GTM_OTBU1T_type *) 0xf019fdc8u)	/* OCDS TBU1 Trigger Register */
#define GTM_OTBU2T	(*( GTM_OTBU1T_type *) 0xf019fdccu)	/* OCDS TBU2 Trigger Register */

typedef volatile union
{
	struct
	{ 
		unsigned int B0LMT          : 3;	/* OTGB0 TS16_IOS Low Byte Module Type */
		unsigned int                : 1;
		unsigned int B0LMI          : 4;	/* OTGB0 TS16_IOS Low Byte Module Instance */
		unsigned int B0HMT          : 3;	/* OTGB0 TS16_IOS High Byte Module Type */
		unsigned int                : 1;
		unsigned int B0HMI          : 4;	/* OTGB0 TS16_IOS High Byte Module Instance */
		unsigned int B1LMT          : 3;	/* OTGB1 TS16_IOS Low Byte Module Type */
		unsigned int                : 1;
		unsigned int B1LMI          : 4;	/* OTGB1 TS16_IOS Low Byte Module Instance */
		unsigned int B1HMT          : 3;	/* OTGB1 TS16_IOS High Byte Module Type */
		unsigned int                : 1;
		unsigned int B1HMI          : 4;	/* OTGB1 TS16_IOS High Byte Module Instance */
	} B;
	int I;
	unsigned int U;

} GTM_OTSC0_type;
#define GTM_OTSC0	(*( GTM_OTSC0_type *) 0xf019fdd4u)	/* OCDS Trigger Set Control 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MCS            : 4;	/* MCS Channel Select */
		unsigned int MI             : 4;	/* MCS Instance */
		unsigned int MCE            : 1;	/* MCS CPU (AEI) Accesses Trace Enable */
		unsigned int MOE            : 1;	/* MCS Opcode Trace Enable */
		unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} GTM_OTSC1_type;
#define GTM_OTSC1	(*( GTM_OTSC1_type *) 0xf019fdd8u)	/* OCDS Trigger Set Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OTGB0          : 4;	/* Trigger Set for OTGB0 */
		unsigned int                : 4;
		unsigned int OTGB1          : 4;	/* Trigger Set for OTGB1 */
		unsigned int                : 4;
		unsigned int OTGB2          : 4;	/* Trigger Set for OTGB2 */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} GTM_OTSS_type;
#define GTM_OTSS	(*( GTM_OTSS_type *) 0xf019fdd0u)	/* OCDS Trigger Set Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 4;	/* Output Selection for PSI5x GTM connection */
		unsigned int SEL1           : 4;	/* Output Selection for PSI5x GTM connection */
		unsigned int SEL2           : 4;	/* Output Selection for PSI5x GTM connection */
		unsigned int SEL3           : 4;	/* Output Selection for PSI5x GTM connection */
		unsigned int SEL4           : 4;	/* Output Selection for PSI5x GTM connection */
		unsigned int SEL5           : 4;	/* Output Selection for PSI5x GTM connection */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

