svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} GTM_PSI5OUTSEL0_type;
#define GTM_PSI5OUTSEL0	(*( GTM_PSI5OUTSEL0_type *) 0xf019fda4u)	/* PSI5 Output Select 0 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL1           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL2           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL3           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL4           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL5           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL6           : 4;	/* Output Selection for PSI5-S GTM connection */
		unsigned int SEL7           : 4;	/* Output Selection for PSI5-S GTM connection */
	} B;
	int I;
	unsigned int U;

} GTM_PSI5SOUTSEL_type;
#define GTM_PSI5SOUTSEL	(*( GTM_PSI5SOUTSEL_type *) 0xf019fda8u)	/* PSI5-S Output Select Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int YEAR           : 8;	/* GTM Year of development */
		/* const */ unsigned int NO             : 4;	/* Define delivery number */
		/* const */ unsigned int MINOR          : 4;	/* Define minor version number of implementation */
		/* const */ unsigned int MAJOR          : 4;	/* Define major version number of implementation */
		/* const */ unsigned int DEV_CODE0      : 4;	/* Device encoding digit 0 */
		/* const */ unsigned int DEV_CODE1      : 4;	/* Device encoding digit 1 */
		/* const */ unsigned int DEV_CODE2      : 4;	/* Device encoding digit 2 */
	} B;
	int I;
	unsigned int U;

} GTM_REV_type;
#define GTM_REV	(*( GTM_REV_type *) 0xf0100000u)	/* GTM Version Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* GTM Reset */
		/* const */ unsigned int Reserved       : 31;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_RST_type;
#define GTM_RST	(*( GTM_RST_type *) 0xf0100004u)	/* GTM Global Reset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SPE_EN         : 1;	/* SPE Submodule enable */
		unsigned int SIE0           : 1;	/* SPE Input enable for TIM_CHx(48) */
		unsigned int SIE1           : 1;	/* SPE Input enable for TIM_CHy(48) */
		unsigned int SIE2           : 1;	/* SPE Input enable for TIM_CHz(48) */
		unsigned int TRIG_SEL       : 2;	/* Select trigger input signal */
		unsigned int TIM_SEL        : 1;	/* select TIM input signal */
		unsigned int FSOM           : 1;	/* Fast Shut-Off Mode */
		unsigned int SPE_PAT_PTR    : 3;	/* Pattern selector for TOM output signals */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int AIP            : 3;	/* Actual input pattern that was detected by a regular input pattern change */
		unsigned int ADIR           : 1;	/* Actual rotation direction */
		unsigned int PIP            : 3;	/* Previous input pattern that was detected by a regular input pattern change */
		unsigned int PDIR           : 1;	/* Previous rotation direction */
		/* const */ unsigned int NIP            : 3;	/* New input pattern that was detected */
		/* const */ unsigned int Reserved_15    : 1;	/* Reserved */
		unsigned int FSOL           : 8;	/* Fast Shut-Off Level for TOM[i] channel 0 to 7 */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_CTRL_STAT_type;
#define GTM_SPE0_CTRL_STAT	(*( GTM_SPE0_CTRL_STAT_type *) 0xf0100800u)	/* SPE0 Control Status Register */
#define GTM_SPE1_CTRL_STAT	(*( GTM_SPE0_CTRL_STAT_type *) 0xf0100880u)	/* SPE1 Control Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SPE_NIPD_IRQ_EN: 1;	/* SPE_NIPD_IRQ interrupt enable */
		unsigned int SPE_DCHG_IRQ_EN: 1;	/* SPE_DCHG_IRQ interrupt enable */
		unsigned int SPE_PERR_IRQ_EN: 1;	/* SPE_PERR_IRQ interrupt enable */
		unsigned int SPE_BIS_IRQ_EN : 1;	/* SPE_BIS_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_IRQ_EN_type;
#define GTM_SPE0_IRQ_EN	(*( GTM_SPE0_IRQ_EN_type *) 0xf0100830u)	/* SPE0 Interrupt Enable Register */
#define GTM_SPE1_IRQ_EN	(*( GTM_SPE0_IRQ_EN_type *) 0xf01008b0u)	/* SPE1 Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TRG_SPE_NIPD   : 1;	/* Force interrupt of SPE_NIPD */
		unsigned int TRG_SPE_DCHG   : 1;	/* Force interrupt of SPE_DCHG */
		unsigned int TRG_SPE_PERR   : 1;	/* Force interrupt of SPE_PERR */
		unsigned int TRG_SPE_BIS    : 1;	/* Force interrupt of SPE_BIS */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_IRQ_FORCINT_type;
#define GTM_SPE0_IRQ_FORCINT	(*( GTM_SPE0_IRQ_FORCINT_type *) 0xf0100834u)	/* SPE0 Interrupt Generation by Software */
#define GTM_SPE1_IRQ_FORCINT	(*( GTM_SPE0_IRQ_FORCINT_type *) 0xf01008b4u)	/* SPE1 Interrupt Generation by Software */

typedef volatile union
{
	struct
	{ 
		unsigned int SPE_NIPD       : 1;	/* New input pattern interrupt occurred */
		unsigned int SPE_DCHG       : 1;	/* SPE_DIR bit changed on behalf of new input pattern */
		unsigned int SPE_PERR       : 1;	/* Wrong or invalid pattern detected at input */
		unsigned int SPE_BIS        : 1;	/* Bouncing input signal detected */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_IRQ_NOTIFY_type;
#define GTM_SPE0_IRQ_NOTIFY	(*( GTM_SPE0_IRQ_NOTIFY_type *) 0xf010082cu)	/* SPE0 Interrupt Notification Register */
#define GTM_SPE1_IRQ_NOTIFY	(*( GTM_SPE0_IRQ_NOTIFY_type *) 0xf01008acu)	/* SPE1 Interrupt Notification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SPE_OUT_CTRL   : 16;	/* SPE output control value for TOM_CH0 to TOM_CH7 */
		/* const */ unsigned int Reserved       : 16;	/* Read as zero, should be written as zero */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_OUT_CTRL_type;
#define GTM_SPE0_OUT_CTRL	(*( GTM_SPE0_OUT_CTRL_type *) 0xf0100828u)	/* SPE0 Output Control Register */
#define GTM_SPE1_OUT_CTRL	(*( GTM_SPE0_OUT_CTRL_type *) 0xf01008a8u)	/* SPE1 Output Control Register */

