svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SPE_OUT_PAT    : 16;	/* SPE output control value for TOM_CH0 to TOM_CH7 */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_OUT_PAT0_type;
#define GTM_SPE0_OUT_PAT0	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100808u)	/* SPE0 Output Definition Register r0 */
#define GTM_SPE0_OUT_PAT1	(*( GTM_SPE0_OUT_PAT0_type *) 0xf010080cu)	/* SPE0 Output Definition Register r1 */
#define GTM_SPE0_OUT_PAT2	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100810u)	/* SPE0 Output Definition Register r2 */
#define GTM_SPE0_OUT_PAT3	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100814u)	/* SPE0 Output Definition Register r3 */
#define GTM_SPE0_OUT_PAT4	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100818u)	/* SPE0 Output Definition Register r4 */
#define GTM_SPE0_OUT_PAT5	(*( GTM_SPE0_OUT_PAT0_type *) 0xf010081cu)	/* SPE0 Output Definition Register r5 */
#define GTM_SPE0_OUT_PAT6	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100820u)	/* SPE0 Output Definition Register r6 */
#define GTM_SPE0_OUT_PAT7	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100824u)	/* SPE0 Output Definition Register r7 */
#define GTM_SPE1_OUT_PAT0	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100888u)	/* SPE1 Output Definition Register r0 */
#define GTM_SPE1_OUT_PAT1	(*( GTM_SPE0_OUT_PAT0_type *) 0xf010088cu)	/* SPE1 Output Definition Register r1 */
#define GTM_SPE1_OUT_PAT2	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100890u)	/* SPE1 Output Definition Register r2 */
#define GTM_SPE1_OUT_PAT3	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100894u)	/* SPE1 Output Definition Register r3 */
#define GTM_SPE1_OUT_PAT4	(*( GTM_SPE0_OUT_PAT0_type *) 0xf0100898u)	/* SPE1 Output Definition Register r4 */
#define GTM_SPE1_OUT_PAT5	(*( GTM_SPE0_OUT_PAT0_type *) 0xf010089cu)	/* SPE1 Output Definition Register r5 */
#define GTM_SPE1_OUT_PAT6	(*( GTM_SPE0_OUT_PAT0_type *) 0xf01008a0u)	/* SPE1 Output Definition Register r6 */
#define GTM_SPE1_OUT_PAT7	(*( GTM_SPE0_OUT_PAT0_type *) 0xf01008a4u)	/* SPE1 Output Definition Register r7 */

typedef volatile union
{
	struct
	{ 
		unsigned int IP0_VAL        : 1;	/* Input pattern 0 is a valid pattern */
		unsigned int IP0_PAT        : 3;	/* Input pattern 0 */
		unsigned int IP1_VAL        : 1;	/* Input pattern 1 is a valid pattern */
		unsigned int IP1_PAT        : 3;	/* Input pattern 1 */
		unsigned int IP2_VAL        : 1;	/* Input pattern 2 is a valid pattern */
		unsigned int IP2_PAT        : 3;	/* Input pattern 2 */
		unsigned int IP3_VAL        : 1;	/* Input pattern 3 is a valid pattern */
		unsigned int IP3_PAT        : 3;	/* Input pattern 3 */
		unsigned int IP4_VAL        : 1;	/* Input pattern 4 is a valid pattern */
		unsigned int IP4_PAT        : 3;	/* Input pattern 4 */
		unsigned int IP5_VAL        : 1;	/* Input pattern 5 is a valid pattern */
		unsigned int IP5_PAT        : 3;	/* Input pattern 5 */
		unsigned int IP6_VAL        : 1;	/* Input pattern 6 is a valid pattern */
		unsigned int IP6_PAT        : 3;	/* Input pattern 6 */
		unsigned int IP7_VAL        : 1;	/* Input pattern 7 is a valid pattern */
		unsigned int IP7_PAT        : 3;	/* Input pattern 7 */
	} B;
	int I;
	unsigned int U;

} GTM_SPE0_PAT_type;
#define GTM_SPE0_PAT	(*( GTM_SPE0_PAT_type *) 0xf0100804u)	/* SPE0 Input Pattern Definition Register */
#define GTM_SPE1_PAT	(*( GTM_SPE0_PAT_type *) 0xf0100884u)	/* SPE1 Input Pattern Definition Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BASE           : 27;	/* Time base value for channel 0 */
		/* const */ unsigned int Reserved       : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_CH0_BASE_type;
#define GTM_TBU_CH0_BASE	(*( GTM_TBU_CH0_BASE_type *) 0xf0100108u)	/* TBU Channel 0 Base Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LOW_RES        : 1;	/* TBU_CH0_BASE register resolution */
		unsigned int CH_CLK_SRC     : 3;	/* Clock source for channel x (x:0...2) time base counter */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_CH0_CTRL_type;
#define GTM_TBU_CH0_CTRL	(*( GTM_TBU_CH0_CTRL_type *) 0xf0100104u)	/* TBU Channel 0 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BASE           : 24;	/* Time base value for channel x (x 1, 2) */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_CH1_BASE_type;
#define GTM_TBU_CH1_BASE	(*( GTM_TBU_CH1_BASE_type *) 0xf0100110u)	/* TBU Channel 1 Base Register */
#define GTM_TBU_CH2_BASE	(*( GTM_TBU_CH1_BASE_type *) 0xf0100118u)	/* TBU Channel 2 Base Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CH_MODE        : 1;	/* Channel mode */
		unsigned int CH_CLK_SRC     : 3;	/* Clock source for channel x (x02) time base counter */
		/* const */ unsigned int Reserved       : 28;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_CH1_CTRL_type;
#define GTM_TBU_CH1_CTRL	(*( GTM_TBU_CH1_CTRL_type *) 0xf010010cu)	/* TBU Channel 1 Control Register */
#define GTM_TBU_CH2_CTRL	(*( GTM_TBU_CH1_CTRL_type *) 0xf0100114u)	/* TBU Channel 2 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENDIS_CH0      : 2;	/* TBU channel 0 enable/disable control */
		unsigned int ENDIS_CH1      : 2;	/* TBU channel 1 enable/disable control */
		unsigned int ENDIS_CH2      : 2;	/* TBU channel 2 enable/disable control */
		/* const */ unsigned int Reserved       : 26;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_CHEN_type;
#define GTM_TBU_CHEN	(*( GTM_TBU_CHEN_type *) 0xf0100100u)	/* TBU Global Channel Enable Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TBU_TS0_S      : 24;	/* value of TBU_TS0 at the last STATE event */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_TS0_S_type;
#define GTM_TBU_TS0_S	(*( GTM_TBU_TS0_S_type *) 0xf01280c4u)	/* DPLL TBU_TS0 Value at last STATE Event */

