svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TBU_TS0_T      : 24;	/* value of TBU_TS0 at the last TRIGGER event */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TBU_TS0_T_type;
#define GTM_TBU_TS0_T	(*( GTM_TBU_TS0_T_type *) 0xf01280c0u)	/* DPLL TBU_TS0 Value at last TRIGGER Event */

typedef volatile union
{
	struct
	{ 
		unsigned int CH0SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH1SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH2SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH3SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH4SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH5SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH6SEL         : 4;	/* TIM Channel x Input Selection */
		unsigned int CH7SEL         : 4;	/* TIM Channel x Input Selection */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0INSEL_type;
#define GTM_TIM0INSEL	(*( GTM_TIM0INSEL_type *) 0xf019fd10u)	/* TIM0 Input Select Register */
#define GTM_TIM1INSEL	(*( GTM_TIM0INSEL_type *) 0xf019fd14u)	/* TIM1 Input Select Register */
#define GTM_TIM2INSEL	(*( GTM_TIM0INSEL_type *) 0xf019fd18u)	/* TIM2 Input Select Register */
#define GTM_TIM3INSEL	(*( GTM_TIM0INSEL_type *) 0xf019fd1cu)	/* TIM3 Input Select Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CNT            : 24;	/* Actual SMU counter value */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_CNT_type;
#define GTM_TIM0_CH0_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101018u)	/* TIM0 Channel 0 SMU Counter Register */
#define GTM_TIM0_CH1_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101098u)	/* TIM0 Channel 1 SMU Counter Register */
#define GTM_TIM0_CH2_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101118u)	/* TIM0 Channel 2 SMU Counter Register */
#define GTM_TIM0_CH3_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101198u)	/* TIM0 Channel 3 SMU Counter Register */
#define GTM_TIM0_CH4_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101218u)	/* TIM0 Channel 4 SMU Counter Register */
#define GTM_TIM0_CH5_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101298u)	/* TIM0 Channel 5 SMU Counter Register */
#define GTM_TIM0_CH6_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101318u)	/* TIM0 Channel 6 SMU Counter Register */
#define GTM_TIM0_CH7_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101398u)	/* TIM0 Channel 7 SMU Counter Register */
#define GTM_TIM1_CH0_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101818u)	/* TIM1 Channel 0 SMU Counter Register */
#define GTM_TIM1_CH1_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101898u)	/* TIM1 Channel 1 SMU Counter Register */
#define GTM_TIM1_CH2_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101918u)	/* TIM1 Channel 2 SMU Counter Register */
#define GTM_TIM1_CH3_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101998u)	/* TIM1 Channel 3 SMU Counter Register */
#define GTM_TIM1_CH4_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101a18u)	/* TIM1 Channel 4 SMU Counter Register */
#define GTM_TIM1_CH5_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101a98u)	/* TIM1 Channel 5 SMU Counter Register */
#define GTM_TIM1_CH6_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101b18u)	/* TIM1 Channel 6 SMU Counter Register */
#define GTM_TIM1_CH7_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0101b98u)	/* TIM1 Channel 7 SMU Counter Register */
#define GTM_TIM2_CH0_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102018u)	/* TIM2 Channel 0 SMU Counter Register */
#define GTM_TIM2_CH1_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102098u)	/* TIM2 Channel 1 SMU Counter Register */
#define GTM_TIM2_CH2_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102118u)	/* TIM2 Channel 2 SMU Counter Register */
#define GTM_TIM2_CH3_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102198u)	/* TIM2 Channel 3 SMU Counter Register */
#define GTM_TIM2_CH4_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102218u)	/* TIM2 Channel 4 SMU Counter Register */
#define GTM_TIM2_CH5_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102298u)	/* TIM2 Channel 5 SMU Counter Register */
#define GTM_TIM2_CH6_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102318u)	/* TIM2 Channel 6 SMU Counter Register */
#define GTM_TIM2_CH7_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102398u)	/* TIM2 Channel 7 SMU Counter Register */
#define GTM_TIM3_CH0_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102818u)	/* TIM3 Channel 0 SMU Counter Register */
#define GTM_TIM3_CH1_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102898u)	/* TIM3 Channel 1 SMU Counter Register */
#define GTM_TIM3_CH2_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102918u)	/* TIM3 Channel 2 SMU Counter Register */
#define GTM_TIM3_CH3_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102998u)	/* TIM3 Channel 3 SMU Counter Register */
#define GTM_TIM3_CH4_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102a18u)	/* TIM3 Channel 4 SMU Counter Register */
#define GTM_TIM3_CH5_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102a98u)	/* TIM3 Channel 5 SMU Counter Register */
#define GTM_TIM3_CH6_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102b18u)	/* TIM3 Channel 6 SMU Counter Register */
#define GTM_TIM3_CH7_CNT	(*( GTM_TIM0_CH0_CNT_type *) 0xf0102b98u)	/* TIM3 Channel 7 SMU Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CNTS           : 24;	/* Counter shadow register */
		/* const */ unsigned int ECNT           : 8;	/* Edge counter */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_CNTS_type;
#define GTM_TIM0_CH0_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010101cu)	/* TIM0 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM0_CH1_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010109cu)	/* TIM0 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM0_CH2_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010111cu)	/* TIM0 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM0_CH3_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010119cu)	/* TIM0 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM0_CH4_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010121cu)	/* TIM0 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM0_CH5_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010129cu)	/* TIM0 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM0_CH6_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010131cu)	/* TIM0 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM0_CH7_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010139cu)	/* TIM0 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM1_CH0_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010181cu)	/* TIM1 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM1_CH1_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010189cu)	/* TIM1 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM1_CH2_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010191cu)	/* TIM1 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM1_CH3_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010199cu)	/* TIM1 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM1_CH4_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0101a1cu)	/* TIM1 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM1_CH5_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0101a9cu)	/* TIM1 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM1_CH6_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0101b1cu)	/* TIM1 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM1_CH7_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0101b9cu)	/* TIM1 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM2_CH0_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010201cu)	/* TIM2 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM2_CH1_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010209cu)	/* TIM2 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM2_CH2_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010211cu)	/* TIM2 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM2_CH3_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010219cu)	/* TIM2 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM2_CH4_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010221cu)	/* TIM2 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM2_CH5_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010229cu)	/* TIM2 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM2_CH6_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010231cu)	/* TIM2 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM2_CH7_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010239cu)	/* TIM2 Channel 7 SMU Shadow Counter Register */
#define GTM_TIM3_CH0_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010281cu)	/* TIM3 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM3_CH1_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010289cu)	/* TIM3 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM3_CH2_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010291cu)	/* TIM3 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM3_CH3_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf010299cu)	/* TIM3 Channel 3 SMU Shadow Counter Register */
#define GTM_TIM3_CH4_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0102a1cu)	/* TIM3 Channel 4 SMU Shadow Counter Register */
#define GTM_TIM3_CH5_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0102a9cu)	/* TIM3 Channel 5 SMU Shadow Counter Register */
#define GTM_TIM3_CH6_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0102b1cu)	/* TIM3 Channel 6 SMU Shadow Counter Register */
#define GTM_TIM3_CH7_CNTS	(*( GTM_TIM0_CH0_CNTS_type *) 0xf0102b9cu)	/* TIM3 Channel 7 SMU Shadow Counter Register */

