svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TIM_EN         : 1;	/* TIM channel x (x:0..7) enable */
		unsigned int TIM_MODE       : 3;	/* TIM channel x (x:0..7) mode */
		unsigned int OSM            : 1;	/* One-shot mode */
		unsigned int ARU_EN         : 1;	/* GPR0 and GPR1 register values routed to ARU */
		unsigned int CICTRL         : 1;	/* Channel Input Control */
		unsigned int TBU0x_SEL      : 1;	/* TBU_TS0 bits input select for TIM_CH[x]_GPRz (x: 0, 1) */
		unsigned int GPR0_SEL       : 2;	/* Selection for GPR0 register */
		unsigned int GPR1_SEL       : 2;	/* Selection for GPR1 register */
		unsigned int CNTS_SEL       : 1;	/* Selection for CNTS register */
		unsigned int DSL            : 1;	/* Signal level control */
		unsigned int ISL            : 1;	/* Ignore signal level */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int FLT_EN         : 1;	/* Filter enable for channel x (x:0..7) */
		unsigned int FLT_CNT_FRQ    : 2;	/* Filter counter frequency select */
		/* const */ unsigned int Reserved_15    : 1;	/* Reserved */
		unsigned int FLT_MODE_RE    : 1;	/* Filter mode for rising edge */
		unsigned int FLT_CTR_RE     : 1;	/* Filter counter mode for rising edge */
		unsigned int FLT_MODE_FE    : 1;	/* Filter mode for falling edge */
		unsigned int FLT_CTR_FE     : 1;	/* Filter counter mode for falling edge */
		unsigned int CLK_SEL        : 3;	/* CMU clock source select for channel */
		/* const */ unsigned int Reserved_21    : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_CTRL_type;
#define GTM_TIM0_CH0_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101000u)	/* TIM Channel 0 Control Register */
#define GTM_TIM0_CH1_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101080u)	/* TIM Channel 1 Control Register */
#define GTM_TIM0_CH2_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101100u)	/* TIM Channel 2 Control Register */
#define GTM_TIM0_CH3_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101180u)	/* TIM Channel 3 Control Register */
#define GTM_TIM0_CH4_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101200u)	/* TIM Channel 4 Control Register */
#define GTM_TIM0_CH5_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101280u)	/* TIM Channel 5 Control Register */
#define GTM_TIM0_CH6_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101300u)	/* TIM Channel 6 Control Register */
#define GTM_TIM0_CH7_CTRL	(*( GTM_TIM0_CH0_CTRL_type *) 0xf0101380u)	/* TIM Channel 7 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FLT_FE         : 24;	/* Filter parameter for falling edge */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_FLT_FE_type;
#define GTM_TIM0_CH0_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101008u)	/* TIM0 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM0_CH1_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101088u)	/* TIM0 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM0_CH2_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101108u)	/* TIM0 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM0_CH3_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101188u)	/* TIM0 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM0_CH4_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101208u)	/* TIM0 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM0_CH5_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101288u)	/* TIM0 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM0_CH6_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101308u)	/* TIM0 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM0_CH7_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101388u)	/* TIM0 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM1_CH0_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101808u)	/* TIM1 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM1_CH1_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101888u)	/* TIM1 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM1_CH2_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101908u)	/* TIM1 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM1_CH3_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101988u)	/* TIM1 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM1_CH4_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101a08u)	/* TIM1 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM1_CH5_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101a88u)	/* TIM1 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM1_CH6_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101b08u)	/* TIM1 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM1_CH7_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0101b88u)	/* TIM1 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM2_CH0_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102008u)	/* TIM2 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM2_CH1_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102088u)	/* TIM2 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM2_CH2_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102108u)	/* TIM2 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM2_CH3_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102188u)	/* TIM2 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM2_CH4_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102208u)	/* TIM2 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM2_CH5_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102288u)	/* TIM2 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM2_CH6_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102308u)	/* TIM2 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM2_CH7_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102388u)	/* TIM2 Channel 7 Filter Parameter 1 Register */
#define GTM_TIM3_CH0_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102808u)	/* TIM3 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM3_CH1_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102888u)	/* TIM3 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM3_CH2_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102908u)	/* TIM3 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM3_CH3_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102988u)	/* TIM3 Channel 3 Filter Parameter 1 Register */
#define GTM_TIM3_CH4_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102a08u)	/* TIM3 Channel 4 Filter Parameter 1 Register */
#define GTM_TIM3_CH5_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102a88u)	/* TIM3 Channel 5 Filter Parameter 1 Register */
#define GTM_TIM3_CH6_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102b08u)	/* TIM3 Channel 6 Filter Parameter 1 Register */
#define GTM_TIM3_CH7_FLT_FE	(*( GTM_TIM0_CH0_FLT_FE_type *) 0xf0102b88u)	/* TIM3 Channel 7 Filter Parameter 1 Register */

