svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int FLT_RE         : 24;	/* Filter parameter for rising edge */
		/* const */ unsigned int Reserved       : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_FLT_RE_type;
#define GTM_TIM0_CH0_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101004u)	/* GTM_TIM0 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM0_CH1_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101084u)	/* GTM_TIM0 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM0_CH2_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101104u)	/* GTM_TIM0 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM0_CH3_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101184u)	/* GTM_TIM0 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM0_CH4_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101204u)	/* GTM_TIM0 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM0_CH5_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101284u)	/* GTM_TIM0 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM0_CH6_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101304u)	/* GTM_TIM0 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM0_CH7_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101384u)	/* GTM_TIM0 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM1_CH0_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101804u)	/* GTM_TIM1 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM1_CH1_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101884u)	/* GTM_TIM1 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM1_CH2_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101904u)	/* GTM_TIM1 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM1_CH3_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101984u)	/* GTM_TIM1 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM1_CH4_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101a04u)	/* GTM_TIM1 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM1_CH5_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101a84u)	/* GTM_TIM1 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM1_CH6_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101b04u)	/* GTM_TIM1 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM1_CH7_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0101b84u)	/* GTM_TIM1 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM2_CH0_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102004u)	/* GTM_TIM2 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM2_CH1_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102084u)	/* GTM_TIM2 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM2_CH2_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102104u)	/* GTM_TIM2 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM2_CH3_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102184u)	/* GTM_TIM2 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM2_CH4_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102204u)	/* GTM_TIM2 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM2_CH5_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102284u)	/* GTM_TIM2 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM2_CH6_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102304u)	/* GTM_TIM2 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM2_CH7_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102384u)	/* GTM_TIM2 Channel 7 Filter Parameter 0 Register */
#define GTM_TIM3_CH0_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102804u)	/* GTM_TIM3 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM3_CH1_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102884u)	/* GTM_TIM3 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM3_CH2_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102904u)	/* GTM_TIM3 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM3_CH3_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102984u)	/* GTM_TIM3 Channel 3 Filter Parameter 0 Register */
#define GTM_TIM3_CH4_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102a04u)	/* GTM_TIM3 Channel 4 Filter Parameter 0 Register */
#define GTM_TIM3_CH5_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102a84u)	/* GTM_TIM3 Channel 5 Filter Parameter 0 Register */
#define GTM_TIM3_CH6_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102b04u)	/* GTM_TIM3 Channel 6 Filter Parameter 0 Register */
#define GTM_TIM3_CH7_FLT_RE	(*( GTM_TIM0_CH0_FLT_RE_type *) 0xf0102b84u)	/* GTM_TIM3 Channel 7 Filter Parameter 0 Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int GPR0           : 24;	/* Input signal characteristic parameter 0 */
		/* const */ unsigned int ECNT           : 8;	/* Edge counter */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_GPR0_type;
#define GTM_TIM0_CH0_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101010u)	/* TIM0 Channel 0 General Purpose 0 Register */
#define GTM_TIM0_CH1_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101090u)	/* TIM0 Channel 1 General Purpose 0 Register */
#define GTM_TIM0_CH2_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101110u)	/* TIM0 Channel 2 General Purpose 0 Register */
#define GTM_TIM0_CH3_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101190u)	/* TIM0 Channel 3 General Purpose 0 Register */
#define GTM_TIM0_CH4_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101210u)	/* TIM0 Channel 4 General Purpose 0 Register */
#define GTM_TIM0_CH5_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101290u)	/* TIM0 Channel 5 General Purpose 0 Register */
#define GTM_TIM0_CH6_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101310u)	/* TIM0 Channel 6 General Purpose 0 Register */
#define GTM_TIM0_CH7_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101390u)	/* TIM0 Channel 7 General Purpose 0 Register */
#define GTM_TIM1_CH0_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101810u)	/* TIM1 Channel 0 General Purpose 0 Register */
#define GTM_TIM1_CH1_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101890u)	/* TIM1 Channel 1 General Purpose 0 Register */
#define GTM_TIM1_CH2_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101910u)	/* TIM1 Channel 2 General Purpose 0 Register */
#define GTM_TIM1_CH3_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101990u)	/* TIM1 Channel 3 General Purpose 0 Register */
#define GTM_TIM1_CH4_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101a10u)	/* TIM1 Channel 4 General Purpose 0 Register */
#define GTM_TIM1_CH5_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101a90u)	/* TIM1 Channel 5 General Purpose 0 Register */
#define GTM_TIM1_CH6_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101b10u)	/* TIM1 Channel 6 General Purpose 0 Register */
#define GTM_TIM1_CH7_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0101b90u)	/* TIM1 Channel 7 General Purpose 0 Register */
#define GTM_TIM2_CH0_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102010u)	/* TIM2 Channel 0 General Purpose 0 Register */
#define GTM_TIM2_CH1_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102090u)	/* TIM2 Channel 1 General Purpose 0 Register */
#define GTM_TIM2_CH2_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102110u)	/* TIM2 Channel 2 General Purpose 0 Register */
#define GTM_TIM2_CH3_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102190u)	/* TIM2 Channel 3 General Purpose 0 Register */
#define GTM_TIM2_CH4_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102210u)	/* TIM2 Channel 4 General Purpose 0 Register */
#define GTM_TIM2_CH5_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102290u)	/* TIM2 Channel 5 General Purpose 0 Register */
#define GTM_TIM2_CH6_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102310u)	/* TIM2 Channel 6 General Purpose 0 Register */
#define GTM_TIM2_CH7_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102390u)	/* TIM2 Channel 7 General Purpose 0 Register */
#define GTM_TIM3_CH0_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102810u)	/* TIM3 Channel 0 General Purpose 0 Register */
#define GTM_TIM3_CH1_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102890u)	/* TIM3 Channel 1 General Purpose 0 Register */
#define GTM_TIM3_CH2_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102910u)	/* TIM3 Channel 2 General Purpose 0 Register */
#define GTM_TIM3_CH3_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102990u)	/* TIM3 Channel 3 General Purpose 0 Register */
#define GTM_TIM3_CH4_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102a10u)	/* TIM3 Channel 4 General Purpose 0 Register */
#define GTM_TIM3_CH5_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102a90u)	/* TIM3 Channel 5 General Purpose 0 Register */
#define GTM_TIM3_CH6_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102b10u)	/* TIM3 Channel 6 General Purpose 0 Register */
#define GTM_TIM3_CH7_GPR0	(*( GTM_TIM0_CH0_GPR0_type *) 0xf0102b90u)	/* TIM3 Channel 7 General Purpose 0 Register */

