svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int GPR1           : 24;	/* Input signal characteristic parameter 1 */
		/* const */ unsigned int ECNT           : 8;	/* Edge counter */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_GPR1_type;
#define GTM_TIM0_CH0_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101014u)	/* TIM0 Channel 0 General Purpose 1 Register */
#define GTM_TIM0_CH1_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101094u)	/* TIM0 Channel 1 General Purpose 1 Register */
#define GTM_TIM0_CH2_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101114u)	/* TIM0 Channel 2 General Purpose 1 Register */
#define GTM_TIM0_CH3_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101194u)	/* TIM0 Channel 3 General Purpose 1 Register */
#define GTM_TIM0_CH4_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101214u)	/* TIM0 Channel 4 General Purpose 1 Register */
#define GTM_TIM0_CH5_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101294u)	/* TIM0 Channel 5 General Purpose 1 Register */
#define GTM_TIM0_CH6_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101314u)	/* TIM0 Channel 6 General Purpose 1 Register */
#define GTM_TIM0_CH7_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101394u)	/* TIM0 Channel 7 General Purpose 1 Register */
#define GTM_TIM1_CH0_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101814u)	/* TIM1 Channel 0 General Purpose 1 Register */
#define GTM_TIM1_CH1_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101894u)	/* TIM1 Channel 1 General Purpose 1 Register */
#define GTM_TIM1_CH2_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101914u)	/* TIM1 Channel 2 General Purpose 1 Register */
#define GTM_TIM1_CH3_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101994u)	/* TIM1 Channel 3 General Purpose 1 Register */
#define GTM_TIM1_CH4_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101a14u)	/* TIM1 Channel 4 General Purpose 1 Register */
#define GTM_TIM1_CH5_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101a94u)	/* TIM1 Channel 5 General Purpose 1 Register */
#define GTM_TIM1_CH6_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101b14u)	/* TIM1 Channel 6 General Purpose 1 Register */
#define GTM_TIM1_CH7_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0101b94u)	/* TIM1 Channel 7 General Purpose 1 Register */
#define GTM_TIM2_CH0_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102014u)	/* TIM2 Channel 0 General Purpose 1 Register */
#define GTM_TIM2_CH1_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102094u)	/* TIM2 Channel 1 General Purpose 1 Register */
#define GTM_TIM2_CH2_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102114u)	/* TIM2 Channel 2 General Purpose 1 Register */
#define GTM_TIM2_CH3_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102194u)	/* TIM2 Channel 3 General Purpose 1 Register */
#define GTM_TIM2_CH4_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102214u)	/* TIM2 Channel 4 General Purpose 1 Register */
#define GTM_TIM2_CH5_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102294u)	/* TIM2 Channel 5 General Purpose 1 Register */
#define GTM_TIM2_CH6_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102314u)	/* TIM2 Channel 6 General Purpose 1 Register */
#define GTM_TIM2_CH7_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102394u)	/* TIM2 Channel 7 General Purpose 1 Register */
#define GTM_TIM3_CH0_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102814u)	/* TIM3 Channel 0 General Purpose 1 Register */
#define GTM_TIM3_CH1_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102894u)	/* TIM3 Channel 1 General Purpose 1 Register */
#define GTM_TIM3_CH2_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102914u)	/* TIM3 Channel 2 General Purpose 1 Register */
#define GTM_TIM3_CH3_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102994u)	/* TIM3 Channel 3 General Purpose 1 Register */
#define GTM_TIM3_CH4_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102a14u)	/* TIM3 Channel 4 General Purpose 1 Register */
#define GTM_TIM3_CH5_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102a94u)	/* TIM3 Channel 5 General Purpose 1 Register */
#define GTM_TIM3_CH6_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102b14u)	/* TIM3 Channel 6 General Purpose 1 Register */
#define GTM_TIM3_CH7_GPR1	(*( GTM_TIM0_CH0_GPR1_type *) 0xf0102b94u)	/* TIM3 Channel 7 General Purpose 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NEWVAL_IRQ_EN  : 1;	/* TIM_NEWVALx_IRQ interrupt enable */
		unsigned int ECNTOFL_IRQ_EN : 1;	/* TIM_ECNTOFLx_IRQ interrupt enable */
		unsigned int CNTOFL_IRQ_EN  : 1;	/* TIM_CNTOFLx_IRQ interrupt enable */
		unsigned int GPRzOFL_IRQ_EN : 1;	/* TIM_GPRzOFLx_IRQ interrupt enable */
		unsigned int TODET_IRQ_EN   : 1;	/* TIM_TODETx_IRQ interrupt enable */
		unsigned int GLITCHDET_IRQ_EN: 1;	/* TIM_GLITCHDETx_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 26;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_IRQ_EN_type;
#define GTM_TIM0_CH0_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101024u)	/* TIM0 Channel 0 Interrupt Enable Register */
#define GTM_TIM0_CH1_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01010a4u)	/* TIM0 Channel 1 Interrupt Enable Register */
#define GTM_TIM0_CH2_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101124u)	/* TIM0 Channel 2 Interrupt Enable Register */
#define GTM_TIM0_CH3_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01011a4u)	/* TIM0 Channel 3 Interrupt Enable Register */
#define GTM_TIM0_CH4_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101224u)	/* TIM0 Channel 4 Interrupt Enable Register */
#define GTM_TIM0_CH5_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01012a4u)	/* TIM0 Channel 5 Interrupt Enable Register */
#define GTM_TIM0_CH6_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101324u)	/* TIM0 Channel 6 Interrupt Enable Register */
#define GTM_TIM0_CH7_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01013a4u)	/* TIM0 Channel 7 Interrupt Enable Register */
#define GTM_TIM1_CH0_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101824u)	/* TIM1 Channel 0 Interrupt Enable Register */
#define GTM_TIM1_CH1_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01018a4u)	/* TIM1 Channel 1 Interrupt Enable Register */
#define GTM_TIM1_CH2_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101924u)	/* TIM1 Channel 2 Interrupt Enable Register */
#define GTM_TIM1_CH3_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01019a4u)	/* TIM1 Channel 3 Interrupt Enable Register */
#define GTM_TIM1_CH4_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101a24u)	/* TIM1 Channel 4 Interrupt Enable Register */
#define GTM_TIM1_CH5_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101aa4u)	/* TIM1 Channel 5 Interrupt Enable Register */
#define GTM_TIM1_CH6_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101b24u)	/* TIM1 Channel 6 Interrupt Enable Register */
#define GTM_TIM1_CH7_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0101ba4u)	/* TIM1 Channel 7 Interrupt Enable Register */
#define GTM_TIM2_CH0_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102024u)	/* TIM2 Channel 0 Interrupt Enable Register */
#define GTM_TIM2_CH1_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01020a4u)	/* TIM2 Channel 1 Interrupt Enable Register */
#define GTM_TIM2_CH2_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102124u)	/* TIM2 Channel 2 Interrupt Enable Register */
#define GTM_TIM2_CH3_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01021a4u)	/* TIM2 Channel 3 Interrupt Enable Register */
#define GTM_TIM2_CH4_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102224u)	/* TIM2 Channel 4 Interrupt Enable Register */
#define GTM_TIM2_CH5_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01022a4u)	/* TIM2 Channel 5 Interrupt Enable Register */
#define GTM_TIM2_CH6_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102324u)	/* TIM2 Channel 6 Interrupt Enable Register */
#define GTM_TIM2_CH7_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01023a4u)	/* TIM2 Channel 7 Interrupt Enable Register */
#define GTM_TIM3_CH0_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102824u)	/* TIM3 Channel 0 Interrupt Enable Register */
#define GTM_TIM3_CH1_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01028a4u)	/* TIM3 Channel 1 Interrupt Enable Register */
#define GTM_TIM3_CH2_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102924u)	/* TIM3 Channel 2 Interrupt Enable Register */
#define GTM_TIM3_CH3_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf01029a4u)	/* TIM3 Channel 3 Interrupt Enable Register */
#define GTM_TIM3_CH4_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102a24u)	/* TIM3 Channel 4 Interrupt Enable Register */
#define GTM_TIM3_CH5_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102aa4u)	/* TIM3 Channel 5 Interrupt Enable Register */
#define GTM_TIM3_CH6_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102b24u)	/* TIM3 Channel 6 Interrupt Enable Register */
#define GTM_TIM3_CH7_IRQ_EN	(*( GTM_TIM0_CH0_IRQ_EN_type *) 0xf0102ba4u)	/* TIM3 Channel 7 Interrupt Enable Register */

