svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TRG_NEWVAL     : 1;	/* Trigger NEWVAL bit in TIM_CHx_IRQ_NOTIFY register by software */
		unsigned int TRG_ECNTOFL    : 1;	/* Trigger ECNTOFL bit in TIM_CHx_IRQ_NOTIFY register by software */
		unsigned int TRG_CNTOFL     : 1;	/* Trigger CNTOFL bit in TIM_CHx_IRQ_NOTIFY register by software */
		unsigned int TRG_GPRzOFL    : 1;	/* Trigger GPRzOFL bit in TIM_CHx_IRQ_NOTIFY register by software */
		unsigned int TRG_TODET      : 1;	/* Trigger TODET bit in TIM_CHx_IRQ_NOTIFY register by software */
		unsigned int TRG_GLITCHDET  : 1;	/* Trigger GLITCHDET bit in TIM_CHx_IRQ_NOTIFY register by software */
		/* const */ unsigned int Reserved       : 26;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_IRQ_FORCINT_type;
#define GTM_TIM0_CH0_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101028u)	/* TIM0 Channel 0 Software Interrupt Force Register */
#define GTM_TIM0_CH1_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01010a8u)	/* TIM0 Channel 1 Software Interrupt Force Register */
#define GTM_TIM0_CH2_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101128u)	/* TIM0 Channel 2 Software Interrupt Force Register */
#define GTM_TIM0_CH3_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01011a8u)	/* TIM0 Channel 3 Software Interrupt Force Register */
#define GTM_TIM0_CH4_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101228u)	/* TIM0 Channel 4 Software Interrupt Force Register */
#define GTM_TIM0_CH5_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01012a8u)	/* TIM0 Channel 5 Software Interrupt Force Register */
#define GTM_TIM0_CH6_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101328u)	/* TIM0 Channel 6 Software Interrupt Force Register */
#define GTM_TIM0_CH7_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01013a8u)	/* TIM0 Channel 7 Software Interrupt Force Register */
#define GTM_TIM1_CH0_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101828u)	/* TIM1 Channel 0 Software Interrupt Force Register */
#define GTM_TIM1_CH1_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01018a8u)	/* TIM1 Channel 1 Software Interrupt Force Register */
#define GTM_TIM1_CH2_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101928u)	/* TIM1 Channel 2 Software Interrupt Force Register */
#define GTM_TIM1_CH3_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01019a8u)	/* TIM1 Channel 3 Software Interrupt Force Register */
#define GTM_TIM1_CH4_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101a28u)	/* TIM1 Channel 4 Software Interrupt Force Register */
#define GTM_TIM1_CH5_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101aa8u)	/* TIM1 Channel 5 Software Interrupt Force Register */
#define GTM_TIM1_CH6_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101b28u)	/* TIM1 Channel 6 Software Interrupt Force Register */
#define GTM_TIM1_CH7_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0101ba8u)	/* TIM1 Channel 7 Software Interrupt Force Register */
#define GTM_TIM2_CH0_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102028u)	/* TIM2 Channel 0 Software Interrupt Force Register */
#define GTM_TIM2_CH1_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01020a8u)	/* TIM2 Channel 1 Software Interrupt Force Register */
#define GTM_TIM2_CH2_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102128u)	/* TIM2 Channel 2 Software Interrupt Force Register */
#define GTM_TIM2_CH3_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01021a8u)	/* TIM2 Channel 3 Software Interrupt Force Register */
#define GTM_TIM2_CH4_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102228u)	/* TIM2 Channel 4 Software Interrupt Force Register */
#define GTM_TIM2_CH5_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01022a8u)	/* TIM2 Channel 5 Software Interrupt Force Register */
#define GTM_TIM2_CH6_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102328u)	/* TIM2 Channel 6 Software Interrupt Force Register */
#define GTM_TIM2_CH7_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01023a8u)	/* TIM2 Channel 7 Software Interrupt Force Register */
#define GTM_TIM3_CH0_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102828u)	/* TIM3 Channel 0 Software Interrupt Force Register */
#define GTM_TIM3_CH1_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01028a8u)	/* TIM3 Channel 1 Software Interrupt Force Register */
#define GTM_TIM3_CH2_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102928u)	/* TIM3 Channel 2 Software Interrupt Force Register */
#define GTM_TIM3_CH3_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf01029a8u)	/* TIM3 Channel 3 Software Interrupt Force Register */
#define GTM_TIM3_CH4_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102a28u)	/* TIM3 Channel 4 Software Interrupt Force Register */
#define GTM_TIM3_CH5_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102aa8u)	/* TIM3 Channel 5 Software Interrupt Force Register */
#define GTM_TIM3_CH6_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102b28u)	/* TIM3 Channel 6 Software Interrupt Force Register */
#define GTM_TIM3_CH7_IRQ_FORCINT	(*( GTM_TIM0_CH0_IRQ_FORCINT_type *) 0xf0102ba8u)	/* TIM3 Channel 7 Software Interrupt Force Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NEWVAL         : 1;	/* New measurement value detected by in channel x (x:0..7) */
		unsigned int ECNTOFL        : 1;	/* counter overflow of channel x, (x:0..7) */
		unsigned int CNTOFL         : 1;	/* SMU CNT counter overflow of channel x, (x:0...7) */
		unsigned int GPRzOFL        : 1;	/* data overflow, old data not read out before new data has arrived at input pin, (x:0..7) */
		unsigned int TODET          : 1;	/* Timeout reached for input signal of channel x, (x:0..7) */
		unsigned int GLITCHDET      : 1;	/* Glitch detected on channel x, (x:0..7) */
		/* const */ unsigned int Reserved       : 26;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_IRQ_NOTIFY_type;
#define GTM_TIM0_CH0_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101020u)	/* TIM0 Channel 0 Interrupt Notification Register */
#define GTM_TIM0_CH1_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01010a0u)	/* TIM0 Channel 1 Interrupt Notification Register */
#define GTM_TIM0_CH2_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101120u)	/* TIM0 Channel 2 Interrupt Notification Register */
#define GTM_TIM0_CH3_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01011a0u)	/* TIM0 Channel 3 Interrupt Notification Register */
#define GTM_TIM0_CH4_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101220u)	/* TIM0 Channel 4 Interrupt Notification Register */
#define GTM_TIM0_CH5_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01012a0u)	/* TIM0 Channel 5 Interrupt Notification Register */
#define GTM_TIM0_CH6_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101320u)	/* TIM0 Channel 6 Interrupt Notification Register */
#define GTM_TIM0_CH7_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01013a0u)	/* TIM0 Channel 7 Interrupt Notification Register */
#define GTM_TIM1_CH0_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101820u)	/* TIM1 Channel 0 Interrupt Notification Register */
#define GTM_TIM1_CH1_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01018a0u)	/* TIM1 Channel 1 Interrupt Notification Register */
#define GTM_TIM1_CH2_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101920u)	/* TIM1 Channel 2 Interrupt Notification Register */
#define GTM_TIM1_CH3_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01019a0u)	/* TIM1 Channel 3 Interrupt Notification Register */
#define GTM_TIM1_CH4_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101a20u)	/* TIM1 Channel 4 Interrupt Notification Register */
#define GTM_TIM1_CH5_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101aa0u)	/* TIM1 Channel 5 Interrupt Notification Register */
#define GTM_TIM1_CH6_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101b20u)	/* TIM1 Channel 6 Interrupt Notification Register */
#define GTM_TIM1_CH7_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0101ba0u)	/* TIM1 Channel 7 Interrupt Notification Register */
#define GTM_TIM2_CH0_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102020u)	/* TIM2 Channel 0 Interrupt Notification Register */
#define GTM_TIM2_CH1_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01020a0u)	/* TIM2 Channel 1 Interrupt Notification Register */
#define GTM_TIM2_CH2_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102120u)	/* TIM2 Channel 2 Interrupt Notification Register */
#define GTM_TIM2_CH3_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01021a0u)	/* TIM2 Channel 3 Interrupt Notification Register */
#define GTM_TIM2_CH4_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102220u)	/* TIM2 Channel 4 Interrupt Notification Register */
#define GTM_TIM2_CH5_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01022a0u)	/* TIM2 Channel 5 Interrupt Notification Register */
#define GTM_TIM2_CH6_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102320u)	/* TIM2 Channel 6 Interrupt Notification Register */
#define GTM_TIM2_CH7_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01023a0u)	/* TIM2 Channel 7 Interrupt Notification Register */
#define GTM_TIM3_CH0_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102820u)	/* TIM3 Channel 0 Interrupt Notification Register */
#define GTM_TIM3_CH1_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01028a0u)	/* TIM3 Channel 1 Interrupt Notification Register */
#define GTM_TIM3_CH2_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102920u)	/* TIM3 Channel 2 Interrupt Notification Register */
#define GTM_TIM3_CH3_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf01029a0u)	/* TIM3 Channel 3 Interrupt Notification Register */
#define GTM_TIM3_CH4_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102a20u)	/* TIM3 Channel 4 Interrupt Notification Register */
#define GTM_TIM3_CH5_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102aa0u)	/* TIM3 Channel 5 Interrupt Notification Register */
#define GTM_TIM3_CH6_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102b20u)	/* TIM3 Channel 6 Interrupt Notification Register */
#define GTM_TIM3_CH7_IRQ_NOTIFY	(*( GTM_TIM0_CH0_IRQ_NOTIFY_type *) 0xf0102ba0u)	/* TIM3 Channel 7 Interrupt Notification Register */

