svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TO_EN          : 1;	/* Timeout detection unit enable */
		unsigned int TCS            : 3;	/* Timeout Clock selection */
		/* const */ unsigned int Reserved       : 4;	/* Reserved */
		unsigned int TOV            : 8;	/* Time out duration for channel x (x:0..7) */
		/* const */ unsigned int TO_CNT         : 8;	/* Current Timeout value for channel x (x:0..7) */
		/* const */ unsigned int Reserved_6     : 8;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_CH0_TDU_type;
#define GTM_TIM0_CH0_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010100cu)	/* TIM0 Channel 0 TDU Control Register */
#define GTM_TIM0_CH1_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010108cu)	/* TIM0 Channel 1 TDU Control Register */
#define GTM_TIM0_CH2_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010110cu)	/* TIM0 Channel 2 TDU Control Register */
#define GTM_TIM0_CH3_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010118cu)	/* TIM0 Channel 3 TDU Control Register */
#define GTM_TIM0_CH4_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010120cu)	/* TIM0 Channel 4 TDU Control Register */
#define GTM_TIM0_CH5_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010128cu)	/* TIM0 Channel 5 TDU Control Register */
#define GTM_TIM0_CH6_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010130cu)	/* TIM0 Channel 6 TDU Control Register */
#define GTM_TIM0_CH7_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010138cu)	/* TIM0 Channel 7 TDU Control Register */
#define GTM_TIM1_CH0_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010180cu)	/* TIM1 Channel 0 TDU Control Register */
#define GTM_TIM1_CH1_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010188cu)	/* TIM1 Channel 1 TDU Control Register */
#define GTM_TIM1_CH2_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010190cu)	/* TIM1 Channel 2 TDU Control Register */
#define GTM_TIM1_CH3_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010198cu)	/* TIM1 Channel 3 TDU Control Register */
#define GTM_TIM1_CH4_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0101a0cu)	/* TIM1 Channel 4 TDU Control Register */
#define GTM_TIM1_CH5_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0101a8cu)	/* TIM1 Channel 5 TDU Control Register */
#define GTM_TIM1_CH6_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0101b0cu)	/* TIM1 Channel 6 TDU Control Register */
#define GTM_TIM1_CH7_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0101b8cu)	/* TIM1 Channel 7 TDU Control Register */
#define GTM_TIM2_CH0_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010200cu)	/* TIM2 Channel 0 TDU Control Register */
#define GTM_TIM2_CH1_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010208cu)	/* TIM2 Channel 1 TDU Control Register */
#define GTM_TIM2_CH2_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010210cu)	/* TIM2 Channel 2 TDU Control Register */
#define GTM_TIM2_CH3_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010218cu)	/* TIM2 Channel 3 TDU Control Register */
#define GTM_TIM2_CH4_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010220cu)	/* TIM2 Channel 4 TDU Control Register */
#define GTM_TIM2_CH5_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010228cu)	/* TIM2 Channel 5 TDU Control Register */
#define GTM_TIM2_CH6_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010230cu)	/* TIM2 Channel 6 TDU Control Register */
#define GTM_TIM2_CH7_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010238cu)	/* TIM2 Channel 7 TDU Control Register */
#define GTM_TIM3_CH0_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010280cu)	/* TIM3 Channel 0 TDU Control Register */
#define GTM_TIM3_CH1_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010288cu)	/* TIM3 Channel 1 TDU Control Register */
#define GTM_TIM3_CH2_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010290cu)	/* TIM3 Channel 2 TDU Control Register */
#define GTM_TIM3_CH3_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf010298cu)	/* TIM3 Channel 3 TDU Control Register */
#define GTM_TIM3_CH4_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0102a0cu)	/* TIM3 Channel 4 TDU Control Register */
#define GTM_TIM3_CH5_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0102a8cu)	/* TIM3 Channel 5 TDU Control Register */
#define GTM_TIM3_CH6_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0102b0cu)	/* TIM3 Channel 6 TDU Control Register */
#define GTM_TIM3_CH7_TDU	(*( GTM_TIM0_CH0_TDU_type *) 0xf0102b8cu)	/* TIM3 Channel 7 TDU Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST_CH0        : 1;	/* Software reset of channel 0 */
		unsigned int RST_CH1        : 1;	/* Software reset of channel 1 */
		unsigned int RST_CH2        : 1;	/* Software reset of channel 2 */
		unsigned int RST_CH3        : 1;	/* Software reset of channel 3 */
		unsigned int RST_CH4        : 1;	/* Software reset of channel 4 */
		unsigned int RST_CH5        : 1;	/* Software reset of channel 5 */
		unsigned int RST_CH6        : 1;	/* Software reset of channel 6 */
		unsigned int RST_CH7        : 1;	/* Software reset of channel 7 */
		/* const */ unsigned int Reserved       : 24;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM0_RST_type;
#define GTM_TIM0_RST	(*( GTM_TIM0_RST_type *) 0xf0101400u)	/* TIM0 Global Software Reset Register */
#define GTM_TIM1_RST	(*( GTM_TIM0_RST_type *) 0xf0101c00u)	/* TIM1 Global Software Reset Register */
#define GTM_TIM2_RST	(*( GTM_TIM0_RST_type *) 0xf0102400u)	/* TIM2 Global Software Reset Register */
#define GTM_TIM3_RST	(*( GTM_TIM0_RST_type *) 0xf0102c00u)	/* TIM3 Global Software Reset Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TIM_EN         : 1;	/* TIM channel x (x:0..7) enable */
		unsigned int TIM_MODE       : 3;	/* TIM channel x (x:0..7) mode */
		unsigned int OSM            : 1;	/* One-shot mode */
		unsigned int ARU_EN         : 1;	/* GPR0 and GPR1 register values routed to ARU */
		unsigned int CICTRL         : 1;	/* Channel Input Control */
		/* const */ unsigned int Reserved       : 1;	/* Reserved */
		unsigned int GPR0_SEL       : 2;	/* Selection for GPR0 register */
		unsigned int GPR1_SEL       : 2;	/* Selection for GPR1 register */
		unsigned int CNTS_SEL       : 1;	/* Selection for CNTS register */
		unsigned int DSL            : 1;	/* Signal level control */
		unsigned int ISL            : 1;	/* Ignore signal level */
		/* const */ unsigned int Reserved_12    : 1;	/* Reserved */
		unsigned int FLT_EN         : 1;	/* Filter enable for channel x (x:0..7) */
		unsigned int FLT_CNT_FRQ    : 2;	/* Filter counter frequency select */
		/* const */ unsigned int Reserved_15    : 1;	/* Reserved */
		unsigned int FLT_MODE_RE    : 1;	/* Filter mode for rising edge */
		unsigned int FLT_CTR_RE     : 1;	/* Filter counter mode for rising edge */
		unsigned int FLT_MODE_FE    : 1;	/* Filter mode for falling edge */
		unsigned int FLT_CTR_FE     : 1;	/* Filter counter mode for falling edge */
		unsigned int CLK_SEL        : 3;	/* CMU clock source select for channel */
		/* const */ unsigned int Reserved_21    : 5;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TIM1_CH0_CTRL_type;
