svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define GTM_TIM1_CH0_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101800u)	/* TIM1 Channel 0 Control Register */
#define GTM_TIM1_CH1_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101880u)	/* TIM1 Channel 1 Control Register */
#define GTM_TIM1_CH2_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101900u)	/* TIM1 Channel 2 Control Register */
#define GTM_TIM1_CH3_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101980u)	/* TIM1 Channel 3 Control Register */
#define GTM_TIM1_CH4_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101a00u)	/* TIM1 Channel 4 Control Register */
#define GTM_TIM1_CH5_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101a80u)	/* TIM1 Channel 5 Control Register */
#define GTM_TIM1_CH6_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101b00u)	/* TIM1 Channel 6 Control Register */
#define GTM_TIM1_CH7_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0101b80u)	/* TIM1 Channel 7 Control Register */
#define GTM_TIM2_CH0_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102000u)	/* TIM2 Channel 0 Control Register */
#define GTM_TIM2_CH1_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102080u)	/* TIM2 Channel 1 Control Register */
#define GTM_TIM2_CH2_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102100u)	/* TIM2 Channel 2 Control Register */
#define GTM_TIM2_CH3_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102180u)	/* TIM2 Channel 3 Control Register */
#define GTM_TIM2_CH4_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102200u)	/* TIM2 Channel 4 Control Register */
#define GTM_TIM2_CH5_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102280u)	/* TIM2 Channel 5 Control Register */
#define GTM_TIM2_CH6_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102300u)	/* TIM2 Channel 6 Control Register */
#define GTM_TIM2_CH7_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102380u)	/* TIM2 Channel 7 Control Register */
#define GTM_TIM3_CH0_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102800u)	/* TIM3 Channel 0 Control Register */
#define GTM_TIM3_CH1_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102880u)	/* TIM3 Channel 1 Control Register */
#define GTM_TIM3_CH2_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102900u)	/* TIM3 Channel 2 Control Register */
#define GTM_TIM3_CH3_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102980u)	/* TIM3 Channel 3 Control Register */
#define GTM_TIM3_CH4_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102a00u)	/* TIM3 Channel 4 Control Register */
#define GTM_TIM3_CH5_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102a80u)	/* TIM3 Channel 5 Control Register */
#define GTM_TIM3_CH6_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102b00u)	/* TIM3 Channel 6 Control Register */
#define GTM_TIM3_CH7_CTRL	(*( GTM_TIM1_CH0_CTRL_type *) 0xf0102b80u)	/* TIM3 Channel 7 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CM0            : 16;	/* TOM CCU0 compare register */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_CM0_type;
#define GTM_TOM0_CH0_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108088u)	/* TOM0 Channel 0 CCU0 Compare Register */
#define GTM_TOM0_CH10_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108308u)	/* TOM0 Channel 10 CCU0 Compare Register */
#define GTM_TOM0_CH11_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108348u)	/* TOM0 Channel 11 CCU0 Compare Register */
#define GTM_TOM0_CH12_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108388u)	/* TOM0 Channel 12 CCU0 Compare Register */
#define GTM_TOM0_CH13_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01083c8u)	/* TOM0 Channel 13 CCU0 Compare Register */
#define GTM_TOM0_CH14_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108408u)	/* TOM0 Channel 14 CCU0 Compare Register */
#define GTM_TOM0_CH15_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108448u)	/* TOM0 Channel 15 CCU0 Compare Register */
#define GTM_TOM0_CH1_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01080c8u)	/* TOM0 Channel 1 CCU0 Compare Register */
#define GTM_TOM0_CH2_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108108u)	/* TOM0 Channel 2 CCU0 Compare Register */
#define GTM_TOM0_CH3_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108148u)	/* TOM0 Channel 3 CCU0 Compare Register */
#define GTM_TOM0_CH4_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108188u)	/* TOM0 Channel 4 CCU0 Compare Register */
#define GTM_TOM0_CH5_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01081c8u)	/* TOM0 Channel 5 CCU0 Compare Register */
#define GTM_TOM0_CH6_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108208u)	/* TOM0 Channel 6 CCU0 Compare Register */
#define GTM_TOM0_CH7_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108248u)	/* TOM0 Channel 7 CCU0 Compare Register */
#define GTM_TOM0_CH8_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108288u)	/* TOM0 Channel 8 CCU0 Compare Register */
#define GTM_TOM0_CH9_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01082c8u)	/* TOM0 Channel 9 CCU0 Compare Register */
#define GTM_TOM1_CH0_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108888u)	/* TOM1 Channel 0 CCU0 Compare Register */
#define GTM_TOM1_CH10_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108b08u)	/* TOM1 Channel 10 CCU0 Compare Register */
#define GTM_TOM1_CH11_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108b48u)	/* TOM1 Channel 11 CCU0 Compare Register */
#define GTM_TOM1_CH12_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108b88u)	/* TOM1 Channel 12 CCU0 Compare Register */
#define GTM_TOM1_CH13_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108bc8u)	/* TOM1 Channel 13 CCU0 Compare Register */
#define GTM_TOM1_CH14_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108c08u)	/* TOM1 Channel 14 CCU0 Compare Register */
#define GTM_TOM1_CH15_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108c48u)	/* TOM1 Channel 15 CCU0 Compare Register */
#define GTM_TOM1_CH1_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01088c8u)	/* TOM1 Channel 1 CCU0 Compare Register */
#define GTM_TOM1_CH2_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108908u)	/* TOM1 Channel 2 CCU0 Compare Register */
#define GTM_TOM1_CH3_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108948u)	/* TOM1 Channel 3 CCU0 Compare Register */
#define GTM_TOM1_CH4_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108988u)	/* TOM1 Channel 4 CCU0 Compare Register */
#define GTM_TOM1_CH5_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01089c8u)	/* TOM1 Channel 5 CCU0 Compare Register */
#define GTM_TOM1_CH6_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108a08u)	/* TOM1 Channel 6 CCU0 Compare Register */
#define GTM_TOM1_CH7_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108a48u)	/* TOM1 Channel 7 CCU0 Compare Register */
#define GTM_TOM1_CH8_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108a88u)	/* TOM1 Channel 8 CCU0 Compare Register */
#define GTM_TOM1_CH9_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0108ac8u)	/* TOM1 Channel 9 CCU0 Compare Register */
#define GTM_TOM2_CH0_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109088u)	/* TOM2 Channel 0 CCU0 Compare Register */
#define GTM_TOM2_CH10_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109308u)	/* TOM2 Channel 10 CCU0 Compare Register */
#define GTM_TOM2_CH11_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109348u)	/* TOM2 Channel 11 CCU0 Compare Register */
#define GTM_TOM2_CH12_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109388u)	/* TOM2 Channel 12 CCU0 Compare Register */
#define GTM_TOM2_CH13_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01093c8u)	/* TOM2 Channel 13 CCU0 Compare Register */
#define GTM_TOM2_CH14_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109408u)	/* TOM2 Channel 14 CCU0 Compare Register */
#define GTM_TOM2_CH15_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109448u)	/* TOM2 Channel 15 CCU0 Compare Register */
#define GTM_TOM2_CH1_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01090c8u)	/* TOM2 Channel 1 CCU0 Compare Register */
#define GTM_TOM2_CH2_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109108u)	/* TOM2 Channel 2 CCU0 Compare Register */
#define GTM_TOM2_CH3_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109148u)	/* TOM2 Channel 3 CCU0 Compare Register */
#define GTM_TOM2_CH4_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109188u)	/* TOM2 Channel 4 CCU0 Compare Register */
#define GTM_TOM2_CH5_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01091c8u)	/* TOM2 Channel 5 CCU0 Compare Register */
#define GTM_TOM2_CH6_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109208u)	/* TOM2 Channel 6 CCU0 Compare Register */
#define GTM_TOM2_CH7_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109248u)	/* TOM2 Channel 7 CCU0 Compare Register */
#define GTM_TOM2_CH8_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf0109288u)	/* TOM2 Channel 8 CCU0 Compare Register */
#define GTM_TOM2_CH9_CM0	(*( GTM_TOM0_CH0_CM0_type *) 0xf01092c8u)	/* TOM2 Channel 9 CCU0 Compare Register */

