svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CM1            : 16;	/* TOM CCU1 compare register */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_CM1_type;
#define GTM_TOM0_CH0_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108090u)	/* TOM0 Channel 0 CCU1 Compare Register */
#define GTM_TOM0_CH10_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108310u)	/* TOM0 Channel 10 CCU1 Compare Register */
#define GTM_TOM0_CH11_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108350u)	/* TOM0 Channel 11 CCU1 Compare Register */
#define GTM_TOM0_CH12_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108390u)	/* TOM0 Channel 12 CCU1 Compare Register */
#define GTM_TOM0_CH13_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01083d0u)	/* TOM0 Channel 13 CCU1 Compare Register */
#define GTM_TOM0_CH14_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108410u)	/* TOM0 Channel 14 CCU1 Compare Register */
#define GTM_TOM0_CH15_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108450u)	/* TOM0 Channel 15 CCU1 Compare Register */
#define GTM_TOM0_CH1_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01080d0u)	/* TOM0 Channel 1 CCU1 Compare Register */
#define GTM_TOM0_CH2_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108110u)	/* TOM0 Channel 2 CCU1 Compare Register */
#define GTM_TOM0_CH3_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108150u)	/* TOM0 Channel 3 CCU1 Compare Register */
#define GTM_TOM0_CH4_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108190u)	/* TOM0 Channel 4 CCU1 Compare Register */
#define GTM_TOM0_CH5_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01081d0u)	/* TOM0 Channel 5 CCU1 Compare Register */
#define GTM_TOM0_CH6_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108210u)	/* TOM0 Channel 6 CCU1 Compare Register */
#define GTM_TOM0_CH7_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108250u)	/* TOM0 Channel 7 CCU1 Compare Register */
#define GTM_TOM0_CH8_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108290u)	/* TOM0 Channel 8 CCU1 Compare Register */
#define GTM_TOM0_CH9_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01082d0u)	/* TOM0 Channel 9 CCU1 Compare Register */
#define GTM_TOM1_CH0_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108890u)	/* TOM1 Channel 0 CCU1 Compare Register */
#define GTM_TOM1_CH10_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108b10u)	/* TOM1 Channel 10 CCU1 Compare Register */
#define GTM_TOM1_CH11_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108b50u)	/* TOM1 Channel 11 CCU1 Compare Register */
#define GTM_TOM1_CH12_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108b90u)	/* TOM1 Channel 12 CCU1 Compare Register */
#define GTM_TOM1_CH13_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108bd0u)	/* TOM1 Channel 13 CCU1 Compare Register */
#define GTM_TOM1_CH14_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108c10u)	/* TOM1 Channel 14 CCU1 Compare Register */
#define GTM_TOM1_CH15_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108c50u)	/* TOM1 Channel 15 CCU1 Compare Register */
#define GTM_TOM1_CH1_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01088d0u)	/* TOM1 Channel 1 CCU1 Compare Register */
#define GTM_TOM1_CH2_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108910u)	/* TOM1 Channel 2 CCU1 Compare Register */
#define GTM_TOM1_CH3_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108950u)	/* TOM1 Channel 3 CCU1 Compare Register */
#define GTM_TOM1_CH4_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108990u)	/* TOM1 Channel 4 CCU1 Compare Register */
#define GTM_TOM1_CH5_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01089d0u)	/* TOM1 Channel 5 CCU1 Compare Register */
#define GTM_TOM1_CH6_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108a10u)	/* TOM1 Channel 6 CCU1 Compare Register */
#define GTM_TOM1_CH7_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108a50u)	/* TOM1 Channel 7 CCU1 Compare Register */
#define GTM_TOM1_CH8_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108a90u)	/* TOM1 Channel 8 CCU1 Compare Register */
#define GTM_TOM1_CH9_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0108ad0u)	/* TOM1 Channel 9 CCU1 Compare Register */
#define GTM_TOM2_CH0_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109090u)	/* TOM2 Channel 0 CCU1 Compare Register */
#define GTM_TOM2_CH10_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109310u)	/* TOM2 Channel 10 CCU1 Compare Register */
#define GTM_TOM2_CH11_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109350u)	/* TOM2 Channel 11 CCU1 Compare Register */
#define GTM_TOM2_CH12_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109390u)	/* TOM2 Channel 12 CCU1 Compare Register */
#define GTM_TOM2_CH13_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01093d0u)	/* TOM2 Channel 13 CCU1 Compare Register */
#define GTM_TOM2_CH14_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109410u)	/* TOM2 Channel 14 CCU1 Compare Register */
#define GTM_TOM2_CH15_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109450u)	/* TOM2 Channel 15 CCU1 Compare Register */
#define GTM_TOM2_CH1_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01090d0u)	/* TOM2 Channel 1 CCU1 Compare Register */
#define GTM_TOM2_CH2_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109110u)	/* TOM2 Channel 2 CCU1 Compare Register */
#define GTM_TOM2_CH3_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109150u)	/* TOM2 Channel 3 CCU1 Compare Register */
#define GTM_TOM2_CH4_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109190u)	/* TOM2 Channel 4 CCU1 Compare Register */
#define GTM_TOM2_CH5_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01091d0u)	/* TOM2 Channel 5 CCU1 Compare Register */
#define GTM_TOM2_CH6_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109210u)	/* TOM2 Channel 6 CCU1 Compare Register */
#define GTM_TOM2_CH7_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109250u)	/* TOM2 Channel 7 CCU1 Compare Register */
#define GTM_TOM2_CH8_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf0109290u)	/* TOM2 Channel 8 CCU1 Compare Register */
#define GTM_TOM2_CH9_CM1	(*( GTM_TOM0_CH0_CM1_type *) 0xf01092d0u)	/* TOM2 Channel 9 CCU1 Compare Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CN0            : 16;	/* TOM CCU0 counter register */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_CN0_type;
#define GTM_TOM0_CH0_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108084u)	/* TOM0 Channel 0 CCU0 Counter Register */
#define GTM_TOM0_CH10_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108304u)	/* TOM0 Channel 10 CCU0 Counter Register */
#define GTM_TOM0_CH11_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108344u)	/* TOM0 Channel 11 CCU0 Counter Register */
#define GTM_TOM0_CH12_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108384u)	/* TOM0 Channel 12 CCU0 Counter Register */
#define GTM_TOM0_CH13_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01083c4u)	/* TOM0 Channel 13 CCU0 Counter Register */
#define GTM_TOM0_CH14_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108404u)	/* TOM0 Channel 14 CCU0 Counter Register */
#define GTM_TOM0_CH15_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108444u)	/* TOM0 Channel 15 CCU0 Counter Register */
#define GTM_TOM0_CH1_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01080c4u)	/* TOM0 Channel 1 CCU0 Counter Register */
#define GTM_TOM0_CH2_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108104u)	/* TOM0 Channel 2 CCU0 Counter Register */
#define GTM_TOM0_CH3_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108144u)	/* TOM0 Channel 3 CCU0 Counter Register */
#define GTM_TOM0_CH4_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108184u)	/* TOM0 Channel 4 CCU0 Counter Register */
#define GTM_TOM0_CH5_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01081c4u)	/* TOM0 Channel 5 CCU0 Counter Register */
#define GTM_TOM0_CH6_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108204u)	/* TOM0 Channel 6 CCU0 Counter Register */
#define GTM_TOM0_CH7_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108244u)	/* TOM0 Channel 7 CCU0 Counter Register */
#define GTM_TOM0_CH8_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108284u)	/* TOM0 Channel 8 CCU0 Counter Register */
#define GTM_TOM0_CH9_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01082c4u)	/* TOM0 Channel 9 CCU0 Counter Register */
#define GTM_TOM1_CH0_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108884u)	/* TOM1 Channel 0 CCU0 Counter Register */
#define GTM_TOM1_CH10_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108b04u)	/* TOM1 Channel 10 CCU0 Counter Register */
#define GTM_TOM1_CH11_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108b44u)	/* TOM1 Channel 11 CCU0 Counter Register */
#define GTM_TOM1_CH12_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108b84u)	/* TOM1 Channel 12 CCU0 Counter Register */
#define GTM_TOM1_CH13_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108bc4u)	/* TOM1 Channel 13 CCU0 Counter Register */
#define GTM_TOM1_CH14_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108c04u)	/* TOM1 Channel 14 CCU0 Counter Register */
#define GTM_TOM1_CH15_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108c44u)	/* TOM1 Channel 15 CCU0 Counter Register */
#define GTM_TOM1_CH1_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01088c4u)	/* TOM1 Channel 1 CCU0 Counter Register */
#define GTM_TOM1_CH2_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108904u)	/* TOM1 Channel 2 CCU0 Counter Register */
#define GTM_TOM1_CH3_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108944u)	/* TOM1 Channel 3 CCU0 Counter Register */
#define GTM_TOM1_CH4_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108984u)	/* TOM1 Channel 4 CCU0 Counter Register */
#define GTM_TOM1_CH5_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01089c4u)	/* TOM1 Channel 5 CCU0 Counter Register */
#define GTM_TOM1_CH6_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108a04u)	/* TOM1 Channel 6 CCU0 Counter Register */
#define GTM_TOM1_CH7_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108a44u)	/* TOM1 Channel 7 CCU0 Counter Register */
#define GTM_TOM1_CH8_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108a84u)	/* TOM1 Channel 8 CCU0 Counter Register */
#define GTM_TOM1_CH9_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0108ac4u)	/* TOM1 Channel 9 CCU0 Counter Register */
#define GTM_TOM2_CH0_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109084u)	/* TOM2 Channel 0 CCU0 Counter Register */
#define GTM_TOM2_CH10_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109304u)	/* TOM2 Channel 10 CCU0 Counter Register */
#define GTM_TOM2_CH11_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109344u)	/* TOM2 Channel 11 CCU0 Counter Register */
#define GTM_TOM2_CH12_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109384u)	/* TOM2 Channel 12 CCU0 Counter Register */
#define GTM_TOM2_CH13_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01093c4u)	/* TOM2 Channel 13 CCU0 Counter Register */
#define GTM_TOM2_CH14_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109404u)	/* TOM2 Channel 14 CCU0 Counter Register */
#define GTM_TOM2_CH15_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109444u)	/* TOM2 Channel 15 CCU0 Counter Register */
#define GTM_TOM2_CH1_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01090c4u)	/* TOM2 Channel 1 CCU0 Counter Register */
#define GTM_TOM2_CH2_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109104u)	/* TOM2 Channel 2 CCU0 Counter Register */
#define GTM_TOM2_CH3_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109144u)	/* TOM2 Channel 3 CCU0 Counter Register */
#define GTM_TOM2_CH4_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109184u)	/* TOM2 Channel 4 CCU0 Counter Register */
#define GTM_TOM2_CH5_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01091c4u)	/* TOM2 Channel 5 CCU0 Counter Register */
#define GTM_TOM2_CH6_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109204u)	/* TOM2 Channel 6 CCU0 Counter Register */
#define GTM_TOM2_CH7_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109244u)	/* TOM2 Channel 7 CCU0 Counter Register */
#define GTM_TOM2_CH8_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf0109284u)	/* TOM2 Channel 8 CCU0 Counter Register */
#define GTM_TOM2_CH9_CN0	(*( GTM_TOM0_CH0_CN0_type *) 0xf01092c4u)	/* TOM2 Channel 9 CCU0 Counter Register */

