svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 11;	/* Reserved */
		unsigned int SL             : 1;	/* Signal level for duty cycle */
		unsigned int CLK_SRC_SR     : 3;	/* Clock source select for channel */
		/* const */ unsigned int Reserved_4     : 5;	/* Reserved */
		unsigned int RST_CCU0       : 1;	/* Reset source of CCU0 */
		/* const */ unsigned int Reserved_6     : 3;	/* Reserved */
		unsigned int TRIGOUT        : 1;	/* Trigger output selection (output signal TRIG_[x]) of module TOM_CH[x] */
		/* const */ unsigned int Reserved_8     : 1;	/* Reserved */
		unsigned int OSM            : 1;	/* One-shot mode */
		/* const */ unsigned int Reserved_10    : 1;	/* Reserved */
		unsigned int SPEM           : 1;	/* SPE mode enable for channel */
		unsigned int GCM            : 1;	/* Gated Counter Mode enable */
		/* const */ unsigned int Reserved_13    : 2;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_CTRL_type;
#define GTM_TOM0_CH0_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108080u)	/* TOM0 Channel 0 Control Register? */
#define GTM_TOM0_CH10_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108300u)	/* TOM0 Channel 10 Control Register? */
#define GTM_TOM0_CH11_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108340u)	/* TOM0 Channel 11 Control Register? */
#define GTM_TOM0_CH12_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108380u)	/* TOM0 Channel 12 Control Register? */
#define GTM_TOM0_CH13_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01083c0u)	/* TOM0 Channel 13 Control Register? */
#define GTM_TOM0_CH14_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108400u)	/* TOM0 Channel 14 Control Register? */
#define GTM_TOM0_CH1_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01080c0u)	/* TOM0 Channel 1 Control Register? */
#define GTM_TOM0_CH2_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108100u)	/* TOM0 Channel 2 Control Register? */
#define GTM_TOM0_CH3_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108140u)	/* TOM0 Channel 3 Control Register? */
#define GTM_TOM0_CH4_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108180u)	/* TOM0 Channel 4 Control Register? */
#define GTM_TOM0_CH5_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01081c0u)	/* TOM0 Channel 5 Control Register? */
#define GTM_TOM0_CH6_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108200u)	/* TOM0 Channel 6 Control Register? */
#define GTM_TOM0_CH7_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108240u)	/* TOM0 Channel 7 Control Register? */
#define GTM_TOM0_CH8_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108280u)	/* TOM0 Channel 8 Control Register? */
#define GTM_TOM0_CH9_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01082c0u)	/* TOM0 Channel 9 Control Register? */
#define GTM_TOM1_CH0_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108880u)	/* TOM1 Channel 0 Control Register? */
#define GTM_TOM1_CH10_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108b00u)	/* TOM1 Channel 10 Control Register? */
#define GTM_TOM1_CH11_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108b40u)	/* TOM1 Channel 11 Control Register? */
#define GTM_TOM1_CH12_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108b80u)	/* TOM1 Channel 12 Control Register? */
#define GTM_TOM1_CH13_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108bc0u)	/* TOM1 Channel 13 Control Register? */
#define GTM_TOM1_CH14_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108c00u)	/* TOM1 Channel 14 Control Register? */
#define GTM_TOM1_CH1_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01088c0u)	/* TOM1 Channel 1 Control Register? */
#define GTM_TOM1_CH2_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108900u)	/* TOM1 Channel 2 Control Register? */
#define GTM_TOM1_CH3_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108940u)	/* TOM1 Channel 3 Control Register? */
#define GTM_TOM1_CH4_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108980u)	/* TOM1 Channel 4 Control Register? */
#define GTM_TOM1_CH5_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01089c0u)	/* TOM1 Channel 5 Control Register? */
#define GTM_TOM1_CH6_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108a00u)	/* TOM1 Channel 6 Control Register? */
#define GTM_TOM1_CH7_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108a40u)	/* TOM1 Channel 7 Control Register? */
#define GTM_TOM1_CH8_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108a80u)	/* TOM1 Channel 8 Control Register? */
#define GTM_TOM1_CH9_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0108ac0u)	/* TOM1 Channel 9 Control Register? */
#define GTM_TOM2_CH0_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109080u)	/* TOM2 Channel 0 Control Register? */
#define GTM_TOM2_CH10_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109300u)	/* TOM2 Channel 10 Control Register? */
#define GTM_TOM2_CH11_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109340u)	/* TOM2 Channel 11 Control Register? */
#define GTM_TOM2_CH12_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109380u)	/* TOM2 Channel 12 Control Register? */
#define GTM_TOM2_CH13_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01093c0u)	/* TOM2 Channel 13 Control Register? */
#define GTM_TOM2_CH14_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109400u)	/* TOM2 Channel 14 Control Register? */
#define GTM_TOM2_CH1_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01090c0u)	/* TOM2 Channel 1 Control Register? */
#define GTM_TOM2_CH2_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109100u)	/* TOM2 Channel 2 Control Register? */
#define GTM_TOM2_CH3_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109140u)	/* TOM2 Channel 3 Control Register? */
#define GTM_TOM2_CH4_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109180u)	/* TOM2 Channel 4 Control Register? */
#define GTM_TOM2_CH5_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01091c0u)	/* TOM2 Channel 5 Control Register? */
#define GTM_TOM2_CH6_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109200u)	/* TOM2 Channel 6 Control Register? */
#define GTM_TOM2_CH7_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109240u)	/* TOM2 Channel 7 Control Register? */
#define GTM_TOM2_CH8_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf0109280u)	/* TOM2 Channel 8 Control Register? */
#define GTM_TOM2_CH9_CTRL	(*( GTM_TOM0_CH0_CTRL_type *) 0xf01092c0u)	/* TOM2 Channel 9 Control Register? */

typedef volatile union
{
	struct
	{ 
		unsigned int CCU0TC_IRQ_EN  : 1;	/* TOM_CCU0TC_IRQ interrupt enable */
		unsigned int CCU1TC_IRQ_EN  : 1;	/* TOM_CCU1TC_IRQ interrupt enable */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_IRQ_EN_type;
#define GTM_TOM0_CH0_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01080a0u)	/* TOM0 Channel 0 Interrupt Enable Register */
#define GTM_TOM0_CH10_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108320u)	/* TOM0 Channel 10 Interrupt Enable Register */
#define GTM_TOM0_CH11_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108360u)	/* TOM0 Channel 11 Interrupt Enable Register */
#define GTM_TOM0_CH12_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01083a0u)	/* TOM0 Channel 12 Interrupt Enable Register */
#define GTM_TOM0_CH13_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01083e0u)	/* TOM0 Channel 13 Interrupt Enable Register */
#define GTM_TOM0_CH14_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108420u)	/* TOM0 Channel 14 Interrupt Enable Register */
#define GTM_TOM0_CH15_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108460u)	/* TOM0 Channel 15 Interrupt Enable Register */
#define GTM_TOM0_CH1_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01080e0u)	/* TOM0 Channel 1 Interrupt Enable Register */
#define GTM_TOM0_CH2_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108120u)	/* TOM0 Channel 2 Interrupt Enable Register */
#define GTM_TOM0_CH3_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108160u)	/* TOM0 Channel 3 Interrupt Enable Register */
#define GTM_TOM0_CH4_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01081a0u)	/* TOM0 Channel 4 Interrupt Enable Register */
#define GTM_TOM0_CH5_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01081e0u)	/* TOM0 Channel 5 Interrupt Enable Register */
#define GTM_TOM0_CH6_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108220u)	/* TOM0 Channel 6 Interrupt Enable Register */
#define GTM_TOM0_CH7_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108260u)	/* TOM0 Channel 7 Interrupt Enable Register */
#define GTM_TOM0_CH8_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01082a0u)	/* TOM0 Channel 8 Interrupt Enable Register */
#define GTM_TOM0_CH9_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01082e0u)	/* TOM0 Channel 9 Interrupt Enable Register */
#define GTM_TOM1_CH0_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01088a0u)	/* TOM1 Channel 0 Interrupt Enable Register */
#define GTM_TOM1_CH10_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108b20u)	/* TOM1 Channel 10 Interrupt Enable Register */
#define GTM_TOM1_CH11_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108b60u)	/* TOM1 Channel 11 Interrupt Enable Register */
#define GTM_TOM1_CH12_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108ba0u)	/* TOM1 Channel 12 Interrupt Enable Register */
#define GTM_TOM1_CH13_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108be0u)	/* TOM1 Channel 13 Interrupt Enable Register */
#define GTM_TOM1_CH14_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108c20u)	/* TOM1 Channel 14 Interrupt Enable Register */
#define GTM_TOM1_CH15_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108c60u)	/* TOM1 Channel 15 Interrupt Enable Register */
#define GTM_TOM1_CH1_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01088e0u)	/* TOM1 Channel 1 Interrupt Enable Register */
#define GTM_TOM1_CH2_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108920u)	/* TOM1 Channel 2 Interrupt Enable Register */
#define GTM_TOM1_CH3_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108960u)	/* TOM1 Channel 3 Interrupt Enable Register */
#define GTM_TOM1_CH4_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01089a0u)	/* TOM1 Channel 4 Interrupt Enable Register */
#define GTM_TOM1_CH5_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01089e0u)	/* TOM1 Channel 5 Interrupt Enable Register */
#define GTM_TOM1_CH6_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108a20u)	/* TOM1 Channel 6 Interrupt Enable Register */
#define GTM_TOM1_CH7_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108a60u)	/* TOM1 Channel 7 Interrupt Enable Register */
#define GTM_TOM1_CH8_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108aa0u)	/* TOM1 Channel 8 Interrupt Enable Register */
#define GTM_TOM1_CH9_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0108ae0u)	/* TOM1 Channel 9 Interrupt Enable Register */
#define GTM_TOM2_CH0_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01090a0u)	/* TOM2 Channel 0 Interrupt Enable Register */
#define GTM_TOM2_CH10_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109320u)	/* TOM2 Channel 10 Interrupt Enable Register */
#define GTM_TOM2_CH11_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109360u)	/* TOM2 Channel 11 Interrupt Enable Register */
#define GTM_TOM2_CH12_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01093a0u)	/* TOM2 Channel 12 Interrupt Enable Register */
#define GTM_TOM2_CH13_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01093e0u)	/* TOM2 Channel 13 Interrupt Enable Register */
#define GTM_TOM2_CH14_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109420u)	/* TOM2 Channel 14 Interrupt Enable Register */
#define GTM_TOM2_CH15_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109460u)	/* TOM2 Channel 15 Interrupt Enable Register */
#define GTM_TOM2_CH1_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01090e0u)	/* TOM2 Channel 1 Interrupt Enable Register */
#define GTM_TOM2_CH2_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109120u)	/* TOM2 Channel 2 Interrupt Enable Register */
#define GTM_TOM2_CH3_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109160u)	/* TOM2 Channel 3 Interrupt Enable Register */
#define GTM_TOM2_CH4_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01091a0u)	/* TOM2 Channel 4 Interrupt Enable Register */
#define GTM_TOM2_CH5_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01091e0u)	/* TOM2 Channel 5 Interrupt Enable Register */
#define GTM_TOM2_CH6_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109220u)	/* TOM2 Channel 6 Interrupt Enable Register */
#define GTM_TOM2_CH7_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf0109260u)	/* TOM2 Channel 7 Interrupt Enable Register */
#define GTM_TOM2_CH8_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01092a0u)	/* TOM2 Channel 8 Interrupt Enable Register */
#define GTM_TOM2_CH9_IRQ_EN	(*( GTM_TOM0_CH0_IRQ_EN_type *) 0xf01092e0u)	/* TOM2 Channel 9 Interrupt Enable Register */

