svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TRG_CCU0TC0    : 1;	/* Trigger TOM_CCU0TC0_IRQ interrupt by software */
		unsigned int TRG_CCU1TC0    : 1;	/* Trigger TOM_CCU1TC0_IRQ interrupt by software */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_IRQ_FORCINT_type;
#define GTM_TOM0_CH0_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01080a4u)	/* TOM0 Channel 0 Software Interrupt Generation Register */
#define GTM_TOM0_CH10_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108324u)	/* TOM0 Channel 10 Software Interrupt Generation Register */
#define GTM_TOM0_CH11_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108364u)	/* TOM0 Channel 11 Software Interrupt Generation Register */
#define GTM_TOM0_CH12_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01083a4u)	/* TOM0 Channel 12 Software Interrupt Generation Register */
#define GTM_TOM0_CH13_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01083e4u)	/* TOM0 Channel 13 Software Interrupt Generation Register */
#define GTM_TOM0_CH14_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108424u)	/* TOM0 Channel 14 Software Interrupt Generation Register */
#define GTM_TOM0_CH15_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108464u)	/* TOM0 Channel 15 Software Interrupt Generation Register */
#define GTM_TOM0_CH1_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01080e4u)	/* TOM0 Channel 1 Software Interrupt Generation Register */
#define GTM_TOM0_CH2_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108124u)	/* TOM0 Channel 2 Software Interrupt Generation Register */
#define GTM_TOM0_CH3_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108164u)	/* TOM0 Channel 3 Software Interrupt Generation Register */
#define GTM_TOM0_CH4_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01081a4u)	/* TOM0 Channel 4 Software Interrupt Generation Register */
#define GTM_TOM0_CH5_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01081e4u)	/* TOM0 Channel 5 Software Interrupt Generation Register */
#define GTM_TOM0_CH6_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108224u)	/* TOM0 Channel 6 Software Interrupt Generation Register */
#define GTM_TOM0_CH7_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108264u)	/* TOM0 Channel 7 Software Interrupt Generation Register */
#define GTM_TOM0_CH8_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01082a4u)	/* TOM0 Channel 8 Software Interrupt Generation Register */
#define GTM_TOM0_CH9_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01082e4u)	/* TOM0 Channel 9 Software Interrupt Generation Register */
#define GTM_TOM1_CH0_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01088a4u)	/* TOM1 Channel 0 Software Interrupt Generation Register */
#define GTM_TOM1_CH10_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108b24u)	/* TOM1 Channel 10 Software Interrupt Generation Register */
#define GTM_TOM1_CH11_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108b64u)	/* TOM1 Channel 11 Software Interrupt Generation Register */
#define GTM_TOM1_CH12_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108ba4u)	/* TOM1 Channel 12 Software Interrupt Generation Register */
#define GTM_TOM1_CH13_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108be4u)	/* TOM1 Channel 13 Software Interrupt Generation Register */
#define GTM_TOM1_CH14_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108c24u)	/* TOM1 Channel 14 Software Interrupt Generation Register */
#define GTM_TOM1_CH15_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108c64u)	/* TOM1 Channel 15 Software Interrupt Generation Register */
#define GTM_TOM1_CH1_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01088e4u)	/* TOM1 Channel 1 Software Interrupt Generation Register */
#define GTM_TOM1_CH2_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108924u)	/* TOM1 Channel 2 Software Interrupt Generation Register */
#define GTM_TOM1_CH3_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108964u)	/* TOM1 Channel 3 Software Interrupt Generation Register */
#define GTM_TOM1_CH4_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01089a4u)	/* TOM1 Channel 4 Software Interrupt Generation Register */
#define GTM_TOM1_CH5_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01089e4u)	/* TOM1 Channel 5 Software Interrupt Generation Register */
#define GTM_TOM1_CH6_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108a24u)	/* TOM1 Channel 6 Software Interrupt Generation Register */
#define GTM_TOM1_CH7_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108a64u)	/* TOM1 Channel 7 Software Interrupt Generation Register */
#define GTM_TOM1_CH8_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108aa4u)	/* TOM1 Channel 8 Software Interrupt Generation Register */
#define GTM_TOM1_CH9_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0108ae4u)	/* TOM1 Channel 9 Software Interrupt Generation Register */
#define GTM_TOM2_CH0_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01090a4u)	/* TOM2 Channel 0 Software Interrupt Generation Register */
#define GTM_TOM2_CH10_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109324u)	/* TOM2 Channel 10 Software Interrupt Generation Register */
#define GTM_TOM2_CH11_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109364u)	/* TOM2 Channel 11 Software Interrupt Generation Register */
#define GTM_TOM2_CH12_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01093a4u)	/* TOM2 Channel 12 Software Interrupt Generation Register */
#define GTM_TOM2_CH13_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01093e4u)	/* TOM2 Channel 13 Software Interrupt Generation Register */
#define GTM_TOM2_CH14_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109424u)	/* TOM2 Channel 14 Software Interrupt Generation Register */
#define GTM_TOM2_CH15_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109464u)	/* TOM2 Channel 15 Software Interrupt Generation Register */
#define GTM_TOM2_CH1_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01090e4u)	/* TOM2 Channel 1 Software Interrupt Generation Register */
#define GTM_TOM2_CH2_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109124u)	/* TOM2 Channel 2 Software Interrupt Generation Register */
#define GTM_TOM2_CH3_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109164u)	/* TOM2 Channel 3 Software Interrupt Generation Register */
#define GTM_TOM2_CH4_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01091a4u)	/* TOM2 Channel 4 Software Interrupt Generation Register */
#define GTM_TOM2_CH5_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01091e4u)	/* TOM2 Channel 5 Software Interrupt Generation Register */
#define GTM_TOM2_CH6_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109224u)	/* TOM2 Channel 6 Software Interrupt Generation Register */
#define GTM_TOM2_CH7_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf0109264u)	/* TOM2 Channel 7 Software Interrupt Generation Register */
#define GTM_TOM2_CH8_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01092a4u)	/* TOM2 Channel 8 Software Interrupt Generation Register */
#define GTM_TOM2_CH9_IRQ_FORCINT	(*( GTM_TOM0_CH0_IRQ_FORCINT_type *) 0xf01092e4u)	/* TOM2 Channel 9 Software Interrupt Generation Register */

