svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CCU0TC         : 1;	/* CCU0 Trigger condition interrupt for channel x */
		unsigned int CCU1TC         : 1;	/* CCU1 Trigger condition interrupt for channel x */
		/* const */ unsigned int Reserved       : 30;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_IRQ_NOTIFY_type;
#define GTM_TOM0_CH0_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010809cu)	/* TOM0 Channel 0 Interrupt Notification Register */
#define GTM_TOM0_CH10_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010831cu)	/* TOM0 Channel 10 Interrupt Notification Register */
#define GTM_TOM0_CH11_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010835cu)	/* TOM0 Channel 11 Interrupt Notification Register */
#define GTM_TOM0_CH12_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010839cu)	/* TOM0 Channel 12 Interrupt Notification Register */
#define GTM_TOM0_CH13_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01083dcu)	/* TOM0 Channel 13 Interrupt Notification Register */
#define GTM_TOM0_CH14_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010841cu)	/* TOM0 Channel 14 Interrupt Notification Register */
#define GTM_TOM0_CH15_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010845cu)	/* TOM0 Channel 15 Interrupt Notification Register */
#define GTM_TOM0_CH1_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01080dcu)	/* TOM0 Channel 1 Interrupt Notification Register */
#define GTM_TOM0_CH2_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010811cu)	/* TOM0 Channel 2 Interrupt Notification Register */
#define GTM_TOM0_CH3_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010815cu)	/* TOM0 Channel 3 Interrupt Notification Register */
#define GTM_TOM0_CH4_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010819cu)	/* TOM0 Channel 4 Interrupt Notification Register */
#define GTM_TOM0_CH5_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01081dcu)	/* TOM0 Channel 5 Interrupt Notification Register */
#define GTM_TOM0_CH6_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010821cu)	/* TOM0 Channel 6 Interrupt Notification Register */
#define GTM_TOM0_CH7_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010825cu)	/* TOM0 Channel 7 Interrupt Notification Register */
#define GTM_TOM0_CH8_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010829cu)	/* TOM0 Channel 8 Interrupt Notification Register */
#define GTM_TOM0_CH9_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01082dcu)	/* TOM0 Channel 9 Interrupt Notification Register */
#define GTM_TOM1_CH0_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010889cu)	/* TOM1 Channel 0 Interrupt Notification Register */
#define GTM_TOM1_CH10_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108b1cu)	/* TOM1 Channel 10 Interrupt Notification Register */
#define GTM_TOM1_CH11_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108b5cu)	/* TOM1 Channel 11 Interrupt Notification Register */
#define GTM_TOM1_CH12_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108b9cu)	/* TOM1 Channel 12 Interrupt Notification Register */
#define GTM_TOM1_CH13_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108bdcu)	/* TOM1 Channel 13 Interrupt Notification Register */
#define GTM_TOM1_CH14_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108c1cu)	/* TOM1 Channel 14 Interrupt Notification Register */
#define GTM_TOM1_CH15_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108c5cu)	/* TOM1 Channel 15 Interrupt Notification Register */
#define GTM_TOM1_CH1_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01088dcu)	/* TOM1 Channel 1 Interrupt Notification Register */
#define GTM_TOM1_CH2_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010891cu)	/* TOM1 Channel 2 Interrupt Notification Register */
#define GTM_TOM1_CH3_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010895cu)	/* TOM1 Channel 3 Interrupt Notification Register */
#define GTM_TOM1_CH4_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010899cu)	/* TOM1 Channel 4 Interrupt Notification Register */
#define GTM_TOM1_CH5_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01089dcu)	/* TOM1 Channel 5 Interrupt Notification Register */
#define GTM_TOM1_CH6_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108a1cu)	/* TOM1 Channel 6 Interrupt Notification Register */
#define GTM_TOM1_CH7_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108a5cu)	/* TOM1 Channel 7 Interrupt Notification Register */
#define GTM_TOM1_CH8_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108a9cu)	/* TOM1 Channel 8 Interrupt Notification Register */
#define GTM_TOM1_CH9_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf0108adcu)	/* TOM1 Channel 9 Interrupt Notification Register */
#define GTM_TOM2_CH0_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010909cu)	/* TOM2 Channel 0 Interrupt Notification Register */
#define GTM_TOM2_CH10_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010931cu)	/* TOM2 Channel 10 Interrupt Notification Register */
#define GTM_TOM2_CH11_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010935cu)	/* TOM2 Channel 11 Interrupt Notification Register */
#define GTM_TOM2_CH12_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010939cu)	/* TOM2 Channel 12 Interrupt Notification Register */
#define GTM_TOM2_CH13_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01093dcu)	/* TOM2 Channel 13 Interrupt Notification Register */
#define GTM_TOM2_CH14_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010941cu)	/* TOM2 Channel 14 Interrupt Notification Register */
#define GTM_TOM2_CH15_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010945cu)	/* TOM2 Channel 15 Interrupt Notification Register */
#define GTM_TOM2_CH1_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01090dcu)	/* TOM2 Channel 1 Interrupt Notification Register */
#define GTM_TOM2_CH2_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010911cu)	/* TOM2 Channel 2 Interrupt Notification Register */
#define GTM_TOM2_CH3_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010915cu)	/* TOM2 Channel 3 Interrupt Notification Register */
#define GTM_TOM2_CH4_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010919cu)	/* TOM2 Channel 4 Interrupt Notification Register */
#define GTM_TOM2_CH5_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01091dcu)	/* TOM2 Channel 5 Interrupt Notification Register */
#define GTM_TOM2_CH6_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010921cu)	/* TOM2 Channel 6 Interrupt Notification Register */
#define GTM_TOM2_CH7_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010925cu)	/* TOM2 Channel 7 Interrupt Notification Register */
#define GTM_TOM2_CH8_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf010929cu)	/* TOM2 Channel 8 Interrupt Notification Register */
#define GTM_TOM2_CH9_IRQ_NOTIFY	(*( GTM_TOM0_CH0_IRQ_NOTIFY_type *) 0xf01092dcu)	/* TOM2 Channel 9 Interrupt Notification Register */

