svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SR0            : 16;	/* TOM channel x shadow register SR0 for update of compare register CM0 */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_SR0_type;
#define GTM_TOM0_CH0_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010808cu)	/* TOM0 Channel 0 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH10_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010830cu)	/* TOM0 Channel 10 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH11_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010834cu)	/* TOM0 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH12_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010838cu)	/* TOM0 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH13_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01083ccu)	/* TOM0 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH14_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010840cu)	/* TOM0 Channel 14 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH15_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010844cu)	/* TOM0 Channel 15 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH1_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01080ccu)	/* TOM0 Channel 1 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH2_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010810cu)	/* TOM0 Channel 2 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH3_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010814cu)	/* TOM0 Channel 3 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH4_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010818cu)	/* TOM0 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH5_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01081ccu)	/* TOM0 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH6_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010820cu)	/* TOM0 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH7_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010824cu)	/* TOM0 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH8_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010828cu)	/* TOM0 Channel 8 CCU0 Compare Shadow Register */
#define GTM_TOM0_CH9_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01082ccu)	/* TOM0 Channel 9 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH0_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010888cu)	/* TOM1 Channel 0 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH10_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108b0cu)	/* TOM1 Channel 10 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH11_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108b4cu)	/* TOM1 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH12_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108b8cu)	/* TOM1 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH13_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108bccu)	/* TOM1 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH14_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108c0cu)	/* TOM1 Channel 14 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH15_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108c4cu)	/* TOM1 Channel 15 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH1_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01088ccu)	/* TOM1 Channel 1 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH2_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010890cu)	/* TOM1 Channel 2 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH3_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010894cu)	/* TOM1 Channel 3 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH4_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010898cu)	/* TOM1 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH5_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01089ccu)	/* TOM1 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH6_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108a0cu)	/* TOM1 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH7_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108a4cu)	/* TOM1 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH8_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108a8cu)	/* TOM1 Channel 8 CCU0 Compare Shadow Register */
#define GTM_TOM1_CH9_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf0108accu)	/* TOM1 Channel 9 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH0_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010908cu)	/* TOM2 Channel 0 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH10_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010930cu)	/* TOM2 Channel 10 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH11_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010934cu)	/* TOM2 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH12_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010938cu)	/* TOM2 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH13_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01093ccu)	/* TOM2 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH14_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010940cu)	/* TOM2 Channel 14 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH15_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010944cu)	/* TOM2 Channel 15 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH1_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01090ccu)	/* TOM2 Channel 1 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH2_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010910cu)	/* TOM2 Channel 2 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH3_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010914cu)	/* TOM2 Channel 3 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH4_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010918cu)	/* TOM2 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH5_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01091ccu)	/* TOM2 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH6_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010920cu)	/* TOM2 Channel 6 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH7_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010924cu)	/* TOM2 Channel 7 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH8_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf010928cu)	/* TOM2 Channel 8 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH9_SR0	(*( GTM_TOM0_CH0_SR0_type *) 0xf01092ccu)	/* TOM2 Channel 9 CCU0 Compare Shadow Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SR1            : 16;	/* TOM channel x shadow register SR1 for update of compare register CM1 */
		/* const */ unsigned int Reserved       : 16;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_SR1_type;
#define GTM_TOM0_CH0_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108094u)	/* TOM0 Channel 0 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH10_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108314u)	/* TOM0 Channel 10 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH11_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108354u)	/* TOM0 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH12_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108394u)	/* TOM0 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH13_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01083d4u)	/* TOM0 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH14_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108414u)	/* TOM0 Channel 14 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH15_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108454u)	/* TOM0 Channel 15 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH1_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01080d4u)	/* TOM0 Channel 1 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH2_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108114u)	/* TOM0 Channel 2 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH3_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108154u)	/* TOM0 Channel 3 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH4_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108194u)	/* TOM0 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH5_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01081d4u)	/* TOM0 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH6_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108214u)	/* TOM0 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH7_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108254u)	/* TOM0 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH8_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108294u)	/* TOM0 Channel 8 CCU1 Compare Shadow Register */
#define GTM_TOM0_CH9_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01082d4u)	/* TOM0 Channel 9 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH0_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108894u)	/* TOM1 Channel 0 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH10_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108b14u)	/* TOM1 Channel 10 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH11_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108b54u)	/* TOM1 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH12_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108b94u)	/* TOM1 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH13_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108bd4u)	/* TOM1 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH14_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108c14u)	/* TOM1 Channel 14 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH15_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108c54u)	/* TOM1 Channel 15 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH1_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01088d4u)	/* TOM1 Channel 1 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH2_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108914u)	/* TOM1 Channel 2 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH3_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108954u)	/* TOM1 Channel 3 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH4_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108994u)	/* TOM1 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH5_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01089d4u)	/* TOM1 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH6_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108a14u)	/* TOM1 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH7_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108a54u)	/* TOM1 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH8_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108a94u)	/* TOM1 Channel 8 CCU1 Compare Shadow Register */
#define GTM_TOM1_CH9_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0108ad4u)	/* TOM1 Channel 9 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH0_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109094u)	/* TOM2 Channel 0 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH10_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109314u)	/* TOM2 Channel 10 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH11_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109354u)	/* TOM2 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH12_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109394u)	/* TOM2 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH13_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01093d4u)	/* TOM2 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH14_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109414u)	/* TOM2 Channel 14 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH15_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109454u)	/* TOM2 Channel 15 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH1_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01090d4u)	/* TOM2 Channel 1 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH2_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109114u)	/* TOM2 Channel 2 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH3_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109154u)	/* TOM2 Channel 3 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH4_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109194u)	/* TOM2 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH5_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01091d4u)	/* TOM2 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH6_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109214u)	/* TOM2 Channel 6 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH7_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109254u)	/* TOM2 Channel 7 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH8_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf0109294u)	/* TOM2 Channel 8 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH9_SR1	(*( GTM_TOM0_CH0_SR1_type *) 0xf01092d4u)	/* TOM2 Channel 9 CCU1 Compare Shadow Register */

