svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int OL             : 1;	/* Output level of output TOM_OUT(x) */
		/* const */ unsigned int Reserved       : 31;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH0_STAT_type;
#define GTM_TOM0_CH0_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108098u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH10_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108318u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH11_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108358u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH12_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108398u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH13_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01083d8u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH14_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108418u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH15_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108458u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH1_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01080d8u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH2_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108118u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH3_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108158u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH4_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108198u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH5_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01081d8u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH6_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108218u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH7_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108258u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH8_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108298u)	/* TOM0 Channel Status Register */
#define GTM_TOM0_CH9_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01082d8u)	/* TOM0 Channel Status Register */
#define GTM_TOM1_CH0_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108898u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH10_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108b18u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH11_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108b58u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH12_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108b98u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH13_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108bd8u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH14_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108c18u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH15_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108c58u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH1_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01088d8u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH2_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108918u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH3_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108958u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH4_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108998u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH5_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01089d8u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH6_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108a18u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH7_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108a58u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH8_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108a98u)	/* TOM1 Channel Status Register */
#define GTM_TOM1_CH9_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0108ad8u)	/* TOM1 Channel Status Register */
#define GTM_TOM2_CH0_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109098u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH10_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109318u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH11_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109358u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH12_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109398u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH13_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01093d8u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH14_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109418u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH15_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109458u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH1_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01090d8u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH2_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109118u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH3_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109158u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH4_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109198u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH5_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01091d8u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH6_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109218u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH7_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109258u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH8_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf0109298u)	/* TOM2 Channel Status Register */
#define GTM_TOM2_CH9_STAT	(*( GTM_TOM0_CH0_STAT_type *) 0xf01092d8u)	/* TOM2 Channel Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 11;	/* Reserved */
		unsigned int SL             : 1;	/* Signal level for duty cycle */
		unsigned int CLK_SRC_SR     : 3;	/* Clock source select for channel */
		/* const */ unsigned int Reserved_4     : 5;	/* Reserved */
		unsigned int RST_CCU0       : 1;	/* Reset source of CCU0 */
		/* const */ unsigned int Reserved_6     : 3;	/* Reserved */
		unsigned int TRIGOUT        : 1;	/* Trigger output selection (output signal TRIG_15) of module TOM_CH15 */
		/* const */ unsigned int Reserved_8     : 1;	/* Reserved */
		unsigned int OSM            : 1;	/* One-shot mode */
		unsigned int BITREV         : 1;	/* Bit-reversing of output of counter register CN0 */
		/* const */ unsigned int Reserved_11    : 4;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_CH15_CTRL_type;
