svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define GTM_TOM0_CH15_CTRL	(*( GTM_TOM0_CH15_CTRL_type *) 0xf0108440u)	/* TOM0 Channel 15 Control Register */
#define GTM_TOM1_CH15_CTRL	(*( GTM_TOM0_CH15_CTRL_type *) 0xf0108c40u)	/* TOM1 Channel 15 Control Register */
#define GTM_TOM2_CH15_CTRL	(*( GTM_TOM0_CH15_CTRL_type *) 0xf0109440u)	/* TOM2 Channel 15 Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HOST_TRIG      : 1;	/* Trigger request signal (see TGC0, TGC1) to update the register ENDIS_STAT and OUTEN_STAT */
		/* const */ unsigned int Reserved       : 7;	/* Reserved */
		unsigned int RST_CH0        : 1;	/* Software reset of channel 0 */
		unsigned int RST_CH1        : 1;	/* Software reset of channel 1 */
		unsigned int RST_CH2        : 1;	/* Software reset of channel 2 */
		unsigned int RST_CH3        : 1;	/* Software reset of channel 3 */
		unsigned int RST_CH4        : 1;	/* Software reset of channel 4 */
		unsigned int RST_CH5        : 1;	/* Software reset of channel 5 */
		unsigned int RST_CH6        : 1;	/* Software reset of channel 6 */
		unsigned int RST_CH7        : 1;	/* Software reset of channel 7 */
		unsigned int UPEN_CTRL0     : 2;	/* TOM channel 0 enable update of register CM0, CM1 and CLK_SRC_STAT from SR0, SR1 and CLK_SRC */
		unsigned int UPEN_CTRL1     : 2;	/* TOM channel 1 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL2     : 2;	/* TOM channel 2 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL3     : 2;	/* TOM channel 3 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL4     : 2;	/* TOM channel 4 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL5     : 2;	/* TOM channel 5 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL6     : 2;	/* TOM channel 6 enable update of register CM0, CM1 and CLK_SRC_STAT */
		unsigned int UPEN_CTRL7     : 2;	/* TOM channel 7 enable update of register CM0, CM1 and CLK_SRC_STAT */
	} B;
	int I;
	unsigned int U;

} GTM_TOM0_TGC0_GLB_CTRL_type;
#define GTM_TOM0_TGC0_GLB_CTRL	(*( GTM_TOM0_TGC0_GLB_CTRL_type *) 0xf0108000u)	/* TOM0 TGC0 Global Control Register */
#define GTM_TOM0_TGC1_GLB_CTRL	(*( GTM_TOM0_TGC0_GLB_CTRL_type *) 0xf0108040u)	/* TOM0 TGC1 Global Control Register */
#define GTM_TOM1_TGC0_GLB_CTRL	(*( GTM_TOM0_TGC0_GLB_CTRL_type *) 0xf0108800u)	/* TOM1 TGC0 Global Control Register */
#define GTM_TOM1_TGC1_GLB_CTRL	(*( GTM_TOM0_TGC0_GLB_CTRL_type *) 0xf0108840u)	/* TOM1 TGC1 Global Control Register */
#define GTM_TOM2_TGC0_GLB_CTRL	(*( GTM_TOM0_TGC0_GLB_CTRL_type *) 0xf0109000u)	/* TOM2 TGC0 Global Control Register */
#define GTM_TOM2_TGC1_GLB_CTRL	(*( GTM_TOM0_TGC0_GLB_CTRL_type *) 0xf0109040u)	/* TOM2 TGC1 Global Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEL0           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL1           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL2           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL3           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL4           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL5           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL6           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL7           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL8           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL9           : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL10          : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL11          : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL12          : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL13          : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL14          : 2;	/* TOUT(n*16+x) Output Selection */
		unsigned int SEL15          : 2;	/* TOUT(n*16+x) Output Selection */
	} B;
	int I;
	unsigned int U;

} GTM_TOUTSEL0_type;
#define GTM_TOUTSEL0	(*( GTM_TOUTSEL0_type *) 0xf019fd30u)	/* Timer Output Select Register */
#define GTM_TOUTSEL1	(*( GTM_TOUTSEL0_type *) 0xf019fd34u)	/* Timer Output Select Register */
#define GTM_TOUTSEL10	(*( GTM_TOUTSEL0_type *) 0xf019fd58u)	/* Timer Output Select Register */
#define GTM_TOUTSEL11	(*( GTM_TOUTSEL0_type *) 0xf019fd5cu)	/* Timer Output Select Register */
#define GTM_TOUTSEL12	(*( GTM_TOUTSEL0_type *) 0xf019fd60u)	/* Timer Output Select Register */
#define GTM_TOUTSEL13	(*( GTM_TOUTSEL0_type *) 0xf019fd64u)	/* Timer Output Select Register */
#define GTM_TOUTSEL14	(*( GTM_TOUTSEL0_type *) 0xf019fd68u)	/* Timer Output Select Register */
#define GTM_TOUTSEL2	(*( GTM_TOUTSEL0_type *) 0xf019fd38u)	/* Timer Output Select Register */
#define GTM_TOUTSEL3	(*( GTM_TOUTSEL0_type *) 0xf019fd3cu)	/* Timer Output Select Register */
#define GTM_TOUTSEL4	(*( GTM_TOUTSEL0_type *) 0xf019fd40u)	/* Timer Output Select Register */
#define GTM_TOUTSEL5	(*( GTM_TOUTSEL0_type *) 0xf019fd44u)	/* Timer Output Select Register */
#define GTM_TOUTSEL6	(*( GTM_TOUTSEL0_type *) 0xf019fd48u)	/* Timer Output Select Register */
#define GTM_TOUTSEL7	(*( GTM_TOUTSEL0_type *) 0xf019fd4cu)	/* Timer Output Select Register */
#define GTM_TOUTSEL8	(*( GTM_TOUTSEL0_type *) 0xf019fd50u)	/* Timer Output Select Register */
#define GTM_TOUTSEL9	(*( GTM_TOUTSEL0_type *) 0xf019fd54u)	/* Timer Output Select Register */


/* VADC */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID x */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID x */
	} B;
	int I;
	unsigned int U;

} VADC_ACCEN0_type;
