svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define VADC_ACCEN0	(*( VADC_ACCEN0_type *) 0xf002003cu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int APC0           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC1           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC2           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC3           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC4           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC5           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC6           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC7           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC8           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC9           : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC10          : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC11          : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC12          : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC13          : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APC14          : 1;	/* Access Protection Channel Control, Group 0 - 14 */
		unsigned int APEM           : 1;	/* Access Protection External Multiplexer */
		unsigned int API0           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API1           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API2           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API3           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API4           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API5           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API6           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API7           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API8           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API9           : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API10          : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API11          : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API12          : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API13          : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int API14          : 1;	/* Access Protection Initialization, Group 0 - 14 */
		unsigned int APGC           : 1;	/* Access Protection Global Configuration */
	} B;
	int I;
	unsigned int U;

} VADC_ACCPROT0_type;
#define VADC_ACCPROT0	(*( VADC_ACCPROT0_type *) 0xf0020088u)	/* Access Protection Register */

typedef volatile union
{
	struct
	{ 
		unsigned int APS0           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS1           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS2           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS3           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS4           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS5           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS6           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS7           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS8           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS9           : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS10          : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS11          : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS12          : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS13          : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APS14          : 1;	/* Access Protection Service Request, Group 0 - 14 */
		unsigned int APTF           : 1;	/* Access Protection Test Function */
		unsigned int APR0           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR1           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR2           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR3           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR4           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR5           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR6           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR7           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR8           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR9           : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR10          : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR11          : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR12          : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR13          : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int APR14          : 1;	/* Access Protection Result Registers, Group 0 - 14 */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

