svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} VADC_ACCPROT1_type;
#define VADC_ACCPROT1	(*( VADC_ACCPROT1_type *) 0xf002008cu)	/* Access Protection Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SRCRESREG      : 4;	/* Source-specific Result Register */
		unsigned int                : 4;
		unsigned int XTSEL          : 4;	/* External Trigger Input Selection */
		/* const */ unsigned int XTLVL          : 1;	/* External Trigger Level */
		unsigned int XTMODE         : 2;	/* Trigger Operating Mode */
		unsigned int XTWC           : 1;	/* Write Control for Trigger Configuration */
		unsigned int GTSEL          : 4;	/* Gate Input Selection */
		/* const */ unsigned int GTLVL          : 1;	/* Gate Input Level */
		unsigned int                : 2;
		unsigned int GTWC           : 1;	/* Write Control for Gate Configuration */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} VADC_BRSCTRL_type;
#define VADC_BRSCTRL	(*( VADC_BRSCTRL_type *) 0xf0020200u)	/* Background Request Source Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ENGT           : 2;	/* Enable Gate */
		unsigned int ENTR           : 1;	/* Enable External Trigger */
		unsigned int ENSI           : 1;	/* Enable Source Interrupt */
		unsigned int SCAN           : 1;	/* Autoscan Enable */
		unsigned int LDM            : 1;	/* Autoscan Source Load Event Mode */
		unsigned int                : 1;
		/* const */ unsigned int REQGT          : 1;	/* Request Gate Level */
		unsigned int CLRPND         : 1;	/* Clear Pending Bits */
		unsigned int LDEV           : 1;	/* Generate Load Event */
		unsigned int                : 6;
		unsigned int RPTDIS         : 1;	/* Repeat Disable */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} VADC_BRSMR_type;
#define VADC_BRSMR	(*( VADC_BRSMR_type *) 0xf0020204u)	/* Background Request Source Mode Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CHPNDGy        : 32;	/* Channels Pending Group x */
	} B;
	int I;
	unsigned int U;

} VADC_BRSPND0_type;
#define VADC_BRSPND0	(*( VADC_BRSPND0_type *) 0xf00201c0u)	/* Background Request Source Pending Register, Group 0 */
#define VADC_BRSPND1	(*( VADC_BRSPND0_type *) 0xf00201c4u)	/* Background Request Source Pending Register, Group 1 */
#define VADC_BRSPND2	(*( VADC_BRSPND0_type *) 0xf00201c8u)	/* Background Request Source Pending Register, Group 2 */
#define VADC_BRSPND3	(*( VADC_BRSPND0_type *) 0xf00201ccu)	/* Background Request Source Pending Register, Group 3 */
#define VADC_BRSPND4	(*( VADC_BRSPND0_type *) 0xf00201d0u)	/* Background Request Source Pending Register, Group 4 */
#define VADC_BRSPND5	(*( VADC_BRSPND0_type *) 0xf00201d4u)	/* Background Request Source Pending Register, Group 5 */
#define VADC_BRSPND6	(*( VADC_BRSPND0_type *) 0xf00201d8u)	/* Background Request Source Pending Register, Group 6 */
#define VADC_BRSPND7	(*( VADC_BRSPND0_type *) 0xf00201dcu)	/* Background Request Source Pending Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int CHSELGy        : 32;	/* Channel Selection Group x */
	} B;
	int I;
	unsigned int U;

} VADC_BRSSEL0_type;
#define VADC_BRSSEL0	(*( VADC_BRSSEL0_type *) 0xf0020180u)	/* Background Request Source Channel Select Register, Group 0 */
#define VADC_BRSSEL1	(*( VADC_BRSSEL0_type *) 0xf0020184u)	/* Background Request Source Channel Select Register, Group 1 */
#define VADC_BRSSEL2	(*( VADC_BRSSEL0_type *) 0xf0020188u)	/* Background Request Source Channel Select Register, Group 2 */
#define VADC_BRSSEL3	(*( VADC_BRSSEL0_type *) 0xf002018cu)	/* Background Request Source Channel Select Register, Group 3 */
#define VADC_BRSSEL4	(*( VADC_BRSSEL0_type *) 0xf0020190u)	/* Background Request Source Channel Select Register, Group 4 */
#define VADC_BRSSEL5	(*( VADC_BRSSEL0_type *) 0xf0020194u)	/* Background Request Source Channel Select Register, Group 5 */
#define VADC_BRSSEL6	(*( VADC_BRSSEL0_type *) 0xf0020198u)	/* Background Request Source Channel Select Register, Group 6 */
#define VADC_BRSSEL7	(*( VADC_BRSSEL0_type *) 0xf002019cu)	/* Background Request Source Channel Select Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} VADC_CLC_type;
#define VADC_CLC	(*( VADC_CLC_type *) 0xf0020000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int EMUXGRP0       : 4;	/* External Multiplexer Group for Interface x */
		unsigned int EMUXGRP1       : 4;	/* External Multiplexer Group for Interface x */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} VADC_EMUXSEL_type;
#define VADC_EMUXSEL	(*( VADC_EMUXSEL_type *) 0xf00203f0u)	/* External Multiplexer Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ALIAS0         : 5;	/* Alias Value for CH0 Conversion Requests */
		unsigned int                : 3;
		unsigned int ALIAS1         : 5;	/* Alias Value for CH1 Conversion Requests */
		unsigned int                : 19;
	} B;
	int I;
	unsigned int U;

} VADC_G0ALIAS_type;
#define VADC_G0ALIAS	(*( VADC_G0ALIAS_type *) 0xf00204b0u)	/* Alias Register, Group 0 */
#define VADC_G1ALIAS	(*( VADC_G0ALIAS_type *) 0xf00208b0u)	/* Alias Register, Group 1 */
#define VADC_G2ALIAS	(*( VADC_G0ALIAS_type *) 0xf0020cb0u)	/* Alias Register, Group 2 */
#define VADC_G3ALIAS	(*( VADC_G0ALIAS_type *) 0xf00210b0u)	/* Alias Register, Group 3 */
#define VADC_G4ALIAS	(*( VADC_G0ALIAS_type *) 0xf00214b0u)	/* Alias Register, Group 4 */
#define VADC_G5ALIAS	(*( VADC_G0ALIAS_type *) 0xf00218b0u)	/* Alias Register, Group 5 */
#define VADC_G6ALIAS	(*( VADC_G0ALIAS_type *) 0xf0021cb0u)	/* Alias Register, Group 6 */
#define VADC_G7ALIAS	(*( VADC_G0ALIAS_type *) 0xf00220b0u)	/* Alias Register, Group 7 */

