svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ANONC          : 2;	/* Analog Converter Control */
		unsigned int                : 2;
		unsigned int ARBRND         : 2;	/* Arbitration Round Length */
		unsigned int                : 1;
		unsigned int ARBM           : 1;	/* Arbitration Mode */
		unsigned int                : 8;
		/* const */ unsigned int ANONS          : 2;	/* Analog Converter Control Status */
		unsigned int                : 10;
		/* const */ unsigned int CAL            : 1;	/* Start-Up Calibration Active Indication */
		unsigned int                : 1;
		/* const */ unsigned int BUSY           : 1;	/* Converter Busy Flag */
		/* const */ unsigned int SAMPLE         : 1;	/* Sample Phase Flag */
	} B;
	int I;
	unsigned int U;

} VADC_G0ARBCFG_type;
#define VADC_G0ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0020480u)	/* Arbitration Configuration Register, Group 0 */
#define VADC_G1ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0020880u)	/* Arbitration Configuration Register, Group 1 */
#define VADC_G2ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0020c80u)	/* Arbitration Configuration Register, Group 2 */
#define VADC_G3ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0021080u)	/* Arbitration Configuration Register, Group 3 */
#define VADC_G4ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0021480u)	/* Arbitration Configuration Register, Group 4 */
#define VADC_G5ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0021880u)	/* Arbitration Configuration Register, Group 5 */
#define VADC_G6ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0021c80u)	/* Arbitration Configuration Register, Group 6 */
#define VADC_G7ARBCFG	(*( VADC_G0ARBCFG_type *) 0xf0022080u)	/* Arbitration Configuration Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int PRIO0          : 2;	/* Priority of Request Source x */
		unsigned int                : 1;
		unsigned int CSM0           : 1;	/* Conversion Start Mode of Request Source x */
		unsigned int PRIO1          : 2;	/* Priority of Request Source x */
		unsigned int                : 1;
		unsigned int CSM1           : 1;	/* Conversion Start Mode of Request Source x */
		unsigned int PRIO2          : 2;	/* Priority of Request Source x */
		unsigned int                : 1;
		unsigned int CSM2           : 1;	/* Conversion Start Mode of Request Source x */
		unsigned int                : 12;
		unsigned int ASEN0          : 1;	/* Arbitration Slot y Enable */
		unsigned int ASEN1          : 1;	/* Arbitration Slot y Enable */
		unsigned int ASEN2          : 1;	/* Arbitration Slot y Enable */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} VADC_G0ARBPR_type;
#define VADC_G0ARBPR	(*( VADC_G0ARBPR_type *) 0xf0020484u)	/* Arbitration Priority Register, Group 0 */
#define VADC_G1ARBPR	(*( VADC_G0ARBPR_type *) 0xf0020884u)	/* Arbitration Priority Register, Group 1 */
#define VADC_G2ARBPR	(*( VADC_G0ARBPR_type *) 0xf0020c84u)	/* Arbitration Priority Register, Group 2 */
#define VADC_G3ARBPR	(*( VADC_G0ARBPR_type *) 0xf0021084u)	/* Arbitration Priority Register, Group 3 */
#define VADC_G4ARBPR	(*( VADC_G0ARBPR_type *) 0xf0021484u)	/* Arbitration Priority Register, Group 4 */
#define VADC_G5ARBPR	(*( VADC_G0ARBPR_type *) 0xf0021884u)	/* Arbitration Priority Register, Group 5 */
#define VADC_G6ARBPR	(*( VADC_G0ARBPR_type *) 0xf0021c84u)	/* Arbitration Priority Register, Group 6 */
#define VADC_G7ARBPR	(*( VADC_G0ARBPR_type *) 0xf0022084u)	/* Arbitration Priority Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int SRCRESREG      : 4;	/* Source-specific Result Register */
		unsigned int                : 4;
		unsigned int XTSEL          : 4;	/* External Trigger Input Selection */
		/* const */ unsigned int XTLVL          : 1;	/* External Trigger Level */
		unsigned int XTMODE         : 2;	/* Trigger Operating Mode */
		unsigned int XTWC           : 1;	/* Write Control for Trigger Configuration */
		unsigned int GTSEL          : 4;	/* Gate Input Selection */
		/* const */ unsigned int GTLVL          : 1;	/* Gate Input Level */
		unsigned int                : 2;
		unsigned int GTWC           : 1;	/* Write Control for Gate Configuration */
		unsigned int                : 4;
		unsigned int TMEN           : 1;	/* Timer Mode Enable */
		unsigned int                : 2;
		unsigned int TMWC           : 1;	/* Write Control for Timer Mode */
	} B;
	int I;
	unsigned int U;

} VADC_G0ASCTRL_type;
#define VADC_G0ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0020520u)	/* Autoscan Source Control Register, Group 0 */
#define VADC_G0QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0020500u)	/* Queue 0 Source Control Register, Group 0 */
#define VADC_G1ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0020920u)	/* Autoscan Source Control Register, Group 1 */
#define VADC_G1QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0020900u)	/* Queue 0 Source Control Register, Group 1 */
#define VADC_G2ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0020d20u)	/* Autoscan Source Control Register, Group 2 */
#define VADC_G2QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0020d00u)	/* Queue 0 Source Control Register, Group 2 */
#define VADC_G3ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0021120u)	/* Autoscan Source Control Register, Group 3 */
#define VADC_G3QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0021100u)	/* Queue 0 Source Control Register, Group 3 */
#define VADC_G4ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0021520u)	/* Autoscan Source Control Register, Group 4 */
#define VADC_G4QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0021500u)	/* Queue 0 Source Control Register, Group 4 */
#define VADC_G5ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0021920u)	/* Autoscan Source Control Register, Group 5 */
#define VADC_G5QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0021900u)	/* Queue 0 Source Control Register, Group 5 */
#define VADC_G6ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0021d20u)	/* Autoscan Source Control Register, Group 6 */
#define VADC_G6QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0021d00u)	/* Queue 0 Source Control Register, Group 6 */
#define VADC_G7ASCTRL	(*( VADC_G0ASCTRL_type *) 0xf0022120u)	/* Autoscan Source Control Register, Group 7 */
#define VADC_G7QCTRL0	(*( VADC_G0ASCTRL_type *) 0xf0022100u)	/* Queue 0 Source Control Register, Group 7 */

