svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ENGT           : 2;	/* Enable Gate */
		unsigned int ENTR           : 1;	/* Enable External Trigger */
		unsigned int ENSI           : 1;	/* Enable Source Interrupt */
		unsigned int SCAN           : 1;	/* Autoscan Enable */
		unsigned int LDM            : 1;	/* Autoscan Source Load Event Mode */
		unsigned int                : 1;
		/* const */ unsigned int REQGT          : 1;	/* Request Gate Level */
		unsigned int CLRPND         : 1;	/* Clear Pending Bits */
		unsigned int LDEV           : 1;	/* Generate Load Event */
		unsigned int                : 6;
		unsigned int RPTDIS         : 1;	/* Repeat Disable */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} VADC_G0ASMR_type;
#define VADC_G0ASMR	(*( VADC_G0ASMR_type *) 0xf0020524u)	/* Autoscan Source Mode Register, Group 0 */
#define VADC_G1ASMR	(*( VADC_G0ASMR_type *) 0xf0020924u)	/* Autoscan Source Mode Register, Group 1 */
#define VADC_G2ASMR	(*( VADC_G0ASMR_type *) 0xf0020d24u)	/* Autoscan Source Mode Register, Group 2 */
#define VADC_G3ASMR	(*( VADC_G0ASMR_type *) 0xf0021124u)	/* Autoscan Source Mode Register, Group 3 */
#define VADC_G4ASMR	(*( VADC_G0ASMR_type *) 0xf0021524u)	/* Autoscan Source Mode Register, Group 4 */
#define VADC_G5ASMR	(*( VADC_G0ASMR_type *) 0xf0021924u)	/* Autoscan Source Mode Register, Group 5 */
#define VADC_G6ASMR	(*( VADC_G0ASMR_type *) 0xf0021d24u)	/* Autoscan Source Mode Register, Group 6 */
#define VADC_G7ASMR	(*( VADC_G0ASMR_type *) 0xf0022124u)	/* Autoscan Source Mode Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int CHPND          : 32;	/* Channels Pending */
	} B;
	int I;
	unsigned int U;

} VADC_G0ASPND_type;
#define VADC_G0ASPND	(*( VADC_G0ASPND_type *) 0xf002052cu)	/* Autoscan Source Pending Register, Group 0 */
#define VADC_G1ASPND	(*( VADC_G0ASPND_type *) 0xf002092cu)	/* Autoscan Source Pending Register, Group 1 */
#define VADC_G2ASPND	(*( VADC_G0ASPND_type *) 0xf0020d2cu)	/* Autoscan Source Pending Register, Group 2 */
#define VADC_G3ASPND	(*( VADC_G0ASPND_type *) 0xf002112cu)	/* Autoscan Source Pending Register, Group 3 */
#define VADC_G4ASPND	(*( VADC_G0ASPND_type *) 0xf002152cu)	/* Autoscan Source Pending Register, Group 4 */
#define VADC_G5ASPND	(*( VADC_G0ASPND_type *) 0xf002192cu)	/* Autoscan Source Pending Register, Group 5 */
#define VADC_G6ASPND	(*( VADC_G0ASPND_type *) 0xf0021d2cu)	/* Autoscan Source Pending Register, Group 6 */
#define VADC_G7ASPND	(*( VADC_G0ASPND_type *) 0xf002212cu)	/* Autoscan Source Pending Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int CHSEL          : 32;	/* Channel Selection */
	} B;
	int I;
	unsigned int U;

} VADC_G0ASSEL_type;
#define VADC_G0ASSEL	(*( VADC_G0ASSEL_type *) 0xf0020528u)	/* Autoscan Source Channel Select Register, Group 0 */
#define VADC_G1ASSEL	(*( VADC_G0ASSEL_type *) 0xf0020928u)	/* Autoscan Source Channel Select Register, Group 1 */
#define VADC_G2ASSEL	(*( VADC_G0ASSEL_type *) 0xf0020d28u)	/* Autoscan Source Channel Select Register, Group 2 */
#define VADC_G3ASSEL	(*( VADC_G0ASSEL_type *) 0xf0021128u)	/* Autoscan Source Channel Select Register, Group 3 */
#define VADC_G4ASSEL	(*( VADC_G0ASSEL_type *) 0xf0021528u)	/* Autoscan Source Channel Select Register, Group 4 */
#define VADC_G5ASSEL	(*( VADC_G0ASSEL_type *) 0xf0021928u)	/* Autoscan Source Channel Select Register, Group 5 */
#define VADC_G6ASSEL	(*( VADC_G0ASSEL_type *) 0xf0021d28u)	/* Autoscan Source Channel Select Register, Group 6 */
#define VADC_G7ASSEL	(*( VADC_G0ASSEL_type *) 0xf0022128u)	/* Autoscan Source Channel Select Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int BFL0           : 1;	/* Boundary Flag y */
		/* const */ unsigned int BFL1           : 1;	/* Boundary Flag y */
		/* const */ unsigned int BFL2           : 1;	/* Boundary Flag y */
		/* const */ unsigned int BFL3           : 1;	/* Boundary Flag y */
		unsigned int                : 4;
		unsigned int BFA0           : 1;	/* Boundary Flag y Activation Select */
		unsigned int BFA1           : 1;	/* Boundary Flag y Activation Select */
		unsigned int BFA2           : 1;	/* Boundary Flag y Activation Select */
		unsigned int BFA3           : 1;	/* Boundary Flag y Activation Select */
		unsigned int                : 4;
		unsigned int BFI0           : 1;	/* Boundary Flag y Inversion Control */
		unsigned int BFI1           : 1;	/* Boundary Flag y Inversion Control */
		unsigned int BFI2           : 1;	/* Boundary Flag y Inversion Control */
		unsigned int BFI3           : 1;	/* Boundary Flag y Inversion Control */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} VADC_G0BFL_type;
#define VADC_G0BFL	(*( VADC_G0BFL_type *) 0xf00204c8u)	/* Boundary Flag Register, Group 0 */
#define VADC_G1BFL	(*( VADC_G0BFL_type *) 0xf00208c8u)	/* Boundary Flag Register, Group 1 */
#define VADC_G2BFL	(*( VADC_G0BFL_type *) 0xf0020cc8u)	/* Boundary Flag Register, Group 2 */
#define VADC_G3BFL	(*( VADC_G0BFL_type *) 0xf00210c8u)	/* Boundary Flag Register, Group 3 */
#define VADC_G4BFL	(*( VADC_G0BFL_type *) 0xf00214c8u)	/* Boundary Flag Register, Group 4 */
#define VADC_G5BFL	(*( VADC_G0BFL_type *) 0xf00218c8u)	/* Boundary Flag Register, Group 5 */
#define VADC_G6BFL	(*( VADC_G0BFL_type *) 0xf0021cc8u)	/* Boundary Flag Register, Group 6 */
#define VADC_G7BFL	(*( VADC_G0BFL_type *) 0xf00220c8u)	/* Boundary Flag Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int BFM0           : 4;	/* Boundary Flag y Mode Control */
		unsigned int BFM1           : 4;	/* Boundary Flag y Mode Control */
		unsigned int BFM2           : 4;	/* Boundary Flag y Mode Control */
		unsigned int BFM3           : 4;	/* Boundary Flag y Mode Control */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} VADC_G0BFLC_type;
#define VADC_G0BFLC	(*( VADC_G0BFLC_type *) 0xf00204d0u)	/* Boundary Flag Control Register, Group 0 */
#define VADC_G1BFLC	(*( VADC_G0BFLC_type *) 0xf00208d0u)	/* Boundary Flag Control Register, Group 1 */
#define VADC_G2BFLC	(*( VADC_G0BFLC_type *) 0xf0020cd0u)	/* Boundary Flag Control Register, Group 2 */
#define VADC_G3BFLC	(*( VADC_G0BFLC_type *) 0xf00210d0u)	/* Boundary Flag Control Register, Group 3 */
#define VADC_G4BFLC	(*( VADC_G0BFLC_type *) 0xf00214d0u)	/* Boundary Flag Control Register, Group 4 */
#define VADC_G5BFLC	(*( VADC_G0BFLC_type *) 0xf00218d0u)	/* Boundary Flag Control Register, Group 5 */
#define VADC_G6BFLC	(*( VADC_G0BFLC_type *) 0xf0021cd0u)	/* Boundary Flag Control Register, Group 6 */
#define VADC_G7BFLC	(*( VADC_G0BFLC_type *) 0xf00220d0u)	/* Boundary Flag Control Register, Group 7 */

