svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int BFC0           : 1;	/* Boundary Flag y Clear */
		unsigned int BFC1           : 1;	/* Boundary Flag y Clear */
		unsigned int BFC2           : 1;	/* Boundary Flag y Clear */
		unsigned int BFC3           : 1;	/* Boundary Flag y Clear */
		unsigned int                : 12;
		unsigned int BFS0           : 1;	/* Boundary Flag y Set */
		unsigned int BFS1           : 1;	/* Boundary Flag y Set */
		unsigned int BFS2           : 1;	/* Boundary Flag y Set */
		unsigned int BFS3           : 1;	/* Boundary Flag y Set */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} VADC_G0BFLS_type;
#define VADC_G0BFLS	(*( VADC_G0BFLS_type *) 0xf00204ccu)	/* Boundary Flag Software Register, Group 0 */
#define VADC_G1BFLS	(*( VADC_G0BFLS_type *) 0xf00208ccu)	/* Boundary Flag Software Register, Group 1 */
#define VADC_G2BFLS	(*( VADC_G0BFLS_type *) 0xf0020cccu)	/* Boundary Flag Software Register, Group 2 */
#define VADC_G3BFLS	(*( VADC_G0BFLS_type *) 0xf00210ccu)	/* Boundary Flag Software Register, Group 3 */
#define VADC_G4BFLS	(*( VADC_G0BFLS_type *) 0xf00214ccu)	/* Boundary Flag Software Register, Group 4 */
#define VADC_G5BFLS	(*( VADC_G0BFLS_type *) 0xf00218ccu)	/* Boundary Flag Software Register, Group 5 */
#define VADC_G6BFLS	(*( VADC_G0BFLS_type *) 0xf0021cccu)	/* Boundary Flag Software Register, Group 6 */
#define VADC_G7BFLS	(*( VADC_G0BFLS_type *) 0xf00220ccu)	/* Boundary Flag Software Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUNDARY0      : 12;	/* Boundary Value 0 for Limit Checking */
		unsigned int                : 4;
		unsigned int BOUNDARY1      : 12;	/* Boundary Value 1 for Limit Checking */
		unsigned int                : 4;
	} B;
	int I;
	unsigned int U;

} VADC_G0BOUND_type;
#define VADC_G0BOUND	(*( VADC_G0BOUND_type *) 0xf00204b8u)	/* Boundary Select Register, Group 0 */
#define VADC_G1BOUND	(*( VADC_G0BOUND_type *) 0xf00208b8u)	/* Boundary Select Register, Group 1 */
#define VADC_G2BOUND	(*( VADC_G0BOUND_type *) 0xf0020cb8u)	/* Boundary Select Register, Group 2 */
#define VADC_G3BOUND	(*( VADC_G0BOUND_type *) 0xf00210b8u)	/* Boundary Select Register, Group 3 */
#define VADC_G4BOUND	(*( VADC_G0BOUND_type *) 0xf00214b8u)	/* Boundary Select Register, Group 4 */
#define VADC_G5BOUND	(*( VADC_G0BOUND_type *) 0xf00218b8u)	/* Boundary Select Register, Group 5 */
#define VADC_G6BOUND	(*( VADC_G0BOUND_type *) 0xf0021cb8u)	/* Boundary Select Register, Group 6 */
#define VADC_G7BOUND	(*( VADC_G0BOUND_type *) 0xf00220b8u)	/* Boundary Select Register, Group 7 */
#define VADC_GLOBBOUND	(*( VADC_G0BOUND_type *) 0xf00200b8u)	/* Global Boundary Select Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CEV0           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV1           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV2           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV3           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV4           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV5           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV6           : 1;	/* Clear Channel Event for Channel y */
		unsigned int CEV7           : 1;	/* Clear Channel Event for Channel y */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} VADC_G0CEFCLR_type;
#define VADC_G0CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0020590u)	/* Channel Event Flag Clear Register, Group 0 */
#define VADC_G1CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0020990u)	/* Channel Event Flag Clear Register, Group 1 */
#define VADC_G2CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0020d90u)	/* Channel Event Flag Clear Register, Group 2 */
#define VADC_G3CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0021190u)	/* Channel Event Flag Clear Register, Group 3 */
#define VADC_G4CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0021590u)	/* Channel Event Flag Clear Register, Group 4 */
#define VADC_G5CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0021990u)	/* Channel Event Flag Clear Register, Group 5 */
#define VADC_G6CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0021d90u)	/* Channel Event Flag Clear Register, Group 6 */
#define VADC_G7CEFCLR	(*( VADC_G0CEFCLR_type *) 0xf0022190u)	/* Channel Event Flag Clear Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int CEV0           : 1;	/* Channel Event for Channel y */
		unsigned int CEV1           : 1;	/* Channel Event for Channel y */
		unsigned int CEV2           : 1;	/* Channel Event for Channel y */
		unsigned int CEV3           : 1;	/* Channel Event for Channel y */
		unsigned int CEV4           : 1;	/* Channel Event for Channel y */
		unsigned int CEV5           : 1;	/* Channel Event for Channel y */
		unsigned int CEV6           : 1;	/* Channel Event for Channel y */
		unsigned int CEV7           : 1;	/* Channel Event for Channel y */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} VADC_G0CEFLAG_type;
#define VADC_G0CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0020580u)	/* Channel Event Flag Register, Group 0 */
#define VADC_G1CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0020980u)	/* Channel Event Flag Register, Group 1 */
#define VADC_G2CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0020d80u)	/* Channel Event Flag Register, Group 2 */
#define VADC_G3CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0021180u)	/* Channel Event Flag Register, Group 3 */
#define VADC_G4CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0021580u)	/* Channel Event Flag Register, Group 4 */
#define VADC_G5CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0021980u)	/* Channel Event Flag Register, Group 5 */
#define VADC_G6CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0021d80u)	/* Channel Event Flag Register, Group 6 */
#define VADC_G7CEFLAG	(*( VADC_G0CEFLAG_type *) 0xf0022180u)	/* Channel Event Flag Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int CEV0NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV1NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV2NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV3NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV4NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV5NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV6NP         : 4;	/* Service Request Node Pointer Channel Event i */
		unsigned int CEV7NP         : 4;	/* Service Request Node Pointer Channel Event i */
	} B;
	int I;
	unsigned int U;

} VADC_G0CEVNP0_type;
#define VADC_G0CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf00205a0u)	/* Channel Event Node Pointer Register 0, Group 0 */
#define VADC_G1CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf00209a0u)	/* Channel Event Node Pointer Register 0, Group 1 */
#define VADC_G2CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf0020da0u)	/* Channel Event Node Pointer Register 0, Group 2 */
#define VADC_G3CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf00211a0u)	/* Channel Event Node Pointer Register 0, Group 3 */
#define VADC_G4CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf00215a0u)	/* Channel Event Node Pointer Register 0, Group 4 */
#define VADC_G5CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf00219a0u)	/* Channel Event Node Pointer Register 0, Group 5 */
#define VADC_G6CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf0021da0u)	/* Channel Event Node Pointer Register 0, Group 6 */
#define VADC_G7CEVNP0	(*( VADC_G0CEVNP0_type *) 0xf00221a0u)	/* Channel Event Node Pointer Register 0, Group 7 */

