svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ASSCH0         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH1         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH2         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH3         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH4         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH5         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH6         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH7         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH8         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH9         : 1;	/* Assignment for Channel y */
		unsigned int ASSCH10        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH11        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH12        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH13        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH14        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH15        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH16        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH17        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH18        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH19        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH20        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH21        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH22        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH23        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH24        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH25        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH26        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH27        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH28        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH29        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH30        : 1;	/* Assignment for Channel y */
		unsigned int ASSCH31        : 1;	/* Assignment for Channel y */
	} B;
	int I;
	unsigned int U;

} VADC_G0CHASS_type;
#define VADC_G0CHASS	(*( VADC_G0CHASS_type *) 0xf0020488u)	/* Channel Assignment Register, Group 0 */
#define VADC_G1CHASS	(*( VADC_G0CHASS_type *) 0xf0020888u)	/* Channel Assignment Register, Group 1 */
#define VADC_G2CHASS	(*( VADC_G0CHASS_type *) 0xf0020c88u)	/* Channel Assignment Register, Group 2 */
#define VADC_G3CHASS	(*( VADC_G0CHASS_type *) 0xf0021088u)	/* Channel Assignment Register, Group 3 */
#define VADC_G4CHASS	(*( VADC_G0CHASS_type *) 0xf0021488u)	/* Channel Assignment Register, Group 4 */
#define VADC_G5CHASS	(*( VADC_G0CHASS_type *) 0xf0021888u)	/* Channel Assignment Register, Group 5 */
#define VADC_G6CHASS	(*( VADC_G0CHASS_type *) 0xf0021c88u)	/* Channel Assignment Register, Group 6 */
#define VADC_G7CHASS	(*( VADC_G0CHASS_type *) 0xf0022088u)	/* Channel Assignment Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int ICLSEL         : 2;	/* Input Class Select */
		unsigned int                : 2;
		unsigned int BNDSELL        : 2;	/* Lower Boundary SelectWhile BNDSELX ? 0000, bitfields BNDSELU and BNDSELL are concatenated and select the corresponding result register as lower boundary. */
		unsigned int BNDSELU        : 2;	/* Upper Boundary Select */
		unsigned int CHEVMODE       : 2;	/* Channel Event Mode */
		unsigned int SYNC           : 1;	/* Synchronization Request */
		unsigned int REFSEL         : 1;	/* Reference Input Selection */
		unsigned int BNDSELX        : 4;	/* BoundaryExtension */
		unsigned int RESREG         : 4;	/* Result Register */
		unsigned int RESTBS         : 1;	/* Result Target for Background Source */
		unsigned int RESPOS         : 1;	/* Result Position */
		unsigned int                : 6;
		unsigned int BWDCH          : 2;	/* Broken Wire Detection Channel */
		unsigned int BWDEN          : 1;	/* Broken Wire Detection Enable */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} VADC_G0CHCTR0_type;
#define VADC_G0CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0020600u)	/* Group 0, Channel 0 Ctrl. Reg. */
#define VADC_G0CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0020604u)	/* Group 0, Channel 1 Ctrl. Reg. */
#define VADC_G0CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0020608u)	/* Group 0, Channel 2 Ctrl. Reg. */
#define VADC_G0CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf002060cu)	/* Group 0, Channel 3 Ctrl. Reg. */
#define VADC_G0CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0020610u)	/* Group 0, Channel 4 Ctrl. Reg. */
#define VADC_G0CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0020614u)	/* Group 0, Channel 5 Ctrl. Reg. */
#define VADC_G0CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0020618u)	/* Group 0, Channel 6 Ctrl. Reg. */
#define VADC_G0CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf002061cu)	/* Group 0, Channel 7 Ctrl. Reg. */
#define VADC_G1CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0020a00u)	/* Group 1, Channel 0 Ctrl. Reg. */
#define VADC_G1CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0020a04u)	/* Group 1, Channel 1 Ctrl. Reg. */
#define VADC_G1CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0020a08u)	/* Group 1, Channel 2 Ctrl. Reg. */
#define VADC_G1CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf0020a0cu)	/* Group 1, Channel 3 Ctrl. Reg. */
#define VADC_G1CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0020a10u)	/* Group 1, Channel 4 Ctrl. Reg. */
#define VADC_G1CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0020a14u)	/* Group 1, Channel 5 Ctrl. Reg. */
#define VADC_G1CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0020a18u)	/* Group 1, Channel 6 Ctrl. Reg. */
#define VADC_G1CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf0020a1cu)	/* Group 1, Channel 7 Ctrl. Reg. */
#define VADC_G2CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0020e00u)	/* Group 2, Channel 0 Ctrl. Reg. */
#define VADC_G2CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0020e04u)	/* Group 2, Channel 1 Ctrl. Reg. */
#define VADC_G2CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0020e08u)	/* Group 2, Channel 2 Ctrl. Reg. */
#define VADC_G2CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf0020e0cu)	/* Group 2, Channel 3 Ctrl. Reg. */
#define VADC_G2CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0020e10u)	/* Group 2, Channel 4 Ctrl. Reg. */
#define VADC_G2CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0020e14u)	/* Group 2, Channel 5 Ctrl. Reg. */
#define VADC_G2CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0020e18u)	/* Group 2, Channel 6 Ctrl. Reg. */
#define VADC_G2CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf0020e1cu)	/* Group 2, Channel 7 Ctrl. Reg. */
#define VADC_G3CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0021200u)	/* Group 3, Channel 0 Ctrl. Reg. */
#define VADC_G3CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0021204u)	/* Group 3, Channel 1 Ctrl. Reg. */
#define VADC_G3CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0021208u)	/* Group 3, Channel 2 Ctrl. Reg. */
#define VADC_G3CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf002120cu)	/* Group 3, Channel 3 Ctrl. Reg. */
#define VADC_G3CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0021210u)	/* Group 3, Channel 4 Ctrl. Reg. */
#define VADC_G3CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0021214u)	/* Group 3, Channel 5 Ctrl. Reg. */
#define VADC_G3CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0021218u)	/* Group 3, Channel 6 Ctrl. Reg. */
#define VADC_G3CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf002121cu)	/* Group 3, Channel 7 Ctrl. Reg. */
#define VADC_G4CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0021600u)	/* Group 4, Channel 0 Ctrl. Reg. */
#define VADC_G4CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0021604u)	/* Group 4, Channel 1 Ctrl. Reg. */
#define VADC_G4CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0021608u)	/* Group 4, Channel 2 Ctrl. Reg. */
#define VADC_G4CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf002160cu)	/* Group 4, Channel 3 Ctrl. Reg. */
#define VADC_G4CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0021610u)	/* Group 4, Channel 4 Ctrl. Reg. */
#define VADC_G4CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0021614u)	/* Group 4, Channel 5 Ctrl. Reg. */
#define VADC_G4CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0021618u)	/* Group 4, Channel 6 Ctrl. Reg. */
#define VADC_G4CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf002161cu)	/* Group 4, Channel 7 Ctrl. Reg. */
#define VADC_G5CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0021a00u)	/* Group 5, Channel 0 Ctrl. Reg. */
#define VADC_G5CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0021a04u)	/* Group 5, Channel 1 Ctrl. Reg. */
#define VADC_G5CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0021a08u)	/* Group 5, Channel 2 Ctrl. Reg. */
#define VADC_G5CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf0021a0cu)	/* Group 5, Channel 3 Ctrl. Reg. */
#define VADC_G5CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0021a10u)	/* Group 5, Channel 4 Ctrl. Reg. */
#define VADC_G5CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0021a14u)	/* Group 5, Channel 5 Ctrl. Reg. */
#define VADC_G5CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0021a18u)	/* Group 5, Channel 6 Ctrl. Reg. */
#define VADC_G5CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf0021a1cu)	/* Group 5, Channel 7 Ctrl. Reg. */
#define VADC_G6CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0021e00u)	/* Group 6, Channel 0 Ctrl. Reg. */
#define VADC_G6CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0021e04u)	/* Group 6, Channel 1 Ctrl. Reg. */
#define VADC_G6CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0021e08u)	/* Group 6, Channel 2 Ctrl. Reg. */
#define VADC_G6CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf0021e0cu)	/* Group 6, Channel 3 Ctrl. Reg. */
#define VADC_G6CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0021e10u)	/* Group 6, Channel 4 Ctrl. Reg. */
#define VADC_G6CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0021e14u)	/* Group 6, Channel 5 Ctrl. Reg. */
#define VADC_G6CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0021e18u)	/* Group 6, Channel 6 Ctrl. Reg. */
#define VADC_G6CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf0021e1cu)	/* Group 6, Channel 7 Ctrl. Reg. */
#define VADC_G7CHCTR0	(*( VADC_G0CHCTR0_type *) 0xf0022200u)	/* Group 7, Channel 0 Ctrl. Reg. */
#define VADC_G7CHCTR1	(*( VADC_G0CHCTR0_type *) 0xf0022204u)	/* Group 7, Channel 1 Ctrl. Reg. */
#define VADC_G7CHCTR2	(*( VADC_G0CHCTR0_type *) 0xf0022208u)	/* Group 7, Channel 2 Ctrl. Reg. */
#define VADC_G7CHCTR3	(*( VADC_G0CHCTR0_type *) 0xf002220cu)	/* Group 7, Channel 3 Ctrl. Reg. */
#define VADC_G7CHCTR4	(*( VADC_G0CHCTR0_type *) 0xf0022210u)	/* Group 7, Channel 4 Ctrl. Reg. */
#define VADC_G7CHCTR5	(*( VADC_G0CHCTR0_type *) 0xf0022214u)	/* Group 7, Channel 5 Ctrl. Reg. */
#define VADC_G7CHCTR6	(*( VADC_G0CHCTR0_type *) 0xf0022218u)	/* Group 7, Channel 6 Ctrl. Reg. */
#define VADC_G7CHCTR7	(*( VADC_G0CHCTR0_type *) 0xf002221cu)	/* Group 7, Channel 7 Ctrl. Reg. */

