svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int EMUXSET        : 3;	/* External Multiplexer Start SelectionFor single-step mode and sequence mode: Select the start value before selecting the respective mode. */
		unsigned int                : 5;
		/* const */ unsigned int EMUXACT        : 3;	/* External Multiplexer Actual Selection */
		unsigned int                : 5;
		unsigned int EMUXCH         : 10;	/* External Multiplexer Channel Select */
		unsigned int EMUXMODE       : 2;	/* External Multiplexer Mode */
		unsigned int EMXCOD         : 1;	/* External Multiplexer Coding Scheme */
		unsigned int EMXST          : 1;	/* External Multiplexer Sample Time Control */
		/* const */ unsigned int EMXCSS         : 1;	/* External Multiplexer Channel Selection Style */
		unsigned int EMXWC          : 1;	/* Write Control for EMUX Configuration */
	} B;
	int I;
	unsigned int U;

} VADC_G0EMUXCTR_type;
#define VADC_G0EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf00205f0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G1EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf00209f0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G2EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf0020df0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G3EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf00211f0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G4EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf00215f0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G5EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf00219f0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G6EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf0021df0u)	/* External Multiplexer Control Register, Group x */
#define VADC_G7EMUXCTR	(*( VADC_G0EMUXCTR_type *) 0xf00221f0u)	/* External Multiplexer Control Register, Group x */

typedef volatile union
{
	struct
	{ 
		unsigned int STCS           : 5;	/* Sample Time Control for Standard Conversions */
		unsigned int                : 3;
		unsigned int CMS            : 3;	/* Conversion Mode for Standard Conversions */
		unsigned int                : 5;
		unsigned int STCE           : 5;	/* Sample Time Control for EMUX Conversions */
		unsigned int                : 3;
		unsigned int CME            : 3;	/* Conversion Mode for EMUX Conversions */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} VADC_G0ICLASS0_type;
#define VADC_G0ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00204a0u)	/* Input Class Register 0, Group 0 */
#define VADC_G0ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00204a4u)	/* Input Class Register 1, Group 0 */
#define VADC_G1ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00208a0u)	/* Input Class Register 0, Group 1 */
#define VADC_G1ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00208a4u)	/* Input Class Register 1, Group 1 */
#define VADC_G2ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf0020ca0u)	/* Input Class Register 0, Group 2 */
#define VADC_G2ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf0020ca4u)	/* Input Class Register 1, Group 2 */
#define VADC_G3ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00210a0u)	/* Input Class Register 0, Group 3 */
#define VADC_G3ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00210a4u)	/* Input Class Register 1, Group 3 */
#define VADC_G4ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00214a0u)	/* Input Class Register 0, Group 4 */
#define VADC_G4ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00214a4u)	/* Input Class Register 1, Group 4 */
#define VADC_G5ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00218a0u)	/* Input Class Register 0, Group 5 */
#define VADC_G5ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00218a4u)	/* Input Class Register 1, Group 5 */
#define VADC_G6ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf0021ca0u)	/* Input Class Register 0, Group 6 */
#define VADC_G6ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf0021ca4u)	/* Input Class Register 1, Group 6 */
#define VADC_G7ICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00220a0u)	/* Input Class Register 0, Group 7 */
#define VADC_G7ICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00220a4u)	/* Input Class Register 1, Group 7 */
#define VADC_GLOBICLASS0	(*( VADC_G0ICLASS0_type *) 0xf00200a0u)	/* Input Class Register 0, Global */
#define VADC_GLOBICLASS1	(*( VADC_G0ICLASS0_type *) 0xf00200a4u)	/* Input Class Register 1, Global */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int REQCHNR        : 5;	/* Request Channel Number */
		/* const */ unsigned int RF             : 1;	/* Refill */
		/* const */ unsigned int ENSI           : 1;	/* Enable Source Interrupt */
		/* const */ unsigned int EXTR           : 1;	/* External Trigger */
		/* const */ unsigned int V              : 1;	/* Request Channel Number Valid */
		/* const */ unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} VADC_G0Q0R0_type;
#define VADC_G0Q0R0	(*( VADC_G0Q0R0_type *) 0xf002050cu)	/* Queue 0 Register 0, Group 0 */
#define VADC_G1Q0R0	(*( VADC_G0Q0R0_type *) 0xf002090cu)	/* Queue 0 Register 0, Group 1 */
#define VADC_G2Q0R0	(*( VADC_G0Q0R0_type *) 0xf0020d0cu)	/* Queue 0 Register 0, Group 2 */
#define VADC_G3Q0R0	(*( VADC_G0Q0R0_type *) 0xf002110cu)	/* Queue 0 Register 0, Group 3 */
#define VADC_G4Q0R0	(*( VADC_G0Q0R0_type *) 0xf002150cu)	/* Queue 0 Register 0, Group 4 */
#define VADC_G5Q0R0	(*( VADC_G0Q0R0_type *) 0xf002190cu)	/* Queue 0 Register 0, Group 5 */
#define VADC_G6Q0R0	(*( VADC_G0Q0R0_type *) 0xf0021d0cu)	/* Queue 0 Register 0, Group 6 */
#define VADC_G7Q0R0	(*( VADC_G0Q0R0_type *) 0xf002210cu)	/* Queue 0 Register 0, Group 7 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int REQCHNR        : 5;	/* Request Channel Number */
		/* const */ unsigned int RF             : 1;	/* Refill */
		/* const */ unsigned int ENSI           : 1;	/* Enable Source Interrupt */
		/* const */ unsigned int EXTR           : 1;	/* External Trigger */
		/* const */ unsigned int V              : 1;	/* Request Channel Number Valid */
		/* const */ unsigned int r              : 23;	/* Reserved, write 0, read as 0 */
	} B;
	int I;
	unsigned int U;

} VADC_G0QBUR0_type;
