svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define VADC_G0QBUR0	(*( VADC_G0QBUR0_type *) 0xf0020510u)	/* Queue 0 Backup Register, Group 0 */
#define VADC_G1QBUR0	(*( VADC_G0QBUR0_type *) 0xf0020910u)	/* Queue 0 Backup Register, Group 1 */
#define VADC_G2QBUR0	(*( VADC_G0QBUR0_type *) 0xf0020d10u)	/* Queue 0 Backup Register, Group 2 */
#define VADC_G3QBUR0	(*( VADC_G0QBUR0_type *) 0xf0021110u)	/* Queue 0 Backup Register, Group 3 */
#define VADC_G4QBUR0	(*( VADC_G0QBUR0_type *) 0xf0021510u)	/* Queue 0 Backup Register, Group 4 */
#define VADC_G5QBUR0	(*( VADC_G0QBUR0_type *) 0xf0021910u)	/* Queue 0 Backup Register, Group 5 */
#define VADC_G6QBUR0	(*( VADC_G0QBUR0_type *) 0xf0021d10u)	/* Queue 0 Backup Register, Group 6 */
#define VADC_G7QBUR0	(*( VADC_G0QBUR0_type *) 0xf0022110u)	/* Queue 0 Backup Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int REQCHNR        : 5;	/* Request Channel Number */
		unsigned int RF             : 1;	/* Refill */
		unsigned int ENSI           : 1;	/* Enable Source Interrupt */
		unsigned int EXTR           : 1;	/* External Trigger */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} VADC_G0QINR0_type;
#define VADC_G0QINR0	(*( VADC_G0QINR0_type *) 0xf0020510u)	/* Queue 0 Input Register, Group 0 */
#define VADC_G1QINR0	(*( VADC_G0QINR0_type *) 0xf0020910u)	/* Queue 0 Input Register, Group 1 */
#define VADC_G2QINR0	(*( VADC_G0QINR0_type *) 0xf0020d10u)	/* Queue 0 Input Register, Group 2 */
#define VADC_G3QINR0	(*( VADC_G0QINR0_type *) 0xf0021110u)	/* Queue 0 Input Register, Group 3 */
#define VADC_G4QINR0	(*( VADC_G0QINR0_type *) 0xf0021510u)	/* Queue 0 Input Register, Group 4 */
#define VADC_G5QINR0	(*( VADC_G0QINR0_type *) 0xf0021910u)	/* Queue 0 Input Register, Group 5 */
#define VADC_G6QINR0	(*( VADC_G0QINR0_type *) 0xf0021d10u)	/* Queue 0 Input Register, Group 6 */
#define VADC_G7QINR0	(*( VADC_G0QINR0_type *) 0xf0022110u)	/* Queue 0 Input Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int ENGT           : 2;	/* Enable Gate */
		unsigned int ENTR           : 1;	/* Enable External Trigger */
		unsigned int                : 5;
		unsigned int CLRV           : 1;	/* Clear Valid Bit */
		unsigned int TREV           : 1;	/* Trigger Event */
		unsigned int FLUSH          : 1;	/* Flush Queue */
		unsigned int CEV            : 1;	/* Clear Event Flag */
		unsigned int                : 4;
		unsigned int RPTDIS         : 1;	/* Repeat Disable */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} VADC_G0QMR0_type;
#define VADC_G0QMR0	(*( VADC_G0QMR0_type *) 0xf0020504u)	/* Queue 0 Mode Register, Group 0 */
#define VADC_G1QMR0	(*( VADC_G0QMR0_type *) 0xf0020904u)	/* Queue 0 Mode Register, Group 1 */
#define VADC_G2QMR0	(*( VADC_G0QMR0_type *) 0xf0020d04u)	/* Queue 0 Mode Register, Group 2 */
#define VADC_G3QMR0	(*( VADC_G0QMR0_type *) 0xf0021104u)	/* Queue 0 Mode Register, Group 3 */
#define VADC_G4QMR0	(*( VADC_G0QMR0_type *) 0xf0021504u)	/* Queue 0 Mode Register, Group 4 */
#define VADC_G5QMR0	(*( VADC_G0QMR0_type *) 0xf0021904u)	/* Queue 0 Mode Register, Group 5 */
#define VADC_G6QMR0	(*( VADC_G0QMR0_type *) 0xf0021d04u)	/* Queue 0 Mode Register, Group 6 */
#define VADC_G7QMR0	(*( VADC_G0QMR0_type *) 0xf0022104u)	/* Queue 0 Mode Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FILL           : 4;	/* Filling Level for Queue 2 */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int EMPTY          : 1;	/* Queue Empty */
		/* const */ unsigned int                : 1;
		/* const */ unsigned int REQGT          : 1;	/* Request Gate Level */
		/* const */ unsigned int EV             : 1;	/* Event Detected */
		/* const */ unsigned int                : 23;
	} B;
	int I;
	unsigned int U;

} VADC_G0QSR0_type;
#define VADC_G0QSR0	(*( VADC_G0QSR0_type *) 0xf0020508u)	/* Queue 0 Status Register, Group 0 */
#define VADC_G1QSR0	(*( VADC_G0QSR0_type *) 0xf0020908u)	/* Queue 0 Status Register, Group 1 */
#define VADC_G2QSR0	(*( VADC_G0QSR0_type *) 0xf0020d08u)	/* Queue 0 Status Register, Group 2 */
#define VADC_G3QSR0	(*( VADC_G0QSR0_type *) 0xf0021108u)	/* Queue 0 Status Register, Group 3 */
#define VADC_G4QSR0	(*( VADC_G0QSR0_type *) 0xf0021508u)	/* Queue 0 Status Register, Group 4 */
#define VADC_G5QSR0	(*( VADC_G0QSR0_type *) 0xf0021908u)	/* Queue 0 Status Register, Group 5 */
#define VADC_G6QSR0	(*( VADC_G0QSR0_type *) 0xf0021d08u)	/* Queue 0 Status Register, Group 6 */
#define VADC_G7QSR0	(*( VADC_G0QSR0_type *) 0xf0022108u)	/* Queue 0 Status Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int DRCTR          : 4;	/* Data Reduction Control */
		unsigned int DMM            : 2;	/* Data Modification Mode */
		unsigned int                : 2;
		unsigned int WFR            : 1;	/* Wait-for-Read Mode Enable */
		unsigned int FEN            : 2;	/* FIFO Mode Enable */
		unsigned int                : 4;
		unsigned int SRGEN          : 1;	/* Service Request Generation Enable */
	} B;
	int I;
	unsigned int U;

} VADC_G0RCR0_type;
#define VADC_G0RCR0	(*( VADC_G0RCR0_type *) 0xf0020680u)	/* Group 0 Result Control Reg. 0 */
#define VADC_G0RCR1	(*( VADC_G0RCR0_type *) 0xf0020684u)	/* Group 0 Result Control Reg. 1 */
#define VADC_G0RCR10	(*( VADC_G0RCR0_type *) 0xf00206a8u)	/* Group 0 Result Control Reg. 10 */
#define VADC_G0RCR11	(*( VADC_G0RCR0_type *) 0xf00206acu)	/* Group 0 Result Control Reg. 11 */
#define VADC_G0RCR12	(*( VADC_G0RCR0_type *) 0xf00206b0u)	/* Group 0 Result Control Reg. 12 */
#define VADC_G0RCR13	(*( VADC_G0RCR0_type *) 0xf00206b4u)	/* Group 0 Result Control Reg. 13 */
#define VADC_G0RCR14	(*( VADC_G0RCR0_type *) 0xf00206b8u)	/* Group 0 Result Control Reg. 14 */
#define VADC_G0RCR15	(*( VADC_G0RCR0_type *) 0xf00206bcu)	/* Group 0 Result Control Reg. 15 */
#define VADC_G0RCR2	(*( VADC_G0RCR0_type *) 0xf0020688u)	/* Group 0 Result Control Reg. 2 */
#define VADC_G0RCR3	(*( VADC_G0RCR0_type *) 0xf002068cu)	/* Group 0 Result Control Reg. 3 */
#define VADC_G0RCR4	(*( VADC_G0RCR0_type *) 0xf0020690u)	/* Group 0 Result Control Reg. 4 */
#define VADC_G0RCR5	(*( VADC_G0RCR0_type *) 0xf0020694u)	/* Group 0 Result Control Reg. 5 */
#define VADC_G0RCR6	(*( VADC_G0RCR0_type *) 0xf0020698u)	/* Group 0 Result Control Reg. 6 */
#define VADC_G0RCR7	(*( VADC_G0RCR0_type *) 0xf002069cu)	/* Group 0 Result Control Reg. 7 */
#define VADC_G0RCR8	(*( VADC_G0RCR0_type *) 0xf00206a0u)	/* Group 0 Result Control Reg. 8 */
#define VADC_G0RCR9	(*( VADC_G0RCR0_type *) 0xf00206a4u)	/* Group 0 Result Control Reg. 9 */
#define VADC_G1RCR0	(*( VADC_G0RCR0_type *) 0xf0020a80u)	/* Group 1 Result Control Reg. 0 */
#define VADC_G1RCR1	(*( VADC_G0RCR0_type *) 0xf0020a84u)	/* Group 1 Result Control Reg. 1 */
#define VADC_G1RCR10	(*( VADC_G0RCR0_type *) 0xf0020aa8u)	/* Group 1 Result Control Reg. 10 */
#define VADC_G1RCR11	(*( VADC_G0RCR0_type *) 0xf0020aacu)	/* Group 1 Result Control Reg. 11 */
#define VADC_G1RCR12	(*( VADC_G0RCR0_type *) 0xf0020ab0u)	/* Group 1 Result Control Reg. 12 */
#define VADC_G1RCR13	(*( VADC_G0RCR0_type *) 0xf0020ab4u)	/* Group 1 Result Control Reg. 13 */
#define VADC_G1RCR14	(*( VADC_G0RCR0_type *) 0xf0020ab8u)	/* Group 1 Result Control Reg. 14 */
#define VADC_G1RCR15	(*( VADC_G0RCR0_type *) 0xf0020abcu)	/* Group 1 Result Control Reg. 15 */
#define VADC_G1RCR2	(*( VADC_G0RCR0_type *) 0xf0020a88u)	/* Group 1 Result Control Reg. 2 */
#define VADC_G1RCR3	(*( VADC_G0RCR0_type *) 0xf0020a8cu)	/* Group 1 Result Control Reg. 3 */
#define VADC_G1RCR4	(*( VADC_G0RCR0_type *) 0xf0020a90u)	/* Group 1 Result Control Reg. 4 */
#define VADC_G1RCR5	(*( VADC_G0RCR0_type *) 0xf0020a94u)	/* Group 1 Result Control Reg. 5 */
#define VADC_G1RCR6	(*( VADC_G0RCR0_type *) 0xf0020a98u)	/* Group 1 Result Control Reg. 6 */
#define VADC_G1RCR7	(*( VADC_G0RCR0_type *) 0xf0020a9cu)	/* Group 1 Result Control Reg. 7 */
#define VADC_G1RCR8	(*( VADC_G0RCR0_type *) 0xf0020aa0u)	/* Group 1 Result Control Reg. 8 */
#define VADC_G1RCR9	(*( VADC_G0RCR0_type *) 0xf0020aa4u)	/* Group 1 Result Control Reg. 9 */
#define VADC_G2RCR0	(*( VADC_G0RCR0_type *) 0xf0020e80u)	/* Group 2 Result Control Reg. 0 */
#define VADC_G2RCR1	(*( VADC_G0RCR0_type *) 0xf0020e84u)	/* Group 2 Result Control Reg. 1 */
#define VADC_G2RCR10	(*( VADC_G0RCR0_type *) 0xf0020ea8u)	/* Group 2 Result Control Reg. 10 */
#define VADC_G2RCR11	(*( VADC_G0RCR0_type *) 0xf0020eacu)	/* Group 2 Result Control Reg. 11 */
#define VADC_G2RCR12	(*( VADC_G0RCR0_type *) 0xf0020eb0u)	/* Group 2 Result Control Reg. 12 */
#define VADC_G2RCR13	(*( VADC_G0RCR0_type *) 0xf0020eb4u)	/* Group 2 Result Control Reg. 13 */
#define VADC_G2RCR14	(*( VADC_G0RCR0_type *) 0xf0020eb8u)	/* Group 2 Result Control Reg. 14 */
#define VADC_G2RCR15	(*( VADC_G0RCR0_type *) 0xf0020ebcu)	/* Group 2 Result Control Reg. 15 */
#define VADC_G2RCR2	(*( VADC_G0RCR0_type *) 0xf0020e88u)	/* Group 2 Result Control Reg. 2 */
#define VADC_G2RCR3	(*( VADC_G0RCR0_type *) 0xf0020e8cu)	/* Group 2 Result Control Reg. 3 */
#define VADC_G2RCR4	(*( VADC_G0RCR0_type *) 0xf0020e90u)	/* Group 2 Result Control Reg. 4 */
#define VADC_G2RCR5	(*( VADC_G0RCR0_type *) 0xf0020e94u)	/* Group 2 Result Control Reg. 5 */
#define VADC_G2RCR6	(*( VADC_G0RCR0_type *) 0xf0020e98u)	/* Group 2 Result Control Reg. 6 */
#define VADC_G2RCR7	(*( VADC_G0RCR0_type *) 0xf0020e9cu)	/* Group 2 Result Control Reg. 7 */
#define VADC_G2RCR8	(*( VADC_G0RCR0_type *) 0xf0020ea0u)	/* Group 2 Result Control Reg. 8 */
#define VADC_G2RCR9	(*( VADC_G0RCR0_type *) 0xf0020ea4u)	/* Group 2 Result Control Reg. 9 */
#define VADC_G3RCR0	(*( VADC_G0RCR0_type *) 0xf0021280u)	/* Group 3 Result Control Reg. 0 */
#define VADC_G3RCR1	(*( VADC_G0RCR0_type *) 0xf0021284u)	/* Group 3 Result Control Reg. 1 */
#define VADC_G3RCR10	(*( VADC_G0RCR0_type *) 0xf00212a8u)	/* Group 3 Result Control Reg. 10 */
#define VADC_G3RCR11	(*( VADC_G0RCR0_type *) 0xf00212acu)	/* Group 3 Result Control Reg. 11 */
#define VADC_G3RCR12	(*( VADC_G0RCR0_type *) 0xf00212b0u)	/* Group 3 Result Control Reg. 12 */
#define VADC_G3RCR13	(*( VADC_G0RCR0_type *) 0xf00212b4u)	/* Group 3 Result Control Reg. 13 */
#define VADC_G3RCR14	(*( VADC_G0RCR0_type *) 0xf00212b8u)	/* Group 3 Result Control Reg. 14 */
#define VADC_G3RCR15	(*( VADC_G0RCR0_type *) 0xf00212bcu)	/* Group 3 Result Control Reg. 15 */
#define VADC_G3RCR2	(*( VADC_G0RCR0_type *) 0xf0021288u)	/* Group 3 Result Control Reg. 2 */
#define VADC_G3RCR3	(*( VADC_G0RCR0_type *) 0xf002128cu)	/* Group 3 Result Control Reg. 3 */
#define VADC_G3RCR4	(*( VADC_G0RCR0_type *) 0xf0021290u)	/* Group 3 Result Control Reg. 4 */
#define VADC_G3RCR5	(*( VADC_G0RCR0_type *) 0xf0021294u)	/* Group 3 Result Control Reg. 5 */
#define VADC_G3RCR6	(*( VADC_G0RCR0_type *) 0xf0021298u)	/* Group 3 Result Control Reg. 6 */
#define VADC_G3RCR7	(*( VADC_G0RCR0_type *) 0xf002129cu)	/* Group 3 Result Control Reg. 7 */
#define VADC_G3RCR8	(*( VADC_G0RCR0_type *) 0xf00212a0u)	/* Group 3 Result Control Reg. 8 */
#define VADC_G3RCR9	(*( VADC_G0RCR0_type *) 0xf00212a4u)	/* Group 3 Result Control Reg. 9 */
#define VADC_G4RCR0	(*( VADC_G0RCR0_type *) 0xf0021680u)	/* Group 4 Result Control Reg. 0 */
#define VADC_G4RCR1	(*( VADC_G0RCR0_type *) 0xf0021684u)	/* Group 4 Result Control Reg. 1 */
#define VADC_G4RCR10	(*( VADC_G0RCR0_type *) 0xf00216a8u)	/* Group 4 Result Control Reg. 10 */
#define VADC_G4RCR11	(*( VADC_G0RCR0_type *) 0xf00216acu)	/* Group 4 Result Control Reg. 11 */
#define VADC_G4RCR12	(*( VADC_G0RCR0_type *) 0xf00216b0u)	/* Group 4 Result Control Reg. 12 */
#define VADC_G4RCR13	(*( VADC_G0RCR0_type *) 0xf00216b4u)	/* Group 4 Result Control Reg. 13 */
#define VADC_G4RCR14	(*( VADC_G0RCR0_type *) 0xf00216b8u)	/* Group 4 Result Control Reg. 14 */
#define VADC_G4RCR15	(*( VADC_G0RCR0_type *) 0xf00216bcu)	/* Group 4 Result Control Reg. 15 */
#define VADC_G4RCR2	(*( VADC_G0RCR0_type *) 0xf0021688u)	/* Group 4 Result Control Reg. 2 */
#define VADC_G4RCR3	(*( VADC_G0RCR0_type *) 0xf002168cu)	/* Group 4 Result Control Reg. 3 */
#define VADC_G4RCR4	(*( VADC_G0RCR0_type *) 0xf0021690u)	/* Group 4 Result Control Reg. 4 */
#define VADC_G4RCR5	(*( VADC_G0RCR0_type *) 0xf0021694u)	/* Group 4 Result Control Reg. 5 */
#define VADC_G4RCR6	(*( VADC_G0RCR0_type *) 0xf0021698u)	/* Group 4 Result Control Reg. 6 */
#define VADC_G4RCR7	(*( VADC_G0RCR0_type *) 0xf002169cu)	/* Group 4 Result Control Reg. 7 */
#define VADC_G4RCR8	(*( VADC_G0RCR0_type *) 0xf00216a0u)	/* Group 4 Result Control Reg. 8 */
#define VADC_G4RCR9	(*( VADC_G0RCR0_type *) 0xf00216a4u)	/* Group 4 Result Control Reg. 9 */
#define VADC_G5RCR0	(*( VADC_G0RCR0_type *) 0xf0021a80u)	/* Group 5 Result Control Reg. 0 */
#define VADC_G5RCR1	(*( VADC_G0RCR0_type *) 0xf0021a84u)	/* Group 5 Result Control Reg. 1 */
#define VADC_G5RCR10	(*( VADC_G0RCR0_type *) 0xf0021aa8u)	/* Group 5 Result Control Reg. 10 */
#define VADC_G5RCR11	(*( VADC_G0RCR0_type *) 0xf0021aacu)	/* Group 5 Result Control Reg. 11 */
#define VADC_G5RCR12	(*( VADC_G0RCR0_type *) 0xf0021ab0u)	/* Group 5 Result Control Reg. 12 */
#define VADC_G5RCR13	(*( VADC_G0RCR0_type *) 0xf0021ab4u)	/* Group 5 Result Control Reg. 13 */
#define VADC_G5RCR14	(*( VADC_G0RCR0_type *) 0xf0021ab8u)	/* Group 5 Result Control Reg. 14 */
#define VADC_G5RCR15	(*( VADC_G0RCR0_type *) 0xf0021abcu)	/* Group 5 Result Control Reg. 15 */
#define VADC_G5RCR2	(*( VADC_G0RCR0_type *) 0xf0021a88u)	/* Group 5 Result Control Reg. 2 */
#define VADC_G5RCR3	(*( VADC_G0RCR0_type *) 0xf0021a8cu)	/* Group 5 Result Control Reg. 3 */
#define VADC_G5RCR4	(*( VADC_G0RCR0_type *) 0xf0021a90u)	/* Group 5 Result Control Reg. 4 */
#define VADC_G5RCR5	(*( VADC_G0RCR0_type *) 0xf0021a94u)	/* Group 5 Result Control Reg. 5 */
#define VADC_G5RCR6	(*( VADC_G0RCR0_type *) 0xf0021a98u)	/* Group 5 Result Control Reg. 6 */
#define VADC_G5RCR7	(*( VADC_G0RCR0_type *) 0xf0021a9cu)	/* Group 5 Result Control Reg. 7 */
#define VADC_G5RCR8	(*( VADC_G0RCR0_type *) 0xf0021aa0u)	/* Group 5 Result Control Reg. 8 */
#define VADC_G5RCR9	(*( VADC_G0RCR0_type *) 0xf0021aa4u)	/* Group 5 Result Control Reg. 9 */
#define VADC_G6RCR0	(*( VADC_G0RCR0_type *) 0xf0021e80u)	/* Group 6 Result Control Reg. 0 */
#define VADC_G6RCR1	(*( VADC_G0RCR0_type *) 0xf0021e84u)	/* Group 6 Result Control Reg. 1 */
#define VADC_G6RCR10	(*( VADC_G0RCR0_type *) 0xf0021ea8u)	/* Group 6 Result Control Reg. 10 */
#define VADC_G6RCR11	(*( VADC_G0RCR0_type *) 0xf0021eacu)	/* Group 6 Result Control Reg. 11 */
#define VADC_G6RCR12	(*( VADC_G0RCR0_type *) 0xf0021eb0u)	/* Group 6 Result Control Reg. 12 */
#define VADC_G6RCR13	(*( VADC_G0RCR0_type *) 0xf0021eb4u)	/* Group 6 Result Control Reg. 13 */
#define VADC_G6RCR14	(*( VADC_G0RCR0_type *) 0xf0021eb8u)	/* Group 6 Result Control Reg. 14 */
#define VADC_G6RCR15	(*( VADC_G0RCR0_type *) 0xf0021ebcu)	/* Group 6 Result Control Reg. 15 */
#define VADC_G6RCR2	(*( VADC_G0RCR0_type *) 0xf0021e88u)	/* Group 6 Result Control Reg. 2 */
#define VADC_G6RCR3	(*( VADC_G0RCR0_type *) 0xf0021e8cu)	/* Group 6 Result Control Reg. 3 */
#define VADC_G6RCR4	(*( VADC_G0RCR0_type *) 0xf0021e90u)	/* Group 6 Result Control Reg. 4 */
#define VADC_G6RCR5	(*( VADC_G0RCR0_type *) 0xf0021e94u)	/* Group 6 Result Control Reg. 5 */
#define VADC_G6RCR6	(*( VADC_G0RCR0_type *) 0xf0021e98u)	/* Group 6 Result Control Reg. 6 */
#define VADC_G6RCR7	(*( VADC_G0RCR0_type *) 0xf0021e9cu)	/* Group 6 Result Control Reg. 7 */
#define VADC_G6RCR8	(*( VADC_G0RCR0_type *) 0xf0021ea0u)	/* Group 6 Result Control Reg. 8 */
#define VADC_G6RCR9	(*( VADC_G0RCR0_type *) 0xf0021ea4u)	/* Group 6 Result Control Reg. 9 */
#define VADC_G7RCR0	(*( VADC_G0RCR0_type *) 0xf0022280u)	/* Group 7 Result Control Reg. 0 */
#define VADC_G7RCR1	(*( VADC_G0RCR0_type *) 0xf0022284u)	/* Group 7 Result Control Reg. 1 */
#define VADC_G7RCR10	(*( VADC_G0RCR0_type *) 0xf00222a8u)	/* Group 7 Result Control Reg. 10 */
#define VADC_G7RCR11	(*( VADC_G0RCR0_type *) 0xf00222acu)	/* Group 7 Result Control Reg. 11 */
#define VADC_G7RCR12	(*( VADC_G0RCR0_type *) 0xf00222b0u)	/* Group 7 Result Control Reg. 12 */
#define VADC_G7RCR13	(*( VADC_G0RCR0_type *) 0xf00222b4u)	/* Group 7 Result Control Reg. 13 */
#define VADC_G7RCR14	(*( VADC_G0RCR0_type *) 0xf00222b8u)	/* Group 7 Result Control Reg. 14 */
#define VADC_G7RCR15	(*( VADC_G0RCR0_type *) 0xf00222bcu)	/* Group 7 Result Control Reg. 15 */
#define VADC_G7RCR2	(*( VADC_G0RCR0_type *) 0xf0022288u)	/* Group 7 Result Control Reg. 2 */
#define VADC_G7RCR3	(*( VADC_G0RCR0_type *) 0xf002228cu)	/* Group 7 Result Control Reg. 3 */
#define VADC_G7RCR4	(*( VADC_G0RCR0_type *) 0xf0022290u)	/* Group 7 Result Control Reg. 4 */
#define VADC_G7RCR5	(*( VADC_G0RCR0_type *) 0xf0022294u)	/* Group 7 Result Control Reg. 5 */
#define VADC_G7RCR6	(*( VADC_G0RCR0_type *) 0xf0022298u)	/* Group 7 Result Control Reg. 6 */
#define VADC_G7RCR7	(*( VADC_G0RCR0_type *) 0xf002229cu)	/* Group 7 Result Control Reg. 7 */
#define VADC_G7RCR8	(*( VADC_G0RCR0_type *) 0xf00222a0u)	/* Group 7 Result Control Reg. 8 */
#define VADC_G7RCR9	(*( VADC_G0RCR0_type *) 0xf00222a4u)	/* Group 7 Result Control Reg. 9 */

