svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int REV0           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV1           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV2           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV3           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV4           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV5           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV6           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV7           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV8           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV9           : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV10          : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV11          : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV12          : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV13          : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV14          : 1;	/* Clear Result Event for Result Register y */
		unsigned int REV15          : 1;	/* Clear Result Event for Result Register y */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} VADC_G0REFCLR_type;
#define VADC_G0REFCLR	(*( VADC_G0REFCLR_type *) 0xf0020594u)	/* Result Event Flag Clear Register, Group 0 */
#define VADC_G1REFCLR	(*( VADC_G0REFCLR_type *) 0xf0020994u)	/* Result Event Flag Clear Register, Group 1 */
#define VADC_G2REFCLR	(*( VADC_G0REFCLR_type *) 0xf0020d94u)	/* Result Event Flag Clear Register, Group 2 */
#define VADC_G3REFCLR	(*( VADC_G0REFCLR_type *) 0xf0021194u)	/* Result Event Flag Clear Register, Group 3 */
#define VADC_G4REFCLR	(*( VADC_G0REFCLR_type *) 0xf0021594u)	/* Result Event Flag Clear Register, Group 4 */
#define VADC_G5REFCLR	(*( VADC_G0REFCLR_type *) 0xf0021994u)	/* Result Event Flag Clear Register, Group 5 */
#define VADC_G6REFCLR	(*( VADC_G0REFCLR_type *) 0xf0021d94u)	/* Result Event Flag Clear Register, Group 6 */
#define VADC_G7REFCLR	(*( VADC_G0REFCLR_type *) 0xf0022194u)	/* Result Event Flag Clear Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int REV0           : 1;	/* Result Event for Result Register y */
		unsigned int REV1           : 1;	/* Result Event for Result Register y */
		unsigned int REV2           : 1;	/* Result Event for Result Register y */
		unsigned int REV3           : 1;	/* Result Event for Result Register y */
		unsigned int REV4           : 1;	/* Result Event for Result Register y */
		unsigned int REV5           : 1;	/* Result Event for Result Register y */
		unsigned int REV6           : 1;	/* Result Event for Result Register y */
		unsigned int REV7           : 1;	/* Result Event for Result Register y */
		unsigned int REV8           : 1;	/* Result Event for Result Register y */
		unsigned int REV9           : 1;	/* Result Event for Result Register y */
		unsigned int REV10          : 1;	/* Result Event for Result Register y */
		unsigned int REV11          : 1;	/* Result Event for Result Register y */
		unsigned int REV12          : 1;	/* Result Event for Result Register y */
		unsigned int REV13          : 1;	/* Result Event for Result Register y */
		unsigned int REV14          : 1;	/* Result Event for Result Register y */
		unsigned int REV15          : 1;	/* Result Event for Result Register y */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} VADC_G0REFLAG_type;
#define VADC_G0REFLAG	(*( VADC_G0REFLAG_type *) 0xf0020584u)	/* Result Event Flag Register, Group 0 */
#define VADC_G1REFLAG	(*( VADC_G0REFLAG_type *) 0xf0020984u)	/* Result Event Flag Register, Group 1 */
#define VADC_G2REFLAG	(*( VADC_G0REFLAG_type *) 0xf0020d84u)	/* Result Event Flag Register, Group 2 */
#define VADC_G3REFLAG	(*( VADC_G0REFLAG_type *) 0xf0021184u)	/* Result Event Flag Register, Group 3 */
#define VADC_G4REFLAG	(*( VADC_G0REFLAG_type *) 0xf0021584u)	/* Result Event Flag Register, Group 4 */
#define VADC_G5REFLAG	(*( VADC_G0REFLAG_type *) 0xf0021984u)	/* Result Event Flag Register, Group 5 */
#define VADC_G6REFLAG	(*( VADC_G0REFLAG_type *) 0xf0021d84u)	/* Result Event Flag Register, Group 6 */
#define VADC_G7REFLAG	(*( VADC_G0REFLAG_type *) 0xf0022184u)	/* Result Event Flag Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int RESULT         : 16;	/* Result of Most Recent Conversion */
		/* const */ unsigned int DRC            : 4;	/* Data Reduction Counter */
		/* const */ unsigned int CHNR           : 5;	/* Channel Number */
		/* const */ unsigned int EMUX           : 3;	/* External Multiplexer Setting */
		/* const */ unsigned int CRS            : 2;	/* Converted Request Source */
		/* const */ unsigned int FCR            : 1;	/* Fast Compare Result */
		/* const */ unsigned int VF             : 1;	/* Valid Flag */
	} B;
	int I;
	unsigned int U;

} VADC_G0RES0_type;
#define VADC_G0RES0	(*( VADC_G0RES0_type *) 0xf0020700u)	/* Group 0 Result Register 0 */
#define VADC_G0RES1	(*( VADC_G0RES0_type *) 0xf0020704u)	/* Group 0 Result Register 1 */
#define VADC_G0RES10	(*( VADC_G0RES0_type *) 0xf0020728u)	/* Group 0 Result Register 10 */
#define VADC_G0RES11	(*( VADC_G0RES0_type *) 0xf002072cu)	/* Group 0 Result Register 11 */
#define VADC_G0RES12	(*( VADC_G0RES0_type *) 0xf0020730u)	/* Group 0 Result Register 12 */
#define VADC_G0RES13	(*( VADC_G0RES0_type *) 0xf0020734u)	/* Group 0 Result Register 13 */
#define VADC_G0RES14	(*( VADC_G0RES0_type *) 0xf0020738u)	/* Group 0 Result Register 14 */
#define VADC_G0RES15	(*( VADC_G0RES0_type *) 0xf002073cu)	/* Group 0 Result Register 15 */
#define VADC_G0RES2	(*( VADC_G0RES0_type *) 0xf0020708u)	/* Group 0 Result Register 2 */
#define VADC_G0RES3	(*( VADC_G0RES0_type *) 0xf002070cu)	/* Group 0 Result Register 3 */
#define VADC_G0RES4	(*( VADC_G0RES0_type *) 0xf0020710u)	/* Group 0 Result Register 4 */
#define VADC_G0RES5	(*( VADC_G0RES0_type *) 0xf0020714u)	/* Group 0 Result Register 5 */
#define VADC_G0RES6	(*( VADC_G0RES0_type *) 0xf0020718u)	/* Group 0 Result Register 6 */
#define VADC_G0RES7	(*( VADC_G0RES0_type *) 0xf002071cu)	/* Group 0 Result Register 7 */
#define VADC_G0RES8	(*( VADC_G0RES0_type *) 0xf0020720u)	/* Group 0 Result Register 8 */
#define VADC_G0RES9	(*( VADC_G0RES0_type *) 0xf0020724u)	/* Group 0 Result Register 9 */
#define VADC_G1RES0	(*( VADC_G0RES0_type *) 0xf0020b00u)	/* Group 1 Result Register 0 */
#define VADC_G1RES1	(*( VADC_G0RES0_type *) 0xf0020b04u)	/* Group 1 Result Register 1 */
#define VADC_G1RES10	(*( VADC_G0RES0_type *) 0xf0020b28u)	/* Group 1 Result Register 10 */
#define VADC_G1RES11	(*( VADC_G0RES0_type *) 0xf0020b2cu)	/* Group 1 Result Register 11 */
#define VADC_G1RES12	(*( VADC_G0RES0_type *) 0xf0020b30u)	/* Group 1 Result Register 12 */
#define VADC_G1RES13	(*( VADC_G0RES0_type *) 0xf0020b34u)	/* Group 1 Result Register 13 */
#define VADC_G1RES14	(*( VADC_G0RES0_type *) 0xf0020b38u)	/* Group 1 Result Register 14 */
#define VADC_G1RES15	(*( VADC_G0RES0_type *) 0xf0020b3cu)	/* Group 1 Result Register 15 */
#define VADC_G1RES2	(*( VADC_G0RES0_type *) 0xf0020b08u)	/* Group 1 Result Register 2 */
#define VADC_G1RES3	(*( VADC_G0RES0_type *) 0xf0020b0cu)	/* Group 1 Result Register 3 */
#define VADC_G1RES4	(*( VADC_G0RES0_type *) 0xf0020b10u)	/* Group 1 Result Register 4 */
#define VADC_G1RES5	(*( VADC_G0RES0_type *) 0xf0020b14u)	/* Group 1 Result Register 5 */
#define VADC_G1RES6	(*( VADC_G0RES0_type *) 0xf0020b18u)	/* Group 1 Result Register 6 */
#define VADC_G1RES7	(*( VADC_G0RES0_type *) 0xf0020b1cu)	/* Group 1 Result Register 7 */
#define VADC_G1RES8	(*( VADC_G0RES0_type *) 0xf0020b20u)	/* Group 1 Result Register 8 */
#define VADC_G1RES9	(*( VADC_G0RES0_type *) 0xf0020b24u)	/* Group 1 Result Register 9 */
#define VADC_G2RES0	(*( VADC_G0RES0_type *) 0xf0020f00u)	/* Group 2 Result Register 0 */
#define VADC_G2RES1	(*( VADC_G0RES0_type *) 0xf0020f04u)	/* Group 2 Result Register 1 */
#define VADC_G2RES10	(*( VADC_G0RES0_type *) 0xf0020f28u)	/* Group 2 Result Register 10 */
#define VADC_G2RES11	(*( VADC_G0RES0_type *) 0xf0020f2cu)	/* Group 2 Result Register 11 */
#define VADC_G2RES12	(*( VADC_G0RES0_type *) 0xf0020f30u)	/* Group 2 Result Register 12 */
#define VADC_G2RES13	(*( VADC_G0RES0_type *) 0xf0020f34u)	/* Group 2 Result Register 13 */
#define VADC_G2RES14	(*( VADC_G0RES0_type *) 0xf0020f38u)	/* Group 2 Result Register 14 */
#define VADC_G2RES15	(*( VADC_G0RES0_type *) 0xf0020f3cu)	/* Group 2 Result Register 15 */
#define VADC_G2RES2	(*( VADC_G0RES0_type *) 0xf0020f08u)	/* Group 2 Result Register 2 */
#define VADC_G2RES3	(*( VADC_G0RES0_type *) 0xf0020f0cu)	/* Group 2 Result Register 3 */
#define VADC_G2RES4	(*( VADC_G0RES0_type *) 0xf0020f10u)	/* Group 2 Result Register 4 */
#define VADC_G2RES5	(*( VADC_G0RES0_type *) 0xf0020f14u)	/* Group 2 Result Register 5 */
#define VADC_G2RES6	(*( VADC_G0RES0_type *) 0xf0020f18u)	/* Group 2 Result Register 6 */
#define VADC_G2RES7	(*( VADC_G0RES0_type *) 0xf0020f1cu)	/* Group 2 Result Register 7 */
#define VADC_G2RES8	(*( VADC_G0RES0_type *) 0xf0020f20u)	/* Group 2 Result Register 8 */
#define VADC_G2RES9	(*( VADC_G0RES0_type *) 0xf0020f24u)	/* Group 2 Result Register 9 */
#define VADC_G3RES0	(*( VADC_G0RES0_type *) 0xf0021300u)	/* Group 3 Result Register 0 */
#define VADC_G3RES1	(*( VADC_G0RES0_type *) 0xf0021304u)	/* Group 3 Result Register 1 */
#define VADC_G3RES10	(*( VADC_G0RES0_type *) 0xf0021328u)	/* Group 3 Result Register 10 */
#define VADC_G3RES11	(*( VADC_G0RES0_type *) 0xf002132cu)	/* Group 3 Result Register 11 */
#define VADC_G3RES12	(*( VADC_G0RES0_type *) 0xf0021330u)	/* Group 3 Result Register 12 */
#define VADC_G3RES13	(*( VADC_G0RES0_type *) 0xf0021334u)	/* Group 3 Result Register 13 */
#define VADC_G3RES14	(*( VADC_G0RES0_type *) 0xf0021338u)	/* Group 3 Result Register 14 */
#define VADC_G3RES15	(*( VADC_G0RES0_type *) 0xf002133cu)	/* Group 3 Result Register 15 */
#define VADC_G3RES2	(*( VADC_G0RES0_type *) 0xf0021308u)	/* Group 3 Result Register 2 */
#define VADC_G3RES3	(*( VADC_G0RES0_type *) 0xf002130cu)	/* Group 3 Result Register 3 */
#define VADC_G3RES4	(*( VADC_G0RES0_type *) 0xf0021310u)	/* Group 3 Result Register 4 */
#define VADC_G3RES5	(*( VADC_G0RES0_type *) 0xf0021314u)	/* Group 3 Result Register 5 */
#define VADC_G3RES6	(*( VADC_G0RES0_type *) 0xf0021318u)	/* Group 3 Result Register 6 */
#define VADC_G3RES7	(*( VADC_G0RES0_type *) 0xf002131cu)	/* Group 3 Result Register 7 */
#define VADC_G3RES8	(*( VADC_G0RES0_type *) 0xf0021320u)	/* Group 3 Result Register 8 */
#define VADC_G3RES9	(*( VADC_G0RES0_type *) 0xf0021324u)	/* Group 3 Result Register 9 */
#define VADC_G4RES0	(*( VADC_G0RES0_type *) 0xf0021700u)	/* Group 4 Result Register 0 */
#define VADC_G4RES1	(*( VADC_G0RES0_type *) 0xf0021704u)	/* Group 4 Result Register 1 */
#define VADC_G4RES10	(*( VADC_G0RES0_type *) 0xf0021728u)	/* Group 4 Result Register 10 */
#define VADC_G4RES11	(*( VADC_G0RES0_type *) 0xf002172cu)	/* Group 4 Result Register 11 */
#define VADC_G4RES12	(*( VADC_G0RES0_type *) 0xf0021730u)	/* Group 4 Result Register 12 */
#define VADC_G4RES13	(*( VADC_G0RES0_type *) 0xf0021734u)	/* Group 4 Result Register 13 */
#define VADC_G4RES14	(*( VADC_G0RES0_type *) 0xf0021738u)	/* Group 4 Result Register 14 */
#define VADC_G4RES15	(*( VADC_G0RES0_type *) 0xf002173cu)	/* Group 4 Result Register 15 */
#define VADC_G4RES2	(*( VADC_G0RES0_type *) 0xf0021708u)	/* Group 4 Result Register 2 */
#define VADC_G4RES3	(*( VADC_G0RES0_type *) 0xf002170cu)	/* Group 4 Result Register 3 */
#define VADC_G4RES4	(*( VADC_G0RES0_type *) 0xf0021710u)	/* Group 4 Result Register 4 */
#define VADC_G4RES5	(*( VADC_G0RES0_type *) 0xf0021714u)	/* Group 4 Result Register 5 */
#define VADC_G4RES6	(*( VADC_G0RES0_type *) 0xf0021718u)	/* Group 4 Result Register 6 */
#define VADC_G4RES7	(*( VADC_G0RES0_type *) 0xf002171cu)	/* Group 4 Result Register 7 */
#define VADC_G4RES8	(*( VADC_G0RES0_type *) 0xf0021720u)	/* Group 4 Result Register 8 */
#define VADC_G4RES9	(*( VADC_G0RES0_type *) 0xf0021724u)	/* Group 4 Result Register 9 */
#define VADC_G5RES0	(*( VADC_G0RES0_type *) 0xf0021b00u)	/* Group 5 Result Register 0 */
#define VADC_G5RES1	(*( VADC_G0RES0_type *) 0xf0021b04u)	/* Group 5 Result Register 1 */
#define VADC_G5RES10	(*( VADC_G0RES0_type *) 0xf0021b28u)	/* Group 5 Result Register 10 */
#define VADC_G5RES11	(*( VADC_G0RES0_type *) 0xf0021b2cu)	/* Group 5 Result Register 11 */
#define VADC_G5RES12	(*( VADC_G0RES0_type *) 0xf0021b30u)	/* Group 5 Result Register 12 */
#define VADC_G5RES13	(*( VADC_G0RES0_type *) 0xf0021b34u)	/* Group 5 Result Register 13 */
#define VADC_G5RES14	(*( VADC_G0RES0_type *) 0xf0021b38u)	/* Group 5 Result Register 14 */
#define VADC_G5RES15	(*( VADC_G0RES0_type *) 0xf0021b3cu)	/* Group 5 Result Register 15 */
#define VADC_G5RES2	(*( VADC_G0RES0_type *) 0xf0021b08u)	/* Group 5 Result Register 2 */
#define VADC_G5RES3	(*( VADC_G0RES0_type *) 0xf0021b0cu)	/* Group 5 Result Register 3 */
#define VADC_G5RES4	(*( VADC_G0RES0_type *) 0xf0021b10u)	/* Group 5 Result Register 4 */
#define VADC_G5RES5	(*( VADC_G0RES0_type *) 0xf0021b14u)	/* Group 5 Result Register 5 */
#define VADC_G5RES6	(*( VADC_G0RES0_type *) 0xf0021b18u)	/* Group 5 Result Register 6 */
#define VADC_G5RES7	(*( VADC_G0RES0_type *) 0xf0021b1cu)	/* Group 5 Result Register 7 */
#define VADC_G5RES8	(*( VADC_G0RES0_type *) 0xf0021b20u)	/* Group 5 Result Register 8 */
#define VADC_G5RES9	(*( VADC_G0RES0_type *) 0xf0021b24u)	/* Group 5 Result Register 9 */
#define VADC_G6RES0	(*( VADC_G0RES0_type *) 0xf0021f00u)	/* Group 6 Result Register 0 */
#define VADC_G6RES1	(*( VADC_G0RES0_type *) 0xf0021f04u)	/* Group 6 Result Register 1 */
#define VADC_G6RES10	(*( VADC_G0RES0_type *) 0xf0021f28u)	/* Group 6 Result Register 10 */
#define VADC_G6RES11	(*( VADC_G0RES0_type *) 0xf0021f2cu)	/* Group 6 Result Register 11 */
#define VADC_G6RES12	(*( VADC_G0RES0_type *) 0xf0021f30u)	/* Group 6 Result Register 12 */
#define VADC_G6RES13	(*( VADC_G0RES0_type *) 0xf0021f34u)	/* Group 6 Result Register 13 */
#define VADC_G6RES14	(*( VADC_G0RES0_type *) 0xf0021f38u)	/* Group 6 Result Register 14 */
#define VADC_G6RES15	(*( VADC_G0RES0_type *) 0xf0021f3cu)	/* Group 6 Result Register 15 */
#define VADC_G6RES2	(*( VADC_G0RES0_type *) 0xf0021f08u)	/* Group 6 Result Register 2 */
#define VADC_G6RES3	(*( VADC_G0RES0_type *) 0xf0021f0cu)	/* Group 6 Result Register 3 */
#define VADC_G6RES4	(*( VADC_G0RES0_type *) 0xf0021f10u)	/* Group 6 Result Register 4 */
#define VADC_G6RES5	(*( VADC_G0RES0_type *) 0xf0021f14u)	/* Group 6 Result Register 5 */
#define VADC_G6RES6	(*( VADC_G0RES0_type *) 0xf0021f18u)	/* Group 6 Result Register 6 */
#define VADC_G6RES7	(*( VADC_G0RES0_type *) 0xf0021f1cu)	/* Group 6 Result Register 7 */
#define VADC_G6RES8	(*( VADC_G0RES0_type *) 0xf0021f20u)	/* Group 6 Result Register 8 */
#define VADC_G6RES9	(*( VADC_G0RES0_type *) 0xf0021f24u)	/* Group 6 Result Register 9 */
#define VADC_G7RES0	(*( VADC_G0RES0_type *) 0xf0022300u)	/* Group 7 Result Register 0 */
#define VADC_G7RES1	(*( VADC_G0RES0_type *) 0xf0022304u)	/* Group 7 Result Register 1 */
#define VADC_G7RES10	(*( VADC_G0RES0_type *) 0xf0022328u)	/* Group 7 Result Register 10 */
#define VADC_G7RES11	(*( VADC_G0RES0_type *) 0xf002232cu)	/* Group 7 Result Register 11 */
#define VADC_G7RES12	(*( VADC_G0RES0_type *) 0xf0022330u)	/* Group 7 Result Register 12 */
#define VADC_G7RES13	(*( VADC_G0RES0_type *) 0xf0022334u)	/* Group 7 Result Register 13 */
#define VADC_G7RES14	(*( VADC_G0RES0_type *) 0xf0022338u)	/* Group 7 Result Register 14 */
#define VADC_G7RES15	(*( VADC_G0RES0_type *) 0xf002233cu)	/* Group 7 Result Register 15 */
#define VADC_G7RES2	(*( VADC_G0RES0_type *) 0xf0022308u)	/* Group 7 Result Register 2 */
#define VADC_G7RES3	(*( VADC_G0RES0_type *) 0xf002230cu)	/* Group 7 Result Register 3 */
#define VADC_G7RES4	(*( VADC_G0RES0_type *) 0xf0022310u)	/* Group 7 Result Register 4 */
#define VADC_G7RES5	(*( VADC_G0RES0_type *) 0xf0022314u)	/* Group 7 Result Register 5 */
#define VADC_G7RES6	(*( VADC_G0RES0_type *) 0xf0022318u)	/* Group 7 Result Register 6 */
#define VADC_G7RES7	(*( VADC_G0RES0_type *) 0xf002231cu)	/* Group 7 Result Register 7 */
#define VADC_G7RES8	(*( VADC_G0RES0_type *) 0xf0022320u)	/* Group 7 Result Register 8 */
#define VADC_G7RES9	(*( VADC_G0RES0_type *) 0xf0022324u)	/* Group 7 Result Register 9 */

