svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESULT         : 16;	/* Result of Most Recent Conversion */
		/* const */ unsigned int DRC            : 4;	/* Data Reduction Counter */
		/* const */ unsigned int CHNR           : 5;	/* Channel Number */
		/* const */ unsigned int EMUX           : 3;	/* External Multiplexer Setting */
		/* const */ unsigned int CRS            : 2;	/* Converted Request Source */
		/* const */ unsigned int FCR            : 1;	/* Fast Compare Result */
		/* const */ unsigned int VF             : 1;	/* Valid Flag */
	} B;
	int I;
	unsigned int U;

} VADC_G0RESD0_type;
#define VADC_G0RESD0	(*( VADC_G0RESD0_type *) 0xf0020780u)	/* Group 0 Result Reg. 0, Debug */
#define VADC_G0RESD1	(*( VADC_G0RESD0_type *) 0xf0020784u)	/* Group 0 Result Reg. 1, Debug */
#define VADC_G0RESD10	(*( VADC_G0RESD0_type *) 0xf00207a8u)	/* Group 0 Result Reg. 10, Debug */
#define VADC_G0RESD11	(*( VADC_G0RESD0_type *) 0xf00207acu)	/* Group 0 Result Reg. 11, Debug */
#define VADC_G0RESD12	(*( VADC_G0RESD0_type *) 0xf00207b0u)	/* Group 0 Result Reg. 12, Debug */
#define VADC_G0RESD13	(*( VADC_G0RESD0_type *) 0xf00207b4u)	/* Group 0 Result Reg. 13, Debug */
#define VADC_G0RESD14	(*( VADC_G0RESD0_type *) 0xf00207b8u)	/* Group 0 Result Reg. 14, Debug */
#define VADC_G0RESD15	(*( VADC_G0RESD0_type *) 0xf00207bcu)	/* Group 0 Result Reg. 15, Debug */
#define VADC_G0RESD2	(*( VADC_G0RESD0_type *) 0xf0020788u)	/* Group 0 Result Reg. 2, Debug */
#define VADC_G0RESD3	(*( VADC_G0RESD0_type *) 0xf002078cu)	/* Group 0 Result Reg. 3, Debug */
#define VADC_G0RESD4	(*( VADC_G0RESD0_type *) 0xf0020790u)	/* Group 0 Result Reg. 4, Debug */
#define VADC_G0RESD5	(*( VADC_G0RESD0_type *) 0xf0020794u)	/* Group 0 Result Reg. 5, Debug */
#define VADC_G0RESD6	(*( VADC_G0RESD0_type *) 0xf0020798u)	/* Group 0 Result Reg. 6, Debug */
#define VADC_G0RESD7	(*( VADC_G0RESD0_type *) 0xf002079cu)	/* Group 0 Result Reg. 7, Debug */
#define VADC_G0RESD8	(*( VADC_G0RESD0_type *) 0xf00207a0u)	/* Group 0 Result Reg. 8, Debug */
#define VADC_G0RESD9	(*( VADC_G0RESD0_type *) 0xf00207a4u)	/* Group 0 Result Reg. 9, Debug */
#define VADC_G1RESD0	(*( VADC_G0RESD0_type *) 0xf0020b80u)	/* Group 1 Result Reg. 0, Debug */
#define VADC_G1RESD1	(*( VADC_G0RESD0_type *) 0xf0020b84u)	/* Group 1 Result Reg. 1, Debug */
#define VADC_G1RESD10	(*( VADC_G0RESD0_type *) 0xf0020ba8u)	/* Group 1 Result Reg. 10, Debug */
#define VADC_G1RESD11	(*( VADC_G0RESD0_type *) 0xf0020bacu)	/* Group 1 Result Reg. 11, Debug */
#define VADC_G1RESD12	(*( VADC_G0RESD0_type *) 0xf0020bb0u)	/* Group 1 Result Reg. 12, Debug */
#define VADC_G1RESD13	(*( VADC_G0RESD0_type *) 0xf0020bb4u)	/* Group 1 Result Reg. 13, Debug */
#define VADC_G1RESD14	(*( VADC_G0RESD0_type *) 0xf0020bb8u)	/* Group 1 Result Reg. 14, Debug */
#define VADC_G1RESD15	(*( VADC_G0RESD0_type *) 0xf0020bbcu)	/* Group 1 Result Reg. 15, Debug */
#define VADC_G1RESD2	(*( VADC_G0RESD0_type *) 0xf0020b88u)	/* Group 1 Result Reg. 2, Debug */
#define VADC_G1RESD3	(*( VADC_G0RESD0_type *) 0xf0020b8cu)	/* Group 1 Result Reg. 3, Debug */
#define VADC_G1RESD4	(*( VADC_G0RESD0_type *) 0xf0020b90u)	/* Group 1 Result Reg. 4, Debug */
#define VADC_G1RESD5	(*( VADC_G0RESD0_type *) 0xf0020b94u)	/* Group 1 Result Reg. 5, Debug */
#define VADC_G1RESD6	(*( VADC_G0RESD0_type *) 0xf0020b98u)	/* Group 1 Result Reg. 6, Debug */
#define VADC_G1RESD7	(*( VADC_G0RESD0_type *) 0xf0020b9cu)	/* Group 1 Result Reg. 7, Debug */
#define VADC_G1RESD8	(*( VADC_G0RESD0_type *) 0xf0020ba0u)	/* Group 1 Result Reg. 8, Debug */
#define VADC_G1RESD9	(*( VADC_G0RESD0_type *) 0xf0020ba4u)	/* Group 1 Result Reg. 9, Debug */
#define VADC_G2RESD0	(*( VADC_G0RESD0_type *) 0xf0020f80u)	/* Group 2 Result Reg. 0, Debug */
#define VADC_G2RESD1	(*( VADC_G0RESD0_type *) 0xf0020f84u)	/* Group 2 Result Reg. 1, Debug */
#define VADC_G2RESD10	(*( VADC_G0RESD0_type *) 0xf0020fa8u)	/* Group 2 Result Reg. 10, Debug */
#define VADC_G2RESD11	(*( VADC_G0RESD0_type *) 0xf0020facu)	/* Group 2 Result Reg. 11, Debug */
#define VADC_G2RESD12	(*( VADC_G0RESD0_type *) 0xf0020fb0u)	/* Group 2 Result Reg. 12, Debug */
#define VADC_G2RESD13	(*( VADC_G0RESD0_type *) 0xf0020fb4u)	/* Group 2 Result Reg. 13, Debug */
#define VADC_G2RESD14	(*( VADC_G0RESD0_type *) 0xf0020fb8u)	/* Group 2 Result Reg. 14, Debug */
#define VADC_G2RESD15	(*( VADC_G0RESD0_type *) 0xf0020fbcu)	/* Group 2 Result Reg. 15, Debug */
#define VADC_G2RESD2	(*( VADC_G0RESD0_type *) 0xf0020f88u)	/* Group 2 Result Reg. 2, Debug */
#define VADC_G2RESD3	(*( VADC_G0RESD0_type *) 0xf0020f8cu)	/* Group 2 Result Reg. 3, Debug */
#define VADC_G2RESD4	(*( VADC_G0RESD0_type *) 0xf0020f90u)	/* Group 2 Result Reg. 4, Debug */
#define VADC_G2RESD5	(*( VADC_G0RESD0_type *) 0xf0020f94u)	/* Group 2 Result Reg. 5, Debug */
#define VADC_G2RESD6	(*( VADC_G0RESD0_type *) 0xf0020f98u)	/* Group 2 Result Reg. 6, Debug */
#define VADC_G2RESD7	(*( VADC_G0RESD0_type *) 0xf0020f9cu)	/* Group 2 Result Reg. 7, Debug */
#define VADC_G2RESD8	(*( VADC_G0RESD0_type *) 0xf0020fa0u)	/* Group 2 Result Reg. 8, Debug */
#define VADC_G2RESD9	(*( VADC_G0RESD0_type *) 0xf0020fa4u)	/* Group 2 Result Reg. 9, Debug */
#define VADC_G3RESD0	(*( VADC_G0RESD0_type *) 0xf0021380u)	/* Group 3 Result Reg. 0, Debug */
#define VADC_G3RESD1	(*( VADC_G0RESD0_type *) 0xf0021384u)	/* Group 3 Result Reg. 1, Debug */
#define VADC_G3RESD10	(*( VADC_G0RESD0_type *) 0xf00213a8u)	/* Group 3 Result Reg. 10, Debug */
#define VADC_G3RESD11	(*( VADC_G0RESD0_type *) 0xf00213acu)	/* Group 3 Result Reg. 11, Debug */
#define VADC_G3RESD12	(*( VADC_G0RESD0_type *) 0xf00213b0u)	/* Group 3 Result Reg. 12, Debug */
#define VADC_G3RESD13	(*( VADC_G0RESD0_type *) 0xf00213b4u)	/* Group 3 Result Reg. 13, Debug */
#define VADC_G3RESD14	(*( VADC_G0RESD0_type *) 0xf00213b8u)	/* Group 3 Result Reg. 14, Debug */
#define VADC_G3RESD15	(*( VADC_G0RESD0_type *) 0xf00213bcu)	/* Group 3 Result Reg. 15, Debug */
#define VADC_G3RESD2	(*( VADC_G0RESD0_type *) 0xf0021388u)	/* Group 3 Result Reg. 2, Debug */
#define VADC_G3RESD3	(*( VADC_G0RESD0_type *) 0xf002138cu)	/* Group 3 Result Reg. 3, Debug */
#define VADC_G3RESD4	(*( VADC_G0RESD0_type *) 0xf0021390u)	/* Group 3 Result Reg. 4, Debug */
#define VADC_G3RESD5	(*( VADC_G0RESD0_type *) 0xf0021394u)	/* Group 3 Result Reg. 5, Debug */
#define VADC_G3RESD6	(*( VADC_G0RESD0_type *) 0xf0021398u)	/* Group 3 Result Reg. 6, Debug */
#define VADC_G3RESD7	(*( VADC_G0RESD0_type *) 0xf002139cu)	/* Group 3 Result Reg. 7, Debug */
#define VADC_G3RESD8	(*( VADC_G0RESD0_type *) 0xf00213a0u)	/* Group 3 Result Reg. 8, Debug */
#define VADC_G3RESD9	(*( VADC_G0RESD0_type *) 0xf00213a4u)	/* Group 3 Result Reg. 9, Debug */
#define VADC_G4RESD0	(*( VADC_G0RESD0_type *) 0xf0021780u)	/* Group 4 Result Reg. 0, Debug */
#define VADC_G4RESD1	(*( VADC_G0RESD0_type *) 0xf0021784u)	/* Group 4 Result Reg. 1, Debug */
#define VADC_G4RESD10	(*( VADC_G0RESD0_type *) 0xf00217a8u)	/* Group 4 Result Reg. 10, Debug */
#define VADC_G4RESD11	(*( VADC_G0RESD0_type *) 0xf00217acu)	/* Group 4 Result Reg. 11, Debug */
#define VADC_G4RESD12	(*( VADC_G0RESD0_type *) 0xf00217b0u)	/* Group 4 Result Reg. 12, Debug */
#define VADC_G4RESD13	(*( VADC_G0RESD0_type *) 0xf00217b4u)	/* Group 4 Result Reg. 13, Debug */
#define VADC_G4RESD14	(*( VADC_G0RESD0_type *) 0xf00217b8u)	/* Group 4 Result Reg. 14, Debug */
#define VADC_G4RESD15	(*( VADC_G0RESD0_type *) 0xf00217bcu)	/* Group 4 Result Reg. 15, Debug */
#define VADC_G4RESD2	(*( VADC_G0RESD0_type *) 0xf0021788u)	/* Group 4 Result Reg. 2, Debug */
#define VADC_G4RESD3	(*( VADC_G0RESD0_type *) 0xf002178cu)	/* Group 4 Result Reg. 3, Debug */
#define VADC_G4RESD4	(*( VADC_G0RESD0_type *) 0xf0021790u)	/* Group 4 Result Reg. 4, Debug */
#define VADC_G4RESD5	(*( VADC_G0RESD0_type *) 0xf0021794u)	/* Group 4 Result Reg. 5, Debug */
#define VADC_G4RESD6	(*( VADC_G0RESD0_type *) 0xf0021798u)	/* Group 4 Result Reg. 6, Debug */
#define VADC_G4RESD7	(*( VADC_G0RESD0_type *) 0xf002179cu)	/* Group 4 Result Reg. 7, Debug */
#define VADC_G4RESD8	(*( VADC_G0RESD0_type *) 0xf00217a0u)	/* Group 4 Result Reg. 8, Debug */
#define VADC_G4RESD9	(*( VADC_G0RESD0_type *) 0xf00217a4u)	/* Group 4 Result Reg. 9, Debug */
#define VADC_G5RESD0	(*( VADC_G0RESD0_type *) 0xf0021b80u)	/* Group 5 Result Reg. 0, Debug */
#define VADC_G5RESD1	(*( VADC_G0RESD0_type *) 0xf0021b84u)	/* Group 5 Result Reg. 1, Debug */
#define VADC_G5RESD10	(*( VADC_G0RESD0_type *) 0xf0021ba8u)	/* Group 5 Result Reg. 10, Debug */
#define VADC_G5RESD11	(*( VADC_G0RESD0_type *) 0xf0021bacu)	/* Group 5 Result Reg. 11, Debug */
#define VADC_G5RESD12	(*( VADC_G0RESD0_type *) 0xf0021bb0u)	/* Group 5 Result Reg. 12, Debug */
#define VADC_G5RESD13	(*( VADC_G0RESD0_type *) 0xf0021bb4u)	/* Group 5 Result Reg. 13, Debug */
#define VADC_G5RESD14	(*( VADC_G0RESD0_type *) 0xf0021bb8u)	/* Group 5 Result Reg. 14, Debug */
#define VADC_G5RESD15	(*( VADC_G0RESD0_type *) 0xf0021bbcu)	/* Group 5 Result Reg. 15, Debug */
#define VADC_G5RESD2	(*( VADC_G0RESD0_type *) 0xf0021b88u)	/* Group 5 Result Reg. 2, Debug */
#define VADC_G5RESD3	(*( VADC_G0RESD0_type *) 0xf0021b8cu)	/* Group 5 Result Reg. 3, Debug */
#define VADC_G5RESD4	(*( VADC_G0RESD0_type *) 0xf0021b90u)	/* Group 5 Result Reg. 4, Debug */
#define VADC_G5RESD5	(*( VADC_G0RESD0_type *) 0xf0021b94u)	/* Group 5 Result Reg. 5, Debug */
#define VADC_G5RESD6	(*( VADC_G0RESD0_type *) 0xf0021b98u)	/* Group 5 Result Reg. 6, Debug */
#define VADC_G5RESD7	(*( VADC_G0RESD0_type *) 0xf0021b9cu)	/* Group 5 Result Reg. 7, Debug */
#define VADC_G5RESD8	(*( VADC_G0RESD0_type *) 0xf0021ba0u)	/* Group 5 Result Reg. 8, Debug */
#define VADC_G5RESD9	(*( VADC_G0RESD0_type *) 0xf0021ba4u)	/* Group 5 Result Reg. 9, Debug */
#define VADC_G6RESD0	(*( VADC_G0RESD0_type *) 0xf0021f80u)	/* Group 6 Result Reg. 0, Debug */
#define VADC_G6RESD1	(*( VADC_G0RESD0_type *) 0xf0021f84u)	/* Group 6 Result Reg. 1, Debug */
#define VADC_G6RESD10	(*( VADC_G0RESD0_type *) 0xf0021fa8u)	/* Group 6 Result Reg. 10, Debug */
#define VADC_G6RESD11	(*( VADC_G0RESD0_type *) 0xf0021facu)	/* Group 6 Result Reg. 11, Debug */
#define VADC_G6RESD12	(*( VADC_G0RESD0_type *) 0xf0021fb0u)	/* Group 6 Result Reg. 12, Debug */
#define VADC_G6RESD13	(*( VADC_G0RESD0_type *) 0xf0021fb4u)	/* Group 6 Result Reg. 13, Debug */
#define VADC_G6RESD14	(*( VADC_G0RESD0_type *) 0xf0021fb8u)	/* Group 6 Result Reg. 14, Debug */
#define VADC_G6RESD15	(*( VADC_G0RESD0_type *) 0xf0021fbcu)	/* Group 6 Result Reg. 15, Debug */
#define VADC_G6RESD2	(*( VADC_G0RESD0_type *) 0xf0021f88u)	/* Group 6 Result Reg. 2, Debug */
#define VADC_G6RESD3	(*( VADC_G0RESD0_type *) 0xf0021f8cu)	/* Group 6 Result Reg. 3, Debug */
#define VADC_G6RESD4	(*( VADC_G0RESD0_type *) 0xf0021f90u)	/* Group 6 Result Reg. 4, Debug */
#define VADC_G6RESD5	(*( VADC_G0RESD0_type *) 0xf0021f94u)	/* Group 6 Result Reg. 5, Debug */
#define VADC_G6RESD6	(*( VADC_G0RESD0_type *) 0xf0021f98u)	/* Group 6 Result Reg. 6, Debug */
#define VADC_G6RESD7	(*( VADC_G0RESD0_type *) 0xf0021f9cu)	/* Group 6 Result Reg. 7, Debug */
#define VADC_G6RESD8	(*( VADC_G0RESD0_type *) 0xf0021fa0u)	/* Group 6 Result Reg. 8, Debug */
#define VADC_G6RESD9	(*( VADC_G0RESD0_type *) 0xf0021fa4u)	/* Group 6 Result Reg. 9, Debug */
#define VADC_G7RESD0	(*( VADC_G0RESD0_type *) 0xf0022380u)	/* Group 7 Result Reg. 0, Debug */
#define VADC_G7RESD1	(*( VADC_G0RESD0_type *) 0xf0022384u)	/* Group 7 Result Reg. 1, Debug */
#define VADC_G7RESD10	(*( VADC_G0RESD0_type *) 0xf00223a8u)	/* Group 7 Result Reg. 10, Debug */
#define VADC_G7RESD11	(*( VADC_G0RESD0_type *) 0xf00223acu)	/* Group 7 Result Reg. 11, Debug */
#define VADC_G7RESD12	(*( VADC_G0RESD0_type *) 0xf00223b0u)	/* Group 7 Result Reg. 12, Debug */
#define VADC_G7RESD13	(*( VADC_G0RESD0_type *) 0xf00223b4u)	/* Group 7 Result Reg. 13, Debug */
#define VADC_G7RESD14	(*( VADC_G0RESD0_type *) 0xf00223b8u)	/* Group 7 Result Reg. 14, Debug */
#define VADC_G7RESD15	(*( VADC_G0RESD0_type *) 0xf00223bcu)	/* Group 7 Result Reg. 15, Debug */
#define VADC_G7RESD2	(*( VADC_G0RESD0_type *) 0xf0022388u)	/* Group 7 Result Reg. 2, Debug */
#define VADC_G7RESD3	(*( VADC_G0RESD0_type *) 0xf002238cu)	/* Group 7 Result Reg. 3, Debug */
#define VADC_G7RESD4	(*( VADC_G0RESD0_type *) 0xf0022390u)	/* Group 7 Result Reg. 4, Debug */
#define VADC_G7RESD5	(*( VADC_G0RESD0_type *) 0xf0022394u)	/* Group 7 Result Reg. 5, Debug */
#define VADC_G7RESD6	(*( VADC_G0RESD0_type *) 0xf0022398u)	/* Group 7 Result Reg. 6, Debug */
#define VADC_G7RESD7	(*( VADC_G0RESD0_type *) 0xf002239cu)	/* Group 7 Result Reg. 7, Debug */
#define VADC_G7RESD8	(*( VADC_G0RESD0_type *) 0xf00223a0u)	/* Group 7 Result Reg. 8, Debug */
#define VADC_G7RESD9	(*( VADC_G0RESD0_type *) 0xf00223a4u)	/* Group 7 Result Reg. 9, Debug */

