svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int REV0NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV1NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV2NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV3NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV4NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV5NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV6NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV7NP         : 4;	/* Service Request Node Pointer Result Event i */
	} B;
	int I;
	unsigned int U;

} VADC_G0REVNP0_type;
#define VADC_G0REVNP0	(*( VADC_G0REVNP0_type *) 0xf00205b0u)	/* Result Event Node Pointer Register 0, Group 0 */
#define VADC_G1REVNP0	(*( VADC_G0REVNP0_type *) 0xf00209b0u)	/* Result Event Node Pointer Register 0, Group 1 */
#define VADC_G2REVNP0	(*( VADC_G0REVNP0_type *) 0xf0020db0u)	/* Result Event Node Pointer Register 0, Group 2 */
#define VADC_G3REVNP0	(*( VADC_G0REVNP0_type *) 0xf00211b0u)	/* Result Event Node Pointer Register 0, Group 3 */
#define VADC_G4REVNP0	(*( VADC_G0REVNP0_type *) 0xf00215b0u)	/* Result Event Node Pointer Register 0, Group 4 */
#define VADC_G5REVNP0	(*( VADC_G0REVNP0_type *) 0xf00219b0u)	/* Result Event Node Pointer Register 0, Group 5 */
#define VADC_G6REVNP0	(*( VADC_G0REVNP0_type *) 0xf0021db0u)	/* Result Event Node Pointer Register 0, Group 6 */
#define VADC_G7REVNP0	(*( VADC_G0REVNP0_type *) 0xf00221b0u)	/* Result Event Node Pointer Register 0, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int REV8NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV9NP         : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV10NP        : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV11NP        : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV12NP        : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV13NP        : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV14NP        : 4;	/* Service Request Node Pointer Result Event i */
		unsigned int REV15NP        : 4;	/* Service Request Node Pointer Result Event i */
	} B;
	int I;
	unsigned int U;

} VADC_G0REVNP1_type;
#define VADC_G0REVNP1	(*( VADC_G0REVNP1_type *) 0xf00205b4u)	/* Result Event Node Pointer Register 1, Group 0 */
#define VADC_G1REVNP1	(*( VADC_G0REVNP1_type *) 0xf00209b4u)	/* Result Event Node Pointer Register 1, Group 1 */
#define VADC_G2REVNP1	(*( VADC_G0REVNP1_type *) 0xf0020db4u)	/* Result Event Node Pointer Register 1, Group 2 */
#define VADC_G3REVNP1	(*( VADC_G0REVNP1_type *) 0xf00211b4u)	/* Result Event Node Pointer Register 1, Group 3 */
#define VADC_G4REVNP1	(*( VADC_G0REVNP1_type *) 0xf00215b4u)	/* Result Event Node Pointer Register 1, Group 4 */
#define VADC_G5REVNP1	(*( VADC_G0REVNP1_type *) 0xf00219b4u)	/* Result Event Node Pointer Register 1, Group 5 */
#define VADC_G6REVNP1	(*( VADC_G0REVNP1_type *) 0xf0021db4u)	/* Result Event Node Pointer Register 1, Group 6 */
#define VADC_G7REVNP1	(*( VADC_G0REVNP1_type *) 0xf00221b4u)	/* Result Event Node Pointer Register 1, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int SEV0           : 1;	/* Clear Source Event 0/1 */
		unsigned int SEV1           : 1;	/* Clear Source Event 0/1 */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} VADC_G0SEFCLR_type;
#define VADC_G0SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0020598u)	/* Source Event Flag Clear Register, Group 0 */
#define VADC_G1SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0020998u)	/* Source Event Flag Clear Register, Group 1 */
#define VADC_G2SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0020d98u)	/* Source Event Flag Clear Register, Group 2 */
#define VADC_G3SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0021198u)	/* Source Event Flag Clear Register, Group 3 */
#define VADC_G4SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0021598u)	/* Source Event Flag Clear Register, Group 4 */
#define VADC_G5SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0021998u)	/* Source Event Flag Clear Register, Group 5 */
#define VADC_G6SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0021d98u)	/* Source Event Flag Clear Register, Group 6 */
#define VADC_G7SEFCLR	(*( VADC_G0SEFCLR_type *) 0xf0022198u)	/* Source Event Flag Clear Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int SEV0           : 1;	/* Source Event 0/1 */
		unsigned int SEV1           : 1;	/* Source Event 0/1 */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} VADC_G0SEFLAG_type;
#define VADC_G0SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0020588u)	/* Source Event Flag Register, Group 0 */
#define VADC_G1SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0020988u)	/* Source Event Flag Register, Group 1 */
#define VADC_G2SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0020d88u)	/* Source Event Flag Register, Group 2 */
#define VADC_G3SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0021188u)	/* Source Event Flag Register, Group 3 */
#define VADC_G4SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0021588u)	/* Source Event Flag Register, Group 4 */
#define VADC_G5SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0021988u)	/* Source Event Flag Register, Group 5 */
#define VADC_G6SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0021d88u)	/* Source Event Flag Register, Group 6 */
#define VADC_G7SEFLAG	(*( VADC_G0SEFLAG_type *) 0xf0022188u)	/* Source Event Flag Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int SEV0NP         : 4;	/* Service Request Node Pointer Source Event i */
		unsigned int SEV1NP         : 4;	/* Service Request Node Pointer Source Event i */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} VADC_G0SEVNP_type;
#define VADC_G0SEVNP	(*( VADC_G0SEVNP_type *) 0xf00205c0u)	/* Source Event Node Pointer Register, Group 0 */
#define VADC_G1SEVNP	(*( VADC_G0SEVNP_type *) 0xf00209c0u)	/* Source Event Node Pointer Register, Group 1 */
#define VADC_G2SEVNP	(*( VADC_G0SEVNP_type *) 0xf0020dc0u)	/* Source Event Node Pointer Register, Group 2 */
#define VADC_G3SEVNP	(*( VADC_G0SEVNP_type *) 0xf00211c0u)	/* Source Event Node Pointer Register, Group 3 */
#define VADC_G4SEVNP	(*( VADC_G0SEVNP_type *) 0xf00215c0u)	/* Source Event Node Pointer Register, Group 4 */
#define VADC_G5SEVNP	(*( VADC_G0SEVNP_type *) 0xf00219c0u)	/* Source Event Node Pointer Register, Group 5 */
#define VADC_G6SEVNP	(*( VADC_G0SEVNP_type *) 0xf0021dc0u)	/* Source Event Node Pointer Register, Group 6 */
#define VADC_G7SEVNP	(*( VADC_G0SEVNP_type *) 0xf00221c0u)	/* Source Event Node Pointer Register, Group 7 */

