svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int AGSR0          : 1;	/* Activate Group Service Request Node y */
		unsigned int AGSR1          : 1;	/* Activate Group Service Request Node y */
		unsigned int AGSR2          : 1;	/* Activate Group Service Request Node y */
		unsigned int AGSR3          : 1;	/* Activate Group Service Request Node y */
		unsigned int                : 4;
		unsigned int ASSR0          : 1;	/* Activate Shared Service Request Node y */
		unsigned int ASSR1          : 1;	/* Activate Shared Service Request Node y */
		unsigned int ASSR2          : 1;	/* Activate Shared Service Request Node y */
		unsigned int ASSR3          : 1;	/* Activate Shared Service Request Node y */
		unsigned int                : 20;
	} B;
	int I;
	unsigned int U;

} VADC_G0SRACT_type;
#define VADC_G0SRACT	(*( VADC_G0SRACT_type *) 0xf00205c8u)	/* Service Request Software Activation Trigger, Group 0 */
#define VADC_G1SRACT	(*( VADC_G0SRACT_type *) 0xf00209c8u)	/* Service Request Software Activation Trigger, Group 1 */
#define VADC_G2SRACT	(*( VADC_G0SRACT_type *) 0xf0020dc8u)	/* Service Request Software Activation Trigger, Group 2 */
#define VADC_G3SRACT	(*( VADC_G0SRACT_type *) 0xf00211c8u)	/* Service Request Software Activation Trigger, Group 3 */
#define VADC_G4SRACT	(*( VADC_G0SRACT_type *) 0xf00215c8u)	/* Service Request Software Activation Trigger, Group 4 */
#define VADC_G5SRACT	(*( VADC_G0SRACT_type *) 0xf00219c8u)	/* Service Request Software Activation Trigger, Group 5 */
#define VADC_G6SRACT	(*( VADC_G0SRACT_type *) 0xf0021dc8u)	/* Service Request Software Activation Trigger, Group 6 */
#define VADC_G7SRACT	(*( VADC_G0SRACT_type *) 0xf00221c8u)	/* Service Request Software Activation Trigger, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int STSEL          : 2;	/* Start Selection */
		unsigned int                : 2;
		unsigned int EVALR1         : 1;	/* Evaluate Ready Input Rx */
		unsigned int EVALR2         : 1;	/* Evaluate Ready Input Rx */
		unsigned int EVALR3         : 1;	/* Evaluate Ready Input Rx */
		unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

} VADC_G0SYNCTR_type;
#define VADC_G0SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf00204c0u)	/* Synchronization Control Register, Group 0 */
#define VADC_G1SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf00208c0u)	/* Synchronization Control Register, Group 1 */
#define VADC_G2SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf0020cc0u)	/* Synchronization Control Register, Group 2 */
#define VADC_G3SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf00210c0u)	/* Synchronization Control Register, Group 3 */
#define VADC_G4SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf00214c0u)	/* Synchronization Control Register, Group 4 */
#define VADC_G5SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf00218c0u)	/* Synchronization Control Register, Group 5 */
#define VADC_G6SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf0021cc0u)	/* Synchronization Control Register, Group 6 */
#define VADC_G7SYNCTR	(*( VADC_G0SYNCTR_type *) 0xf00220c0u)	/* Synchronization Control Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int VF0            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF1            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF2            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF3            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF4            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF5            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF6            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF7            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF8            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF9            : 1;	/* Valid Flag of Result Register x */
		unsigned int VF10           : 1;	/* Valid Flag of Result Register x */
		unsigned int VF11           : 1;	/* Valid Flag of Result Register x */
		unsigned int VF12           : 1;	/* Valid Flag of Result Register x */
		unsigned int VF13           : 1;	/* Valid Flag of Result Register x */
		unsigned int VF14           : 1;	/* Valid Flag of Result Register x */
		unsigned int VF15           : 1;	/* Valid Flag of Result Register x */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} VADC_G0VFR_type;
#define VADC_G0VFR	(*( VADC_G0VFR_type *) 0xf00205f8u)	/* Valid Flag Register, Group 0 */
#define VADC_G1VFR	(*( VADC_G0VFR_type *) 0xf00209f8u)	/* Valid Flag Register, Group 1 */
#define VADC_G2VFR	(*( VADC_G0VFR_type *) 0xf0020df8u)	/* Valid Flag Register, Group 2 */
#define VADC_G3VFR	(*( VADC_G0VFR_type *) 0xf00211f8u)	/* Valid Flag Register, Group 3 */
#define VADC_G4VFR	(*( VADC_G0VFR_type *) 0xf00215f8u)	/* Valid Flag Register, Group 4 */
#define VADC_G5VFR	(*( VADC_G0VFR_type *) 0xf00219f8u)	/* Valid Flag Register, Group 5 */
#define VADC_G6VFR	(*( VADC_G0VFR_type *) 0xf0021df8u)	/* Valid Flag Register, Group 6 */
#define VADC_G7VFR	(*( VADC_G0VFR_type *) 0xf00221f8u)	/* Valid Flag Register, Group 7 */

typedef volatile union
{
	struct
	{ 
		unsigned int DIVA           : 5;	/* Divider Factor for the Analog Internal Clock */
		unsigned int                : 2;
		unsigned int DCMSB          : 1;	/* Double Clock for the MSB Conversion */
		unsigned int DIVD           : 2;	/* Divider Factor for the Arbiter Clock */
		unsigned int                : 5;
		unsigned int DIVWC          : 1;	/* Write Control for Divider Parameters */
		unsigned int DPCAL0         : 1;	/* Disable Post-Calibration */
		unsigned int DPCAL1         : 1;	/* Disable Post-Calibration */
		unsigned int DPCAL2         : 1;	/* Disable Post-Calibration */
		unsigned int DPCAL3         : 1;	/* Disable Post-Calibration */
		unsigned int                : 11;
		unsigned int SUCAL          : 1;	/* Start-Up Calibration */
	} B;
	int I;
	unsigned int U;

} VADC_GLOBCFG_type;
#define VADC_GLOBCFG	(*( VADC_GLOBCFG_type *) 0xf0020080u)	/* Global Configuration Register */

