svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SEVGLB         : 1;	/* Source Event (Background) */
		unsigned int                : 7;
		unsigned int REVGLB         : 1;	/* Global Result Event */
		unsigned int                : 7;
		unsigned int SEVGLBCLR      : 1;	/* Clear Source Event (Background) */
		unsigned int                : 7;
		unsigned int REVGLBCLR      : 1;	/* Clear Global Result Event */
		unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} VADC_GLOBEFLAG_type;
#define VADC_GLOBEFLAG	(*( VADC_GLOBEFLAG_type *) 0xf00200e0u)	/* Global Event Flag Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SEV0NP         : 4;	/* Service Request Node Pointer Backgr. Source */
		unsigned int                : 12;
		unsigned int REV0NP         : 4;	/* Service Request Node Pointer Backgr. Result */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} VADC_GLOBEVNP_type;
#define VADC_GLOBEVNP	(*( VADC_GLOBEVNP_type *) 0xf0020140u)	/* Global Event Node Pointer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 16;
		unsigned int DRCTR          : 4;	/* Data Reduction Control */
		unsigned int                : 4;
		unsigned int WFR            : 1;	/* Wait-for-Read Mode Enable */
		unsigned int                : 6;
		unsigned int SRGEN          : 1;	/* Service Request Generation Enable */
	} B;
	int I;
	unsigned int U;

} VADC_GLOBRCR_type;
#define VADC_GLOBRCR	(*( VADC_GLOBRCR_type *) 0xf0020280u)	/* Global Result Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RESULT         : 16;	/* Result of most recent conversion */
		/* const */ unsigned int GNR            : 4;	/* Group Number */
		/* const */ unsigned int CHNR           : 5;	/* Channel Number */
		/* const */ unsigned int EMUX           : 3;	/* External Multiplexer Setting */
		/* const */ unsigned int CRS            : 2;	/* Converted Request Source */
		/* const */ unsigned int FCR            : 1;	/* Fast Compare Result */
		unsigned int VF             : 1;	/* Valid Flag */
	} B;
	int I;
	unsigned int U;

} VADC_GLOBRES_type;
#define VADC_GLOBRES	(*( VADC_GLOBRES_type *) 0xf0020300u)	/* Global Result Register */
#define VADC_GLOBRESD	(*( VADC_GLOBRES_type *) 0xf0020380u)	/* Global Result Register, Debug */

typedef volatile union
{
	struct
	{ 
		unsigned int CDCH           : 4;	/* Converter Diagnostics Channel */
		unsigned int CDGR           : 4;	/* Converter Diagnostics Group */
		unsigned int CDEN           : 1;	/* Converter Diagnostics Enable */
		unsigned int CDSEL          : 2;	/* Converter Diagnostics Pull-Devices Select */
		unsigned int                : 4;
		unsigned int CDWC           : 1;	/* Write Control for Conversion Diagnostics */
		unsigned int PDD            : 1;	/* Pull-Down Diagnostics Enable */
		unsigned int MDPD           : 1;	/* Multiplexer Diagnostics Pull-Devices Enable */
		unsigned int MDPU           : 1;	/* Multiplexer Diagnostics Pull-Devices Enable */
		unsigned int                : 4;
		unsigned int MDWC           : 1;	/* Write Control for Multiplexer Diagnostics */
		unsigned int TRSW           : 1;	/* Trigger Event via Software */
		unsigned int TREV           : 1;	/* Trigger Event Flag */
		unsigned int                : 3;
		unsigned int SRGMODE        : 2;	/* Service Request Generation Mode */
		unsigned int SRGWC          : 1;	/* Write Control for Service Request Gen. Mode */
	} B;
	int I;
	unsigned int U;

} VADC_GLOBTF_type;
#define VADC_GLOBTF	(*( VADC_GLOBTF_type *) 0xf0020160u)	/* Global Test Functions Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} VADC_ID_type;
#define VADC_ID	(*( VADC_ID_type *) 0xf0020008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} VADC_KRST0_type;
#define VADC_KRST0	(*( VADC_KRST0_type *) 0xf0020034u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} VADC_KRST1_type;
#define VADC_KRST1	(*( VADC_KRST1_type *) 0xf0020030u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} VADC_KRSTCLR_type;
#define VADC_KRSTCLR	(*( VADC_KRSTCLR_type *) 0xf002002cu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TGS            : 2;	/* Trigger Set for OTGB0/1 */
		unsigned int TGB            : 1;	/* OTGB0/1 Bus Select */
		unsigned int TG_P           : 1;	/* TGS, TGB Write Protection */
		unsigned int                : 20;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} VADC_OCS_type;
#define VADC_OCS	(*( VADC_OCS_type *) 0xf0020028u)	/* OCDS Control and Status Register */


/* DSADC */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} DSADC_ACCEN0_type;
#define DSADC_ACCEN0	(*( DSADC_ACCEN0_type *) 0xf002403cu)	/* Access Enable Register 0 */

