svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RG00           : 1;	/* Register Group x, Channels 0 - 3 */
		unsigned int RG01           : 1;	/* Register Group x, Channels 0 - 3 */
		unsigned int RG02           : 1;	/* Register Group x, Channels 0 - 3 */
		unsigned int RG03           : 1;	/* Register Group x, Channels 0 - 3 */
		unsigned int RG04           : 1;	/* Register Group x, Channels 0 - 3 */
		unsigned int                : 9;
		unsigned int RG10           : 1;	/* Register Group 0/1, General Control */
		unsigned int RG11           : 1;	/* Register Group 0/1, General Control */
		unsigned int RG40           : 1;	/* Register Group x, Channels 4 - 5 */
		unsigned int RG41           : 1;	/* Register Group x, Channels 4 - 5 */
		unsigned int RG42           : 1;	/* Register Group x, Channels 4 - 5 */
		unsigned int RG43           : 1;	/* Register Group x, Channels 4 - 5 */
		unsigned int RG44           : 1;	/* Register Group x, Channels 4 - 5 */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} DSADC_ACCPROT_type;
#define DSADC_ACCPROT	(*( DSADC_ACCPROT_type *) 0xf0024090u)	/* Access Protection Register */

typedef volatile union
{
	struct
	{ 
		unsigned int BOUNDARYL      : 16;	/* Lower Boundary Value for Limit Checking */
		unsigned int BOUNDARYU      : 16;	/* Upper Boundary Value for Limit Checking */
	} B;
	int I;
	unsigned int U;

} DSADC_BOUNDSEL0_type;
#define DSADC_BOUNDSEL0	(*( DSADC_BOUNDSEL0_type *) 0xf0024128u)	/* Boundary Select Register 0 */
#define DSADC_BOUNDSEL1	(*( DSADC_BOUNDSEL0_type *) 0xf0024228u)	/* Boundary Select Register 1 */
#define DSADC_BOUNDSEL2	(*( DSADC_BOUNDSEL0_type *) 0xf0024328u)	/* Boundary Select Register 2 */
#define DSADC_BOUNDSEL3	(*( DSADC_BOUNDSEL0_type *) 0xf0024428u)	/* Boundary Select Register 3 */
#define DSADC_BOUNDSEL4	(*( DSADC_BOUNDSEL0_type *) 0xf0024528u)	/* Boundary Select Register 4 */
#define DSADC_BOUNDSEL5	(*( DSADC_BOUNDSEL0_type *) 0xf0024628u)	/* Boundary Select Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int CGMOD          : 2;	/* Carrier Generator Operating Mode */
		unsigned int BREV           : 1;	/* Bit-Reverse PWM Generation */
		unsigned int SIGPOL         : 1;	/* Signal Polarity */
		unsigned int DIVCG          : 4;	/* Divider Factor for the PWM Pattern Signal Generator */
		unsigned int                : 7;
		/* const */ unsigned int RUN            : 1;	/* Run Indicator */
		/* const */ unsigned int BITCOUNT       : 5;	/* Bit Counter */
		unsigned int                : 3;
		/* const */ unsigned int STEPCOUNT      : 4;	/* Step Counter */
		/* const */ unsigned int STEPS          : 1;	/* Step Counter Sign */
		/* const */ unsigned int STEPD          : 1;	/* Step Counter Direction */
		/* const */ unsigned int SGNCG          : 1;	/* Sign Signal from Carrier Generator */
		unsigned int                : 1;
	} B;
	int I;
	unsigned int U;

} DSADC_CGCFG_type;
#define DSADC_CGCFG	(*( DSADC_CGCFG_type *) 0xf00240a0u)	/* Carrier Generator Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SDCOUNT        : 8;	/* Sign Delay Counter */
		/* const */ unsigned int SDCAP          : 8;	/* Sign Delay Capture Value */
		unsigned int SDPOS          : 8;	/* Sign Delay Value for Positive Halfwave */
		unsigned int SDNEG          : 8;	/* Sign Delay Value for Negative Halfwave */
	} B;
	int I;
	unsigned int U;

} DSADC_CGSYNC0_type;
#define DSADC_CGSYNC0	(*( DSADC_CGSYNC0_type *) 0xf00241a0u)	/* Carrier Generator Synchronization Register 0 */
#define DSADC_CGSYNC1	(*( DSADC_CGSYNC0_type *) 0xf00242a0u)	/* Carrier Generator Synchronization Register 1 */
#define DSADC_CGSYNC2	(*( DSADC_CGSYNC0_type *) 0xf00243a0u)	/* Carrier Generator Synchronization Register 2 */
#define DSADC_CGSYNC3	(*( DSADC_CGSYNC0_type *) 0xf00244a0u)	/* Carrier Generator Synchronization Register 3 */
#define DSADC_CGSYNC4	(*( DSADC_CGSYNC0_type *) 0xf00245a0u)	/* Carrier Generator Synchronization Register 4 */
#define DSADC_CGSYNC5	(*( DSADC_CGSYNC0_type *) 0xf00246a0u)	/* Carrier Generator Synchronization Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} DSADC_CLC_type;
#define DSADC_CLC	(*( DSADC_CLC_type *) 0xf0024000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DSRC           : 4;	/* Input Data Source Select */
		unsigned int                : 3;
		unsigned int DSWC           : 1;	/* Write Control for Data Selection */
		unsigned int ITRMODE        : 2;	/* Integrator Trigger ModeThe integration trigger mode controls bit INTEN in register and hence the operation of the integrator: Bit INTEN is set when ITRMODE=11 or when the selected trigger signal transition occurs. Bit INTEN is cleared when ITRMODE=00 or when the inverse trigger signal transition occurs. */
		unsigned int TSTRMODE       : 2;	/* Timestamp Trigger ModeThe timestamp trigger mode controls capturing the timestamp information to register . */
		unsigned int TRSEL          : 3;	/* Trigger Select */
		unsigned int TRWC           : 1;	/* Write Control for Trigger Parameters */
		unsigned int CSRC           : 4;	/* Sample Clock Source Select */
		unsigned int STROBE         : 4;	/* Data Strobe Generation Mode */
		unsigned int                : 7;
		unsigned int SCWC           : 1;	/* Write Control for Strobe/Clock Selection */
	} B;
	int I;
	unsigned int U;

} DSADC_DICFG0_type;
#define DSADC_DICFG0	(*( DSADC_DICFG0_type *) 0xf0024108u)	/* Demodulator Input Configuration Register 0 */
#define DSADC_DICFG1	(*( DSADC_DICFG0_type *) 0xf0024208u)	/* Demodulator Input Configuration Register 1 */
#define DSADC_DICFG2	(*( DSADC_DICFG0_type *) 0xf0024308u)	/* Demodulator Input Configuration Register 2 */
#define DSADC_DICFG3	(*( DSADC_DICFG0_type *) 0xf0024408u)	/* Demodulator Input Configuration Register 3 */
#define DSADC_DICFG4	(*( DSADC_DICFG0_type *) 0xf0024508u)	/* Demodulator Input Configuration Register 4 */
#define DSADC_DICFG5	(*( DSADC_DICFG0_type *) 0xf0024608u)	/* Demodulator Input Configuration Register 5 */

