svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RESEV0         : 1;	/* Result Event */
		unsigned int RESEV1         : 1;	/* Result Event */
		unsigned int RESEV2         : 1;	/* Result Event */
		unsigned int RESEV3         : 1;	/* Result Event */
		unsigned int RESEV4         : 1;	/* Result Event */
		unsigned int RESEV5         : 1;	/* Result Event */
		unsigned int                : 10;
		unsigned int ALEV0          : 1;	/* Alarm Event */
		unsigned int ALEV1          : 1;	/* Alarm Event */
		unsigned int ALEV2          : 1;	/* Alarm Event */
		unsigned int ALEV3          : 1;	/* Alarm Event */
		unsigned int ALEV4          : 1;	/* Alarm Event */
		unsigned int ALEV5          : 1;	/* Alarm Event */
		unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} DSADC_EVFLAG_type;
#define DSADC_EVFLAG	(*( DSADC_EVFLAG_type *) 0xf00240e0u)	/* Event Flag Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RESEC0         : 1;	/* Result Event Clear */
		unsigned int RESEC1         : 1;	/* Result Event Clear */
		unsigned int RESEC2         : 1;	/* Result Event Clear */
		unsigned int RESEC3         : 1;	/* Result Event Clear */
		unsigned int RESEC4         : 1;	/* Result Event Clear */
		unsigned int RESEC5         : 1;	/* Result Event Clear */
		unsigned int                : 10;
		unsigned int ALEC0          : 1;	/* Alarm Event Clear */
		unsigned int ALEC1          : 1;	/* Alarm Event Clear */
		unsigned int ALEC2          : 1;	/* Alarm Event Clear */
		unsigned int ALEC3          : 1;	/* Alarm Event Clear */
		unsigned int ALEC4          : 1;	/* Alarm Event Clear */
		unsigned int ALEC5          : 1;	/* Alarm Event Clear */
		unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} DSADC_EVFLAGCLR_type;
#define DSADC_EVFLAGCLR	(*( DSADC_EVFLAGCLR_type *) 0xf00240e4u)	/* Event Flag Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CFADF          : 8;	/* Comb Filter (Auxiliary) Decimation Factor */
		unsigned int CFAC           : 2;	/* Comb Filter (Auxiliary) Configuration */
		unsigned int SRGA           : 2;	/* Service Request Generation Auxiliary Filter */
		unsigned int ESEL           : 2;	/* Event Select */
		unsigned int EGT            : 1;	/* Event Gating */
		unsigned int                : 1;
		unsigned int AFSC           : 2;	/* Auxiliary Filter Shift Control */
		unsigned int                : 6;
		/* const */ unsigned int CFADCNT        : 8;	/* Comb Filter (Auxiliary) Decimation Counter */
	} B;
	int I;
	unsigned int U;

} DSADC_FCFGA0_type;
#define DSADC_FCFGA0	(*( DSADC_FCFGA0_type *) 0xf0024118u)	/* Filter Configuration Register 0, Auxiliary Filter */
#define DSADC_FCFGA1	(*( DSADC_FCFGA0_type *) 0xf0024218u)	/* Filter Configuration Register 1, Auxiliary Filter */
#define DSADC_FCFGA2	(*( DSADC_FCFGA0_type *) 0xf0024318u)	/* Filter Configuration Register 2, Auxiliary Filter */
#define DSADC_FCFGA3	(*( DSADC_FCFGA0_type *) 0xf0024418u)	/* Filter Configuration Register 3, Auxiliary Filter */
#define DSADC_FCFGA4	(*( DSADC_FCFGA0_type *) 0xf0024518u)	/* Filter Configuration Register 4, Auxiliary Filter */
#define DSADC_FCFGA5	(*( DSADC_FCFGA0_type *) 0xf0024618u)	/* Filter Configuration Register 5, Auxiliary Filter */

typedef volatile union
{
	struct
	{ 
		unsigned int CFMDF          : 8;	/* Comb Filter (Main Chain) Decimation Factor */
		unsigned int CFMC           : 2;	/* Comb Filter (Main Chain) Configuration */
		unsigned int CFEN           : 1;	/* Comb Filter Enable */
		unsigned int                : 1;
		unsigned int MFSC           : 2;	/* Main Filter Shift Control */
		unsigned int SRGM           : 2;	/* Service Request Generation Main Chain */
		unsigned int CFMSV          : 8;	/* Comb Filter (Main Chain) Start Value */
		/* const */ unsigned int CFMDCNT        : 8;	/* Comb Filter (Main Chain) Decimation Counter */
	} B;
	int I;
	unsigned int U;

} DSADC_FCFGC0_type;
#define DSADC_FCFGC0	(*( DSADC_FCFGC0_type *) 0xf0024114u)	/* Filter Configuration Register 0, Main Comb Filter */
#define DSADC_FCFGC1	(*( DSADC_FCFGC0_type *) 0xf0024214u)	/* Filter Configuration Register 1, Main Comb Filter */
#define DSADC_FCFGC2	(*( DSADC_FCFGC0_type *) 0xf0024314u)	/* Filter Configuration Register 2, Main Comb Filter */
#define DSADC_FCFGC3	(*( DSADC_FCFGC0_type *) 0xf0024414u)	/* Filter Configuration Register 3, Main Comb Filter */
#define DSADC_FCFGC4	(*( DSADC_FCFGC0_type *) 0xf0024514u)	/* Filter Configuration Register 4, Main Comb Filter */
#define DSADC_FCFGC5	(*( DSADC_FCFGC0_type *) 0xf0024614u)	/* Filter Configuration Register 5, Main Comb Filter */

typedef volatile union
{
	struct
	{ 
		unsigned int FIR0EN         : 1;	/* FIR Filter 0 Enable */
		unsigned int FIR1EN         : 1;	/* FIR Filter 1 Enable */
		unsigned int OCEN           : 1;	/* Offset Compensation Filter Enable */
		unsigned int DSH            : 2;	/* Data Shift Control */
		unsigned int                : 27;
	} B;
	int I;
	unsigned int U;

} DSADC_FCFGM0_type;
#define DSADC_FCFGM0	(*( DSADC_FCFGM0_type *) 0xf0024110u)	/* Filter Configuration Register 0, Main Filter Chain */
#define DSADC_FCFGM1	(*( DSADC_FCFGM0_type *) 0xf0024210u)	/* Filter Configuration Register 1, Main Filter Chain */
#define DSADC_FCFGM2	(*( DSADC_FCFGM0_type *) 0xf0024310u)	/* Filter Configuration Register 2, Main Filter Chain */
#define DSADC_FCFGM3	(*( DSADC_FCFGM0_type *) 0xf0024410u)	/* Filter Configuration Register 3, Main Filter Chain */
#define DSADC_FCFGM4	(*( DSADC_FCFGM0_type *) 0xf0024510u)	/* Filter Configuration Register 4, Main Filter Chain */
#define DSADC_FCFGM5	(*( DSADC_FCFGM0_type *) 0xf0024610u)	/* Filter Configuration Register 5, Main Filter Chain */

typedef volatile union
{
	struct
	{ 
		unsigned int MCSEL          : 3;	/* Modulator Clock Select */
		unsigned int                : 8;
		unsigned int IRM0           : 1;	/* Internal Resistance Measurement Control */
		unsigned int IRM2           : 1;	/* Internal Resistance Measurement Control */
		unsigned int IRM4           : 1;	/* Internal Resistance Measurement Control */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} DSADC_GLOBCFG_type;
