svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define DSADC_GLOBCFG	(*( DSADC_GLOBCFG_type *) 0xf0024080u)	/* Global Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CHRUN          : 6;	/* Channel x Run Control */
		unsigned int                : 10;
		unsigned int MRUN           : 6;	/* Modulator x Run Control */
		unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} DSADC_GLOBRC_type;
#define DSADC_GLOBRC	(*( DSADC_GLOBRC_type *) 0xf0024088u)	/* Global Run Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} DSADC_ID_type;
#define DSADC_ID	(*( DSADC_ID_type *) 0xf0024008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NVALCNT        : 6;	/* Number of Values Counted */
		unsigned int                : 1;
		/* const */ unsigned int INTEN          : 1;	/* Integration EnableFor the control of bit INTEN, see also bitfield ITRMODE in register . */
		/* const */ unsigned int REPCNT         : 4;	/* Integration Cycle Counter */
		unsigned int REPVAL         : 4;	/* Number of Integration Cycles */
		unsigned int NVALDIS        : 6;	/* Number of Values Discarded */
		unsigned int                : 1;
		unsigned int IWS            : 1;	/* Integration Window SIze */
		unsigned int NVALINT        : 6;	/* Number of Values Integrated */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} DSADC_IWCTR0_type;
#define DSADC_IWCTR0	(*( DSADC_IWCTR0_type *) 0xf0024120u)	/* Integration Window Control Register 0 */
#define DSADC_IWCTR1	(*( DSADC_IWCTR0_type *) 0xf0024220u)	/* Integration Window Control Register 1 */
#define DSADC_IWCTR2	(*( DSADC_IWCTR0_type *) 0xf0024320u)	/* Integration Window Control Register 2 */
#define DSADC_IWCTR3	(*( DSADC_IWCTR0_type *) 0xf0024420u)	/* Integration Window Control Register 3 */
#define DSADC_IWCTR4	(*( DSADC_IWCTR0_type *) 0xf0024520u)	/* Integration Window Control Register 4 */
#define DSADC_IWCTR5	(*( DSADC_IWCTR0_type *) 0xf0024620u)	/* Integration Window Control Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} DSADC_KRST0_type;
#define DSADC_KRST0	(*( DSADC_KRST0_type *) 0xf0024034u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} DSADC_KRST1_type;
#define DSADC_KRST1	(*( DSADC_KRST1_type *) 0xf0024030u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} DSADC_KRSTCLR_type;
#define DSADC_KRSTCLR	(*( DSADC_KRSTCLR_type *) 0xf002402cu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int INCFGP         : 2;	/* Configuration of Positive Input Line */
		unsigned int INCFGN         : 2;	/* Configuration of Negative Input Line */
		unsigned int GAINSEL        : 4;	/* Gain Select of Analog Input Path */
		unsigned int INSEL          : 2;	/* Input Pin Selection */
		/* const */ unsigned int INMUX          : 2;	/* Input Multiplexer Setting */
		unsigned int INMODE         : 2;	/* Input Multiplexer Control Mode */
		unsigned int INMAC          : 1;	/* Input Multiplexer Action Control */
		unsigned int INCWC          : 1;	/* Write Control for Input Parameters */
		unsigned int DIVM           : 4;	/* Divider Factor for Modulator Clock */
		unsigned int                : 3;
		unsigned int DWC            : 1;	/* Write Control for Divider Factor */
		unsigned int CMVS           : 2;	/* Common Mode Voltage Selection */
		unsigned int MCFG           : 2;	/* Modulator Configuration */
		unsigned int GCEN           : 1;	/* Gain Calibration Enable */
		unsigned int APC            : 1;	/* Automatic Power Control */
		unsigned int                : 1;
		unsigned int MWC            : 1;	/* Write Control for Mode Selection */
	} B;
	int I;
	unsigned int U;

} DSADC_MODCFG0_type;
#define DSADC_MODCFG0	(*( DSADC_MODCFG0_type *) 0xf0024100u)	/* Modulator Configuration Register 0 */
#define DSADC_MODCFG1	(*( DSADC_MODCFG0_type *) 0xf0024200u)	/* Modulator Configuration Register 1 */
#define DSADC_MODCFG2	(*( DSADC_MODCFG0_type *) 0xf0024300u)	/* Modulator Configuration Register 2 */
#define DSADC_MODCFG3	(*( DSADC_MODCFG0_type *) 0xf0024400u)	/* Modulator Configuration Register 3 */
#define DSADC_MODCFG4	(*( DSADC_MODCFG0_type *) 0xf0024500u)	/* Modulator Configuration Register 4 */
#define DSADC_MODCFG5	(*( DSADC_MODCFG0_type *) 0xf0024600u)	/* Modulator Configuration Register 5 */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} DSADC_OCS_type;
#define DSADC_OCS	(*( DSADC_OCS_type *) 0xf0024028u)	/* OCDS Control and Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int OFFSET         : 16;	/* Offset Value */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} DSADC_OFFM0_type;
#define DSADC_OFFM0	(*( DSADC_OFFM0_type *) 0xf0024138u)	/* Offset Register 0 Main Filter */
#define DSADC_OFFM1	(*( DSADC_OFFM0_type *) 0xf0024238u)	/* Offset Register 1 Main Filter */
#define DSADC_OFFM2	(*( DSADC_OFFM0_type *) 0xf0024338u)	/* Offset Register 2 Main Filter */
#define DSADC_OFFM3	(*( DSADC_OFFM0_type *) 0xf0024438u)	/* Offset Register 3 Main Filter */
#define DSADC_OFFM4	(*( DSADC_OFFM0_type *) 0xf0024538u)	/* Offset Register 4 Main Filter */
#define DSADC_OFFM5	(*( DSADC_OFFM0_type *) 0xf0024638u)	/* Offset Register 5 Main Filter */

