svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RFEN           : 1;	/* Rectification Enable */
		unsigned int                : 3;
		unsigned int SSRC           : 2;	/* Sign Source */
		unsigned int                : 9;
		/* const */ unsigned int SDCVAL         : 1;	/* Valid Flag */
		unsigned int                : 14;
		/* const */ unsigned int SGNCS          : 1;	/* Selected Carrier Sign Signal */
		/* const */ unsigned int SGND           : 1;	/* Sign Signal Delayed */
	} B;
	int I;
	unsigned int U;

} DSADC_RECTCFG0_type;
#define DSADC_RECTCFG0	(*( DSADC_RECTCFG0_type *) 0xf00241a8u)	/* Rectification Configuration Register 0 */
#define DSADC_RECTCFG1	(*( DSADC_RECTCFG0_type *) 0xf00242a8u)	/* Rectification Configuration Register 1 */
#define DSADC_RECTCFG2	(*( DSADC_RECTCFG0_type *) 0xf00243a8u)	/* Rectification Configuration Register 2 */
#define DSADC_RECTCFG3	(*( DSADC_RECTCFG0_type *) 0xf00244a8u)	/* Rectification Configuration Register 3 */
#define DSADC_RECTCFG4	(*( DSADC_RECTCFG0_type *) 0xf00245a8u)	/* Rectification Configuration Register 4 */
#define DSADC_RECTCFG5	(*( DSADC_RECTCFG0_type *) 0xf00246a8u)	/* Rectification Configuration Register 5 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESULT         : 16;	/* Result of most recent conversion */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} DSADC_RESA0_type;
#define DSADC_RESA0	(*( DSADC_RESA0_type *) 0xf0024140u)	/* Result Register 0 Auxiliary Filter */
#define DSADC_RESA1	(*( DSADC_RESA0_type *) 0xf0024240u)	/* Result Register 1 Auxiliary Filter */
#define DSADC_RESA2	(*( DSADC_RESA0_type *) 0xf0024340u)	/* Result Register 2 Auxiliary Filter */
#define DSADC_RESA3	(*( DSADC_RESA0_type *) 0xf0024440u)	/* Result Register 3 Auxiliary Filter */
#define DSADC_RESA4	(*( DSADC_RESA0_type *) 0xf0024540u)	/* Result Register 4 Auxiliary Filter */
#define DSADC_RESA5	(*( DSADC_RESA0_type *) 0xf0024640u)	/* Result Register 5 Auxiliary Filter */
#define DSADC_RESM0	(*( DSADC_RESA0_type *) 0xf0024130u)	/* Result Register 0 Main Filter */
#define DSADC_RESM1	(*( DSADC_RESA0_type *) 0xf0024230u)	/* Result Register 1 Main Filter */
#define DSADC_RESM2	(*( DSADC_RESA0_type *) 0xf0024330u)	/* Result Register 2 Main Filter */
#define DSADC_RESM3	(*( DSADC_RESA0_type *) 0xf0024430u)	/* Result Register 3 Main Filter */
#define DSADC_RESM4	(*( DSADC_RESA0_type *) 0xf0024530u)	/* Result Register 4 Main Filter */
#define DSADC_RESM5	(*( DSADC_RESA0_type *) 0xf0024630u)	/* Result Register 5 Main Filter */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESULT         : 16;	/* Result of most recent conversion */
		/* const */ unsigned int CFMDCNT        : 8;	/* Comb Filter (Main Chain) Decimation Counter */
		/* const */ unsigned int NVALCNT        : 6;	/* Number of Values Counted */
		/* const */ unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} DSADC_TSTMP0_type;
#define DSADC_TSTMP0	(*( DSADC_TSTMP0_type *) 0xf0024150u)	/* Time-Stamp Register 0 */
#define DSADC_TSTMP1	(*( DSADC_TSTMP0_type *) 0xf0024250u)	/* Time-Stamp Register 1 */
#define DSADC_TSTMP2	(*( DSADC_TSTMP0_type *) 0xf0024350u)	/* Time-Stamp Register 2 */
#define DSADC_TSTMP3	(*( DSADC_TSTMP0_type *) 0xf0024450u)	/* Time-Stamp Register 3 */
#define DSADC_TSTMP4	(*( DSADC_TSTMP0_type *) 0xf0024550u)	/* Time-Stamp Register 4 */
#define DSADC_TSTMP5	(*( DSADC_TSTMP0_type *) 0xf0024650u)	/* Time-Stamp Register 5 */


/* BMU */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} BMU_ACCEN0_type;
#define BMU_ACCEN0	(*( BMU_ACCEN0_type *) 0xf00308fcu)	/* Access Enable Register 0 */

