svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} BMU_ACCEN1_type;
#define BMU_ACCEN1	(*( BMU_ACCEN1_type *) 0xf00308f8u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 4;
		/* const */ unsigned int RMC            : 8;	/* 8-bit Clock Divider Value in RUN Mode */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} BMU_CLC_type;
#define BMU_CLC	(*( BMU_CLC_type *) 0xf0030800u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MODE           : 1;	/* Access Mode */
		/* const */ unsigned int TMF            : 1;	/* Transaction Master Filtering */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} BMU_CTL_type;
#define BMU_CTL	(*( BMU_CTL_type *) 0xf0030820u)	/* Transaction Filtering Control */

typedef volatile union
{
	struct
	{ 
		unsigned int FHT_INT        : 1;	/* Interrupt Enable for Fifo High Threshold */
		unsigned int OVF_INT        : 1;	/* Interrupt Enable for Overflow Detection */
		unsigned int UDF_INT        : 1;	/* Interrupt Enable for Underflow Detection */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} BMU_FMCTL_type;
#define BMU_FMCTL	(*( BMU_FMCTL_type *) 0xf0030840u)	/* Fifo Monitor control register */

typedef volatile union
{
	struct
	{ 
		unsigned int FHT_STS        : 1;	/* Status Flag for Fifo High Threshold interrupt */
		unsigned int OVF_STS        : 1;	/* Status Flag for Overrun interrupt */
		unsigned int UDF_STS        : 1;	/* Status Flag for Underflow interrupt */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} BMU_FMSTS_type;
#define BMU_FMSTS	(*( BMU_FMSTS_type *) 0xf0030844u)	/* Fifo Monitor Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FHT            : 8;	/* Fifo High Threshold */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} BMU_FMTH_type;
#define BMU_FMTH	(*( BMU_FMTH_type *) 0xf0030848u)	/* Fifo Monitor: Fullness Threshold Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int UCELLS         : 9;	/* Number of valid (used) entries in the BTF */
		/* const */ unsigned int                : 7;
		/* const */ unsigned int FCELLS         : 9;	/* Number of free entries in the BTF */
		/* const */ unsigned int                : 7;
	} B;
	int I;
	unsigned int U;

} BMU_FULLNESS_type;
#define BMU_FULLNESS	(*( BMU_FULLNESS_type *) 0xf0030828u)	/* Fullness Information for Bus Transaction Fifo */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} BMU_ID_type;
#define BMU_ID	(*( BMU_ID_type *) 0xf0030808u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FPI_SEL0       : 1;	/* Select Bit for FPI Region 0 */
		unsigned int FPI_SEL1       : 1;	/* Select Bit for FPI Region 1 */
		unsigned int FPI_SEL2       : 1;	/* Select Bit for FPI Region 2 */
		unsigned int FPI_SEL3       : 1;	/* Select Bit for FPI Region 3 */
		unsigned int FPI_SEL4       : 1;	/* Select Bit for FPI Region 4 */
		unsigned int FPI_SEL5       : 1;	/* Select Bit for FPI Region 5 */
		unsigned int FPI_SEL6       : 1;	/* Select Bit for FPI Region 6 */
		unsigned int FPI_SEL7       : 1;	/* Select Bit for FPI Region 7 */
		unsigned int FPI_SEL8       : 1;	/* Select Bit for FPI Region 8 */
		unsigned int FPI_SEL9       : 1;	/* Select Bit for FPI Region 9 */
		unsigned int FPI_SEL10      : 1;	/* Select Bit for FPI Region 10 */
		unsigned int FPI_SEL11      : 1;	/* Select Bit for FPI Region 11 */
		unsigned int FPI_SEL12      : 1;	/* Select Bit for FPI Region 12 */
		unsigned int FPI_SEL13      : 1;	/* Select Bit for FPI Region 13 */
		unsigned int FPI_SEL14      : 1;	/* Select Bit for FPI Region 14 */
		unsigned int FPI_SEL15      : 1;	/* Select Bit for FPI Region 15 */
		unsigned int FPI_SEL16      : 1;	/* Select Bit for FPI Region 16 */
		unsigned int FPI_SEL17      : 1;	/* Select Bit for FPI Region 17 */
		unsigned int FPI_SEL18      : 1;	/* Select Bit for FPI Region 18 */
		unsigned int FPI_SEL19      : 1;	/* Select Bit for FPI Region 19 */
		unsigned int FPI_SEL20      : 1;	/* Select Bit for FPI Region 20 */
		unsigned int FPI_SEL21      : 1;	/* Select Bit for FPI Region 21 */
		unsigned int FPI_SEL22      : 1;	/* Select Bit for FPI Region 22 */
		unsigned int FPI_SEL23      : 1;	/* Select Bit for FPI Region 23 */
		unsigned int FPI_SEL24      : 1;	/* Select Bit for FPI Region 24 */
		unsigned int FPI_SEL25      : 1;	/* Select Bit for FPI Region 25 */
		unsigned int FPI_SEL26      : 1;	/* Select Bit for FPI Region 26 */
		unsigned int FPI_SEL27      : 1;	/* Select Bit for FPI Region 27 */
		unsigned int FPI_SEL28      : 1;	/* Select Bit for FPI Region 28 */
		unsigned int FPI_SEL29      : 1;	/* Select Bit for FPI Region 29 */
		unsigned int FPI_SEL30      : 1;	/* Select Bit for FPI Region 30 */
		unsigned int FPI_SEL31      : 1;	/* Select Bit for FPI Region 31 */
	} B;
	int I;
	unsigned int U;

} BMU_PSET0_type;
#define BMU_PSET0	(*( BMU_PSET0_type *) 0xf0030830u)	/* Peripheral Set 0 Configuration */

typedef volatile union
{
	struct
	{ 
		unsigned int FPI_SEL32      : 1;	/* Select Bit for FPI Region 32 */
		unsigned int FPI_SEL33      : 1;	/* Select Bit for FPI Region 33 */
		unsigned int FPI_SEL34      : 1;	/* Select Bit for FPI Region 34 */
		unsigned int FPI_SEL35      : 1;	/* Select Bit for FPI Region 35 */
		unsigned int FPI_SEL36      : 1;	/* Select Bit for FPI Region 36 */
		unsigned int FPI_SEL37      : 1;	/* Select Bit for FPI Region 37 */
		unsigned int FPI_SEL38      : 1;	/* Select Bit for FPI Region 38 */
		unsigned int FPI_SEL39      : 1;	/* Select Bit for FPI Region 39 */
		unsigned int FPI_SEL40      : 1;	/* Select Bit for FPI Region 40 */
		unsigned int FPI_SEL41      : 1;	/* Select Bit for FPI Region 41 */
		unsigned int FPI_SEL42      : 1;	/* Select Bit for FPI Region 42 */
		unsigned int FPI_SEL43      : 1;	/* Select Bit for FPI Region 43 */
		unsigned int FPI_SEL44      : 1;	/* Select Bit for FPI Region 44 */
		unsigned int FPI_SEL45      : 1;	/* Select Bit for FPI Region 45 */
		unsigned int FPI_SEL46      : 1;	/* Select Bit for FPI Region 46 */
		unsigned int FPI_SEL47      : 1;	/* Select Bit for FPI Region 47 */
		unsigned int FPI_SEL48      : 1;	/* Select Bit for FPI Region 48 */
		unsigned int FPI_SEL49      : 1;	/* Select Bit for FPI Region 49 */
		unsigned int FPI_SEL50      : 1;	/* Select Bit for FPI Region 50 */
		unsigned int FPI_SEL51      : 1;	/* Select Bit for FPI Region 51 */
		unsigned int FPI_SEL52      : 1;	/* Select Bit for FPI Region 52 */
		unsigned int FPI_SEL53      : 1;	/* Select Bit for FPI Region 53 */
		unsigned int FPI_SEL54      : 1;	/* Select Bit for FPI Region 54 */
		unsigned int FPI_SEL55      : 1;	/* Select Bit for FPI Region 55 */
		unsigned int FPI_SEL56      : 1;	/* Select Bit for FPI Region 56 */
		unsigned int FPI_SEL57      : 1;	/* Select Bit for FPI Region 57 */
		unsigned int FPI_SEL58      : 1;	/* Select Bit for FPI Region 58 */
		unsigned int FPI_SEL59      : 1;	/* Select Bit for FPI Region 59 */
		unsigned int FPI_SEL60      : 1;	/* Select Bit for FPI Region 60 */
		unsigned int FPI_SEL61      : 1;	/* Select Bit for FPI Region 61 */
		unsigned int FPI_SEL62      : 1;	/* Select Bit for FPI Region 62 */
		unsigned int FPI_SEL63      : 1;	/* Select Bit for FPI Region 63 */
	} B;
	int I;
	unsigned int U;

