svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} BMU_PSET1_type;
#define BMU_PSET1	(*( BMU_PSET1_type *) 0xf0030834u)	/* Peripheral Set 1 Configuration */

typedef volatile union
{
	struct
	{ 
		unsigned int FPI_SEL64      : 1;	/* Select Bit for FPI Region 64 */
		unsigned int FPI_SEL65      : 1;	/* Select Bit for FPI Region 65 */
		unsigned int FPI_SEL66      : 1;	/* Select Bit for FPI Region 66 */
		unsigned int FPI_SEL67      : 1;	/* Select Bit for FPI Region 67 */
		unsigned int FPI_SEL68      : 1;	/* Select Bit for FPI Region 68 */
		unsigned int FPI_SEL69      : 1;	/* Select Bit for FPI Region 69 */
		unsigned int FPI_SEL70      : 1;	/* Select Bit for FPI Region 70 */
		unsigned int FPI_SEL71      : 1;	/* Select Bit for FPI Region 71 */
		unsigned int FPI_SEL72      : 1;	/* Select Bit for FPI Region 72 */
		unsigned int FPI_SEL73      : 1;	/* Select Bit for FPI Region 73 */
		unsigned int FPI_SEL74      : 1;	/* Select Bit for FPI Region 74 */
		unsigned int FPI_SEL75      : 1;	/* Select Bit for FPI Region 75 */
		unsigned int FPI_SEL76      : 1;	/* Select Bit for FPI Region 76 */
		unsigned int FPI_SEL77      : 1;	/* Select Bit for FPI Region 77 */
		unsigned int FPI_SEL78      : 1;	/* Select Bit for FPI Region 78 */
		unsigned int FPI_SEL79      : 1;	/* Select Bit for FPI Region 79 */
		unsigned int FPI_SEL80      : 1;	/* Select Bit for FPI Region 80 */
		unsigned int FPI_SEL81      : 1;	/* Select Bit for FPI Region 81 */
		unsigned int FPI_SEL82      : 1;	/* Select Bit for FPI Region 82 */
		unsigned int FPI_SEL83      : 1;	/* Select Bit for FPI Region 83 */
		unsigned int FPI_SEL84      : 1;	/* Select Bit for FPI Region 84 */
		unsigned int FPI_SEL85      : 1;	/* Select Bit for FPI Region 85 */
		unsigned int FPI_SEL86      : 1;	/* Select Bit for FPI Region 86 */
		unsigned int FPI_SEL87      : 1;	/* Select Bit for FPI Region 87 */
		unsigned int FPI_SEL88      : 1;	/* Select Bit for FPI Region 88 */
		unsigned int FPI_SEL89      : 1;	/* Select Bit for FPI Region 89 */
		unsigned int FPI_SEL90      : 1;	/* Select Bit for FPI Region 90 */
		unsigned int FPI_SEL91      : 1;	/* Select Bit for FPI Region 91 */
		unsigned int FPI_SEL92      : 1;	/* Select Bit for FPI Region 92 */
		unsigned int FPI_SEL93      : 1;	/* Select Bit for FPI Region 93 */
		unsigned int FPI_SEL94      : 1;	/* Select Bit for FPI Region 94 */
		unsigned int FPI_SEL95      : 1;	/* Select Bit for FPI Region 95 */
	} B;
	int I;
	unsigned int U;

} BMU_PSET2_type;
#define BMU_PSET2	(*( BMU_PSET2_type *) 0xf0030838u)	/* Peripheral Set 2 Configuration */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RPTR           : 8;	/* Read Pointer Position */
		/* const */ unsigned int                : 8;
		/* const */ unsigned int WPTR           : 8;	/* Write Pointer Position */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} BMU_PTR_type;
#define BMU_PTR	(*( BMU_PTR_type *) 0xf0030824u)	/* Pointer Information for Bus Transaction Fifo */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TID0           : 4;	/* Transaction Identifier 0 */
		/* const */ unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} BMU_TID_type;
#define BMU_TID	(*( BMU_TID_type *) 0xf003083cu)	/* FPI Transaction ID Set 0 Configuration */


/* I2C */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} I2C0_ACCEN0_type;
#define I2C0_ACCEN0	(*( I2C0_ACCEN0_type *) 0xf00d000cu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RES            : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} I2C0_ACCEN1_type;
