svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define I2C0_ACCEN1	(*( I2C0_ACCEN1_type *) 0xf00d0010u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int ADR            : 10;	/* I2C-bus Device Address */
		unsigned int                : 6;
		unsigned int TBAM           : 1;	/* Ten Bit Address Mode */
		unsigned int GCE            : 1;	/* General Call Enable */
		unsigned int MCE            : 1;	/* Master Code Enable */
		unsigned int MnS            : 1;	/* Master / not Slave */
		unsigned int SONA           : 1;	/* Stop on Not-acknowledge */
		unsigned int SOPE           : 1;	/* Stop on Packet End */
		unsigned int                : 10;
	} B;
	int I;
	unsigned int U;

} I2C0_ADDRCFG_type;
#define I2C0_ADDRCFG	(*( I2C0_ADDRCFG_type *) 0xf00c0020u)	/* Address Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int BS             : 2;	/* Bus Status */
		/* const */ unsigned int RnW            : 1;	/* Read/not Write */
		/* const */ unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} I2C0_BUSSTAT_type;
#define I2C0_BUSSTAT	(*( I2C0_BUSSTAT_type *) 0xf00c0024u)	/* Bus Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} I2C0_CLC_type;
#define I2C0_CLC	(*( I2C0_CLC_type *) 0xf00d0000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int SPEN           : 1;	/* Module Suspend Enable Bit for OCDS */
		unsigned int EDIS           : 1;	/* External Request Disable */
		unsigned int SBWE           : 1;	/* Module Suspend Bit Write Enable for OCDS */
		unsigned int FSOE           : 1;	/* Fast Switch Off Enable */
		unsigned int                : 2;
		unsigned int RMC            : 8;	/* Clock Divider for Standard Run Mode */
		unsigned int ORMC           : 8;	/* Clock Divider for Optional Run Mode (AHB peripherals) */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} I2C0_CLC1_type;
#define I2C0_CLC1	(*( I2C0_CLC1_type *) 0xf00c0000u)	/* Clock Control 1 Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SETRSC         : 1;	/* Set Restart Condition */
		unsigned int SETEND         : 1;	/* Set End of Transmission */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} I2C0_ENDDCTRL_type;
#define I2C0_ENDDCTRL	(*( I2C0_ENDDCTRL_type *) 0xf00c0014u)	/* End Data Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXF_UFL        : 1;	/* RX FIFO Underflow */
		unsigned int RXF_OFL        : 1;	/* RX FIFO Overflow */
		unsigned int TXF_UFL        : 1;	/* TX FIFO Underflow */
		unsigned int TXF_OFL        : 1;	/* TX FIFO Overflow */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} I2C0_ERRIRQSC_type;
#define I2C0_ERRIRQSC	(*( I2C0_ERRIRQSC_type *) 0xf00c0068u)	/* Error Interrupt Request Source Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXF_UFL        : 1;	/* RX FIFO Underflow */
		unsigned int RXF_OFL        : 1;	/* RX FIFO Overflow */
		unsigned int TXF_UFL        : 1;	/* TX FIFO Underflow */
		unsigned int TXF_OFL        : 1;	/* TX FIFO Overflow */
		unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} I2C0_ERRIRQSM_type;
#define I2C0_ERRIRQSM	(*( I2C0_ERRIRQSM_type *) 0xf00c0060u)	/* Error Interrupt Request Source Mask Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXF_UFL        : 1;	/* RX FIFO Underflow */
		/* const */ unsigned int RXF_OFL        : 1;	/* RX FIFO Overflow */
		/* const */ unsigned int TXF_UFL        : 1;	/* TX FIFO Underflow */
		/* const */ unsigned int TXF_OFL        : 1;	/* TX FIFO Overflow */
		/* const */ unsigned int                : 28;
	} B;
	int I;
	unsigned int U;

} I2C0_ERRIRQSS_type;
#define I2C0_ERRIRQSS	(*( I2C0_ERRIRQSS_type *) 0xf00c0064u)	/* Error Interrupt Request Source Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DEC            : 11;	/* Decrement Value of Fractional Divider */
		unsigned int                : 5;
		unsigned int INC            : 8;	/* Increment Value of Fractional Divider */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} I2C0_FDIVCFG_type;
#define I2C0_FDIVCFG	(*( I2C0_FDIVCFG_type *) 0xf00c0018u)	/* Fractional Divider Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DEC            : 11;	/* Decrement Value of Fractional Divider */
		unsigned int                : 5;
		unsigned int INC            : 8;	/* Increment Value of Fractional Divider */
		unsigned int                : 7;
		unsigned int DIS_SCL_SYN    : 1;	/* Disable SCL Synchronization */
	} B;
	int I;
	unsigned int U;

} I2C0_FDIVHIGHCFG_type;
#define I2C0_FDIVHIGHCFG	(*( I2C0_FDIVHIGHCFG_type *) 0xf00c001cu)	/* Fractional Divider High-speed Mode Configuration Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int FFS            : 6;	/* Filled FIFO Stages */
		/* const */ unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} I2C0_FFSSTAT_type;
#define I2C0_FFSSTAT	(*( I2C0_FFSSTAT_type *) 0xf00c0038u)	/* Filled FIFO Stages Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXBS           : 2;	/* RX Burst Size */
		unsigned int                : 2;
		unsigned int TXBS           : 2;	/* TX Burst Size */
		unsigned int                : 2;
		unsigned int RXFA           : 2;	/* RX FIFO Alignment */
		unsigned int                : 2;
		unsigned int TXFA           : 2;	/* TX FIFO Alignment */
		unsigned int                : 2;
		unsigned int RXFC           : 1;	/* RX FIFO Flow Control */
		unsigned int TXFC           : 1;	/* TX FIFO Flow Control */
		unsigned int                : 14;
	} B;
	int I;
	unsigned int U;

} I2C0_FIFOCFG_type;
#define I2C0_FIFOCFG	(*( I2C0_FIFOCFG_type *) 0xf00c0028u)	/* FIFO Configuration Register */

