svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int PISEL          : 3;	/* Port Input Select */
		unsigned int                : 29;
	} B;
	int I;
	unsigned int U;

} I2C0_GPCTL_type;
#define I2C0_GPCTL	(*( I2C0_GPCTL_type *) 0xf00d0008u)	/* General Purpose Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LSREQ_INT      : 1;	/* Last Single Request Interrupt */
		unsigned int SREQ_INT       : 1;	/* Single Request Interrupt */
		unsigned int LBREQ_INT      : 1;	/* Last Burst Request Interrupt */
		unsigned int BREQ_INT       : 1;	/* Burst Request Interrupt */
		unsigned int I2C_ERR_INT    : 1;	/* I2C Error Interrupt */
		unsigned int I2C_P_INT      : 1;	/* I2C Protocol Interrupt */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} I2C0_ICR_type;
#define I2C0_ICR	(*( I2C0_ICR_type *) 0xf00c008cu)	/* Interrupt Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODNUMBER      : 8;	/* Module Number Value */
		/* const */ unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} I2C0_ID_type;
#define I2C0_ID	(*( I2C0_ID_type *) 0xf00c0008u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LSREQ_INT      : 1;	/* Last Single Request Interrupt */
		unsigned int SREQ_INT       : 1;	/* Single Request Interrupt */
		unsigned int LBREQ_INT      : 1;	/* Last Burst Request Interrupt */
		unsigned int BREQ_INT       : 1;	/* Burst Request Interrupt */
		unsigned int I2C_ERR_INT    : 1;	/* I2C Error Interrupt */
		unsigned int I2C_P_INT      : 1;	/* I2C Protocol Interrupt */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} I2C0_IMSC_type;
#define I2C0_IMSC	(*( I2C0_IMSC_type *) 0xf00c0084u)	/* Interrupt Mask Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int LSREQ_INT      : 1;	/* Last Single Request Interrupt */
		unsigned int SREQ_INT       : 1;	/* Single Request Interrupt */
		unsigned int LBREQ_INT      : 1;	/* Last Burst Request Interrupt */
		unsigned int BREQ_INT       : 1;	/* Burst Request Interrupt */
		unsigned int I2C_ERR_INT    : 1;	/* I2C Error Interrupt */
		unsigned int I2C_P_INT      : 1;	/* I2C Protocol Interrupt */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} I2C0_ISR_type;
#define I2C0_ISR	(*( I2C0_ISR_type *) 0xf00c0090u)	/* Interrupt Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} I2C0_KRST0_type;
#define I2C0_KRST0	(*( I2C0_KRST0_type *) 0xf00d0014u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} I2C0_KRST1_type;
#define I2C0_KRST1	(*( I2C0_KRST1_type *) 0xf00d0018u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} I2C0_KRSTCLR_type;
#define I2C0_KRSTCLR	(*( I2C0_KRSTCLR_type *) 0xf00d001cu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int LSREQ_INT      : 1;	/* Last Single Request Interrupt */
		/* const */ unsigned int SREQ_INT       : 1;	/* Single Request Interrupt */
		/* const */ unsigned int LBREQ_INT      : 1;	/* Last Burst Request Interrupt */
		/* const */ unsigned int BREQ_INT       : 1;	/* Burst Request Interrupt */
		/* const */ unsigned int I2C_ERR_INT    : 1;	/* I2C Error Interrupt */
		/* const */ unsigned int I2C_P_INT      : 1;	/* I2C Protocol Interrupt */
		/* const */ unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} I2C0_MIS_type;
#define I2C0_MIS	(*( I2C0_MIS_type *) 0xf00c0088u)	/* Masked Interrupt Status Register */
#define I2C0_RIS	(*( I2C0_MIS_type *) 0xf00c0080u)	/* Raw Interrupt Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} I2C0_MODID_type;
#define I2C0_MODID	(*( I2C0_MODID_type *) 0xf00d0004u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MRPS           : 14;	/* Maximum Received Packet Size */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} I2C0_MRPSCTRL_type;
#define I2C0_MRPSCTRL	(*( I2C0_MRPSCTRL_type *) 0xf00c002cu)	/* Maximum Received Packet Size Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int AM             : 1;	/* Address Match */
		unsigned int GC             : 1;	/* General Call */
		unsigned int MC             : 1;	/* Master Code */
		unsigned int AL             : 1;	/* Arbitration Lost */
		unsigned int NACK           : 1;	/* Not-acknowledge Received */
		unsigned int TX_END         : 1;	/* Transmission End */
		unsigned int RX             : 1;	/* Receive Mode */
		unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

} I2C0_PIRQSC_type;
#define I2C0_PIRQSC	(*( I2C0_PIRQSC_type *) 0xf00c0078u)	/* Protocol Interrupt Request Source Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int AM             : 1;	/* Address Match */
		unsigned int GC             : 1;	/* General Call */
		unsigned int MC             : 1;	/* Master Code */
		unsigned int AL             : 1;	/* Arbitration Lost */
		unsigned int NACK           : 1;	/* Not-acknowledge Received */
		unsigned int TX_END         : 1;	/* Transmission End */
		unsigned int RX             : 1;	/* Receive Mode */
		unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

