svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} I2C0_PIRQSM_type;
#define I2C0_PIRQSM	(*( I2C0_PIRQSM_type *) 0xf00c0070u)	/* Protocol Interrupt Request Source Mask Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int AM             : 1;	/* Address Match */
		/* const */ unsigned int GC             : 1;	/* General Call */
		/* const */ unsigned int MC             : 1;	/* Master Code */
		/* const */ unsigned int AL             : 1;	/* Arbitration Lost */
		/* const */ unsigned int NACK           : 1;	/* Not-acknowledge Received */
		/* const */ unsigned int TX_END         : 1;	/* Transmission End */
		/* const */ unsigned int RX             : 1;	/* Receive Mode */
		/* const */ unsigned int                : 25;
	} B;
	int I;
	unsigned int U;

} I2C0_PIRQSS_type;
#define I2C0_PIRQSS	(*( I2C0_PIRQSS_type *) 0xf00c0074u)	/* Protocol Interrupt Request Source Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RPS            : 14;	/* Received Packet Size */
		/* const */ unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} I2C0_RPSSTAT_type;
#define I2C0_RPSSTAT	(*( I2C0_RPSSTAT_type *) 0xf00c0030u)	/* Received Packet Size Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RUN            : 1;	/* Enable I2C-bus Interface */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} I2C0_RUNCTRL_type;
#define I2C0_RUNCTRL	(*( I2C0_RUNCTRL_type *) 0xf00c0010u)	/* RUN Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXD            : 32;	/* Reception Data */
	} B;
	int I;
	unsigned int U;

} I2C0_RXD_type;
#define I2C0_RXD	(*( I2C0_RXD_type *) 0xf00cc000u)	/* Reception Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SDA_DEL_HD_DAT : 6;	/* SDA Delay Stages for Data Hold Time */
		unsigned int HS_SDA_DEL_HD_DAT: 3;	/* SDA Delay Stages for Data Hold Time in High-speed Mode */
		unsigned int SCL_DEL_HD_STA : 3;	/* SCL Delay Stages for Hold Time Start (Restart) Bit */
		unsigned int                : 2;
		unsigned int EN_SCL_LOW_LEN : 1;	/* Enable Direct Configuration of SCL Low Period Length in Fast Mode */
		unsigned int FS_SCL_LOW     : 1;	/* Set Fast Mode SCL Low Period Timing */
		unsigned int HS_SDA_DEL     : 3;	/* SDA Delay Stages for Start/Stop bit in High-speed Mode */
		unsigned int                : 5;
		unsigned int SCL_LOW_LEN    : 8;	/* SCL Low Length in Fast Mode */
	} B;
	int I;
	unsigned int U;

} I2C0_TIMCFG_type;
#define I2C0_TIMCFG	(*( I2C0_TIMCFG_type *) 0xf00c0040u)	/* Timing Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TPS            : 14;	/* Transmit Packet Size */
		unsigned int                : 18;
	} B;
	int I;
	unsigned int U;

} I2C0_TPSCTRL_type;
#define I2C0_TPSCTRL	(*( I2C0_TPSCTRL_type *) 0xf00c0034u)	/* Transmit Packet Size Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TXD            : 32;	/* Transmission Data */
	} B;
	int I;
	unsigned int U;

} I2C0_TXD_type;
#define I2C0_TXD	(*( I2C0_TXD_type *) 0xf00c8000u)	/* Transmission Data Register */


/* IOM */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} IOM_ACCEN0_type;
#define IOM_ACCEN0	(*( IOM_ACCEN0_type *) 0xf003502cu)	/* IOM Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} IOM_ACCEN1_type;
#define IOM_ACCEN1	(*( IOM_ACCEN1_type *) 0xf0035028u)	/* IOM Access Enable Register 1 */

