svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 1;
		unsigned int EDIS           : 1;	/* Sleep Mode Enable Control */
		unsigned int                : 4;
		unsigned int RMC            : 8;	/* 8-bit Clock Divider Value in RUN Mode */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} IOM_CLC_type;
#define IOM_CLC	(*( IOM_CLC_type *) 0xf0035000u)	/* IOM Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SELC0          : 4;	/* Event Channel Select */
		unsigned int THRC0          : 4;	/* Channel Event Counter Threshold */
		unsigned int SELC1          : 4;	/* Event Channel Select */
		unsigned int THCR1          : 4;	/* Channel Event Counter Threshold */
		unsigned int SELC2          : 4;	/* Event Channel Select */
		unsigned int THCR2          : 4;	/* Channel Event Counter Threshold */
		unsigned int SELC3          : 4;	/* Event Channel Select */
		unsigned int THCR3          : 4;	/* Channel Event Counter Threshold */
	} B;
	int I;
	unsigned int U;

} IOM_ECMCCFG_type;
#define IOM_ECMCCFG	(*( IOM_ECMCCFG_type *) 0xf0035030u)	/* IOM Event Combiner Module Counter Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ETA0_15        : 16;	/* LAM 0-15 Event Trigger Activity (last) */
		unsigned int ETB0_15        : 16;	/* LAM 0-15 Event Trigger Activity (previous ETA0-15) */
	} B;
	int I;
	unsigned int U;

} IOM_ECMETH0_type;
#define IOM_ECMETH0	(*( IOM_ECMETH0_type *) 0xf0035038u)	/* IOM Event Combiner Module Event Trigger History Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int ETC0_15        : 16;	/* LAM 0-15 Event Trigger Activity (previous ETB0-15) */
		unsigned int ETD0_15        : 16;	/* LAM 0-15 Event Trigger Activity (previous ETC0-15) */
	} B;
	int I;
	unsigned int U;

} IOM_ECMETH1_type;
#define IOM_ECMETH1	(*( IOM_ECMETH1_type *) 0xf003503cu)	/* IOM Event Combiner Module Event Trigger History Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CES0           : 1;	/* Event Combiner Selection */
		unsigned int CES1           : 1;	/* Event Combiner Selection */
		unsigned int CES2           : 1;	/* Event Combiner Selection */
		unsigned int CES3           : 1;	/* Event Combiner Selection */
		unsigned int CES4           : 1;	/* Event Combiner Selection */
		unsigned int CES5           : 1;	/* Event Combiner Selection */
		unsigned int CES6           : 1;	/* Event Combiner Selection */
		unsigned int CES7           : 1;	/* Event Combiner Selection */
		unsigned int CES8           : 1;	/* Event Combiner Selection */
		unsigned int CES9           : 1;	/* Event Combiner Selection */
		unsigned int CES10          : 1;	/* Event Combiner Selection */
		unsigned int CES11          : 1;	/* Event Combiner Selection */
		unsigned int CES12          : 1;	/* Event Combiner Selection */
		unsigned int CES13          : 1;	/* Event Combiner Selection */
		unsigned int CES14          : 1;	/* Event Combiner Selection */
		unsigned int CES15          : 1;	/* Event Combiner Selection */
		unsigned int CTS0           : 1;	/* Accumulated (Counted) Event Combiner Selection */
		unsigned int CTS1           : 1;	/* Accumulated (Counted) Event Combiner Selection */
		unsigned int CTS2           : 1;	/* Accumulated (Counted) Event Combiner Selection */
		unsigned int CTS3           : 1;	/* Accumulated (Counted) Event Combiner Selection */
		unsigned int                : 12;
	} B;
	int I;
	unsigned int U;

} IOM_ECMSELR_type;
#define IOM_ECMSELR	(*( IOM_ECMSELR_type *) 0xf0035034u)	/* IOM Event Combiner Module Global Event Selection Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CMP            : 16;	/* Threshold Value of Filter 'and' Prescaler Cell k */
		unsigned int MOD            : 3;	/* Operation Mode Selection for Filter 'and' Prescaler Cell k */
		unsigned int ISM            : 2;	/* Monitor Input Signal Selection for Filter 'and' Prescaler Cell k */
		unsigned int                : 1;
		unsigned int RTG            : 1;	/* Reset Timer behaviour for Filter 'and' Prescaler Cell k on Glitch */
		unsigned int                : 1;
		unsigned int ISR            : 3;	/* Reference Input Signal Selection for Filter 'and' Prescaler Cell k */
		unsigned int                : 5;
	} B;
	int I;
	unsigned int U;

} IOM_FPCCTR0_type;
#define IOM_FPCCTR0	(*( IOM_FPCCTR0_type *) 0xf0035080u)	/* IOM Filter and Prescaler Cell Control Register 0 */
#define IOM_FPCCTR1	(*( IOM_FPCCTR0_type *) 0xf0035084u)	/* IOM Filter and Prescaler Cell Control Register 1 */
#define IOM_FPCCTR10	(*( IOM_FPCCTR0_type *) 0xf00350a8u)	/* IOM Filter and Prescaler Cell Control Register 10 */
#define IOM_FPCCTR11	(*( IOM_FPCCTR0_type *) 0xf00350acu)	/* IOM Filter and Prescaler Cell Control Register 11 */
#define IOM_FPCCTR12	(*( IOM_FPCCTR0_type *) 0xf00350b0u)	/* IOM Filter and Prescaler Cell Control Register 12 */
#define IOM_FPCCTR13	(*( IOM_FPCCTR0_type *) 0xf00350b4u)	/* IOM Filter and Prescaler Cell Control Register 13 */
#define IOM_FPCCTR14	(*( IOM_FPCCTR0_type *) 0xf00350b8u)	/* IOM Filter and Prescaler Cell Control Register 14 */
#define IOM_FPCCTR15	(*( IOM_FPCCTR0_type *) 0xf00350bcu)	/* IOM Filter and Prescaler Cell Control Register 15 */
#define IOM_FPCCTR2	(*( IOM_FPCCTR0_type *) 0xf0035088u)	/* IOM Filter and Prescaler Cell Control Register 2 */
#define IOM_FPCCTR3	(*( IOM_FPCCTR0_type *) 0xf003508cu)	/* IOM Filter and Prescaler Cell Control Register 3 */
#define IOM_FPCCTR4	(*( IOM_FPCCTR0_type *) 0xf0035090u)	/* IOM Filter and Prescaler Cell Control Register 4 */
#define IOM_FPCCTR5	(*( IOM_FPCCTR0_type *) 0xf0035094u)	/* IOM Filter and Prescaler Cell Control Register 5 */
#define IOM_FPCCTR6	(*( IOM_FPCCTR0_type *) 0xf0035098u)	/* IOM Filter and Prescaler Cell Control Register 6 */
#define IOM_FPCCTR7	(*( IOM_FPCCTR0_type *) 0xf003509cu)	/* IOM Filter and Prescaler Cell Control Register 7 */
#define IOM_FPCCTR8	(*( IOM_FPCCTR0_type *) 0xf00350a0u)	/* IOM Filter and Prescaler Cell Control Register 8 */
#define IOM_FPCCTR9	(*( IOM_FPCCTR0_type *) 0xf00350a4u)	/* IOM Filter and Prescaler Cell Control Register 9 */

