svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int FEG0           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG1           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG2           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG3           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG4           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG5           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG6           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG7           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG8           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG9           : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG10          : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG11          : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG12          : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG13          : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG14          : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int FEG15          : 1;	/* Falling Edge Glitch Flag for FPCk */
		unsigned int REG0           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG1           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG2           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG3           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG4           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG5           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG6           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG7           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG8           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG9           : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG10          : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG11          : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG12          : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG13          : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG14          : 1;	/* Rising Edge Glitch Flag for FPCk */
		unsigned int REG15          : 1;	/* Rising Edge Glitch Flag for FPCk */
	} B;
	int I;
	unsigned int U;

} IOM_FPCESR_type;
#define IOM_FPCESR	(*( IOM_FPCESR_type *) 0xf0035078u)	/* IOM Filter and Prescaler Cells Rising 'and' Falling Edge Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TIM            : 16;	/* Timer Value of Filter and Prescaler Cell k */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} IOM_FPCTIM0_type;
#define IOM_FPCTIM0	(*( IOM_FPCTIM0_type *) 0xf00350c0u)	/* IOM Filter and Prescaler Cell 0 Timer Register k */
#define IOM_FPCTIM1	(*( IOM_FPCTIM0_type *) 0xf00350c4u)	/* IOM Filter and Prescaler Cell 1 Timer Register k */
#define IOM_FPCTIM10	(*( IOM_FPCTIM0_type *) 0xf00350e8u)	/* IOM Filter and Prescaler Cell 10 Timer Register k */
#define IOM_FPCTIM11	(*( IOM_FPCTIM0_type *) 0xf00350ecu)	/* IOM Filter and Prescaler Cell 11 Timer Register k */
#define IOM_FPCTIM12	(*( IOM_FPCTIM0_type *) 0xf00350f0u)	/* IOM Filter and Prescaler Cell 12 Timer Register k */
#define IOM_FPCTIM13	(*( IOM_FPCTIM0_type *) 0xf00350f4u)	/* IOM Filter and Prescaler Cell 13 Timer Register k */
#define IOM_FPCTIM14	(*( IOM_FPCTIM0_type *) 0xf00350f8u)	/* IOM Filter and Prescaler Cell 14 Timer Register k */
#define IOM_FPCTIM15	(*( IOM_FPCTIM0_type *) 0xf00350fcu)	/* IOM Filter and Prescaler Cell 15 Timer Register k */
#define IOM_FPCTIM2	(*( IOM_FPCTIM0_type *) 0xf00350c8u)	/* IOM Filter and Prescaler Cell 2 Timer Register k */
#define IOM_FPCTIM3	(*( IOM_FPCTIM0_type *) 0xf00350ccu)	/* IOM Filter and Prescaler Cell 3 Timer Register k */
#define IOM_FPCTIM4	(*( IOM_FPCTIM0_type *) 0xf00350d0u)	/* IOM Filter and Prescaler Cell 4 Timer Register k */
#define IOM_FPCTIM5	(*( IOM_FPCTIM0_type *) 0xf00350d4u)	/* IOM Filter and Prescaler Cell 5 Timer Register k */
#define IOM_FPCTIM6	(*( IOM_FPCTIM0_type *) 0xf00350d8u)	/* IOM Filter and Prescaler Cell 6 Timer Register k */
#define IOM_FPCTIM7	(*( IOM_FPCTIM0_type *) 0xf00350dcu)	/* IOM Filter and Prescaler Cell 7 Timer Register k */
#define IOM_FPCTIM8	(*( IOM_FPCTIM0_type *) 0xf00350e0u)	/* IOM Filter and Prescaler Cell 8 Timer Register k */
#define IOM_FPCTIM9	(*( IOM_FPCTIM0_type *) 0xf00350e4u)	/* IOM Filter and Prescaler Cell 9 Timer Register k */

typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* GTM input 0 selection for EXOR combiner */
		unsigned int EN1            : 1;	/* GTM input 1 selection for EXOR combiner */
		unsigned int EN2            : 1;	/* GTM input 2 selection for EXOR combiner */
		unsigned int EN3            : 1;	/* GTM input 3 selection for EXOR combiner */
		unsigned int EN4            : 1;	/* GTM input 4 selection for EXOR combiner */
		unsigned int EN5            : 1;	/* GTM input 5 selection for EXOR combiner */
		unsigned int EN6            : 1;	/* GTM input 6 selection for EXOR combiner */
		unsigned int EN7            : 1;	/* GTM input 7 selection for EXOR combiner */
		unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} IOM_GTMEXR_type;
#define IOM_GTMEXR	(*( IOM_GTMEXR_type *) 0xf0035040u)	/* IOM GTM Input EXOR Combiner Selection Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} IOM_ID_type;
#define IOM_ID	(*( IOM_ID_type *) 0xf0035008u)	/* IOM Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} IOM_KRST0_type;
#define IOM_KRST0	(*( IOM_KRST0_type *) 0xf0035024u)	/* IOM Kernel Reset Register 0 */

