svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} IOM_KRST1_type;
#define IOM_KRST1	(*( IOM_KRST1_type *) 0xf0035020u)	/* IOM Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} IOM_KRSTCLR_type;
#define IOM_KRSTCLR	(*( IOM_KRSTCLR_type *) 0xf003501cu)	/* IOM Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int IVR            : 1;	/* Invert Reference LAM block m */
		unsigned int IVM            : 1;	/* Invert Monitor LAM block m */
		unsigned int MOS            : 1;	/* Monitor Source Select LAM block m */
		unsigned int RMS            : 1;	/* Runmode Select LAM block m */
		unsigned int EWS            : 1;	/* Event Window Select LAM block m */
		unsigned int                : 3;
		unsigned int EDS            : 4;	/* Event Window Active Edge Selection LAM block m */
		unsigned int IVW            : 1;	/* Invert Event Window LAM block m */
		unsigned int                : 3;
		unsigned int MCS            : 4;	/* Monitor Input Signal Selection LAM block m */
		unsigned int RCS            : 4;	/* Reference Input Signal Selection LAM block m */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} IOM_LAMCFG0_type;
#define IOM_LAMCFG0	(*( IOM_LAMCFG0_type *) 0xf0035180u)	/* IOM Logic Analyzer Module Configuration Register 0 */
#define IOM_LAMCFG1	(*( IOM_LAMCFG0_type *) 0xf0035184u)	/* IOM Logic Analyzer Module Configuration Register 1 */
#define IOM_LAMCFG10	(*( IOM_LAMCFG0_type *) 0xf00351a8u)	/* IOM Logic Analyzer Module Configuration Register 10 */
#define IOM_LAMCFG11	(*( IOM_LAMCFG0_type *) 0xf00351acu)	/* IOM Logic Analyzer Module Configuration Register 11 */
#define IOM_LAMCFG12	(*( IOM_LAMCFG0_type *) 0xf00351b0u)	/* IOM Logic Analyzer Module Configuration Register 12 */
#define IOM_LAMCFG13	(*( IOM_LAMCFG0_type *) 0xf00351b4u)	/* IOM Logic Analyzer Module Configuration Register 13 */
#define IOM_LAMCFG14	(*( IOM_LAMCFG0_type *) 0xf00351b8u)	/* IOM Logic Analyzer Module Configuration Register 14 */
#define IOM_LAMCFG15	(*( IOM_LAMCFG0_type *) 0xf00351bcu)	/* IOM Logic Analyzer Module Configuration Register 15 */
#define IOM_LAMCFG2	(*( IOM_LAMCFG0_type *) 0xf0035188u)	/* IOM Logic Analyzer Module Configuration Register 2 */
#define IOM_LAMCFG3	(*( IOM_LAMCFG0_type *) 0xf003518cu)	/* IOM Logic Analyzer Module Configuration Register 3 */
#define IOM_LAMCFG4	(*( IOM_LAMCFG0_type *) 0xf0035190u)	/* IOM Logic Analyzer Module Configuration Register 4 */
#define IOM_LAMCFG5	(*( IOM_LAMCFG0_type *) 0xf0035194u)	/* IOM Logic Analyzer Module Configuration Register 5 */
#define IOM_LAMCFG6	(*( IOM_LAMCFG0_type *) 0xf0035198u)	/* IOM Logic Analyzer Module Configuration Register 6 */
#define IOM_LAMCFG7	(*( IOM_LAMCFG0_type *) 0xf003519cu)	/* IOM Logic Analyzer Module Configuration Register 7 */
#define IOM_LAMCFG8	(*( IOM_LAMCFG0_type *) 0xf00351a0u)	/* IOM Logic Analyzer Module Configuration Register 8 */
#define IOM_LAMCFG9	(*( IOM_LAMCFG0_type *) 0xf00351a4u)	/* IOM Logic Analyzer Module Configuration Register 9 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CNT            : 24;	/* Event Window Count Value LAM block m */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} IOM_LAMEWC0_type;
#define IOM_LAMEWC0	(*( IOM_LAMEWC0_type *) 0xf0035100u)	/* IOM Logic Analyzer Module Event Window Count Status Register 0 */
#define IOM_LAMEWC1	(*( IOM_LAMEWC0_type *) 0xf0035104u)	/* IOM Logic Analyzer Module Event Window Count Status Register 1 */
#define IOM_LAMEWC10	(*( IOM_LAMEWC0_type *) 0xf0035128u)	/* IOM Logic Analyzer Module Event Window Count Status Register 10 */
#define IOM_LAMEWC11	(*( IOM_LAMEWC0_type *) 0xf003512cu)	/* IOM Logic Analyzer Module Event Window Count Status Register 11 */
#define IOM_LAMEWC12	(*( IOM_LAMEWC0_type *) 0xf0035130u)	/* IOM Logic Analyzer Module Event Window Count Status Register 12 */
#define IOM_LAMEWC13	(*( IOM_LAMEWC0_type *) 0xf0035134u)	/* IOM Logic Analyzer Module Event Window Count Status Register 13 */
#define IOM_LAMEWC14	(*( IOM_LAMEWC0_type *) 0xf0035138u)	/* IOM Logic Analyzer Module Event Window Count Status Register 14 */
#define IOM_LAMEWC15	(*( IOM_LAMEWC0_type *) 0xf003513cu)	/* IOM Logic Analyzer Module Event Window Count Status Register 15 */
#define IOM_LAMEWC2	(*( IOM_LAMEWC0_type *) 0xf0035108u)	/* IOM Logic Analyzer Module Event Window Count Status Register 2 */
#define IOM_LAMEWC3	(*( IOM_LAMEWC0_type *) 0xf003510cu)	/* IOM Logic Analyzer Module Event Window Count Status Register 3 */
#define IOM_LAMEWC4	(*( IOM_LAMEWC0_type *) 0xf0035110u)	/* IOM Logic Analyzer Module Event Window Count Status Register 4 */
#define IOM_LAMEWC5	(*( IOM_LAMEWC0_type *) 0xf0035114u)	/* IOM Logic Analyzer Module Event Window Count Status Register 5 */
#define IOM_LAMEWC6	(*( IOM_LAMEWC0_type *) 0xf0035118u)	/* IOM Logic Analyzer Module Event Window Count Status Register 6 */
#define IOM_LAMEWC7	(*( IOM_LAMEWC0_type *) 0xf003511cu)	/* IOM Logic Analyzer Module Event Window Count Status Register 7 */
#define IOM_LAMEWC8	(*( IOM_LAMEWC0_type *) 0xf0035120u)	/* IOM Logic Analyzer Module Event Window Count Status Register 8 */
#define IOM_LAMEWC9	(*( IOM_LAMEWC0_type *) 0xf0035124u)	/* IOM Logic Analyzer Module Event Window Count Status Register 9 */

typedef volatile union
{
	struct
	{ 
		unsigned int THR            : 24;	/* Event Window Count Threshold */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} IOM_LAMEWS0_type;
#define IOM_LAMEWS0	(*( IOM_LAMEWS0_type *) 0xf00351c0u)	/* IOM Logic Analyzer Module Event Window Configuration Register 0 */
#define IOM_LAMEWS1	(*( IOM_LAMEWS0_type *) 0xf00351c4u)	/* IOM Logic Analyzer Module Event Window Configuration Register 1 */
#define IOM_LAMEWS10	(*( IOM_LAMEWS0_type *) 0xf00351e8u)	/* IOM Logic Analyzer Module Event Window Configuration Register 10 */
#define IOM_LAMEWS11	(*( IOM_LAMEWS0_type *) 0xf00351ecu)	/* IOM Logic Analyzer Module Event Window Configuration Register 11 */
#define IOM_LAMEWS12	(*( IOM_LAMEWS0_type *) 0xf00351f0u)	/* IOM Logic Analyzer Module Event Window Configuration Register 12 */
#define IOM_LAMEWS13	(*( IOM_LAMEWS0_type *) 0xf00351f4u)	/* IOM Logic Analyzer Module Event Window Configuration Register 13 */
#define IOM_LAMEWS14	(*( IOM_LAMEWS0_type *) 0xf00351f8u)	/* IOM Logic Analyzer Module Event Window Configuration Register 14 */
#define IOM_LAMEWS15	(*( IOM_LAMEWS0_type *) 0xf00351fcu)	/* IOM Logic Analyzer Module Event Window Configuration Register 15 */
#define IOM_LAMEWS2	(*( IOM_LAMEWS0_type *) 0xf00351c8u)	/* IOM Logic Analyzer Module Event Window Configuration Register 2 */
#define IOM_LAMEWS3	(*( IOM_LAMEWS0_type *) 0xf00351ccu)	/* IOM Logic Analyzer Module Event Window Configuration Register 3 */
#define IOM_LAMEWS4	(*( IOM_LAMEWS0_type *) 0xf00351d0u)	/* IOM Logic Analyzer Module Event Window Configuration Register 4 */
#define IOM_LAMEWS5	(*( IOM_LAMEWS0_type *) 0xf00351d4u)	/* IOM Logic Analyzer Module Event Window Configuration Register 5 */
#define IOM_LAMEWS6	(*( IOM_LAMEWS0_type *) 0xf00351d8u)	/* IOM Logic Analyzer Module Event Window Configuration Register 6 */
#define IOM_LAMEWS7	(*( IOM_LAMEWS0_type *) 0xf00351dcu)	/* IOM Logic Analyzer Module Event Window Configuration Register 7 */
#define IOM_LAMEWS8	(*( IOM_LAMEWS0_type *) 0xf00351e0u)	/* IOM Logic Analyzer Module Event Window Configuration Register 8 */
#define IOM_LAMEWS9	(*( IOM_LAMEWS0_type *) 0xf00351e4u)	/* IOM Logic Analyzer Module Event Window Configuration Register 9 */


