svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
/* PSI5 */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} PSI5_ACCEN0_type;
#define PSI5_ACCEN0	(*( PSI5_ACCEN0_type *) 0xf00053d0u)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} PSI5_ACCEN1_type;
#define PSI5_ACCEN1	(*( PSI5_ACCEN1_type *) 0xf00053d4u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} PSI5_CLC_type;
#define PSI5_CLC	(*( PSI5_CLC_type *) 0xf0005000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CRCI0          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI1          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI2          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI3          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI4          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI5          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI6          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI7          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI8          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI9          : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI10         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI11         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI12         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI13         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI14         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI15         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI16         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI17         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI18         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI19         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI20         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI21         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI22         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI23         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI24         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI25         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI26         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI27         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI28         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI29         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI30         : 1;	/* Clear CRCI Flag of Buffer y */
		unsigned int CRCI31         : 1;	/* Clear CRCI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_CRCICLR0_type;
#define PSI5_CRCICLR0	(*( PSI5_CRCICLR0_type *) 0xf000559cu)	/* CRCIOV0 Clear Register */
#define PSI5_CRCICLR1	(*( PSI5_CRCICLR0_type *) 0xf00055a0u)	/* CRCIOV1 Clear Register */
#define PSI5_CRCICLR2	(*( PSI5_CRCICLR0_type *) 0xf00055a4u)	/* CRCIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CRCI0          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI1          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI2          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI3          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI4          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI5          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI6          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI7          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI8          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI9          : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI10         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI11         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI12         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI13         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI14         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI15         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI16         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI17         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI18         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI19         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI20         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI21         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI22         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI23         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI24         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI25         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI26         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI27         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI28         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI29         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI30         : 1;	/* CRCI Flag of Buffer y */
		/* const */ unsigned int CRCI31         : 1;	/* CRCI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_CRCIOV0_type;
#define PSI5_CRCIOV0	(*( PSI5_CRCIOV0_type *) 0xf000545cu)	/* CRCI Overview Register */
#define PSI5_CRCIOV1	(*( PSI5_CRCIOV0_type *) 0xf0005460u)	/* CRCI Overview Register */
#define PSI5_CRCIOV2	(*( PSI5_CRCIOV0_type *) 0xf0005464u)	/* CRCI Overview Register */

