svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int CRCI0          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI1          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI2          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI3          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI4          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI5          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI6          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI7          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI8          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI9          : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI10         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI11         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI12         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI13         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI14         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI15         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI16         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI17         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI18         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI19         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI20         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI21         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI22         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI23         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI24         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI25         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI26         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI27         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI28         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI29         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI30         : 1;	/* Set CRCI Flag of Buffer y */
		unsigned int CRCI31         : 1;	/* Set CRCI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_CRCISET0_type;
#define PSI5_CRCISET0	(*( PSI5_CRCISET0_type *) 0xf00054fcu)	/* CRCIOV0 Set Register */
#define PSI5_CRCISET1	(*( PSI5_CRCISET0_type *) 0xf0005500u)	/* CRCIOV1 Set Register */
#define PSI5_CRCISET2	(*( PSI5_CRCISET0_type *) 0xf0005504u)	/* CRCIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CTV            : 16;	/* Channel Trigger Value CTV */
		unsigned int CTC            : 16;	/* Channel Trigger Counter */
	} B;
	int I;
	unsigned int U;

} PSI5_CTV0_type;
#define PSI5_CTV0	(*( PSI5_CTV0_type *) 0xf000508cu)	/* Channel Trigger Value Register 0 */
#define PSI5_CTV1	(*( PSI5_CTV0_type *) 0xf000511cu)	/* Channel Trigger Value Register 1 */
#define PSI5_CTV2	(*( PSI5_CTV0_type *) 0xf00051acu)	/* Channel Trigger Value Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 4;
		unsigned int DM             : 2;	/* Divider Mode */
		/* const */ unsigned int RESULT         : 10;	/* Result Value */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} PSI5_FDR_type;
#define PSI5_FDR	(*( PSI5_FDR_type *) 0xf000500cu)	/* SMU Fractional Divider Register */

typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 4;
		unsigned int DM             : 2;	/* Divider Mode */
		/* const */ unsigned int RESULT         : 10;	/* Result Value */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} PSI5_FDRH_type;
#define PSI5_FDRH	(*( PSI5_FDRH_type *) 0xf0005014u)	/* Fractional Divider Register for Higher Bit Rate */
#define PSI5_FDRL	(*( PSI5_FDRH_type *) 0xf0005010u)	/* Fractional Divider Register for Lower Bit Rate */

typedef volatile union
{
	struct
	{ 
		unsigned int STEP           : 10;	/* Step Value */
		unsigned int                : 4;
		unsigned int DM             : 2;	/* Divider Mode */
		/* const */ unsigned int RESULT         : 10;	/* Result Value */
		unsigned int ECS            : 3;	/* External Time Stamp Clear Source Select */
		unsigned int ECEA           : 1;	/* External Time Stamp Clear Enable A */
		unsigned int ECEB           : 1;	/* External Time Stamp Clear Enable B */
		unsigned int ECEC           : 1;	/* External Time Stamp Clear Enable C */
	} B;
	int I;
	unsigned int U;

} PSI5_FDRT_type;
#define PSI5_FDRT	(*( PSI5_FDRT_type *) 0xf0005018u)	/* Fractional Divider Register for Time Stamp */

typedef volatile union
{
	struct
	{ 
		unsigned int CRCI           : 1;	/* CRCI */
		unsigned int NBI            : 1;	/* NBI */
		unsigned int MEI            : 1;	/* MEI */
		unsigned int NFI            : 1;	/* NFI */
		unsigned int TEI            : 1;	/* TEI */
		unsigned int                : 3;
		unsigned int ETC0           : 1;	/* Enable Channel Trigger Counter CTVx.CTC */
		unsigned int ETC1           : 1;	/* Enable Channel Trigger Counter CTVx.CTC */
		unsigned int ETC2           : 1;	/* Enable Channel Trigger Counter CTVx.CTC */
		unsigned int ETC3           : 1;	/* Enable Channel Trigger Counter CTVx.CTC */
		unsigned int ETC4           : 1;	/* Enable Channel Trigger Counter CTVx.CTC */
		unsigned int                : 3;
		unsigned int CEN0           : 1;	/* Enable Channel */
		unsigned int CEN1           : 1;	/* Enable Channel */
		unsigned int CEN2           : 1;	/* Enable Channel */
		unsigned int CEN3           : 1;	/* Enable Channel */
		unsigned int CEN4           : 1;	/* Enable Channel */
		unsigned int                : 11;
	} B;
	int I;
	unsigned int U;

} PSI5_GCR_type;
#define PSI5_GCR	(*( PSI5_GCR_type *) 0xf000502cu)	/* Global Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} PSI5_ID_type;
#define PSI5_ID	(*( PSI5_ID_type *) 0xf0005008u)	/* Module Identification Register */

