svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 4;	/* Interrupt Node Pointer for Interrupt RSI */
		unsigned int RDI            : 4;	/* Interrupt Node Pointer for Interrupt RDI */
		unsigned int RBI            : 4;	/* Interrupt Node Pointer for Interrupt RBI */
		unsigned int TDI            : 4;	/* Interrupt Node Pointer for Interrupt TDI */
		unsigned int TBI            : 4;	/* Interrupt Node Pointer for Interrupt TBI */
		unsigned int ERRI           : 4;	/* Interrupt Node Pointer for Interrupt ERRI */
		unsigned int SDI            : 4;	/* Interrupt Node Pointer for Interrupt SDI */
		unsigned int FWI            : 4;	/* Interrupt Node Pointer for FWI */
	} B;
	int I;
	unsigned int U;

} PSI5_INP0_type;
#define PSI5_INP0	(*( PSI5_INP0_type *) 0xf00052fcu)	/* Interrupt Node Pointer Register 0 */
#define PSI5_INP1	(*( PSI5_INP0_type *) 0xf0005300u)	/* Interrupt Node Pointer Register 1 */
#define PSI5_INP2	(*( PSI5_INP0_type *) 0xf0005304u)	/* Interrupt Node Pointer Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 1;	/* Clear Interrupt Request Flag RSI */
		unsigned int RDI            : 1;	/* Clear Interrupt Request Flag RDI */
		unsigned int RBI            : 1;	/* Clear Interrupt Request Flag RBI */
		unsigned int TEI            : 1;	/* Clear Interrupt Request Flag TEI */
		unsigned int NBI            : 1;	/* Clear Interrupt Request Flag NBI */
		unsigned int MEI            : 1;	/* Clear Interrupt Request Flag MEI */
		unsigned int CRCI           : 1;	/* Clear Interrupt Request Flag CRCI */
		unsigned int FWI            : 1;	/* Clear Interrupt Request Flag FWI */
		unsigned int RUI            : 1;	/* Clear Interrupt Request Flag RUI */
		unsigned int RMI            : 1;	/* Clear Interrupt Request Flag RMI */
		unsigned int TPI            : 1;	/* Clear Interrupt Request Flag TPI */
		unsigned int TPOI           : 1;	/* Clear Interrupt Request Flag TPOI */
		unsigned int TSI            : 1;	/* Clear Interrupt Request Flag TSI */
		unsigned int TSOI           : 1;	/* Clear Interrupt Request Flag TSOI */
		unsigned int TOI            : 1;	/* Clear Interrupt Request Flag TOI */
		unsigned int TOOI           : 1;	/* Clear Interrupt Request Flag TOOI */
		unsigned int NFI            : 1;	/* Clear Interrupt Request Flag NFI */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} PSI5_INTCLRA0_type;
#define PSI5_INTCLRA0	(*( PSI5_INTCLRA0_type *) 0xf0005360u)	/* Interrupt Clear Register A 0 */
#define PSI5_INTCLRA1	(*( PSI5_INTCLRA0_type *) 0xf0005364u)	/* Interrupt Clear Register A 1 */
#define PSI5_INTCLRA2	(*( PSI5_INTCLRA0_type *) 0xf0005368u)	/* Interrupt Clear Register A 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int WSI0           : 1;	/* Clear Interrupt Request Flag WSIy */
		unsigned int WSI1           : 1;	/* Clear Interrupt Request Flag WSIy */
		unsigned int WSI2           : 1;	/* Clear Interrupt Request Flag WSIy */
		unsigned int WSI3           : 1;	/* Clear Interrupt Request Flag WSIy */
		unsigned int WSI4           : 1;	/* Clear Interrupt Request Flag WSIy */
		unsigned int WSI5           : 1;	/* Clear Interrupt Request Flag WSIy */
		unsigned int SDI0           : 1;	/* Clear Interrupt Request Flag SDIy */
		unsigned int SDI1           : 1;	/* Clear Interrupt Request Flag SDIy */
		unsigned int SDI2           : 1;	/* Clear Interrupt Request Flag SDIy */
		unsigned int SDI3           : 1;	/* Clear Interrupt Request Flag SDIy */
		unsigned int SDI4           : 1;	/* Clear Interrupt Request Flag SDIy */
		unsigned int SDI5           : 1;	/* Clear Interrupt Request Flag SDIy */
		unsigned int SOI0           : 1;	/* Clear Interrupt Request Flag SOIy */
		unsigned int SOI1           : 1;	/* Clear Interrupt Request Flag SOIy */
		unsigned int SOI2           : 1;	/* Clear Interrupt Request Flag SOIy */
		unsigned int SOI3           : 1;	/* Clear Interrupt Request Flag SOIy */
		unsigned int SOI4           : 1;	/* Clear Interrupt Request Flag SOIy */
		unsigned int SOI5           : 1;	/* Clear Interrupt Request Flag SOIy */
		unsigned int SCRI0          : 1;	/* Clear Interrupt Request Flag SCRIy */
		unsigned int SCRI1          : 1;	/* Clear Interrupt Request Flag SCRIy */
		unsigned int SCRI2          : 1;	/* Clear Interrupt Request Flag SCRIy */
		unsigned int SCRI3          : 1;	/* Clear Interrupt Request Flag SCRIy */
		unsigned int SCRI4          : 1;	/* Clear Interrupt Request Flag SCRIy */
		unsigned int SCRI5          : 1;	/* Clear Interrupt Request Flag SCRIy */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} PSI5_INTCLRB0_type;
#define PSI5_INTCLRB0	(*( PSI5_INTCLRB0_type *) 0xf0005374u)	/* Interrupt Clear Register A 0 */
#define PSI5_INTCLRB1	(*( PSI5_INTCLRB0_type *) 0xf0005378u)	/* Interrupt Clear Register A 1 */
#define PSI5_INTCLRB2	(*( PSI5_INTCLRB0_type *) 0xf000537cu)	/* Interrupt Clear Register A 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 1;	/* Enable Interrupt Request RSI */
		unsigned int RDI            : 1;	/* Enable Interrupt Request RDI */
		unsigned int RBI            : 1;	/* Enable Interrupt Request RBI */
		unsigned int TEI            : 1;	/* Enable Interrupt Request TEI */
		unsigned int NBI            : 1;	/* Enable Interrupt Request NBI */
		unsigned int MEI            : 1;	/* Enable Interrupt Request MEII */
		unsigned int CRCI           : 1;	/* Enable Interrupt Request CRCI */
		unsigned int FWI            : 1;	/* Enable Interrupt Request FWI */
		unsigned int RUI            : 1;	/* Enable Interrupt Request RUI */
		unsigned int RMI            : 1;	/* Enable Interrupt Request RMII */
		unsigned int TPI            : 1;	/* Enable Interrupt Request TPI */
		unsigned int TPOI           : 1;	/* Enable Interrupt Request TPOI */
		unsigned int TSI            : 1;	/* Enable Interrupt Request TSI */
		unsigned int TSOI           : 1;	/* Enable Interrupt Request TSOI */
		unsigned int TOI            : 1;	/* Enable Interrupt Request TOI */
		unsigned int TOOI           : 1;	/* Enable Interrupt Request TOOI */
		unsigned int NFI            : 1;	/* Enable Interrupt Request NFI */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} PSI5_INTENA0_type;
#define PSI5_INTENA0	(*( PSI5_INTENA0_type *) 0xf0005388u)	/* Interrupt Enable Register A 0 */
#define PSI5_INTENA1	(*( PSI5_INTENA0_type *) 0xf000538cu)	/* Interrupt Enable Register A 1 */
#define PSI5_INTENA2	(*( PSI5_INTENA0_type *) 0xf0005390u)	/* Interrupt Enable Register A 2 */

