svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int WSI0           : 1;	/* Enable Interrupt Request WSIy */
		unsigned int WSI1           : 1;	/* Enable Interrupt Request WSIy */
		unsigned int WSI2           : 1;	/* Enable Interrupt Request WSIy */
		unsigned int WSI3           : 1;	/* Enable Interrupt Request WSIy */
		unsigned int WSI4           : 1;	/* Enable Interrupt Request WSIy */
		unsigned int WSI5           : 1;	/* Enable Interrupt Request WSIy */
		unsigned int SDI0           : 1;	/* Enable Interrupt Request SDIy */
		unsigned int SDI1           : 1;	/* Enable Interrupt Request SDIy */
		unsigned int SDI2           : 1;	/* Enable Interrupt Request SDIy */
		unsigned int SDI3           : 1;	/* Enable Interrupt Request SDIy */
		unsigned int SDI4           : 1;	/* Enable Interrupt Request SDIy */
		unsigned int SDI5           : 1;	/* Enable Interrupt Request SDIy */
		unsigned int SOI0           : 1;	/* Enable Interrupt Request SOIy */
		unsigned int SOI1           : 1;	/* Enable Interrupt Request SOIy */
		unsigned int SOI2           : 1;	/* Enable Interrupt Request SOIy */
		unsigned int SOI3           : 1;	/* Enable Interrupt Request SOIy */
		unsigned int SOI4           : 1;	/* Enable Interrupt Request SOIy */
		unsigned int SOI5           : 1;	/* Enable Interrupt Request SOIy */
		unsigned int SCRI0          : 1;	/* Enable Interrupt Request SCRIy */
		unsigned int SCRI1          : 1;	/* Enable Interrupt Request SCRIy */
		unsigned int SCRI2          : 1;	/* Enable Interrupt Request SCRIy */
		unsigned int SCRI3          : 1;	/* Enable Interrupt Request SCRIy */
		unsigned int SCRI4          : 1;	/* Enable Interrupt Request SCRIy */
		unsigned int SCRI5          : 1;	/* Enable Interrupt Request SCRIy */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} PSI5_INTENB0_type;
#define PSI5_INTENB0	(*( PSI5_INTENB0_type *) 0xf000539cu)	/* Interrupt Enable Register B 0 */
#define PSI5_INTENB1	(*( PSI5_INTENB0_type *) 0xf00053a0u)	/* Interrupt Enable Register B 1 */
#define PSI5_INTENB2	(*( PSI5_INTENB0_type *) 0xf00053a4u)	/* Interrupt Enable Register B 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RSI            : 1;	/* Interrupt Pending on any Node Pointer RSI */
		/* const */ unsigned int RDI            : 1;	/* Interrupt Pending on any Node Pointer RDI */
		/* const */ unsigned int RBI            : 1;	/* Interrupt Pending on any Node Pointer RBI */
		/* const */ unsigned int TDI            : 1;	/* Interrupt Pending on any Node Pointer TDI */
		/* const */ unsigned int TBI            : 1;	/* Interrupt Pending on any Node Pointer TBI */
		/* const */ unsigned int ERRI           : 1;	/* Interrupt Pending on any Node Pointer ERRI */
		/* const */ unsigned int SDI            : 1;	/* Interrupt Pending on any Node Pointer SDI */
		/* const */ unsigned int FWI            : 1;	/* Interrupt Pending on any Node Pointer FWI */
		/* const */ unsigned int                : 24;
	} B;
	int I;
	unsigned int U;

} PSI5_INTOV_type;
#define PSI5_INTOV	(*( PSI5_INTOV_type *) 0xf00052f8u)	/* Interrupt Overview Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI            : 1;	/* Set Interrupt Request Flag RSI */
		unsigned int RDI            : 1;	/* Set Interrupt Request Flag RDI */
		unsigned int RBI            : 1;	/* Set Interrupt Request Flag RBI */
		unsigned int TEI            : 1;	/* Set Interrupt Request Flag TEI */
		unsigned int NBI            : 1;	/* Set Interrupt Request Flag NBI */
		unsigned int MEI            : 1;	/* Set Interrupt Request Flag MEI */
		unsigned int CRCI           : 1;	/* Set Interrupt Request Flag CRCI */
		unsigned int FWI            : 1;	/* Set Interrupt Request Flag FWI */
		unsigned int RUI            : 1;	/* Set Interrupt Request Flag RUI */
		unsigned int RMI            : 1;	/* Set Interrupt Request Flag RMI */
		unsigned int TPI            : 1;	/* Set Interrupt Request Flag TPI */
		unsigned int TPOI           : 1;	/* Set Interrupt Request Flag TPOI */
		unsigned int TSI            : 1;	/* Set Interrupt Request Flag TSI */
		unsigned int TSOI           : 1;	/* Set Interrupt Request Flag TSOI */
		unsigned int TOI            : 1;	/* Set Interrupt Request Flag TOI */
		unsigned int TOOI           : 1;	/* Set Interrupt Request Flag TOOI */
		unsigned int NFI            : 1;	/* Set Interrupt Request Flag NFI */
		unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} PSI5_INTSETA0_type;
#define PSI5_INTSETA0	(*( PSI5_INTSETA0_type *) 0xf0005338u)	/* Interrupt Set Register A 0 */
#define PSI5_INTSETA1	(*( PSI5_INTSETA0_type *) 0xf000533cu)	/* Interrupt Set Register A 1 */
#define PSI5_INTSETA2	(*( PSI5_INTSETA0_type *) 0xf0005340u)	/* Interrupt Set Register A 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int WSI0           : 1;	/* Set Interrupt Request Flag WSIy */
		unsigned int WSI1           : 1;	/* Set Interrupt Request Flag WSIy */
		unsigned int WSI2           : 1;	/* Set Interrupt Request Flag WSIy */
		unsigned int WSI3           : 1;	/* Set Interrupt Request Flag WSIy */
		unsigned int WSI4           : 1;	/* Set Interrupt Request Flag WSIy */
		unsigned int WSI5           : 1;	/* Set Interrupt Request Flag WSIy */
		unsigned int SDI0           : 1;	/* Set Interrupt Request Flag SDIy */
		unsigned int SDI1           : 1;	/* Set Interrupt Request Flag SDIy */
		unsigned int SDI2           : 1;	/* Set Interrupt Request Flag SDIy */
		unsigned int SDI3           : 1;	/* Set Interrupt Request Flag SDIy */
		unsigned int SDI4           : 1;	/* Set Interrupt Request Flag SDIy */
		unsigned int SDI5           : 1;	/* Set Interrupt Request Flag SDIy */
		unsigned int SOI0           : 1;	/* Set Interrupt Request Flag SOIy */
		unsigned int SOI1           : 1;	/* Set Interrupt Request Flag SOIy */
		unsigned int SOI2           : 1;	/* Set Interrupt Request Flag SOIy */
		unsigned int SOI3           : 1;	/* Set Interrupt Request Flag SOIy */
		unsigned int SOI4           : 1;	/* Set Interrupt Request Flag SOIy */
		unsigned int SOI5           : 1;	/* Set Interrupt Request Flag SOIy */
		unsigned int SCRI0          : 1;	/* Set Interrupt Request Flag SCRIy */
		unsigned int SCRI1          : 1;	/* Set Interrupt Request Flag SCRIy */
		unsigned int SCRI2          : 1;	/* Set Interrupt Request Flag SCRIy */
		unsigned int SCRI3          : 1;	/* Set Interrupt Request Flag SCRIy */
		unsigned int SCRI4          : 1;	/* Set Interrupt Request Flag SCRIy */
		unsigned int SCRI5          : 1;	/* Set Interrupt Request Flag SCRIy */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

