svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} PSI5_INTSETB0_type;
#define PSI5_INTSETB0	(*( PSI5_INTSETB0_type *) 0xf000534cu)	/* Interrupt Set Register B 0 */
#define PSI5_INTSETB1	(*( PSI5_INTSETB0_type *) 0xf0005350u)	/* Interrupt Set Register B 1 */
#define PSI5_INTSETB2	(*( PSI5_INTSETB0_type *) 0xf0005354u)	/* Interrupt Set Register B 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RSI            : 1;	/* Receive Success Interrupt Request Flag */
		/* const */ unsigned int RDI            : 1;	/* Receive Data Interrupt Request Flag */
		/* const */ unsigned int RBI            : 1;	/* Receive Buffer Overflow Interrupt Request Flag */
		/* const */ unsigned int TEI            : 1;	/* Time Slot Error Interrupt Request Flag */
		/* const */ unsigned int NBI            : 1;	/* Number of Bits too low Request Flag */
		/* const */ unsigned int MEI            : 1;	/* Error in Message Bits Flag */
		/* const */ unsigned int CRCI           : 1;	/* CRC Error Request Flag */
		/* const */ unsigned int FWI            : 1;	/* FIFO Warning Level Request Flag */
		/* const */ unsigned int RUI            : 1;	/* Receive Memory Underrun Interrupt Request Flag */
		/* const */ unsigned int RMI            : 1;	/* Receive Memory Overflow Flag */
		/* const */ unsigned int TPI            : 1;	/* Transfer Preparation Interrupt Request Flag */
		/* const */ unsigned int TPOI           : 1;	/* Transmit Preparation Overflow Interrupt Request Flag */
		/* const */ unsigned int TSI            : 1;	/* Transfer Shift Interrupt Request Flag */
		/* const */ unsigned int TSOI           : 1;	/* Transmit Shift Overflow Interrupt Request Flag */
		/* const */ unsigned int TOI            : 1;	/* Transfer Output Interrupt Request Flag */
		/* const */ unsigned int TOOI           : 1;	/* Transmit Shift Overflow Interrupt Request Flag */
		/* const */ unsigned int NFI            : 1;	/* No Frame Received Interrupt Flag */
		/* const */ unsigned int                : 15;
	} B;
	int I;
	unsigned int U;

} PSI5_INTSTATA0_type;
#define PSI5_INTSTATA0	(*( PSI5_INTSTATA0_type *) 0xf0005310u)	/* Interrupt Status Register A 0 */
#define PSI5_INTSTATA1	(*( PSI5_INTSTATA0_type *) 0xf0005314u)	/* Interrupt Status Register A 1 */
#define PSI5_INTSTATA2	(*( PSI5_INTSTATA0_type *) 0xf0005318u)	/* Interrupt Status Register A 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int WSI0           : 1;	/* Wrong Serial Protocol Error Request Flag */
		/* const */ unsigned int WSI1           : 1;	/* Wrong Serial Protocol Error Request Flag */
		/* const */ unsigned int WSI2           : 1;	/* Wrong Serial Protocol Error Request Flag */
		/* const */ unsigned int WSI3           : 1;	/* Wrong Serial Protocol Error Request Flag */
		/* const */ unsigned int WSI4           : 1;	/* Wrong Serial Protocol Error Request Flag */
		/* const */ unsigned int WSI5           : 1;	/* Wrong Serial Protocol Error Request Flag */
		/* const */ unsigned int SDI0           : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SDI1           : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SDI2           : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SDI3           : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SDI4           : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SDI5           : 1;	/* Serial Data Receive Interrupt Request Flag */
		/* const */ unsigned int SOI0           : 1;	/* Serial Data Buffer Overrun Interrupt Request Flag */
		/* const */ unsigned int SOI1           : 1;	/* Serial Data Buffer Overrun Interrupt Request Flag */
		/* const */ unsigned int SOI2           : 1;	/* Serial Data Buffer Overrun Interrupt Request Flag */
		/* const */ unsigned int SOI3           : 1;	/* Serial Data Buffer Overrun Interrupt Request Flag */
		/* const */ unsigned int SOI4           : 1;	/* Serial Data Buffer Overrun Interrupt Request Flag */
		/* const */ unsigned int SOI5           : 1;	/* Serial Data Buffer Overrun Interrupt Request Flag */
		/* const */ unsigned int SCRI0          : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int SCRI1          : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int SCRI2          : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int SCRI3          : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int SCRI4          : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int SCRI5          : 1;	/* Serial Data CRC Error Request Flag */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} PSI5_INTSTATB0_type;
#define PSI5_INTSTATB0	(*( PSI5_INTSTATB0_type *) 0xf0005324u)	/* Interrupt Status Register B 0 */
#define PSI5_INTSTATB1	(*( PSI5_INTSTATB0_type *) 0xf0005328u)	/* Interrupt Status Register B 1 */
#define PSI5_INTSTATB2	(*( PSI5_INTSTATB0_type *) 0xf000532cu)	/* Interrupt Status Register B 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int ALTI           : 2;	/* Alternate Input Select */
		unsigned int                : 2;
		unsigned int DEPTH          : 4;	/* Digital Glitch Filter Depth */
		unsigned int OIE            : 1;	/* Output Inverter Enable Channel x */
		unsigned int IIE            : 1;	/* Input Inverter Enable Channel x */
		unsigned int                : 2;
		/* const */ unsigned int REG            : 1;	/* Rising Edge Glitch Flag for Channel x */
		/* const */ unsigned int FEG            : 1;	/* Falling Edge Glitch Flag for Channel x */
		unsigned int CREG           : 1;	/* Clear Rising Edge Glitch Flag for Channel x */
		unsigned int CFEG           : 1;	/* Clear Falling Edge Glitch Flag for Channel x */
		unsigned int                : 14;
		/* const */ unsigned int RXM            : 1;	/* Receive Monitor for Channel x */
		/* const */ unsigned int TXM            : 1;	/* Transmit Monitor for Channel x */
	} B;
	int I;
	unsigned int U;

} PSI5_IOCR0_type;
#define PSI5_IOCR0	(*( PSI5_IOCR0_type *) 0xf0005030u)	/* Input and Output Control Register 0 */
#define PSI5_IOCR1	(*( PSI5_IOCR0_type *) 0xf00050c0u)	/* Input and Output Control Register 1 */
#define PSI5_IOCR2	(*( PSI5_IOCR0_type *) 0xf0005150u)	/* Input and Output Control Register 2 */

