svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} PSI5_KRST0_type;
#define PSI5_KRST0	(*( PSI5_KRST0_type *) 0xf00053d8u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} PSI5_KRST1_type;
#define PSI5_KRST1	(*( PSI5_KRST1_type *) 0xf00053dcu)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} PSI5_KRSTCLR_type;
#define PSI5_KRSTCLR	(*( PSI5_KRSTCLR_type *) 0xf00053e0u)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int MEI0           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI1           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI2           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI3           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI4           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI5           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI6           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI7           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI8           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI9           : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI10          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI11          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI12          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI13          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI14          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI15          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI16          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI17          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI18          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI19          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI20          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI21          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI22          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI23          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI24          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI25          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI26          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI27          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI28          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI29          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI30          : 1;	/* Clear MEI Flag of Buffer y */
		unsigned int MEI31          : 1;	/* Clear MEI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_MEICLR0_type;
#define PSI5_MEICLR0	(*( PSI5_MEICLR0_type *) 0xf00055d8u)	/* MEIOV0 Clear Register */
#define PSI5_MEICLR1	(*( PSI5_MEICLR0_type *) 0xf00055dcu)	/* MEIOV1 Clear Register */
#define PSI5_MEICLR2	(*( PSI5_MEICLR0_type *) 0xf00055e0u)	/* MEIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MEI0           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI1           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI2           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI3           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI4           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI5           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI6           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI7           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI8           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI9           : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI10          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI11          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI12          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI13          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI14          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI15          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI16          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI17          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI18          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI19          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI20          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI21          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI22          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI23          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI24          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI25          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI26          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI27          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI28          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI29          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI30          : 1;	/* MEI Flag of Buffer y */
		/* const */ unsigned int MEI31          : 1;	/* MEI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_MEIOV0_type;
#define PSI5_MEIOV0	(*( PSI5_MEIOV0_type *) 0xf0005498u)	/* MEI Overview Register */
#define PSI5_MEIOV1	(*( PSI5_MEIOV0_type *) 0xf000549cu)	/* MEI Overview Register */
#define PSI5_MEIOV2	(*( PSI5_MEIOV0_type *) 0xf00054a0u)	/* MEI Overview Register */

