svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int MEI0           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI1           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI2           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI3           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI4           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI5           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI6           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI7           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI8           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI9           : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI10          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI11          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI12          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI13          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI14          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI15          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI16          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI17          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI18          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI19          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI20          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI21          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI22          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI23          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI24          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI25          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI26          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI27          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI28          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI29          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI30          : 1;	/* Set MEI Flag of Buffer y */
		unsigned int MEI31          : 1;	/* Set MEI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_MEISET0_type;
#define PSI5_MEISET0	(*( PSI5_MEISET0_type *) 0xf0005538u)	/* MEIOV0 Set Register */
#define PSI5_MEISET1	(*( PSI5_MEISET0_type *) 0xf000553cu)	/* MEIOV1 Set Register */
#define PSI5_MEISET2	(*( PSI5_MEISET0_type *) 0xf0005540u)	/* MEIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NBI0           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI1           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI2           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI3           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI4           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI5           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI6           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI7           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI8           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI9           : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI10          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI11          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI12          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI13          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI14          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI15          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI16          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI17          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI18          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI19          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI20          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI21          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI22          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI23          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI24          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI25          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI26          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI27          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI28          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI29          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI30          : 1;	/* Clear NBI Flag of Buffer y */
		unsigned int NBI31          : 1;	/* Clear NBI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_NBICLR0_type;
#define PSI5_NBICLR0	(*( PSI5_NBICLR0_type *) 0xf0005574u)	/* NBIOV0 Clear Register */
#define PSI5_NBICLR1	(*( PSI5_NBICLR0_type *) 0xf0005578u)	/* NBIOV1 Clear Register */
#define PSI5_NBICLR2	(*( PSI5_NBICLR0_type *) 0xf000557cu)	/* NBIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NBI0           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI1           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI2           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI3           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI4           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI5           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI6           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI7           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI8           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI9           : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI10          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI11          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI12          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI13          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI14          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI15          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI16          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI17          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI18          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI19          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI20          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI21          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI22          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI23          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI24          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI25          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI26          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI27          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI28          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI29          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI30          : 1;	/* NBI Flag of Buffer y */
		/* const */ unsigned int NBI31          : 1;	/* NBI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

