svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} PSI5_NBIOV0_type;
#define PSI5_NBIOV0	(*( PSI5_NBIOV0_type *) 0xf0005434u)	/* NBI Overview Register */
#define PSI5_NBIOV1	(*( PSI5_NBIOV0_type *) 0xf0005438u)	/* NBI Overview Register */
#define PSI5_NBIOV2	(*( PSI5_NBIOV0_type *) 0xf000543cu)	/* NBI Overview Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NBI0           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI1           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI2           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI3           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI4           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI5           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI6           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI7           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI8           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI9           : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI10          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI11          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI12          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI13          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI14          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI15          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI16          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI17          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI18          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI19          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI20          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI21          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI22          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI23          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI24          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI25          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI26          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI27          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI28          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI29          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI30          : 1;	/* Set NBI Flag of Buffer y */
		unsigned int NBI31          : 1;	/* Set NBI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_NBISET0_type;
#define PSI5_NBISET0	(*( PSI5_NBISET0_type *) 0xf00054d4u)	/* NBIOV0 Set Register */
#define PSI5_NBISET1	(*( PSI5_NBISET0_type *) 0xf00054d8u)	/* NBIOV1 Set Register */
#define PSI5_NBISET2	(*( PSI5_NBISET0_type *) 0xf00054dcu)	/* NBIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NFI0           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI1           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI2           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI3           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI4           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI5           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI6           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI7           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI8           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI9           : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI10          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI11          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI12          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI13          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI14          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI15          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI16          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI17          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI18          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI19          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI20          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI21          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI22          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI23          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI24          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI25          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI26          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI27          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI28          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI29          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI30          : 1;	/* Clear NFI Flag of Buffer y */
		unsigned int NFI31          : 1;	/* Clear NFI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_NFICLR0_type;
#define PSI5_NFICLR0	(*( PSI5_NFICLR0_type *) 0xf00055c4u)	/* NFIOV0 Clear Register */
#define PSI5_NFICLR1	(*( PSI5_NFICLR0_type *) 0xf00055c8u)	/* NFIOV1 Clear Register */
#define PSI5_NFICLR2	(*( PSI5_NFICLR0_type *) 0xf00055ccu)	/* NFIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int NFI0           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI1           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI2           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI3           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI4           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI5           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI6           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI7           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI8           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI9           : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI10          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI11          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI12          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI13          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI14          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI15          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI16          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI17          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI18          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI19          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI20          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI21          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI22          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI23          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI24          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI25          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI26          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI27          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI28          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI29          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI30          : 1;	/* NFI Flag of Buffer y */
		/* const */ unsigned int NFI31          : 1;	/* NFI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_NFIOV0_type;
