svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define PSI5_NFIOV0	(*( PSI5_NFIOV0_type *) 0xf0005484u)	/* NFI Overview Register */
#define PSI5_NFIOV1	(*( PSI5_NFIOV0_type *) 0xf0005488u)	/* NFI Overview Register */
#define PSI5_NFIOV2	(*( PSI5_NFIOV0_type *) 0xf000548cu)	/* NFI Overview Register */

typedef volatile union
{
	struct
	{ 
		unsigned int NFI0           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI1           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI2           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI3           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI4           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI5           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI6           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI7           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI8           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI9           : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI10          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI11          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI12          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI13          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI14          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI15          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI16          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI17          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI18          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI19          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI20          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI21          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI22          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI23          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI24          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI25          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI26          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI27          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI28          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI29          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI30          : 1;	/* Set NFI Flag of Buffer y */
		unsigned int NFI31          : 1;	/* Set NFI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_NFISET0_type;
#define PSI5_NFISET0	(*( PSI5_NFISET0_type *) 0xf0005524u)	/* NFIOV0 Set Register */
#define PSI5_NFISET1	(*( PSI5_NFISET0_type *) 0xf0005528u)	/* NFIOV1 Set Register */
#define PSI5_NFISET2	(*( PSI5_NFISET0_type *) 0xf000552cu)	/* NFIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int                : 24;
		unsigned int SUS            : 4;	/* OCDS Suspend Control */
		unsigned int SUS_P          : 1;	/* SUS Write Protection */
		/* const */ unsigned int SUSSTA         : 1;	/* Suspend State */
		unsigned int                : 2;
	} B;
	int I;
	unsigned int U;

} PSI5_OCS_type;
#define PSI5_OCS	(*( PSI5_OCS_type *) 0xf00053ccu)	/* OCDS Control and Status */

typedef volatile union
{
	struct
	{ 
		unsigned int PLEN           : 6;	/* Pulse Length */
		unsigned int                : 2;
		unsigned int DEL            : 6;	/* Delay Length */
		unsigned int                : 1;
		unsigned int TBS            : 1;	/* Time Base Select */
		unsigned int ETB            : 3;	/* External Time Base Select */
		unsigned int PTE            : 1;	/* Periodic Trigger Enable */
		unsigned int ETS            : 3;	/* External Trigger Select */
		unsigned int ETE            : 1;	/* External Trigger Enable */
		unsigned int BYP            : 1;	/* Bypass Enable */
		unsigned int BOT            : 7;	/* Blank Out Time */
	} B;
	int I;
	unsigned int U;

} PSI5_PGC0_type;
#define PSI5_PGC0	(*( PSI5_PGC0_type *) 0xf0005088u)	/* Pulse Generation Control Register 0 */
#define PSI5_PGC1	(*( PSI5_PGC0_type *) 0xf0005118u)	/* Pulse Generation Control Register 1 */
#define PSI5_PGC2	(*( PSI5_PGC0_type *) 0xf00051a8u)	/* Pulse Generation Control Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int PDL0           : 5;	/* Payload Data Length */
		unsigned int PDL1           : 5;	/* Payload Data Length */
		unsigned int PDL2           : 5;	/* Payload Data Length */
		unsigned int PDL3           : 5;	/* Payload Data Length */
		unsigned int PDL4           : 5;	/* Payload Data Length */
		unsigned int PDL5           : 5;	/* Payload Data Length */
		unsigned int ASYN           : 1;	/* Asynchronous Mode */
		unsigned int AVBS           : 1;	/* Verbose Mode for Asynchronous Mode */
	} B;
	int I;
	unsigned int U;

} PSI5_RCRA0_type;
#define PSI5_RCRA0	(*( PSI5_RCRA0_type *) 0xf0005034u)	/* Receiver Control Register A 0 */
#define PSI5_RCRA1	(*( PSI5_RCRA0_type *) 0xf00050c4u)	/* Receiver Control Register A 1 */
#define PSI5_RCRA2	(*( PSI5_RCRA0_type *) 0xf0005154u)	/* Receiver Control Register A 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int MSG0           : 1;	/* Messaging Bits */
		unsigned int CRC0           : 1;	/* CRC or Parity Selection */
		unsigned int FEC0           : 1;	/* Frame Expectation Control */
		unsigned int VBS0           : 1;	/* Verbose Mode */
		unsigned int MSG1           : 1;	/* Messaging Bits */
		unsigned int CRC1           : 1;	/* CRC or Parity Selection */
		unsigned int FEC1           : 1;	/* Frame Expectation Control */
		unsigned int VBS1           : 1;	/* Verbose Mode */
		unsigned int MSG2           : 1;	/* Messaging Bits */
		unsigned int CRC2           : 1;	/* CRC or Parity Selection */
		unsigned int FEC2           : 1;	/* Frame Expectation Control */
		unsigned int VBS2           : 1;	/* Verbose Mode */
		unsigned int MSG3           : 1;	/* Messaging Bits */
		unsigned int CRC3           : 1;	/* CRC or Parity Selection */
		unsigned int FEC3           : 1;	/* Frame Expectation Control */
		unsigned int VBS3           : 1;	/* Verbose Mode */
		unsigned int MSG4           : 1;	/* Messaging Bits */
		unsigned int CRC4           : 1;	/* CRC or Parity Selection */
		unsigned int FEC4           : 1;	/* Frame Expectation Control */
		unsigned int VBS4           : 1;	/* Verbose Mode */
		unsigned int MSG5           : 1;	/* Messaging Bits */
		unsigned int CRC5           : 1;	/* CRC or Parity Selection */
		unsigned int FEC5           : 1;	/* Frame Expectation Control */
		unsigned int VBS5           : 1;	/* Verbose Mode */
		unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} PSI5_RCRB0_type;
#define PSI5_RCRB0	(*( PSI5_RCRB0_type *) 0xf0005038u)	/* Receiver Control Register B 0 */
#define PSI5_RCRB1	(*( PSI5_RCRB0_type *) 0xf00050c8u)	/* Receiver Control Register B 1 */
#define PSI5_RCRB2	(*( PSI5_RCRB0_type *) 0xf0005158u)	/* Receiver Control Register B 2 */

