svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int BRS            : 1;	/* Baud Rate Select */
		unsigned int TSP            : 2;	/* Time Stamp Select for Pulses */
		unsigned int TSF            : 2;	/* Time Stamp Select for Start of Frame (SOF) */
		unsigned int TSR            : 1;	/* Time Stamp Select for Receive Data Registers */
		unsigned int                : 26;
	} B;
	int I;
	unsigned int U;

} PSI5_RCRC0_type;
#define PSI5_RCRC0	(*( PSI5_RCRC0_type *) 0xf000503cu)	/* Receiver Control Register C 0 */
#define PSI5_RCRC1	(*( PSI5_RCRC0_type *) 0xf00050ccu)	/* Receiver Control Register C 1 */
#define PSI5_RCRC2	(*( PSI5_RCRC0_type *) 0xf000515cu)	/* Receiver Control Register C 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RD             : 32;	/* RD */
	} B;
	int I;
	unsigned int U;

} PSI5_RDF0_type;
#define PSI5_RDF0	(*( PSI5_RDF0_type *) 0xf00053f8u)	/* Receive Data FIFO 0 */
#define PSI5_RDF1	(*( PSI5_RDF0_type *) 0xf00053fcu)	/* Receive Data FIFO 1 */
#define PSI5_RDF2	(*( PSI5_RDF0_type *) 0xf0005400u)	/* Receive Data FIFO 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int RDI0           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI1           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI2           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI3           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI4           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI5           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI6           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI7           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI8           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI9           : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI10          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI11          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI12          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI13          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI14          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI15          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI16          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI17          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI18          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI19          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI20          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI21          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI22          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI23          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI24          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI25          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI26          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI27          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI28          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI29          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI30          : 1;	/* Clear RDI Flag of Buffer y */
		unsigned int RDI31          : 1;	/* Clear RDI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RDICLR0_type;
#define PSI5_RDICLR0	(*( PSI5_RDICLR0_type *) 0xf00055b0u)	/* RDIOV0 Clear Register */
#define PSI5_RDICLR1	(*( PSI5_RDICLR0_type *) 0xf00055b4u)	/* RDIOV1 Clear Register */
#define PSI5_RDICLR2	(*( PSI5_RDICLR0_type *) 0xf00055b8u)	/* RDIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RDI0           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI1           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI2           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI3           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI4           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI5           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI6           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI7           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI8           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI9           : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI10          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI11          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI12          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI13          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI14          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI15          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI16          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI17          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI18          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI19          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI20          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI21          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI22          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI23          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI24          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI25          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI26          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI27          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI28          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI29          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI30          : 1;	/* RDI Flag of Buffer y */
		/* const */ unsigned int RDI31          : 1;	/* RDI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RDIOV0_type;
#define PSI5_RDIOV0	(*( PSI5_RDIOV0_type *) 0xf0005470u)	/* RDI Overview Register */
#define PSI5_RDIOV1	(*( PSI5_RDIOV0_type *) 0xf0005474u)	/* RDI Overview Register */
#define PSI5_RDIOV2	(*( PSI5_RDIOV0_type *) 0xf0005478u)	/* RDI Overview Register */

