svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RDI0           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI1           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI2           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI3           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI4           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI5           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI6           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI7           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI8           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI9           : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI10          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI11          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI12          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI13          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI14          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI15          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI16          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI17          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI18          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI19          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI20          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI21          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI22          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI23          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI24          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI25          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI26          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI27          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI28          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI29          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI30          : 1;	/* Set RDI Flag of Buffer y */
		unsigned int RDI31          : 1;	/* Set RDI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RDISET0_type;
#define PSI5_RDISET0	(*( PSI5_RDISET0_type *) 0xf0005510u)	/* RDIOV0 Set Register */
#define PSI5_RDISET1	(*( PSI5_RDISET0_type *) 0xf0005514u)	/* RDIOV1 Set Register */
#define PSI5_RDISET2	(*( PSI5_RDISET0_type *) 0xf0005518u)	/* RDIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TS             : 24;	/* Time Stamp */
		/* const */ unsigned int SC             : 3;	/* Slot Counter */
		/* const */ unsigned int TEI            : 1;	/* Time Slot Error Flag */
		/* const */ unsigned int NBI            : 1;	/* Number of bits Error Flag */
		/* const */ unsigned int MEI            : 1;	/* Error in Messaging Bits Flag */
		/* const */ unsigned int NFI            : 1;	/* No Frame Received Flag */
		/* const */ unsigned int RMI            : 1;	/* Receive Memory Overflow Flag */
	} B;
	int I;
	unsigned int U;

} PSI5_RDMH00_type;
#define PSI5_RDMH00	(*( PSI5_RDMH00_type *) 0xf0005604u)	/* Receive Data Memory High 0 0 */
#define PSI5_RDMH01	(*( PSI5_RDMH00_type *) 0xf000560cu)	/* Receive Data Memory High 0 1 */
#define PSI5_RDMH010	(*( PSI5_RDMH00_type *) 0xf0005654u)	/* Receive Data Memory High 0 10 */
#define PSI5_RDMH011	(*( PSI5_RDMH00_type *) 0xf000565cu)	/* Receive Data Memory High 0 11 */
#define PSI5_RDMH012	(*( PSI5_RDMH00_type *) 0xf0005664u)	/* Receive Data Memory High 0 12 */
#define PSI5_RDMH013	(*( PSI5_RDMH00_type *) 0xf000566cu)	/* Receive Data Memory High 0 13 */
#define PSI5_RDMH014	(*( PSI5_RDMH00_type *) 0xf0005674u)	/* Receive Data Memory High 0 14 */
#define PSI5_RDMH015	(*( PSI5_RDMH00_type *) 0xf000567cu)	/* Receive Data Memory High 0 15 */
#define PSI5_RDMH016	(*( PSI5_RDMH00_type *) 0xf0005684u)	/* Receive Data Memory High 0 16 */
#define PSI5_RDMH017	(*( PSI5_RDMH00_type *) 0xf000568cu)	/* Receive Data Memory High 0 17 */
#define PSI5_RDMH018	(*( PSI5_RDMH00_type *) 0xf0005694u)	/* Receive Data Memory High 0 18 */
#define PSI5_RDMH019	(*( PSI5_RDMH00_type *) 0xf000569cu)	/* Receive Data Memory High 0 19 */
#define PSI5_RDMH02	(*( PSI5_RDMH00_type *) 0xf0005614u)	/* Receive Data Memory High 0 2 */
#define PSI5_RDMH020	(*( PSI5_RDMH00_type *) 0xf00056a4u)	/* Receive Data Memory High 0 20 */
#define PSI5_RDMH021	(*( PSI5_RDMH00_type *) 0xf00056acu)	/* Receive Data Memory High 0 21 */
#define PSI5_RDMH022	(*( PSI5_RDMH00_type *) 0xf00056b4u)	/* Receive Data Memory High 0 22 */
#define PSI5_RDMH023	(*( PSI5_RDMH00_type *) 0xf00056bcu)	/* Receive Data Memory High 0 23 */
#define PSI5_RDMH024	(*( PSI5_RDMH00_type *) 0xf00056c4u)	/* Receive Data Memory High 0 24 */
#define PSI5_RDMH025	(*( PSI5_RDMH00_type *) 0xf00056ccu)	/* Receive Data Memory High 0 25 */
#define PSI5_RDMH026	(*( PSI5_RDMH00_type *) 0xf00056d4u)	/* Receive Data Memory High 0 26 */
#define PSI5_RDMH027	(*( PSI5_RDMH00_type *) 0xf00056dcu)	/* Receive Data Memory High 0 27 */
#define PSI5_RDMH028	(*( PSI5_RDMH00_type *) 0xf00056e4u)	/* Receive Data Memory High 0 28 */
#define PSI5_RDMH029	(*( PSI5_RDMH00_type *) 0xf00056ecu)	/* Receive Data Memory High 0 29 */
#define PSI5_RDMH03	(*( PSI5_RDMH00_type *) 0xf000561cu)	/* Receive Data Memory High 0 3 */
#define PSI5_RDMH030	(*( PSI5_RDMH00_type *) 0xf00056f4u)	/* Receive Data Memory High 0 30 */
#define PSI5_RDMH031	(*( PSI5_RDMH00_type *) 0xf00056fcu)	/* Receive Data Memory High 0 31 */
#define PSI5_RDMH04	(*( PSI5_RDMH00_type *) 0xf0005624u)	/* Receive Data Memory High 0 4 */
#define PSI5_RDMH05	(*( PSI5_RDMH00_type *) 0xf000562cu)	/* Receive Data Memory High 0 5 */
#define PSI5_RDMH06	(*( PSI5_RDMH00_type *) 0xf0005634u)	/* Receive Data Memory High 0 6 */
#define PSI5_RDMH07	(*( PSI5_RDMH00_type *) 0xf000563cu)	/* Receive Data Memory High 0 7 */
#define PSI5_RDMH08	(*( PSI5_RDMH00_type *) 0xf0005644u)	/* Receive Data Memory High 0 8 */
#define PSI5_RDMH09	(*( PSI5_RDMH00_type *) 0xf000564cu)	/* Receive Data Memory High 0 9 */
#define PSI5_RDMH10	(*( PSI5_RDMH00_type *) 0xf0005704u)	/* Receive Data Memory High 1 0 */
#define PSI5_RDMH11	(*( PSI5_RDMH00_type *) 0xf000570cu)	/* Receive Data Memory High 1 1 */
#define PSI5_RDMH110	(*( PSI5_RDMH00_type *) 0xf0005754u)	/* Receive Data Memory High 1 10 */
#define PSI5_RDMH111	(*( PSI5_RDMH00_type *) 0xf000575cu)	/* Receive Data Memory High 1 11 */
#define PSI5_RDMH112	(*( PSI5_RDMH00_type *) 0xf0005764u)	/* Receive Data Memory High 1 12 */
#define PSI5_RDMH113	(*( PSI5_RDMH00_type *) 0xf000576cu)	/* Receive Data Memory High 1 13 */
#define PSI5_RDMH114	(*( PSI5_RDMH00_type *) 0xf0005774u)	/* Receive Data Memory High 1 14 */
#define PSI5_RDMH115	(*( PSI5_RDMH00_type *) 0xf000577cu)	/* Receive Data Memory High 1 15 */
#define PSI5_RDMH116	(*( PSI5_RDMH00_type *) 0xf0005784u)	/* Receive Data Memory High 1 16 */
#define PSI5_RDMH117	(*( PSI5_RDMH00_type *) 0xf000578cu)	/* Receive Data Memory High 1 17 */
#define PSI5_RDMH118	(*( PSI5_RDMH00_type *) 0xf0005794u)	/* Receive Data Memory High 1 18 */
#define PSI5_RDMH119	(*( PSI5_RDMH00_type *) 0xf000579cu)	/* Receive Data Memory High 1 19 */
#define PSI5_RDMH12	(*( PSI5_RDMH00_type *) 0xf0005714u)	/* Receive Data Memory High 1 2 */
#define PSI5_RDMH120	(*( PSI5_RDMH00_type *) 0xf00057a4u)	/* Receive Data Memory High 1 20 */
#define PSI5_RDMH121	(*( PSI5_RDMH00_type *) 0xf00057acu)	/* Receive Data Memory High 1 21 */
#define PSI5_RDMH122	(*( PSI5_RDMH00_type *) 0xf00057b4u)	/* Receive Data Memory High 1 22 */
#define PSI5_RDMH123	(*( PSI5_RDMH00_type *) 0xf00057bcu)	/* Receive Data Memory High 1 23 */
#define PSI5_RDMH124	(*( PSI5_RDMH00_type *) 0xf00057c4u)	/* Receive Data Memory High 1 24 */
#define PSI5_RDMH125	(*( PSI5_RDMH00_type *) 0xf00057ccu)	/* Receive Data Memory High 1 25 */
#define PSI5_RDMH126	(*( PSI5_RDMH00_type *) 0xf00057d4u)	/* Receive Data Memory High 1 26 */
#define PSI5_RDMH127	(*( PSI5_RDMH00_type *) 0xf00057dcu)	/* Receive Data Memory High 1 27 */
#define PSI5_RDMH128	(*( PSI5_RDMH00_type *) 0xf00057e4u)	/* Receive Data Memory High 1 28 */
#define PSI5_RDMH129	(*( PSI5_RDMH00_type *) 0xf00057ecu)	/* Receive Data Memory High 1 29 */
#define PSI5_RDMH13	(*( PSI5_RDMH00_type *) 0xf000571cu)	/* Receive Data Memory High 1 3 */
#define PSI5_RDMH130	(*( PSI5_RDMH00_type *) 0xf00057f4u)	/* Receive Data Memory High 1 30 */
#define PSI5_RDMH131	(*( PSI5_RDMH00_type *) 0xf00057fcu)	/* Receive Data Memory High 1 31 */
#define PSI5_RDMH14	(*( PSI5_RDMH00_type *) 0xf0005724u)	/* Receive Data Memory High 1 4 */
#define PSI5_RDMH15	(*( PSI5_RDMH00_type *) 0xf000572cu)	/* Receive Data Memory High 1 5 */
#define PSI5_RDMH16	(*( PSI5_RDMH00_type *) 0xf0005734u)	/* Receive Data Memory High 1 6 */
#define PSI5_RDMH17	(*( PSI5_RDMH00_type *) 0xf000573cu)	/* Receive Data Memory High 1 7 */
#define PSI5_RDMH18	(*( PSI5_RDMH00_type *) 0xf0005744u)	/* Receive Data Memory High 1 8 */
#define PSI5_RDMH19	(*( PSI5_RDMH00_type *) 0xf000574cu)	/* Receive Data Memory High 1 9 */
#define PSI5_RDMH20	(*( PSI5_RDMH00_type *) 0xf0005804u)	/* Receive Data Memory High 2 0 */
#define PSI5_RDMH21	(*( PSI5_RDMH00_type *) 0xf000580cu)	/* Receive Data Memory High 2 1 */
#define PSI5_RDMH210	(*( PSI5_RDMH00_type *) 0xf0005854u)	/* Receive Data Memory High 2 10 */
#define PSI5_RDMH211	(*( PSI5_RDMH00_type *) 0xf000585cu)	/* Receive Data Memory High 2 11 */
#define PSI5_RDMH212	(*( PSI5_RDMH00_type *) 0xf0005864u)	/* Receive Data Memory High 2 12 */
#define PSI5_RDMH213	(*( PSI5_RDMH00_type *) 0xf000586cu)	/* Receive Data Memory High 2 13 */
#define PSI5_RDMH214	(*( PSI5_RDMH00_type *) 0xf0005874u)	/* Receive Data Memory High 2 14 */
#define PSI5_RDMH215	(*( PSI5_RDMH00_type *) 0xf000587cu)	/* Receive Data Memory High 2 15 */
#define PSI5_RDMH216	(*( PSI5_RDMH00_type *) 0xf0005884u)	/* Receive Data Memory High 2 16 */
#define PSI5_RDMH217	(*( PSI5_RDMH00_type *) 0xf000588cu)	/* Receive Data Memory High 2 17 */
#define PSI5_RDMH218	(*( PSI5_RDMH00_type *) 0xf0005894u)	/* Receive Data Memory High 2 18 */
#define PSI5_RDMH219	(*( PSI5_RDMH00_type *) 0xf000589cu)	/* Receive Data Memory High 2 19 */
#define PSI5_RDMH22	(*( PSI5_RDMH00_type *) 0xf0005814u)	/* Receive Data Memory High 2 2 */
#define PSI5_RDMH220	(*( PSI5_RDMH00_type *) 0xf00058a4u)	/* Receive Data Memory High 2 20 */
#define PSI5_RDMH221	(*( PSI5_RDMH00_type *) 0xf00058acu)	/* Receive Data Memory High 2 21 */
#define PSI5_RDMH222	(*( PSI5_RDMH00_type *) 0xf00058b4u)	/* Receive Data Memory High 2 22 */
#define PSI5_RDMH223	(*( PSI5_RDMH00_type *) 0xf00058bcu)	/* Receive Data Memory High 2 23 */
#define PSI5_RDMH224	(*( PSI5_RDMH00_type *) 0xf00058c4u)	/* Receive Data Memory High 2 24 */
#define PSI5_RDMH225	(*( PSI5_RDMH00_type *) 0xf00058ccu)	/* Receive Data Memory High 2 25 */
#define PSI5_RDMH226	(*( PSI5_RDMH00_type *) 0xf00058d4u)	/* Receive Data Memory High 2 26 */
#define PSI5_RDMH227	(*( PSI5_RDMH00_type *) 0xf00058dcu)	/* Receive Data Memory High 2 27 */
#define PSI5_RDMH228	(*( PSI5_RDMH00_type *) 0xf00058e4u)	/* Receive Data Memory High 2 28 */
#define PSI5_RDMH229	(*( PSI5_RDMH00_type *) 0xf00058ecu)	/* Receive Data Memory High 2 29 */
#define PSI5_RDMH23	(*( PSI5_RDMH00_type *) 0xf000581cu)	/* Receive Data Memory High 2 3 */
#define PSI5_RDMH230	(*( PSI5_RDMH00_type *) 0xf00058f4u)	/* Receive Data Memory High 2 30 */
#define PSI5_RDMH231	(*( PSI5_RDMH00_type *) 0xf00058fcu)	/* Receive Data Memory High 2 31 */
#define PSI5_RDMH24	(*( PSI5_RDMH00_type *) 0xf0005824u)	/* Receive Data Memory High 2 4 */
#define PSI5_RDMH25	(*( PSI5_RDMH00_type *) 0xf000582cu)	/* Receive Data Memory High 2 5 */
#define PSI5_RDMH26	(*( PSI5_RDMH00_type *) 0xf0005834u)	/* Receive Data Memory High 2 6 */
#define PSI5_RDMH27	(*( PSI5_RDMH00_type *) 0xf000583cu)	/* Receive Data Memory High 2 7 */
#define PSI5_RDMH28	(*( PSI5_RDMH00_type *) 0xf0005844u)	/* Receive Data Memory High 2 8 */
#define PSI5_RDMH29	(*( PSI5_RDMH00_type *) 0xf000584cu)	/* Receive Data Memory High 2 9 */

