svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CRCI           : 1;	/* CRC Error Flag */
		/* const */ unsigned int CRC            : 3;	/* CRC */
		/* const */ unsigned int RD             : 28;	/* RD */
	} B;
	int I;
	unsigned int U;

} PSI5_RDML00_type;
#define PSI5_RDML00	(*( PSI5_RDML00_type *) 0xf0005600u)	/* Receive Data Memory Low 0 0 */
#define PSI5_RDML01	(*( PSI5_RDML00_type *) 0xf0005608u)	/* Receive Data Memory Low 0 1 */
#define PSI5_RDML010	(*( PSI5_RDML00_type *) 0xf0005650u)	/* Receive Data Memory Low 0 10 */
#define PSI5_RDML011	(*( PSI5_RDML00_type *) 0xf0005658u)	/* Receive Data Memory Low 0 11 */
#define PSI5_RDML012	(*( PSI5_RDML00_type *) 0xf0005660u)	/* Receive Data Memory Low 0 12 */
#define PSI5_RDML013	(*( PSI5_RDML00_type *) 0xf0005668u)	/* Receive Data Memory Low 0 13 */
#define PSI5_RDML014	(*( PSI5_RDML00_type *) 0xf0005670u)	/* Receive Data Memory Low 0 14 */
#define PSI5_RDML015	(*( PSI5_RDML00_type *) 0xf0005678u)	/* Receive Data Memory Low 0 15 */
#define PSI5_RDML016	(*( PSI5_RDML00_type *) 0xf0005680u)	/* Receive Data Memory Low 0 16 */
#define PSI5_RDML017	(*( PSI5_RDML00_type *) 0xf0005688u)	/* Receive Data Memory Low 0 17 */
#define PSI5_RDML018	(*( PSI5_RDML00_type *) 0xf0005690u)	/* Receive Data Memory Low 0 18 */
#define PSI5_RDML019	(*( PSI5_RDML00_type *) 0xf0005698u)	/* Receive Data Memory Low 0 19 */
#define PSI5_RDML02	(*( PSI5_RDML00_type *) 0xf0005610u)	/* Receive Data Memory Low 0 2 */
#define PSI5_RDML020	(*( PSI5_RDML00_type *) 0xf00056a0u)	/* Receive Data Memory Low 0 20 */
#define PSI5_RDML021	(*( PSI5_RDML00_type *) 0xf00056a8u)	/* Receive Data Memory Low 0 21 */
#define PSI5_RDML022	(*( PSI5_RDML00_type *) 0xf00056b0u)	/* Receive Data Memory Low 0 22 */
#define PSI5_RDML023	(*( PSI5_RDML00_type *) 0xf00056b8u)	/* Receive Data Memory Low 0 23 */
#define PSI5_RDML024	(*( PSI5_RDML00_type *) 0xf00056c0u)	/* Receive Data Memory Low 0 24 */
#define PSI5_RDML025	(*( PSI5_RDML00_type *) 0xf00056c8u)	/* Receive Data Memory Low 0 25 */
#define PSI5_RDML026	(*( PSI5_RDML00_type *) 0xf00056d0u)	/* Receive Data Memory Low 0 26 */
#define PSI5_RDML027	(*( PSI5_RDML00_type *) 0xf00056d8u)	/* Receive Data Memory Low 0 27 */
#define PSI5_RDML028	(*( PSI5_RDML00_type *) 0xf00056e0u)	/* Receive Data Memory Low 0 28 */
#define PSI5_RDML029	(*( PSI5_RDML00_type *) 0xf00056e8u)	/* Receive Data Memory Low 0 29 */
#define PSI5_RDML03	(*( PSI5_RDML00_type *) 0xf0005618u)	/* Receive Data Memory Low 0 3 */
#define PSI5_RDML030	(*( PSI5_RDML00_type *) 0xf00056f0u)	/* Receive Data Memory Low 0 30 */
#define PSI5_RDML031	(*( PSI5_RDML00_type *) 0xf00056f8u)	/* Receive Data Memory Low 0 31 */
#define PSI5_RDML04	(*( PSI5_RDML00_type *) 0xf0005620u)	/* Receive Data Memory Low 0 4 */
#define PSI5_RDML05	(*( PSI5_RDML00_type *) 0xf0005628u)	/* Receive Data Memory Low 0 5 */
#define PSI5_RDML06	(*( PSI5_RDML00_type *) 0xf0005630u)	/* Receive Data Memory Low 0 6 */
#define PSI5_RDML07	(*( PSI5_RDML00_type *) 0xf0005638u)	/* Receive Data Memory Low 0 7 */
#define PSI5_RDML08	(*( PSI5_RDML00_type *) 0xf0005640u)	/* Receive Data Memory Low 0 8 */
#define PSI5_RDML09	(*( PSI5_RDML00_type *) 0xf0005648u)	/* Receive Data Memory Low 0 9 */
#define PSI5_RDML10	(*( PSI5_RDML00_type *) 0xf0005700u)	/* Receive Data Memory Low 1 0 */
#define PSI5_RDML11	(*( PSI5_RDML00_type *) 0xf0005708u)	/* Receive Data Memory Low 1 1 */
#define PSI5_RDML110	(*( PSI5_RDML00_type *) 0xf0005750u)	/* Receive Data Memory Low 1 10 */
#define PSI5_RDML111	(*( PSI5_RDML00_type *) 0xf0005758u)	/* Receive Data Memory Low 1 11 */
#define PSI5_RDML112	(*( PSI5_RDML00_type *) 0xf0005760u)	/* Receive Data Memory Low 1 12 */
#define PSI5_RDML113	(*( PSI5_RDML00_type *) 0xf0005768u)	/* Receive Data Memory Low 1 13 */
#define PSI5_RDML114	(*( PSI5_RDML00_type *) 0xf0005770u)	/* Receive Data Memory Low 1 14 */
#define PSI5_RDML115	(*( PSI5_RDML00_type *) 0xf0005778u)	/* Receive Data Memory Low 1 15 */
#define PSI5_RDML116	(*( PSI5_RDML00_type *) 0xf0005780u)	/* Receive Data Memory Low 1 16 */
#define PSI5_RDML117	(*( PSI5_RDML00_type *) 0xf0005788u)	/* Receive Data Memory Low 1 17 */
#define PSI5_RDML118	(*( PSI5_RDML00_type *) 0xf0005790u)	/* Receive Data Memory Low 1 18 */
#define PSI5_RDML119	(*( PSI5_RDML00_type *) 0xf0005798u)	/* Receive Data Memory Low 1 19 */
#define PSI5_RDML12	(*( PSI5_RDML00_type *) 0xf0005710u)	/* Receive Data Memory Low 1 2 */
#define PSI5_RDML120	(*( PSI5_RDML00_type *) 0xf00057a0u)	/* Receive Data Memory Low 1 20 */
#define PSI5_RDML121	(*( PSI5_RDML00_type *) 0xf00057a8u)	/* Receive Data Memory Low 1 21 */
#define PSI5_RDML122	(*( PSI5_RDML00_type *) 0xf00057b0u)	/* Receive Data Memory Low 1 22 */
#define PSI5_RDML123	(*( PSI5_RDML00_type *) 0xf00057b8u)	/* Receive Data Memory Low 1 23 */
#define PSI5_RDML124	(*( PSI5_RDML00_type *) 0xf00057c0u)	/* Receive Data Memory Low 1 24 */
#define PSI5_RDML125	(*( PSI5_RDML00_type *) 0xf00057c8u)	/* Receive Data Memory Low 1 25 */
#define PSI5_RDML126	(*( PSI5_RDML00_type *) 0xf00057d0u)	/* Receive Data Memory Low 1 26 */
#define PSI5_RDML127	(*( PSI5_RDML00_type *) 0xf00057d8u)	/* Receive Data Memory Low 1 27 */
#define PSI5_RDML128	(*( PSI5_RDML00_type *) 0xf00057e0u)	/* Receive Data Memory Low 1 28 */
#define PSI5_RDML129	(*( PSI5_RDML00_type *) 0xf00057e8u)	/* Receive Data Memory Low 1 29 */
#define PSI5_RDML13	(*( PSI5_RDML00_type *) 0xf0005718u)	/* Receive Data Memory Low 1 3 */
#define PSI5_RDML130	(*( PSI5_RDML00_type *) 0xf00057f0u)	/* Receive Data Memory Low 1 30 */
#define PSI5_RDML131	(*( PSI5_RDML00_type *) 0xf00057f8u)	/* Receive Data Memory Low 1 31 */
#define PSI5_RDML14	(*( PSI5_RDML00_type *) 0xf0005720u)	/* Receive Data Memory Low 1 4 */
#define PSI5_RDML15	(*( PSI5_RDML00_type *) 0xf0005728u)	/* Receive Data Memory Low 1 5 */
#define PSI5_RDML16	(*( PSI5_RDML00_type *) 0xf0005730u)	/* Receive Data Memory Low 1 6 */
#define PSI5_RDML17	(*( PSI5_RDML00_type *) 0xf0005738u)	/* Receive Data Memory Low 1 7 */
#define PSI5_RDML18	(*( PSI5_RDML00_type *) 0xf0005740u)	/* Receive Data Memory Low 1 8 */
#define PSI5_RDML19	(*( PSI5_RDML00_type *) 0xf0005748u)	/* Receive Data Memory Low 1 9 */
#define PSI5_RDML20	(*( PSI5_RDML00_type *) 0xf0005800u)	/* Receive Data Memory Low 2 0 */
#define PSI5_RDML21	(*( PSI5_RDML00_type *) 0xf0005808u)	/* Receive Data Memory Low 2 1 */
#define PSI5_RDML210	(*( PSI5_RDML00_type *) 0xf0005850u)	/* Receive Data Memory Low 2 10 */
#define PSI5_RDML211	(*( PSI5_RDML00_type *) 0xf0005858u)	/* Receive Data Memory Low 2 11 */
#define PSI5_RDML212	(*( PSI5_RDML00_type *) 0xf0005860u)	/* Receive Data Memory Low 2 12 */
#define PSI5_RDML213	(*( PSI5_RDML00_type *) 0xf0005868u)	/* Receive Data Memory Low 2 13 */
#define PSI5_RDML214	(*( PSI5_RDML00_type *) 0xf0005870u)	/* Receive Data Memory Low 2 14 */
#define PSI5_RDML215	(*( PSI5_RDML00_type *) 0xf0005878u)	/* Receive Data Memory Low 2 15 */
#define PSI5_RDML216	(*( PSI5_RDML00_type *) 0xf0005880u)	/* Receive Data Memory Low 2 16 */
#define PSI5_RDML217	(*( PSI5_RDML00_type *) 0xf0005888u)	/* Receive Data Memory Low 2 17 */
#define PSI5_RDML218	(*( PSI5_RDML00_type *) 0xf0005890u)	/* Receive Data Memory Low 2 18 */
#define PSI5_RDML219	(*( PSI5_RDML00_type *) 0xf0005898u)	/* Receive Data Memory Low 2 19 */
#define PSI5_RDML22	(*( PSI5_RDML00_type *) 0xf0005810u)	/* Receive Data Memory Low 2 2 */
#define PSI5_RDML220	(*( PSI5_RDML00_type *) 0xf00058a0u)	/* Receive Data Memory Low 2 20 */
#define PSI5_RDML221	(*( PSI5_RDML00_type *) 0xf00058a8u)	/* Receive Data Memory Low 2 21 */
#define PSI5_RDML222	(*( PSI5_RDML00_type *) 0xf00058b0u)	/* Receive Data Memory Low 2 22 */
#define PSI5_RDML223	(*( PSI5_RDML00_type *) 0xf00058b8u)	/* Receive Data Memory Low 2 23 */
#define PSI5_RDML224	(*( PSI5_RDML00_type *) 0xf00058c0u)	/* Receive Data Memory Low 2 24 */
#define PSI5_RDML225	(*( PSI5_RDML00_type *) 0xf00058c8u)	/* Receive Data Memory Low 2 25 */
#define PSI5_RDML226	(*( PSI5_RDML00_type *) 0xf00058d0u)	/* Receive Data Memory Low 2 26 */
#define PSI5_RDML227	(*( PSI5_RDML00_type *) 0xf00058d8u)	/* Receive Data Memory Low 2 27 */
#define PSI5_RDML228	(*( PSI5_RDML00_type *) 0xf00058e0u)	/* Receive Data Memory Low 2 28 */
#define PSI5_RDML229	(*( PSI5_RDML00_type *) 0xf00058e8u)	/* Receive Data Memory Low 2 29 */
#define PSI5_RDML23	(*( PSI5_RDML00_type *) 0xf0005818u)	/* Receive Data Memory Low 2 3 */
#define PSI5_RDML230	(*( PSI5_RDML00_type *) 0xf00058f0u)	/* Receive Data Memory Low 2 30 */
#define PSI5_RDML231	(*( PSI5_RDML00_type *) 0xf00058f8u)	/* Receive Data Memory Low 2 31 */
#define PSI5_RDML24	(*( PSI5_RDML00_type *) 0xf0005820u)	/* Receive Data Memory Low 2 4 */
#define PSI5_RDML25	(*( PSI5_RDML00_type *) 0xf0005828u)	/* Receive Data Memory Low 2 5 */
#define PSI5_RDML26	(*( PSI5_RDML00_type *) 0xf0005830u)	/* Receive Data Memory Low 2 6 */
#define PSI5_RDML27	(*( PSI5_RDML00_type *) 0xf0005838u)	/* Receive Data Memory Low 2 7 */
#define PSI5_RDML28	(*( PSI5_RDML00_type *) 0xf0005840u)	/* Receive Data Memory Low 2 8 */
#define PSI5_RDML29	(*( PSI5_RDML00_type *) 0xf0005848u)	/* Receive Data Memory Low 2 9 */

