svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TS             : 24;	/* Time Stamp */
		/* const */ unsigned int SC             : 3;	/* Slot Counter */
		/* const */ unsigned int TEI            : 1;	/* Time Slot Error Flag */
		/* const */ unsigned int NBI            : 1;	/* Number of bits Error Flag */
		/* const */ unsigned int MEI            : 1;	/* Error in Message Bits Flag */
		/* const */ unsigned int NFI            : 1;	/* No Frame Received Flag */
		/* const */ unsigned int RBI            : 1;	/* Receive Buffer Overflow Flag */
	} B;
	int I;
	unsigned int U;

} PSI5_RDRH0_type;
#define PSI5_RDRH0	(*( PSI5_RDRH0_type *) 0xf0005084u)	/* Receive Data Register High 0 */
#define PSI5_RDRH1	(*( PSI5_RDRH0_type *) 0xf0005114u)	/* Receive Data Register High 1 */
#define PSI5_RDRH2	(*( PSI5_RDRH0_type *) 0xf00051a4u)	/* Receive Data Register High 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CRCI           : 1;	/* CRC Error Flag */
		/* const */ unsigned int CRC            : 3;	/* CRC */
		/* const */ unsigned int RD             : 28;	/* RD */
	} B;
	int I;
	unsigned int U;

} PSI5_RDRL0_type;
#define PSI5_RDRL0	(*( PSI5_RDRL0_type *) 0xf0005080u)	/* Receive Data Register Low 0 */
#define PSI5_RDRL1	(*( PSI5_RDRL0_type *) 0xf0005110u)	/* Receive Data Register Low 1 */
#define PSI5_RDRL2	(*( PSI5_RDRL0_type *) 0xf00051a0u)	/* Receive Data Register Low 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int REP            : 6;	/* FIFO Read Pointer */
		unsigned int                : 2;
		/* const */ unsigned int WRP            : 6;	/* FIFO/Ring Buffer Write Pointer */
		unsigned int                : 2;
		unsigned int FWL            : 5;	/* FIFO Warning Level */
		unsigned int                : 8;
		/* const */ unsigned int WRAP           : 1;	/* Write Pointer WRAP Indicator */
		/* const */ unsigned int FRQ            : 1;	/* Flush Request */
		unsigned int FLU            : 1;	/* Flush */
	} B;
	int I;
	unsigned int U;

} PSI5_RFC0_type;
#define PSI5_RFC0	(*( PSI5_RFC0_type *) 0xf00053e4u)	/* Receive FIFO Control Register 0 */
#define PSI5_RFC1	(*( PSI5_RFC0_type *) 0xf00053e8u)	/* Receive FIFO Control Register 1 */
#define PSI5_RFC2	(*( PSI5_RFC0_type *) 0xf00053ecu)	/* Receive FIFO Control Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int RMI0           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI1           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI2           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI3           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI4           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI5           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI6           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI7           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI8           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI9           : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI10          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI11          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI12          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI13          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI14          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI15          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI16          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI17          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI18          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI19          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI20          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI21          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI22          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI23          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI24          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI25          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI26          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI27          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI28          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI29          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI30          : 1;	/* Clear RMI Flag of Buffer y */
		unsigned int RMI31          : 1;	/* Clear RMI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RMICLR0_type;
#define PSI5_RMICLR0	(*( PSI5_RMICLR0_type *) 0xf0005560u)	/* RMIOV0 Clear Register */
#define PSI5_RMICLR1	(*( PSI5_RMICLR0_type *) 0xf0005564u)	/* RMIOV1 Clear Register */
#define PSI5_RMICLR2	(*( PSI5_RMICLR0_type *) 0xf0005568u)	/* RMIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RMI0           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI1           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI2           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI3           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI4           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI5           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI6           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI7           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI8           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI9           : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI10          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI11          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI12          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI13          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI14          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI15          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI16          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI17          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI18          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI19          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI20          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI21          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI22          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI23          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI24          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI25          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI26          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI27          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI28          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI29          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI30          : 1;	/* RMI Flag of Buffer y */
		/* const */ unsigned int RMI31          : 1;	/* RMI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RMIOV0_type;
#define PSI5_RMIOV0	(*( PSI5_RMIOV0_type *) 0xf0005420u)	/* RMI Overview Register */
#define PSI5_RMIOV1	(*( PSI5_RMIOV0_type *) 0xf0005424u)	/* RMI Overview Register */
#define PSI5_RMIOV2	(*( PSI5_RMIOV0_type *) 0xf0005428u)	/* RMI Overview Register */

