svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RMI0           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI1           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI2           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI3           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI4           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI5           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI6           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI7           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI8           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI9           : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI10          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI11          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI12          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI13          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI14          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI15          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI16          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI17          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI18          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI19          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI20          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI21          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI22          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI23          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI24          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI25          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI26          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI27          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI28          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI29          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI30          : 1;	/* Set RMI Flag of Buffer y */
		unsigned int RMI31          : 1;	/* Set RMI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RMISET0_type;
#define PSI5_RMISET0	(*( PSI5_RMISET0_type *) 0xf00054c0u)	/* RMIOV0 Set Register */
#define PSI5_RMISET1	(*( PSI5_RMISET0_type *) 0xf00054c4u)	/* RMIOV1 Set Register */
#define PSI5_RMISET2	(*( PSI5_RMISET0_type *) 0xf00054c8u)	/* RMIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RSI0           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI1           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI2           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI3           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI4           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI5           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI6           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI7           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI8           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI9           : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI10          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI11          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI12          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI13          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI14          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI15          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI16          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI17          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI18          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI19          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI20          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI21          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI22          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI23          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI24          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI25          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI26          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI27          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI28          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI29          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI30          : 1;	/* Clear RSI Flag of Buffer y */
		unsigned int RSI31          : 1;	/* Clear RSI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RSICLR0_type;
#define PSI5_RSICLR0	(*( PSI5_RSICLR0_type *) 0xf000554cu)	/* RSIOV0 Clear Register */
#define PSI5_RSICLR1	(*( PSI5_RSICLR0_type *) 0xf0005550u)	/* RSIOV1 Clear Register */
#define PSI5_RSICLR2	(*( PSI5_RSICLR0_type *) 0xf0005554u)	/* RSIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RSI0           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI1           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI2           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI3           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI4           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI5           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI6           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI7           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI8           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI9           : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI10          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI11          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI12          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI13          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI14          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI15          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI16          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI17          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI18          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI19          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI20          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI21          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI22          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI23          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI24          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI25          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI26          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI27          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI28          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI29          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI30          : 1;	/* RSI Flag of Buffer y */
		/* const */ unsigned int RSI31          : 1;	/* RSI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RSIOV0_type;
#define PSI5_RSIOV0	(*( PSI5_RSIOV0_type *) 0xf000540cu)	/* RSI Overview Register */
#define PSI5_RSIOV1	(*( PSI5_RSIOV0_type *) 0xf0005410u)	/* RSI Overview Register */
#define PSI5_RSIOV2	(*( PSI5_RSIOV0_type *) 0xf0005414u)	/* RSI Overview Register */

