svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int RSI0           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI1           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI2           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI3           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI4           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI5           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI6           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI7           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI8           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI9           : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI10          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI11          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI12          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI13          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI14          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI15          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI16          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI17          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI18          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI19          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI20          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI21          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI22          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI23          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI24          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI25          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI26          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI27          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI28          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI29          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI30          : 1;	/* Set RSI Flag of Buffer y */
		unsigned int RSI31          : 1;	/* Set RSI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_RSISET0_type;
#define PSI5_RSISET0	(*( PSI5_RSISET0_type *) 0xf00054acu)	/* RSIOV0 Set Register */
#define PSI5_RSISET1	(*( PSI5_RSISET0_type *) 0xf00054b0u)	/* RSIOV1 Set Register */
#define PSI5_RSISET2	(*( PSI5_RSISET0_type *) 0xf00054b4u)	/* RSIOV2 Set Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CRC            : 3;	/* CRC */
		/* const */ unsigned int                : 5;
		/* const */ unsigned int MSG            : 2;	/* Messaging Bits */
		/* const */ unsigned int                : 22;
	} B;
	int I;
	unsigned int U;

} PSI5_RSR0_type;
#define PSI5_RSR0	(*( PSI5_RSR0_type *) 0xf000505cu)	/* Receive Status Register 0 */
#define PSI5_RSR1	(*( PSI5_RSR0_type *) 0xf00050ecu)	/* Receive Status Register 1 */
#define PSI5_RSR2	(*( PSI5_RSR0_type *) 0xf000517cu)	/* Receive Status Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int PLL            : 6;	/* Pay Load Length of Registers SDRL/H */
		unsigned int EPS            : 1;	/* Enhanced Protocol Selection */
		unsigned int BSC            : 1;	/* Bit Stuffing Control */
		unsigned int SSL            : 6;	/* Pay Load Length of Registers SSRL/H */
		unsigned int FLUS           : 1;	/* Flush SSRH/Lx */
		unsigned int FLUO           : 1;	/* Flush SORH/Lx */
		unsigned int SOL            : 6;	/* Pay Load Length of Registers SORL/H */
		unsigned int CRC            : 1;	/* CRC Generation Control */
		unsigned int STA            : 1;	/* Start Sequence Generation Control */
		unsigned int INH            : 1;	/* Inhibit Transfer */
		unsigned int GO             : 1;	/* Release prepared Send data */
		/* const */ unsigned int TPF            : 1;	/* Transmit Preparation Flag */
		/* const */ unsigned int TSF            : 1;	/* Transmit Shift Flag */
		/* const */ unsigned int TOF            : 1;	/* Transmit Output Flag */
		unsigned int                : 2;
		/* const */ unsigned int TRQ            : 1;	/* Transfer Request in Progress */
	} B;
	int I;
	unsigned int U;

} PSI5_SCR0_type;
#define PSI5_SCR0	(*( PSI5_SCR0_type *) 0xf0005090u)	/* Send Control Register 0 */
#define PSI5_SCR1	(*( PSI5_SCR0_type *) 0xf0005120u)	/* Send Control Register 1 */
#define PSI5_SCR2	(*( PSI5_SCR0_type *) 0xf00051b0u)	/* Send Control Register 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int SD32           : 1;	/* SDy */
		unsigned int SD33           : 1;	/* SDy */
		unsigned int SD34           : 1;	/* SDy */
		unsigned int SD35           : 1;	/* SDy */
		unsigned int SD36           : 1;	/* SDy */
		unsigned int SD37           : 1;	/* SDy */
		unsigned int SD38           : 1;	/* SDy */
		unsigned int SD39           : 1;	/* SDy */
		unsigned int SD40           : 1;	/* SDy */
		unsigned int SD41           : 1;	/* SDy */
		unsigned int SD42           : 1;	/* SDy */
		unsigned int SD43           : 1;	/* SDy */
		unsigned int SD44           : 1;	/* SDy */
		unsigned int SD45           : 1;	/* SDy */
		unsigned int SD46           : 1;	/* SDy */
		unsigned int SD47           : 1;	/* SDy */
		unsigned int SD48           : 1;	/* SDy */
		unsigned int SD49           : 1;	/* SDy */
		unsigned int SD50           : 1;	/* SDy */
		unsigned int SD51           : 1;	/* SDy */
		unsigned int SD52           : 1;	/* SDy */
		unsigned int SD53           : 1;	/* SDy */
		unsigned int SD54           : 1;	/* SDy */
		unsigned int SD55           : 1;	/* SDy */
		unsigned int SD56           : 1;	/* SDy */
		unsigned int SD57           : 1;	/* SDy */
		unsigned int SD58           : 1;	/* SDy */
		unsigned int SD59           : 1;	/* SDy */
		unsigned int SD60           : 1;	/* SDy */
		unsigned int SD61           : 1;	/* SDy */
		unsigned int SD62           : 1;	/* SDy */
		unsigned int SD63           : 1;	/* SDy */
	} B;
	int I;
	unsigned int U;

} PSI5_SDRH0_type;
