svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define PSI5_SDRH0	(*( PSI5_SDRH0_type *) 0xf0005098u)	/* Send Data Register High 0 */
#define PSI5_SDRH1	(*( PSI5_SDRH0_type *) 0xf0005128u)	/* Send Data Register High 1 */
#define PSI5_SDRH2	(*( PSI5_SDRH0_type *) 0xf00051b8u)	/* Send Data Register High 2 */
#define PSI5_SORH0	(*( PSI5_SDRH0_type *) 0xf00050a8u)	/* Send Output Register High 0 */
#define PSI5_SORH1	(*( PSI5_SDRH0_type *) 0xf0005138u)	/* Send Output Register High 1 */
#define PSI5_SORH2	(*( PSI5_SDRH0_type *) 0xf00051c8u)	/* Send Output Register High 2 */
#define PSI5_SSRH0	(*( PSI5_SDRH0_type *) 0xf00050a0u)	/* Send Shift Register High 0 */
#define PSI5_SSRH1	(*( PSI5_SDRH0_type *) 0xf0005130u)	/* Send Shift Register High 1 */
#define PSI5_SSRH2	(*( PSI5_SDRH0_type *) 0xf00051c0u)	/* Send Shift Register High 2 */

typedef volatile union
{
	struct
	{ 
		unsigned int SD0            : 1;	/* SDy */
		unsigned int SD1            : 1;	/* SDy */
		unsigned int SD2            : 1;	/* SDy */
		unsigned int SD3            : 1;	/* SDy */
		unsigned int SD4            : 1;	/* SDy */
		unsigned int SD5            : 1;	/* SDy */
		unsigned int SD6            : 1;	/* SDy */
		unsigned int SD7            : 1;	/* SDy */
		unsigned int SD8            : 1;	/* SDy */
		unsigned int SD9            : 1;	/* SDy */
		unsigned int SD10           : 1;	/* SDy */
		unsigned int SD11           : 1;	/* SDy */
		unsigned int SD12           : 1;	/* SDy */
		unsigned int SD13           : 1;	/* SDy */
		unsigned int SD14           : 1;	/* SDy */
		unsigned int SD15           : 1;	/* SDy */
		unsigned int SD16           : 1;	/* SDy */
		unsigned int SD17           : 1;	/* SDy */
		unsigned int SD18           : 1;	/* SDy */
		unsigned int SD19           : 1;	/* SDy */
		unsigned int SD20           : 1;	/* SDy */
		unsigned int SD21           : 1;	/* SDy */
		unsigned int SD22           : 1;	/* SDy */
		unsigned int SD23           : 1;	/* SDy */
		unsigned int SD24           : 1;	/* SDy */
		unsigned int SD25           : 1;	/* SDy */
		unsigned int SD26           : 1;	/* SDy */
		unsigned int SD27           : 1;	/* SDy */
		unsigned int SD28           : 1;	/* SDy */
		unsigned int SD29           : 1;	/* SDy */
		unsigned int SD30           : 1;	/* SDy */
		unsigned int SD31           : 1;	/* SDy */
	} B;
	int I;
	unsigned int U;

} PSI5_SDRL0_type;
#define PSI5_SDRL0	(*( PSI5_SDRL0_type *) 0xf0005094u)	/* Send Data Register Low 0 */
#define PSI5_SDRL1	(*( PSI5_SDRL0_type *) 0xf0005124u)	/* Send Data Register Low 1 */
#define PSI5_SDRL2	(*( PSI5_SDRL0_type *) 0xf00051b4u)	/* Send Data Register Low 2 */
#define PSI5_SORL0	(*( PSI5_SDRL0_type *) 0xf00050a4u)	/* Send Output Register Low 0 */
#define PSI5_SORL1	(*( PSI5_SDRL0_type *) 0xf0005134u)	/* Send Output Register Low 1 */
#define PSI5_SORL2	(*( PSI5_SDRL0_type *) 0xf00051c4u)	/* Send Output Register Low 2 */
#define PSI5_SSRL0	(*( PSI5_SDRL0_type *) 0xf000509cu)	/* Send Shift Register Low 0 */
#define PSI5_SSRL1	(*( PSI5_SDRL0_type *) 0xf000512cu)	/* Send Shift Register Low 1 */
#define PSI5_SSRL2	(*( PSI5_SDRL0_type *) 0xf00051bcu)	/* Send Shift Register Low 2 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SD             : 16;	/* Serial Data */
		/* const */ unsigned int MID            : 8;	/* Message ID */
		/* const */ unsigned int SCRC           : 6;	/* SCRC */
		/* const */ unsigned int SCRI           : 1;	/* CRC of Serial Message failed Interrupt Flag. */
		/* const */ unsigned int CON            : 1;	/* Configuration bit */
	} B;
	int I;
	unsigned int U;

} PSI5_SDS00_type;
#define PSI5_SDS00	(*( PSI5_SDS00_type *) 0xf0005060u)	/* Serial Data and Status Register 00 */
#define PSI5_SDS01	(*( PSI5_SDS00_type *) 0xf0005064u)	/* Serial Data and Status Register 01 */
#define PSI5_SDS02	(*( PSI5_SDS00_type *) 0xf0005068u)	/* Serial Data and Status Register 02 */
#define PSI5_SDS03	(*( PSI5_SDS00_type *) 0xf000506cu)	/* Serial Data and Status Register 03 */
#define PSI5_SDS04	(*( PSI5_SDS00_type *) 0xf0005070u)	/* Serial Data and Status Register 04 */
#define PSI5_SDS05	(*( PSI5_SDS00_type *) 0xf0005074u)	/* Serial Data and Status Register 05 */
#define PSI5_SDS10	(*( PSI5_SDS00_type *) 0xf00050f0u)	/* Serial Data and Status Register 10 */
#define PSI5_SDS11	(*( PSI5_SDS00_type *) 0xf00050f4u)	/* Serial Data and Status Register 11 */
#define PSI5_SDS12	(*( PSI5_SDS00_type *) 0xf00050f8u)	/* Serial Data and Status Register 12 */
#define PSI5_SDS13	(*( PSI5_SDS00_type *) 0xf00050fcu)	/* Serial Data and Status Register 13 */
#define PSI5_SDS14	(*( PSI5_SDS00_type *) 0xf0005100u)	/* Serial Data and Status Register 14 */
#define PSI5_SDS15	(*( PSI5_SDS00_type *) 0xf0005104u)	/* Serial Data and Status Register 15 */
#define PSI5_SDS20	(*( PSI5_SDS00_type *) 0xf0005180u)	/* Serial Data and Status Register 20 */
#define PSI5_SDS21	(*( PSI5_SDS00_type *) 0xf0005184u)	/* Serial Data and Status Register 21 */
#define PSI5_SDS22	(*( PSI5_SDS00_type *) 0xf0005188u)	/* Serial Data and Status Register 22 */
#define PSI5_SDS23	(*( PSI5_SDS00_type *) 0xf000518cu)	/* Serial Data and Status Register 23 */
#define PSI5_SDS24	(*( PSI5_SDS00_type *) 0xf0005190u)	/* Serial Data and Status Register 24 */
#define PSI5_SDS25	(*( PSI5_SDS00_type *) 0xf0005194u)	/* Serial Data and Status Register 25 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TS             : 24;	/* Time Stamp */
		/* const */ unsigned int                : 8;
	} B;
	int I;
	unsigned int U;

} PSI5_SFTSC0_type;
#define PSI5_SFTSC0	(*( PSI5_SFTSC0_type *) 0xf000507cu)	/* SOF TS Capture Register SFTSC0 */
#define PSI5_SFTSC1	(*( PSI5_SFTSC0_type *) 0xf000510cu)	/* SOF TS Capture Register SFTSC1 */
#define PSI5_SFTSC2	(*( PSI5_SFTSC0_type *) 0xf000519cu)	/* SOF TS Capture Register SFTSC2 */
#define PSI5_SPTSC0	(*( PSI5_SFTSC0_type *) 0xf0005078u)	/* SOP TS Capture Register SPTSC0 */
#define PSI5_SPTSC1	(*( PSI5_SFTSC0_type *) 0xf0005108u)	/* SOP TS Capture Register SPTSC1 */
#define PSI5_SPTSC2	(*( PSI5_SFTSC0_type *) 0xf0005198u)	/* SOP TS Capture Register SPTSC2 */

