svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int TEI0           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI1           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI2           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI3           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI4           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI5           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI6           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI7           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI8           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI9           : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI10          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI11          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI12          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI13          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI14          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI15          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI16          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI17          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI18          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI19          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI20          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI21          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI22          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI23          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI24          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI25          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI26          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI27          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI28          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI29          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI30          : 1;	/* Clear TEI Flag of Buffer y */
		unsigned int TEI31          : 1;	/* Clear TEI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_TEICLR0_type;
#define PSI5_TEICLR0	(*( PSI5_TEICLR0_type *) 0xf0005588u)	/* TEIOV0 Clear Register */
#define PSI5_TEICLR1	(*( PSI5_TEICLR0_type *) 0xf000558cu)	/* TEIOV1 Clear Register */
#define PSI5_TEICLR2	(*( PSI5_TEICLR0_type *) 0xf0005590u)	/* TEIOV2 Clear Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TEI0           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI1           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI2           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI3           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI4           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI5           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI6           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI7           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI8           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI9           : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI10          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI11          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI12          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI13          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI14          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI15          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI16          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI17          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI18          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI19          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI20          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI21          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI22          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI23          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI24          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI25          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI26          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI27          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI28          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI29          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI30          : 1;	/* TEI Flag of Buffer y */
		/* const */ unsigned int TEI31          : 1;	/* TEI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_TEIOV0_type;
#define PSI5_TEIOV0	(*( PSI5_TEIOV0_type *) 0xf0005448u)	/* TEI Overview Register */
#define PSI5_TEIOV1	(*( PSI5_TEIOV0_type *) 0xf000544cu)	/* TEI Overview Register */
#define PSI5_TEIOV2	(*( PSI5_TEIOV0_type *) 0xf0005450u)	/* TEI Overview Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TEI0           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI1           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI2           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI3           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI4           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI5           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI6           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI7           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI8           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI9           : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI10          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI11          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI12          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI13          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI14          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI15          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI16          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI17          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI18          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI19          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI20          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI21          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI22          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI23          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI24          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI25          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI26          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI27          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI28          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI29          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI30          : 1;	/* Set TEI Flag of Buffer y */
		unsigned int TEI31          : 1;	/* Set TEI Flag of Buffer y */
	} B;
	int I;
	unsigned int U;

} PSI5_TEISET0_type;
#define PSI5_TEISET0	(*( PSI5_TEISET0_type *) 0xf00054e8u)	/* TEIOV0 Set Register */
#define PSI5_TEISET1	(*( PSI5_TEISET0_type *) 0xf00054ecu)	/* TEIOV1 Set Register */
#define PSI5_TEISET2	(*( PSI5_TEISET0_type *) 0xf00054f0u)	/* TEIOV2 Set Register */

