svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CTS            : 24;	/* Current Time Stamp for the Module */
		unsigned int ETB            : 3;	/* External Time Base Select */
		unsigned int TBS            : 1;	/* Time Base Select */
		unsigned int                : 2;
		unsigned int ACLR           : 1;	/* Clear All Current Time Stamp Counters */
		unsigned int CLR            : 1;	/* Clear Current Time Stamp for the Module */
	} B;
	int I;
	unsigned int U;

} PSI5_TSRA_type;
#define PSI5_TSRA	(*( PSI5_TSRA_type *) 0xf000501cu)	/* Time Stamp Register A */
#define PSI5_TSRB	(*( PSI5_TSRA_type *) 0xf0005020u)	/* Time Stamp Register B */
#define PSI5_TSRC	(*( PSI5_TSRA_type *) 0xf0005024u)	/* Time Stamp Register C */

typedef volatile union
{
	struct
	{ 
		unsigned int WDLxw          : 16;	/* Watch Dog Timer Limit */
		unsigned int                : 16;
	} B;
	int I;
	unsigned int U;

} PSI5_WDT00_type;
#define PSI5_WDT00	(*( PSI5_WDT00_type *) 0xf0005040u)	/* Watch Dog Timer Register 00 */
#define PSI5_WDT01	(*( PSI5_WDT00_type *) 0xf0005044u)	/* Watch Dog Timer Register 01 */
#define PSI5_WDT02	(*( PSI5_WDT00_type *) 0xf0005048u)	/* Watch Dog Timer Register 02 */
#define PSI5_WDT03	(*( PSI5_WDT00_type *) 0xf000504cu)	/* Watch Dog Timer Register 03 */
#define PSI5_WDT04	(*( PSI5_WDT00_type *) 0xf0005050u)	/* Watch Dog Timer Register 04 */
#define PSI5_WDT05	(*( PSI5_WDT00_type *) 0xf0005054u)	/* Watch Dog Timer Register 05 */
#define PSI5_WDT06	(*( PSI5_WDT00_type *) 0xf0005058u)	/* Watch Dog Timer Register 06 */
#define PSI5_WDT10	(*( PSI5_WDT00_type *) 0xf00050d0u)	/* Watch Dog Timer Register 10 */
#define PSI5_WDT11	(*( PSI5_WDT00_type *) 0xf00050d4u)	/* Watch Dog Timer Register 11 */
#define PSI5_WDT12	(*( PSI5_WDT00_type *) 0xf00050d8u)	/* Watch Dog Timer Register 12 */
#define PSI5_WDT13	(*( PSI5_WDT00_type *) 0xf00050dcu)	/* Watch Dog Timer Register 13 */
#define PSI5_WDT14	(*( PSI5_WDT00_type *) 0xf00050e0u)	/* Watch Dog Timer Register 14 */
#define PSI5_WDT15	(*( PSI5_WDT00_type *) 0xf00050e4u)	/* Watch Dog Timer Register 15 */
#define PSI5_WDT16	(*( PSI5_WDT00_type *) 0xf00050e8u)	/* Watch Dog Timer Register 16 */
#define PSI5_WDT20	(*( PSI5_WDT00_type *) 0xf0005160u)	/* Watch Dog Timer Register 20 */
#define PSI5_WDT21	(*( PSI5_WDT00_type *) 0xf0005164u)	/* Watch Dog Timer Register 21 */
#define PSI5_WDT22	(*( PSI5_WDT00_type *) 0xf0005168u)	/* Watch Dog Timer Register 22 */
#define PSI5_WDT23	(*( PSI5_WDT00_type *) 0xf000516cu)	/* Watch Dog Timer Register 23 */
#define PSI5_WDT24	(*( PSI5_WDT00_type *) 0xf0005170u)	/* Watch Dog Timer Register 24 */
#define PSI5_WDT25	(*( PSI5_WDT00_type *) 0xf0005174u)	/* Watch Dog Timer Register 25 */
#define PSI5_WDT26	(*( PSI5_WDT00_type *) 0xf0005178u)	/* Watch Dog Timer Register 26 */


/* ETH */
typedef volatile union
{
	struct
	{ 
		unsigned int EN0            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN1            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN2            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN3            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN4            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN5            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN6            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN7            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN8            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN9            : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN10           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN11           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN12           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN13           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN14           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN15           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN16           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN17           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN18           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN19           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN20           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN21           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN22           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN23           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN24           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN25           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN26           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN27           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN28           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN29           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN30           : 1;	/* Access Enable for Master TAG ID n */
		unsigned int EN31           : 1;	/* Access Enable for Master TAG ID n */
	} B;
	int I;
	unsigned int U;

} ETH_ACCEN0_type;
#define ETH_ACCEN0	(*( ETH_ACCEN0_type *) 0xf001d00cu)	/* Access Enable Register 0 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int Reserved       : 32;	/* Reserved */
	} B;
	int I;
	unsigned int U;

} ETH_ACCEN1_type;
#define ETH_ACCEN1	(*( ETH_ACCEN1_type *) 0xf001d010u)	/* Access Enable Register 1 */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int AXWHSTS        : 1;	/* AXI Master Write Channel or AHB Master Status */
		/* const */ unsigned int AXIRDSTS       : 1;	/* AXI Master Read Channel Status */
		/* const */ unsigned int RESERVED_31_2  : 30;	/* RESERVED_31_2 */
	} B;
	int I;
	unsigned int U;

} ETH_AHB_OR_AXI_STATUS_type;
#define ETH_AHB_OR_AXI_STATUS	(*( ETH_AHB_OR_AXI_STATUS_type *) 0xf001f02cu)	/* Register 11 - AHB or AXI Status Register */

