svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int SWR            : 1;	/* Software Reset */
		unsigned int DA             : 1;	/* DMA Arbitration Scheme */
		unsigned int DSL            : 5;	/* Descriptor Skip Length */
		unsigned int ATDS           : 1;	/* Alternate Descriptor Size */
		unsigned int PBL            : 6;	/* Programmable Burst Length */
		unsigned int PR             : 2;	/* Priority Ratio */
		unsigned int FB             : 1;	/* Fixed Burst */
		unsigned int RPBL           : 6;	/* Rx DMA PBL */
		unsigned int USP            : 1;	/* Use Seperate PBL */
		unsigned int HEIGHTxPBL     : 1;	/* 8xPBL Mode */
		unsigned int AAL            : 1;	/* Address Aligned Beats */
		unsigned int MB             : 1;	/* Mixed Burst */
		unsigned int TXPR           : 1;	/* Transmit Priority */
		/* const */ unsigned int PRWG           : 2;	/* Channel Priority Weights */
		/* const */ unsigned int RESERVED_31_30 : 2;	/* RESERVED_31_30 */
	} B;
	int I;
	unsigned int U;

} ETH_BUS_MODE_type;
#define ETH_BUS_MODE	(*( ETH_BUS_MODE_type *) 0xf001f000u)	/* Register 0 - Bus Mode Register */

typedef volatile union
{
	struct
	{ 
		unsigned int DISR           : 1;	/* Module Disable Request Bit */
		/* const */ unsigned int DISS           : 1;	/* Module Disable Status Bit */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} ETH_CLC_type;
#define ETH_CLC	(*( ETH_CLC_type *) 0xf001d000u)	/* Clock Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CURRBUFAPTR    : 32;	/* Host Receive Buffer Address Pointer */
	} B;
	int I;
	unsigned int U;

} ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_type;
#define ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS	(*( ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_type *) 0xf001f054u)	/* Register 21 - Current Host Receive Buffer Address Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CURRDESAPTR    : 32;	/* Host Receive Descriptor Address Pointer */
	} B;
	int I;
	unsigned int U;

} ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_type;
#define ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR	(*( ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_type *) 0xf001f04cu)	/* Register 19 - Current Host Receive Descriptor Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CURTBUFAPTR    : 32;	/* Host Transmit Buffer Address Pointer */
	} B;
	int I;
	unsigned int U;

} ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_type;
#define ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS	(*( ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_type *) 0xf001f050u)	/* Register 20 - Current Host Transmit Buffer Address Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int CURTDESAPTR    : 32;	/* Host Transmit Descriptor Address Pointer */
	} B;
	int I;
	unsigned int U;

} ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_type;
#define ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR	(*( ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_type *) 0xf001f048u)	/* Register 18 - Current Host Transmit Descriptor Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RPESTS         : 1;	/* MAC GMII or MII Receive Protocol Engine Status */
		/* const */ unsigned int RFCFCSTS       : 2;	/* MAC Receive Frame Controller FIFO Status */
		/* const */ unsigned int RESERVED_3     : 1;	/* RESERVED_3 */
		/* const */ unsigned int RWCSTS         : 1;	/* MTL Rx FIFO Write Controller Active Status */
		/* const */ unsigned int RRCSTS         : 2;	/* MTL Rx FIFO Read Controller State */
		/* const */ unsigned int RESERVED_7     : 1;	/* RESERVED_7 */
		/* const */ unsigned int RXFSTS         : 2;	/* MTL Rx FIFO Fill-level Status */
		/* const */ unsigned int RESERVED_15_10 : 6;	/* RESERVED_15_10 */
		/* const */ unsigned int TPESTS         : 1;	/* MAC GMII or MII Transmit Protocol Engine Status */
		/* const */ unsigned int TFCSTS         : 2;	/* MAC Transmit Frame Controller Status */
		/* const */ unsigned int TXPAUSED       : 1;	/* MAC transmitter in PAUSE */
		/* const */ unsigned int TRCSTS         : 2;	/* MTL Tx FIFO Read Controller Status */
		/* const */ unsigned int TWCSTS         : 1;	/* MTL Tx FIFO Write Controller Active Status */
		/* const */ unsigned int RESERVED_23    : 1;	/* RESERVED_23 */
		/* const */ unsigned int TXFSTS         : 1;	/* MTL Tx FIFO Not Empty Status */
		/* const */ unsigned int TXSTSFSTS      : 1;	/* MTL TxStatus FIFO Full Status */
		/* const */ unsigned int RESERVED_31_26 : 6;	/* RESERVED_31_26 */
	} B;
	int I;
	unsigned int U;

} ETH_DEBUG_type;
#define ETH_DEBUG	(*( ETH_DEBUG_type *) 0xf001e024u)	/* Register 9 - Debug Register */

typedef volatile union
{
	struct
	{ 
		unsigned int FCA_BPA        : 1;	/* Flow Control Busy or Backpressure Activate */
		unsigned int TFE            : 1;	/* Transmit Flow Control Enable */
		unsigned int RFE            : 1;	/* Receive Flow Control Enable */
		unsigned int UP             : 1;	/* Unicast Pause Frame Detect */
		unsigned int PLT            : 2;	/* Pause Low Threshold */
		/* const */ unsigned int RESERVED_6     : 1;	/* RESERVED_6 */
		unsigned int DZPQ           : 1;	/* Disable Zero-Quanta Pause */
		/* const */ unsigned int RESERVED_15_8  : 8;	/* RESERVED_15_8 */
		unsigned int PT             : 16;	/* Pause Time */
	} B;
	int I;
	unsigned int U;

} ETH_FLOW_CONTROL_type;
#define ETH_FLOW_CONTROL	(*( ETH_FLOW_CONTROL_type *) 0xf001e018u)	/* Register 6 - Flow Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int GB             : 1;	/* GMII Busy */
		unsigned int GW             : 1;	/* GMII Write */
		unsigned int CR             : 4;	/* CSR Clock Range */
		unsigned int GR             : 5;	/* GMII Register */
		unsigned int PA             : 5;	/* Physical Layer Address */
		/* const */ unsigned int RESERVED_31_16 : 16;	/* RESERVED_31_16 */
	} B;
	int I;
	unsigned int U;

} ETH_GMII_ADDRESS_type;
#define ETH_GMII_ADDRESS	(*( ETH_GMII_ADDRESS_type *) 0xf001e010u)	/* Register 4 - GMII Address Register */

