svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int GD             : 16;	/* GMII Data */
		/* const */ unsigned int RESERVED_31_16 : 16;	/* RESERVED_31_16 */
	} B;
	int I;
	unsigned int U;

} ETH_GMII_DATA_type;
#define ETH_GMII_DATA	(*( ETH_GMII_DATA_type *) 0xf001e014u)	/* Register 5 - GMII Data Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ALTI0          : 2;	/* Alternate Input Select */
		unsigned int ALTI1          : 2;	/* Alternate Input Select */
		unsigned int ALTI2          : 2;	/* Alternate Input Select */
		unsigned int ALTI3          : 2;	/* Alternate Input Select */
		unsigned int ALTI4          : 2;	/* Alternate Input Select */
		unsigned int ALTI5          : 2;	/* Alternate Input Select */
		unsigned int ALTI6          : 2;	/* Alternate Input Select */
		unsigned int ALTI7          : 2;	/* Alternate Input Select */
		unsigned int ALTI8          : 2;	/* Alternate Input Select */
		unsigned int ALTI9          : 2;	/* Alternate Input Select */
		unsigned int ALTI10         : 2;	/* Alternate Input Select */
		unsigned int                : 2;
		unsigned int EPR            : 1;	/* External Phy Interface RMMI Mode Bit */
		unsigned int DIV            : 1;	/* Module Clock Divider Request Bit */
		unsigned int                : 6;
	} B;
	int I;
	unsigned int U;

} ETH_GPCTL_type;
#define ETH_GPCTL	(*( ETH_GPCTL_type *) 0xf001d008u)	/* Input and Output Control Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HTH            : 32;	/* Hash Table High */
	} B;
	int I;
	unsigned int U;

} ETH_HASH_TABLE_HIGH_type;
#define ETH_HASH_TABLE_HIGH	(*( ETH_HASH_TABLE_HIGH_type *) 0xf001e008u)	/* Register 2 - Hash Table High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int HTL            : 32;	/* Hash Table Low */
	} B;
	int I;
	unsigned int U;

} ETH_HASH_TABLE_LOW_type;
#define ETH_HASH_TABLE_LOW	(*( ETH_HASH_TABLE_LOW_type *) 0xf001e00cu)	/* Register 3 - Hash Table Low Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MIISEL         : 1;	/* MIISEL */
		/* const */ unsigned int GMIISEL        : 1;	/* GMIISEL */
		/* const */ unsigned int HDSEL          : 1;	/* HDSEL */
		/* const */ unsigned int EXTHASHEN      : 1;	/* EXTHASHEN */
		/* const */ unsigned int HASHSEL        : 1;	/* HASHSEL */
		/* const */ unsigned int ADDMACADRSEL   : 1;	/* ADDMACADRSEL */
		/* const */ unsigned int PCSSEL         : 1;	/* PCSSEL */
		/* const */ unsigned int L3L4FLTREN     : 1;	/* L3L4FLTREN */
		/* const */ unsigned int SMASEL         : 1;	/* SMASEL */
		/* const */ unsigned int RWKSEL         : 1;	/* RWKSEL */
		/* const */ unsigned int MGKSEL         : 1;	/* MGKSEL */
		/* const */ unsigned int MMCSEL         : 1;	/* MMCSEL */
		/* const */ unsigned int TSVER1SEL      : 1;	/* TSVER1SEL */
		/* const */ unsigned int TSVER2SEL      : 1;	/* TSVER2SEL */
		/* const */ unsigned int EEESEL         : 1;	/* EEESEL */
		/* const */ unsigned int AVSEL          : 1;	/* AVSEL */
		/* const */ unsigned int TXCOESEL       : 1;	/* TXCOESEL */
		/* const */ unsigned int RXTYP1COE      : 1;	/* RXTYP1COE */
		/* const */ unsigned int RXTYP2COE      : 1;	/* RXTYP2COE */
		unsigned int RXFIFOSIZE     : 1;	/* RXFIFOSIZE */
		/* const */ unsigned int RXCHCNT        : 2;	/* RXCHCNT */
		/* const */ unsigned int TXCHCNT        : 2;	/* TXCHCNT */
		/* const */ unsigned int ENHDESSEL      : 1;	/* ENHDESSEL */
		/* const */ unsigned int INTTSEN        : 1;	/* INTTSEN */
		/* const */ unsigned int FLEXIPPSEN     : 1;	/* FLEXIPPSEN */
		/* const */ unsigned int SAVLANINS      : 1;	/* SAVLANINS */
		/* const */ unsigned int ACTPHYIF       : 3;	/* Active or Selected PHY interface */
		/* const */ unsigned int RESERVED_31    : 1;	/* RESERVED_31 */
	} B;
	int I;
	unsigned int U;

} ETH_HW_FEATURE_type;
#define ETH_HW_FEATURE	(*( ETH_HW_FEATURE_type *) 0xf001f058u)	/* Register 22 - HW Feature Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MODREV         : 8;	/* Module Revision Number */
		/* const */ unsigned int MODTYPE        : 8;	/* Module Type */
		/* const */ unsigned int MODNUMBER      : 16;	/* Module Number Value */
	} B;
	int I;
	unsigned int U;

} ETH_ID_type;
#define ETH_ID	(*( ETH_ID_type *) 0xf001d004u)	/* Module Identification Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TIE            : 1;	/* Transmit Interrupt Enable */
		unsigned int TSE            : 1;	/* Transmit Stopped Enable */
		unsigned int TUE            : 1;	/* Transmit Buffer Unvailable Enable */
		unsigned int TJE            : 1;	/* Transmit Jabber Timeout Enable */
		unsigned int OVE            : 1;	/* Overflow Interrupt Enable */
		unsigned int UNE            : 1;	/* Underflow Interrupt Enable */
		unsigned int RIE            : 1;	/* Receive Interrupt Enable */
		unsigned int RUE            : 1;	/* Receive Buffer Unavailable Enable */
		unsigned int RSE            : 1;	/* Receive Stopped Enable */
		unsigned int RWE            : 1;	/* Receive Watchdog Timeout Enable */
		unsigned int ETE            : 1;	/* Early Transmit Interrupt Enable */
		/* const */ unsigned int RESERVED_12_11 : 2;	/* RESERVED_12_11 */
		unsigned int FBE            : 1;	/* Fatal Bus Error Enable */
		unsigned int ERE            : 1;	/* Early Receive Interrupt Enable */
		unsigned int AIE            : 1;	/* Abnormal Interrupt Summary Enable */
		unsigned int NIE            : 1;	/* Normal Interrupt Summary Enable */
		/* const */ unsigned int RESERVED_31_17 : 15;	/* RESERVED_31_17 */
	} B;
	int I;
	unsigned int U;

} ETH_INTERRUPT_ENABLE_type;
#define ETH_INTERRUPT_ENABLE	(*( ETH_INTERRUPT_ENABLE_type *) 0xf001f01cu)	/* Register 7 - Interrupt Enable Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RGSMIIIM       : 1;	/* RGMII or SMII Interrupt Mask */
		/* const */ unsigned int PCSLCHGIM      : 1;	/* PCS Link Status Interrupt Mask */
		/* const */ unsigned int PCSANCIM       : 1;	/* PCS AN Completion Interrupt Mask */
		unsigned int PMTIM          : 1;	/* PMT Interrupt Mask */
		/* const */ unsigned int RESERVED_8_4   : 5;	/* RESERVED_8_4 */
		unsigned int TSIM           : 1;	/* Timestamp Interrupt Mask */
		/* const */ unsigned int LPIIM          : 1;	/* LPI Interrupt Mask */
		/* const */ unsigned int RESERVED_31_11 : 21;	/* RESERVED_31_11 */
	} B;
	int I;
	unsigned int U;

} ETH_INTERRUPT_MASK_type;
#define ETH_INTERRUPT_MASK	(*( ETH_INTERRUPT_MASK_type *) 0xf001e03cu)	/* Register 15 - Interrupt Mask Register */

