svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RGSMIIIS       : 1;	/* RGMII or SMII Interrupt Status */
		/* const */ unsigned int PCSLCHGIS      : 1;	/* PCS Link Status Changed */
		/* const */ unsigned int PCSANCIS       : 1;	/* PCS Auto-Negotiation Complete */
		/* const */ unsigned int PMTIS          : 1;	/* PMT Interrupt Status */
		/* const */ unsigned int MMCIS          : 1;	/* MMC Interrupt Status */
		/* const */ unsigned int MMCRXIS        : 1;	/* MMC Receive Interrupt Status */
		/* const */ unsigned int MMCTXIS        : 1;	/* MMC Transmit Interrupt Status */
		/* const */ unsigned int MMCRXIPIS      : 1;	/* MMC Receive Checksum Offload Interrupt Status */
		/* const */ unsigned int RESERVED_8     : 1;	/* RESERVED_8 */
		/* const */ unsigned int TSIS           : 1;	/* Timestamp Interrupt Status */
		/* const */ unsigned int LPIIS          : 1;	/* LPI Interrupt Status */
		/* const */ unsigned int RESERVED_31_11 : 21;	/* RESERVED_31_11 */
	} B;
	int I;
	unsigned int U;

} ETH_INTERRUPT_STATUS_type;
#define ETH_INTERRUPT_STATUS	(*( ETH_INTERRUPT_STATUS_type *) 0xf001e038u)	/* Register 14 - Interrupt Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		/* const */ unsigned int RSTSTAT        : 1;	/* Kernel Reset Status */
		unsigned int                : 30;
	} B;
	int I;
	unsigned int U;

} ETH_KRST0_type;
#define ETH_KRST0	(*( ETH_KRST0_type *) 0xf001d014u)	/* Kernel Reset Register 0 */

typedef volatile union
{
	struct
	{ 
		unsigned int RST            : 1;	/* Kernel Reset */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} ETH_KRST1_type;
#define ETH_KRST1	(*( ETH_KRST1_type *) 0xf001d018u)	/* Kernel Reset Register 1 */

typedef volatile union
{
	struct
	{ 
		unsigned int CLR            : 1;	/* Kernel Reset Status Clear */
		unsigned int                : 31;
	} B;
	int I;
	unsigned int U;

} ETH_KRSTCLR_type;
#define ETH_KRSTCLR	(*( ETH_KRSTCLR_type *) 0xf001d01cu)	/* Kernel Reset Status Clear Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address0 [47:32] */
		/* const */ unsigned int RESERVED_30_16 : 15;	/* RESERVED_30_16 */
		/* const */ unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS0_HIGH_type;
#define ETH_MAC_ADDRESS0_HIGH	(*( ETH_MAC_ADDRESS0_HIGH_type *) 0xf001e040u)	/* Register 16 - MAC Address0 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address0 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS0_LOW_type;
#define ETH_MAC_ADDRESS0_LOW	(*( ETH_MAC_ADDRESS0_LOW_type *) 0xf001e044u)	/* Register 17 - MAC Address0 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address10 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS10_HIGH_type;
#define ETH_MAC_ADDRESS10_HIGH	(*( ETH_MAC_ADDRESS10_HIGH_type *) 0xf001e090u)	/* Register 36 - MAC Address10 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address10 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS10_LOW_type;
#define ETH_MAC_ADDRESS10_LOW	(*( ETH_MAC_ADDRESS10_LOW_type *) 0xf001e094u)	/* Register 37 - MAC Address10 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address11 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS11_HIGH_type;
#define ETH_MAC_ADDRESS11_HIGH	(*( ETH_MAC_ADDRESS11_HIGH_type *) 0xf001e098u)	/* Register 38 - MAC Address11 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address11 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS11_LOW_type;
#define ETH_MAC_ADDRESS11_LOW	(*( ETH_MAC_ADDRESS11_LOW_type *) 0xf001e09cu)	/* Register 39 - MAC Address1 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address12 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS12_HIGH_type;
#define ETH_MAC_ADDRESS12_HIGH	(*( ETH_MAC_ADDRESS12_HIGH_type *) 0xf001e0a0u)	/* Register 40 - MAC Address12 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address12 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS12_LOW_type;
#define ETH_MAC_ADDRESS12_LOW	(*( ETH_MAC_ADDRESS12_LOW_type *) 0xf001e0a4u)	/* Register 41 - MAC Address12 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address13 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS13_HIGH_type;
#define ETH_MAC_ADDRESS13_HIGH	(*( ETH_MAC_ADDRESS13_HIGH_type *) 0xf001e0a8u)	/* Register 42 - MAC Address13 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address13 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS13_LOW_type;
