svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
#define ETH_MAC_ADDRESS13_LOW	(*( ETH_MAC_ADDRESS13_LOW_type *) 0xf001e0acu)	/* Register 43 - MAC Address13 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address14 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS14_HIGH_type;
#define ETH_MAC_ADDRESS14_HIGH	(*( ETH_MAC_ADDRESS14_HIGH_type *) 0xf001e0b0u)	/* Register 44 - MAC Address14 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address14 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS14_LOW_type;
#define ETH_MAC_ADDRESS14_LOW	(*( ETH_MAC_ADDRESS14_LOW_type *) 0xf001e0b4u)	/* Register 45 - MAC Address14 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* ADDRHI */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS15_HIGH_type;
#define ETH_MAC_ADDRESS15_HIGH	(*( ETH_MAC_ADDRESS15_HIGH_type *) 0xf001e0b8u)	/* Register 46 - MAC Address15 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address15 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS15_LOW_type;
#define ETH_MAC_ADDRESS15_LOW	(*( ETH_MAC_ADDRESS15_LOW_type *) 0xf001e0bcu)	/* Register 47 - MAC Address15 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address16 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS16_HIGH_type;
#define ETH_MAC_ADDRESS16_HIGH	(*( ETH_MAC_ADDRESS16_HIGH_type *) 0xf001e800u)	/* Register 512 - MAC Address16 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address16 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS16_LOW_type;
#define ETH_MAC_ADDRESS16_LOW	(*( ETH_MAC_ADDRESS16_LOW_type *) 0xf001e804u)	/* Register 513 - MAC Address16 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address18 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS17_HIGH_type;
#define ETH_MAC_ADDRESS17_HIGH	(*( ETH_MAC_ADDRESS17_HIGH_type *) 0xf001e808u)	/* Register 514 - MAC Address17 High Register */
#define ETH_MAC_ADDRESS18_HIGH	(*( ETH_MAC_ADDRESS17_HIGH_type *) 0xf001e810u)	/* Register 516 - MAC Address18 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address17 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS17_LOW_type;
#define ETH_MAC_ADDRESS17_LOW	(*( ETH_MAC_ADDRESS17_LOW_type *) 0xf001e80cu)	/* Register 515 - MAC Address17 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address18 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS18_LOW_type;
#define ETH_MAC_ADDRESS18_LOW	(*( ETH_MAC_ADDRESS18_LOW_type *) 0xf001e814u)	/* Register 517 - MAC Address18 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address19 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS19_HIGH_type;
#define ETH_MAC_ADDRESS19_HIGH	(*( ETH_MAC_ADDRESS19_HIGH_type *) 0xf001e818u)	/* Register 518 - MAC Address19 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address19 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS19_LOW_type;
#define ETH_MAC_ADDRESS19_LOW	(*( ETH_MAC_ADDRESS19_LOW_type *) 0xf001e81cu)	/* Register 519 - MAC Address19 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address1 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS1_HIGH_type;
#define ETH_MAC_ADDRESS1_HIGH	(*( ETH_MAC_ADDRESS1_HIGH_type *) 0xf001e048u)	/* Register 18 - MAC Address1 High Register */
#define ETH_MAC_ADDRESS24_HIGH	(*( ETH_MAC_ADDRESS1_HIGH_type *) 0xf001e840u)	/* Register 528 - MAC Address24 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address1 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS1_LOW_type;
#define ETH_MAC_ADDRESS1_LOW	(*( ETH_MAC_ADDRESS1_LOW_type *) 0xf001e04cu)	/* Register 19 - MAC Address1 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address20 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS20_HIGH_type;
#define ETH_MAC_ADDRESS20_HIGH	(*( ETH_MAC_ADDRESS20_HIGH_type *) 0xf001e820u)	/* Register 520 - MAC Address20 High Register */

