svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address20 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS20_LOW_type;
#define ETH_MAC_ADDRESS20_LOW	(*( ETH_MAC_ADDRESS20_LOW_type *) 0xf001e824u)	/* Register 521 - MAC Address20 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address21 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS21_HIGH_type;
#define ETH_MAC_ADDRESS21_HIGH	(*( ETH_MAC_ADDRESS21_HIGH_type *) 0xf001e828u)	/* Register 522 - MAC Address21 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address21 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS21_LOW_type;
#define ETH_MAC_ADDRESS21_LOW	(*( ETH_MAC_ADDRESS21_LOW_type *) 0xf001e82cu)	/* Register 523 - MAC Address21 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address22 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS22_HIGH_type;
#define ETH_MAC_ADDRESS22_HIGH	(*( ETH_MAC_ADDRESS22_HIGH_type *) 0xf001e830u)	/* Register 524 - MAC Address22 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address22 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS22_LOW_type;
#define ETH_MAC_ADDRESS22_LOW	(*( ETH_MAC_ADDRESS22_LOW_type *) 0xf001e834u)	/* Register 525 - MAC Address22 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address23 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS23_HIGH_type;
#define ETH_MAC_ADDRESS23_HIGH	(*( ETH_MAC_ADDRESS23_HIGH_type *) 0xf001e838u)	/* Register 526 - MAC Address23 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address23 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS23_LOW_type;
#define ETH_MAC_ADDRESS23_LOW	(*( ETH_MAC_ADDRESS23_LOW_type *) 0xf001e83cu)	/* Register 527 - MAC Address23 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address24 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS24_LOW_type;
#define ETH_MAC_ADDRESS24_LOW	(*( ETH_MAC_ADDRESS24_LOW_type *) 0xf001e844u)	/* Register 529 - MAC Address24 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address25 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS25_HIGH_type;
#define ETH_MAC_ADDRESS25_HIGH	(*( ETH_MAC_ADDRESS25_HIGH_type *) 0xf001e848u)	/* Register 530 - MAC Address25 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address25 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS25_LOW_type;
#define ETH_MAC_ADDRESS25_LOW	(*( ETH_MAC_ADDRESS25_LOW_type *) 0xf001e84cu)	/* Register 531 - MAC Address25 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address26 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS26_HIGH_type;
#define ETH_MAC_ADDRESS26_HIGH	(*( ETH_MAC_ADDRESS26_HIGH_type *) 0xf001e850u)	/* Register 532 - MAC Address26 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address26 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS26_LOW_type;
#define ETH_MAC_ADDRESS26_LOW	(*( ETH_MAC_ADDRESS26_LOW_type *) 0xf001e854u)	/* Register 533 - MAC Address26 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address27 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS27_HIGH_type;
#define ETH_MAC_ADDRESS27_HIGH	(*( ETH_MAC_ADDRESS27_HIGH_type *) 0xf001e858u)	/* Register 534 - MAC Address27 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address27 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS27_LOW_type;
#define ETH_MAC_ADDRESS27_LOW	(*( ETH_MAC_ADDRESS27_LOW_type *) 0xf001e85cu)	/* Register 535 - MAC Address27 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address28 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

