svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ETH_MAC_ADDRESS28_HIGH_type;
#define ETH_MAC_ADDRESS28_HIGH	(*( ETH_MAC_ADDRESS28_HIGH_type *) 0xf001e860u)	/* Register 536 - MAC Address28 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address28 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS28_LOW_type;
#define ETH_MAC_ADDRESS28_LOW	(*( ETH_MAC_ADDRESS28_LOW_type *) 0xf001e864u)	/* Register 537 - MAC Address28 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address29 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS29_HIGH_type;
#define ETH_MAC_ADDRESS29_HIGH	(*( ETH_MAC_ADDRESS29_HIGH_type *) 0xf001e868u)	/* Register 538 - MAC Address29 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address29 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS29_LOW_type;
#define ETH_MAC_ADDRESS29_LOW	(*( ETH_MAC_ADDRESS29_LOW_type *) 0xf001e86cu)	/* Register 539 - MAC Address29 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address2 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS2_HIGH_type;
#define ETH_MAC_ADDRESS2_HIGH	(*( ETH_MAC_ADDRESS2_HIGH_type *) 0xf001e050u)	/* Register 20 - MAC Address2 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address2 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS2_LOW_type;
#define ETH_MAC_ADDRESS2_LOW	(*( ETH_MAC_ADDRESS2_LOW_type *) 0xf001e054u)	/* Register 21 - MAC Address2 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address30 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS30_HIGH_type;
#define ETH_MAC_ADDRESS30_HIGH	(*( ETH_MAC_ADDRESS30_HIGH_type *) 0xf001e870u)	/* Register 540 - MAC Address30 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address30 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS30_LOW_type;
#define ETH_MAC_ADDRESS30_LOW	(*( ETH_MAC_ADDRESS30_LOW_type *) 0xf001e874u)	/* Register 541 - MAC Address30 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address31 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS31_HIGH_type;
#define ETH_MAC_ADDRESS31_HIGH	(*( ETH_MAC_ADDRESS31_HIGH_type *) 0xf001e878u)	/* Register 542 - MAC Address31 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address31 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS31_LOW_type;
#define ETH_MAC_ADDRESS31_LOW	(*( ETH_MAC_ADDRESS31_LOW_type *) 0xf001e87cu)	/* Register 543 - MAC Address31 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address3 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS3_HIGH_type;
#define ETH_MAC_ADDRESS3_HIGH	(*( ETH_MAC_ADDRESS3_HIGH_type *) 0xf001e058u)	/* Register 22 - MAC Address3 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address3 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS3_LOW_type;
#define ETH_MAC_ADDRESS3_LOW	(*( ETH_MAC_ADDRESS3_LOW_type *) 0xf001e05cu)	/* Register 23 - MAC Address3 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address4 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS4_HIGH_type;
#define ETH_MAC_ADDRESS4_HIGH	(*( ETH_MAC_ADDRESS4_HIGH_type *) 0xf001e060u)	/* Register 24 - MAC Address4 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address4 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS4_LOW_type;
#define ETH_MAC_ADDRESS4_LOW	(*( ETH_MAC_ADDRESS4_LOW_type *) 0xf001e064u)	/* Register 25 - MAC Address4 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address5 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS5_HIGH_type;
#define ETH_MAC_ADDRESS5_HIGH	(*( ETH_MAC_ADDRESS5_HIGH_type *) 0xf001e068u)	/* Register 26 - MAC Address5 High Register */

