svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address5 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS5_LOW_type;
#define ETH_MAC_ADDRESS5_LOW	(*( ETH_MAC_ADDRESS5_LOW_type *) 0xf001e06cu)	/* Register 27 - MAC Address5 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address6 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS6_HIGH_type;
#define ETH_MAC_ADDRESS6_HIGH	(*( ETH_MAC_ADDRESS6_HIGH_type *) 0xf001e070u)	/* Register 28 - MAC Address6 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address6 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS6_LOW_type;
#define ETH_MAC_ADDRESS6_LOW	(*( ETH_MAC_ADDRESS6_LOW_type *) 0xf001e074u)	/* Register 29 - MAC Address6 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address7 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS7_HIGH_type;
#define ETH_MAC_ADDRESS7_HIGH	(*( ETH_MAC_ADDRESS7_HIGH_type *) 0xf001e078u)	/* Register 30 - MAC Address7 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address7 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS7_LOW_type;
#define ETH_MAC_ADDRESS7_LOW	(*( ETH_MAC_ADDRESS7_LOW_type *) 0xf001e07cu)	/* Register 31 - MAC Address7 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address8 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS8_HIGH_type;
#define ETH_MAC_ADDRESS8_HIGH	(*( ETH_MAC_ADDRESS8_HIGH_type *) 0xf001e080u)	/* Register 32 - MAC Address8 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address8 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS8_LOW_type;
#define ETH_MAC_ADDRESS8_LOW	(*( ETH_MAC_ADDRESS8_LOW_type *) 0xf001e084u)	/* Register 33 - MAC Address8 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRHI         : 16;	/* MAC Address9 [47:32] */
		/* const */ unsigned int RESERVED_23_16 : 8;	/* RESERVED_23_16 */
		unsigned int MBC            : 6;	/* Mask Byte Control */
		unsigned int SA             : 1;	/* Source Address */
		unsigned int AE             : 1;	/* Address Enable */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS9_HIGH_type;
#define ETH_MAC_ADDRESS9_HIGH	(*( ETH_MAC_ADDRESS9_HIGH_type *) 0xf001e088u)	/* Register 34 - MAC Address9 High Register */

typedef volatile union
{
	struct
	{ 
		unsigned int ADDRLO         : 32;	/* MAC Address9 [31:0] */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_ADDRESS9_LOW_type;
#define ETH_MAC_ADDRESS9_LOW	(*( ETH_MAC_ADDRESS9_LOW_type *) 0xf001e08cu)	/* Register 35 - MAC Address9 Low Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PRELEN         : 2;	/* Preamble Length for Transmit Frames */
		unsigned int RE             : 1;	/* Receiver Enable */
		unsigned int TE             : 1;	/* Transmitter Enable */
		unsigned int DC             : 1;	/* Deferral Check */
		unsigned int BL             : 2;	/* Back-Off Limit */
		unsigned int ACS            : 1;	/* Automatic Pad or CRC Stripping */
		/* const */ unsigned int LUD            : 1;	/* Link Up or Down */
		unsigned int DR             : 1;	/* Disable Retry */
		unsigned int IPC            : 1;	/* Checksum Offload */
		unsigned int DM             : 1;	/* Duplex Mode */
		unsigned int LM             : 1;	/* Loopback Mode */
		unsigned int DO             : 1;	/* Disable Receive Own */
		unsigned int FES            : 1;	/* Speed */
		/* const */ unsigned int PS             : 1;	/* Port Select */
		unsigned int DCRS           : 1;	/* Disable Carrier Sense During Transmission */
		unsigned int IFG            : 3;	/* Inter-Frame Gap */
		unsigned int JE             : 1;	/* Jumbo Frame Enable */
		/* const */ unsigned int BE             : 1;	/* Frame Burst Enable */
		unsigned int JD             : 1;	/* Jabber Disable */
		unsigned int WD             : 1;	/* Watchdog Disable */
		/* const */ unsigned int TC             : 1;	/* Transmit Configuration in RGMII, SGMII, or SMII */
		unsigned int CST            : 1;	/* CRC Stripping of Type Frames */
		/* const */ unsigned int SFTERR         : 1;	/* SMII Force Transmit Error */
		unsigned int TWOKPE         : 1;	/* IEEE 802.3as support for 2K packets Enable */
		/* const */ unsigned int SARC           : 3;	/* Source Address Insertion or Replacement Control */
		/* const */ unsigned int RESERVED_31    : 1;	/* RESERVED_31 */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_CONFIGURATION_type;
#define ETH_MAC_CONFIGURATION	(*( ETH_MAC_CONFIGURATION_type *) 0xf001e000u)	/* Register 0 - MAC Configuration Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PR             : 1;	/* Promiscuous Mode */
		unsigned int HUC            : 1;	/* Hash Unicast */
		unsigned int HMC            : 1;	/* Hash Multicast */
		unsigned int DAIF           : 1;	/* DA Inverse Filtering */
		unsigned int PM             : 1;	/* Pass All Multicast */
		unsigned int DBF            : 1;	/* Disable Broadcast Frames */
		unsigned int PCF            : 2;	/* Pass Control Frames */
		unsigned int SAIF           : 1;	/* SA Inverse Filtering */
		unsigned int SAF            : 1;	/* Source Address Filter Enable */
		unsigned int HPF            : 1;	/* Hash or Perfect Filter */
		/* const */ unsigned int RESERVED_15_11 : 5;	/* RESERVED_15_11 */
		unsigned int VTFE           : 1;	/* VLAN Tag Filter Enable */
		/* const */ unsigned int RESERVED_19_17 : 3;	/* RESERVED_19_17 */
		/* const */ unsigned int IPFE           : 1;	/* Layer 3 and Layer 4 Filter Enable */
		/* const */ unsigned int DNTU           : 1;	/* Drop non-TCP/UDP over IP Frames */
		/* const */ unsigned int RESERVED_30_22 : 9;	/* RESERVED_30_22 */
		unsigned int RA             : 1;	/* Receive All */
	} B;
	int I;
	unsigned int U;

} ETH_MAC_FRAME_FILTER_type;
#define ETH_MAC_FRAME_FILTER	(*( ETH_MAC_FRAME_FILTER_type *) 0xf001e004u)	/* Register 1 - MAC Frame Filter */

