svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int MISFRMCNT      : 16;	/* MISFRMCNT */
		/* const */ unsigned int MISCNTOVF      : 1;	/* MISCNTOVF */
		/* const */ unsigned int OVFFRMCNT      : 11;	/* OVFFRMCNT */
		/* const */ unsigned int OVFCNTOVF      : 1;	/* OVFCNTOVF */
		/* const */ unsigned int RESERVED_31_29 : 3;	/* RESERVED_31_29 */
	} B;
	int I;
	unsigned int U;

} ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_type;
#define ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER	(*( ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_type *) 0xf001f020u)	/* Register 8 - Missed Frame and Buffer Overflow Counter Register */

typedef volatile union
{
	struct
	{ 
		unsigned int CNTRST         : 1;	/* Counters Reset */
		unsigned int CNTSTOPRO      : 1;	/* Counters Stop Rollover */
		unsigned int RSTONRD        : 1;	/* Reset on Read */
		unsigned int CNTFREEZ       : 1;	/* MMC Counter Freeze */
		unsigned int CNTPRST        : 1;	/* Counters Preset */
		unsigned int CNTPRSTLVL     : 1;	/* Full-Half Preset */
		/* const */ unsigned int RESERVED_7_6   : 2;	/* RESERVED_7_6 */
		unsigned int UCDBC          : 1;	/* Update MMC Counters for Dropped Broadcast Frames */
		/* const */ unsigned int RESERVED_31_9  : 23;	/* RESERVED_31_9 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_CONTROL_type;
#define ETH_MMC_CONTROL	(*( ETH_MMC_CONTROL_type *) 0xf001e100u)	/* Register 64 - MMC Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4GFIS     : 1;	/* MMC Receive IPV4 Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV4HERFIS   : 1;	/* MMC Receive IPV4 Header Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV4NOPAYFIS : 1;	/* MMC Receive IPV4 No Payload Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV4FRAGFIS  : 1;	/* MMC Receive IPV4 Fragmented Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV4UDSBLFIS : 1;	/* MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV6GFIS     : 1;	/* MMC Receive IPV6 Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV6HERFIS   : 1;	/* MMC Receive IPV6 Header Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXIPV6NOPAYFIS : 1;	/* MMC Receive IPV6 No Payload Frame Counter Interrupt Status */
		/* const */ unsigned int RXUDPGFIS      : 1;	/* MMC Receive UDP Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXUDPERFIS     : 1;	/* MMC Receive UDP Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXTCPGFIS      : 1;	/* MMC Receive TCP Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXTCPERFIS     : 1;	/* MMC Receive TCP Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXICMPGFIS     : 1;	/* MMC Receive ICMP Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXICMPERFIS    : 1;	/* MMC Receive ICMP Error Frame Counter Interrupt Status */
		/* const */ unsigned int RESERVED_15_14 : 2;	/* RESERVED_15_14 */
		/* const */ unsigned int RXIPV4GOIS     : 1;	/* MMC Receive IPV4 Good Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV4HEROIS   : 1;	/* MMC Receive IPV4 Header Error Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV4NOPAYOIS : 1;	/* MMC Receive IPV4 No Payload Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV4FRAGOIS  : 1;	/* MMC Receive IPV4 Fragmented Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV4UDSBLOIS : 1;	/* MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV6GOIS     : 1;	/* MMC Receive IPV6 Good Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV6HEROIS   : 1;	/* MMC Receive IPV6 Header Error Octet Counter Interrupt Status */
		/* const */ unsigned int RXIPV6NOPAYOIS : 1;	/* MMC Receive IPV6 No Payload Octet Counter Interrupt Status */
		/* const */ unsigned int RXUDPGOIS      : 1;	/* MMC Receive UDP Good Octet Counter Interrupt Status */
		/* const */ unsigned int RXUDPEROIS     : 1;	/* MMC Receive UDP Error Octet Counter Interrupt Status */
		/* const */ unsigned int RXTCPGOIS      : 1;	/* MMC Receive TCP Good Octet Counter Interrupt Status */
		/* const */ unsigned int RXTCPEROIS     : 1;	/* MMC Receive TCP Error Octet Counter Interrupt Status */
		/* const */ unsigned int RXICMPGOIS     : 1;	/* MMC Receive ICMP Good Octet Counter Interrupt Status */
		/* const */ unsigned int RXICMPEROIS    : 1;	/* MMC Receive ICMP Error Octet Counter Interrupt Status */
		/* const */ unsigned int RESERVED_31_30 : 2;	/* RESERVED_31_30 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_IPC_RECEIVE_INTERRUPT_type;
#define ETH_MMC_IPC_RECEIVE_INTERRUPT	(*( ETH_MMC_IPC_RECEIVE_INTERRUPT_type *) 0xf001e208u)	/* Register 130 - MMC Receive Checksum Offload Interrupt Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXIPV4GFIM     : 1;	/* MMC Receive IPV4 Good Frame Counter Interrupt Mask */
		unsigned int RXIPV4HERFIM   : 1;	/* MMC Receive IPV4 Header Error Frame Counter Interrupt Mask */
		unsigned int RXIPV4NOPAYFIM : 1;	/* MMC Receive IPV4 No Payload Frame Counter Interrupt Mask */
		unsigned int RXIPV4FRAGFIM  : 1;	/* MMC Receive IPV4 Fragmented Frame Counter Interrupt Mask */
		unsigned int RXIPV4UDSBLFIM : 1;	/* MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Mask */
		unsigned int RXIPV6GFIM     : 1;	/* MMC Receive IPV6 Good Frame Counter Interrupt Mask */
		unsigned int RXIPV6HERFIM   : 1;	/* MMC Receive IPV6 Header Error Frame Counter Interrupt Mask */
		unsigned int RXIPV6NOPAYFIM : 1;	/* MMC Receive IPV6 No Payload Frame Counter Interrupt Mask */
		unsigned int RXUDPGFIM      : 1;	/* MMC Receive UDP Good Frame Counter Interrupt Mask */
		unsigned int RXUDPERFIM     : 1;	/* MMC Receive UDP Error Frame Counter Interrupt Mask */
		unsigned int RXTCPGFIM      : 1;	/* MMC Receive TCP Good Frame Counter Interrupt Mask */
		unsigned int RXTCPERFIM     : 1;	/* MMC Receive TCP Error Frame Counter Interrupt Mask */
		unsigned int RXICMPGFIM     : 1;	/* MMC Receive ICMP Good Frame Counter Interrupt Mask */
		unsigned int RXICMPERFIM    : 1;	/* MMC Receive ICMP Error Frame Counter Interrupt Mask */
		/* const */ unsigned int RESERVED_15_14 : 2;	/* RESERVED_15_14 */
		unsigned int RXIPV4GOIM     : 1;	/* MMC Receive IPV4 Good Octet Counter Interrupt Mask */
		unsigned int RXIPV4HEROIM   : 1;	/* MMC Receive IPV4 Header Error Octet Counter Interrupt Mask */
		unsigned int RXIPV4NOPAYOIM : 1;	/* MMC Receive IPV4 No Payload Octet Counter Interrupt Mask */
		unsigned int RXIPV4FRAGOIM  : 1;	/* MMC Receive IPV4 Fragmented Octet Counter Interrupt Mask */
		unsigned int RXIPV4UDSBLOIM : 1;	/* MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Mask */
		unsigned int RXIPV6GOIM     : 1;	/* MMC Receive IPV6 Good Octet Counter Interrupt Mask */
		unsigned int RXIPV6HEROIM   : 1;	/* MMC Receive IPV6 Header Error Octet Counter Interrupt Mask */
		unsigned int RXIPV6NOPAYOIM : 1;	/* MMC Receive IPV6 No Payload Octet Counter Interrupt Mask */
		unsigned int RXUDPGOIM      : 1;	/* MMC Receive UDP Good Octet Counter Interrupt Mask */
		unsigned int RXUDPEROIM     : 1;	/* MMC Receive UDP Error Octet Counter Interrupt Mask */
		unsigned int RXTCPGOIM      : 1;	/* MMC Receive TCP Good Octet Counter Interrupt Mask */
		unsigned int RXTCPEROIM     : 1;	/* MMC Receive TCP Error Octet Counter Interrupt Mask */
		unsigned int RXICMPGOIM     : 1;	/* MMC Receive ICMP Good Octet Counter Interrupt Mask */
		unsigned int RXICMPEROIM    : 1;	/* MMC Receive ICMP Error Octet Counter Interrupt Mask */
		/* const */ unsigned int RESERVED_31_30 : 2;	/* RESERVED_31_30 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_type;
#define ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK	(*( ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_type *) 0xf001e200u)	/* Register 128 - MMC Receive Checksum Offload Interrupt Mask Register */

