svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXGBFRMIS      : 1;	/* MMC Receive Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RXGBOCTIS      : 1;	/* MMC Receive Good Bad Octet Counter Interrupt Status */
		/* const */ unsigned int RXGOCTIS       : 1;	/* MMC Receive Good Octet Counter Interrupt Status. */
		/* const */ unsigned int RXBCGFIS       : 1;	/* MMC Receive Broadcast Good Frame Counter Interrupt Status. */
		/* const */ unsigned int RXMCGFIS       : 1;	/* MMC Receive Multicast Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXCRCERFIS     : 1;	/* MMC Receive CRC Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXALGNERFIS    : 1;	/* MMC Receive Alignment Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXRUNTFIS      : 1;	/* MMC Receive Runt Frame Counter Interrupt Status */
		/* const */ unsigned int RXJABERFIS     : 1;	/* MMC Receive Jabber Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXUSIZEGFIS    : 1;	/* MMC Receive Undersize Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXOSIZEGFIS    : 1;	/* MMC Receive Oversize Good Frame Counter Interrupt Status */
		/* const */ unsigned int RX64OCTGBFIS   : 1;	/* MMC Receive 64 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RX65T127OCTGBFIS: 1;	/* MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RX128T255OCTGBFIS: 1;	/* MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RX256T511OCTGBFIS: 1;	/* MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RX512T1023OCTGBFIS: 1;	/* MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RX1024TMAXOCTGBFIS: 1;	/* MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RXUCGFIS       : 1;	/* MMC Receive Unicast Good Frame Counter Interrupt Status */
		/* const */ unsigned int RXLENERFIS     : 1;	/* MMC Receive Length Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXORANGEFIS    : 1;	/* MMC Receive Out Of Range Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXPAUSFIS      : 1;	/* MMC Receive Pause Frame Counter Interrupt Status */
		/* const */ unsigned int RXFOVFIS       : 1;	/* MMC Receive FIFO Overflow Frame Counter Interrupt Status */
		/* const */ unsigned int RXVLANGBFIS    : 1;	/* MMC Receive VLAN Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int RXWDOGFIS      : 1;	/* MMC Receive Watchdog Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXRCVERRFIS    : 1;	/* MMC Receive Error Frame Counter Interrupt Status */
		/* const */ unsigned int RXCTRLFIS      : 1;	/* MMC Receive Control Frame Counter Interrupt Status */
		/* const */ unsigned int RESERVED_31_26 : 6;	/* RESERVED_31_26 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_RECEIVE_INTERRUPT_type;
#define ETH_MMC_RECEIVE_INTERRUPT	(*( ETH_MMC_RECEIVE_INTERRUPT_type *) 0xf001e104u)	/* Register 65 - MMC Receive Interrupt Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RXGBFRMIM      : 1;	/* MMC Receive Good Bad Frame Counter Interrupt Mask */
		unsigned int RXGBOCTIM      : 1;	/* MMC Receive Good Bad Octet Counter Interrupt Mask */
		unsigned int RXGOCTIM       : 1;	/* MMC Receive Good Octet Counter Interrupt Mask */
		unsigned int RXBCGFIM       : 1;	/* MMC Receive Broadcast Good Frame Counter Interrupt Mask */
		unsigned int RXMCGFIM       : 1;	/* MMC Receive Multicast Good Frame Counter Interrupt Mask */
		unsigned int RXCRCERFIM     : 1;	/* MMC Receive CRC Error Frame Counter Interrupt Mask */
		unsigned int RXALGNERFIM    : 1;	/* MMC Receive Alignment Error Frame Counter Interrupt Mask */
		unsigned int RXRUNTFIM      : 1;	/* MMC Receive Runt Frame Counter Interrupt Mask */
		unsigned int RXJABERFIM     : 1;	/* MMC Receive Jabber Error Frame Counter Interrupt Mask */
		unsigned int RXUSIZEGFIM    : 1;	/* MMC Receive Undersize Good Frame Counter Interrupt Mask */
		unsigned int RXOSIZEGFIM    : 1;	/* MMC Receive Oversize Good Frame Counter Interrupt Mask */
		unsigned int RX64OCTGBFIM   : 1;	/* MMC Receive 64 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int RX65T127OCTGBFIM: 1;	/* MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int RX128T255OCTGBFIM: 1;	/* MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int RX256T511OCTGBFIM: 1;	/* MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int RX512T1023OCTGBFIM: 1;	/* MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int RX1024TMAXOCTGBFIM: 1;	/* MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int RXUCGFIM       : 1;	/* MMC Receive Unicast Good Frame Counter Interrupt Mask */
		unsigned int RXLENERFIM     : 1;	/* MMC Receive Length Error Frame Counter Interrupt Mask */
		unsigned int RXORANGEFIM    : 1;	/* MMC Receive Out Of Range Error Frame Counter Interrupt Mask */
		unsigned int RXPAUSFIM      : 1;	/* MMC Receive Pause Frame Counter Interrupt Mask */
		unsigned int RXFOVFIM       : 1;	/* MMC Receive FIFO Overflow Frame Counter Interrupt Mask */
		unsigned int RXVLANGBFIM    : 1;	/* MMC Receive VLAN Good Bad Frame Counter Interrupt Mask */
		unsigned int RXWDOGFIM      : 1;	/* MMC Receive Watchdog Error Frame Counter Interrupt Mask */
		unsigned int RXRCVERRFIM    : 1;	/* MMC Receive Error Frame Counter Interrupt Mask */
		unsigned int RXCTRLFIM      : 1;	/* MMC Receive Control Frame Counter Interrupt Mask */
		/* const */ unsigned int RESERVED_31_26 : 6;	/* RESERVED_31_26 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_RECEIVE_INTERRUPT_MASK_type;
#define ETH_MMC_RECEIVE_INTERRUPT_MASK	(*( ETH_MMC_RECEIVE_INTERRUPT_MASK_type *) 0xf001e10cu)	/* - */

