svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXGBOCTIS      : 1;	/* MMC Transmit Good Bad Octet Counter Interrupt Status */
		/* const */ unsigned int TXGBFRMIS      : 1;	/* MMC Transmit Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TXBCGFIS       : 1;	/* MMC Transmit Broadcast Good Frame Counter Interrupt Status */
		/* const */ unsigned int TXMCGFIS       : 1;	/* MMC Transmit Multicast Good Frame Counter Interrupt Status */
		/* const */ unsigned int TX64OCTGBFIS   : 1;	/* MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Status. */
		/* const */ unsigned int TX65T127OCTGBFIS: 1;	/* MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TX128T255OCTGBFIS: 1;	/* MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TX256T511OCTGBFIS: 1;	/* MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TX512T1023OCTGBFIS: 1;	/* MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TX1024TMAXOCTGBFIS: 1;	/* MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TXUCGBFIS      : 1;	/* MMC Transmit Unicast Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TXMCGBFIS      : 1;	/* MMC Transmit Multicast Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TXBCGBFIS      : 1;	/* MMC Transmit Broadcast Good Bad Frame Counter Interrupt Status */
		/* const */ unsigned int TXUFLOWERFIS   : 1;	/* MMC Transmit Underflow Error Frame Counter Interrupt Status */
		/* const */ unsigned int TXSCOLGFIS     : 1;	/* MMC Transmit Single Collision Good Frame Counter Interrupt Status */
		/* const */ unsigned int TXMCOLGFIS     : 1;	/* MMC Transmit Multiple Collision Good Frame Counter Interrupt Status */
		/* const */ unsigned int TXDEFFIS       : 1;	/* MMC Transmit Deferred Frame Counter Interrupt Status */
		/* const */ unsigned int TXLATCOLFIS    : 1;	/* MMC Transmit Late Collision Frame Counter Interrupt Status */
		/* const */ unsigned int TXEXCOLFIS     : 1;	/* MMC Transmit Excessive Collision Frame Counter Interrupt Status */
		/* const */ unsigned int TXCARERFIS     : 1;	/* MMC Transmit Carrier Error Frame Counter Interrupt Status */
		/* const */ unsigned int TXGOCTIS       : 1;	/* MMC Transmit Good Octet Counter Interrupt Status */
		/* const */ unsigned int TXGFRMIS       : 1;	/* MMC Transmit Good Frame Counter Interrupt Status */
		/* const */ unsigned int TXEXDEFFIS     : 1;	/* MMC Transmit Excessive Deferral Frame Counter Interrupt Status */
		/* const */ unsigned int TXPAUSFIS      : 1;	/* MMC Transmit Pause Frame Counter Interrupt Status */
		/* const */ unsigned int TXVLANGFIS     : 1;	/* MMC Transmit VLAN Good Frame Counter Interrupt Status */
		/* const */ unsigned int TXOSIZEGFIS    : 1;	/* MMC Transmit Oversize Good Frame Counter Interrupt Status */
		/* const */ unsigned int RESERVED_31_26 : 6;	/* RESERVED_31_26 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_TRANSMIT_INTERRUPT_type;
#define ETH_MMC_TRANSMIT_INTERRUPT	(*( ETH_MMC_TRANSMIT_INTERRUPT_type *) 0xf001e108u)	/* Register 66 - MMC Transmit Interrupt Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TXGBOCTIM      : 1;	/* MMC Transmit Good Bad Octet Counter Interrupt Mask */
		unsigned int TXGBFRMIM      : 1;	/* MMC Transmit Good Bad Frame Counter Interrupt Mask */
		unsigned int TXBCGFIM       : 1;	/* MMC Transmit Broadcast Good Frame Counter Interrupt Mask */
		unsigned int TXMCGFIM       : 1;	/* MMC Transmit Multicast Good Frame Counter Interrupt Mask */
		unsigned int TX64OCTGBFIM   : 1;	/* MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int TX65T127OCTGBFIM: 1;	/* MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int TX128T255OCTGBFIM: 1;	/* MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int TX256T511OCTGBFIM: 1;	/* MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int TX512T1023OCTGBFIM: 1;	/* MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int TX1024TMAXOCTGBFIM: 1;	/* MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask */
		unsigned int TXUCGBFIM      : 1;	/* MMC Transmit Unicast Good Bad Frame Counter Interrupt Mask */
		unsigned int TXMCGBFIM      : 1;	/* MMC Transmit Multicast Good Bad Frame Counter Interrupt Mask */
		unsigned int TXBCGBFIM      : 1;	/* MMC Transmit Broadcast Good Bad Frame Counter Interrupt Mask */
		unsigned int TXUFLOWERFIM   : 1;	/* MMC Transmit Underflow Error Frame Counter Interrupt Mask */
		unsigned int TXSCOLGFIM     : 1;	/* MMC Transmit Single Collision Good Frame Counter Interrupt Mask */
		unsigned int TXMCOLGFIM     : 1;	/* MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask */
		unsigned int TXDEFFIM       : 1;	/* MMC Transmit Deferred Frame Counter Interrupt Mask */
		unsigned int TXLATCOLFIM    : 1;	/* MMC Transmit Late Collision Frame Counter Interrupt Mask */
		unsigned int TXEXCOLFIM     : 1;	/* MMC Transmit Excessive Collision Frame Counter Interrupt Mask */
		unsigned int TXCARERFIM     : 1;	/* MMC Transmit Carrier Error Frame Counter Interrupt Mask */
		unsigned int TXGOCTIM       : 1;	/* MMC Transmit Good Octet Counter Interrupt Mask */
		unsigned int TXGFRMIM       : 1;	/* MMC Transmit Good Frame Counter Interrupt Mask */
		unsigned int TXEXDEFFIM     : 1;	/* MMC Transmit Excessive Deferral Frame Counter Interrupt Mask */
		unsigned int TXPAUSFIM      : 1;	/* MMC Transmit Pause Frame Counter Interrupt Mask */
		unsigned int TXVLANGFIM     : 1;	/* MMC Transmit VLAN Good Frame Counter Interrupt Mask */
		unsigned int TXOSIZEGFIM    : 1;	/* MMC Transmit Oversize Good Frame Counter Interrupt Mask */
		/* const */ unsigned int RESERVED_31_26 : 6;	/* RESERVED_31_26 */
	} B;
	int I;
	unsigned int U;

} ETH_MMC_TRANSMIT_INTERRUPT_MASK_type;
#define ETH_MMC_TRANSMIT_INTERRUPT_MASK	(*( ETH_MMC_TRANSMIT_INTERRUPT_MASK_type *) 0xf001e110u)	/* Register 68 - MMC Transmit Interrupt Mask Register */

