svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESERVED_0     : 1;	/* RESERVED_0 */
		unsigned int SR             : 1;	/* Start or Stop Receive */
		unsigned int OSF            : 1;	/* Operate on Second Frame */
		unsigned int RTC            : 2;	/* Receive Threshold Control */
		/* const */ unsigned int RESERVED_5     : 1;	/* RESERVED_5 */
		unsigned int FUF            : 1;	/* Forward Undersized Good Frames */
		unsigned int FEF            : 1;	/* Forward Error Frames */
		unsigned int EFC            : 1;	/* Enable HW Flow Control */
		unsigned int RFA            : 2;	/* Threshold for Activating Flow Control (in half-duplex and full-duplex) */
		unsigned int RFD            : 2;	/* Threshold for Deactivating Flow Control (in half-duplex and full-duplex) */
		unsigned int ST             : 1;	/* Start or Stop Transmission Command */
		unsigned int TTC            : 3;	/* Transmit Threshold Control */
		/* const */ unsigned int RESERVED_19_17 : 3;	/* RESERVED_19_17 */
		unsigned int FTF            : 1;	/* Flush Transmit FIFO */
		unsigned int TSF            : 1;	/* Transmit Store and Forward */
		/* const */ unsigned int RFD2           : 1;	/* MSB of Threshold for Deactivating Flow Control */
		/* const */ unsigned int RFA2           : 1;	/* MSB of Threshold for Activating Flow Control */
		unsigned int DFF            : 1;	/* Disable Flushing of Received Frames */
		unsigned int RSF            : 1;	/* Receive Store and Forward */
		unsigned int DT             : 1;	/* Disable Dropping of TCP/IP Checksum Error Frames */
		/* const */ unsigned int RESERVED_31_27 : 5;	/* RESERVED_31_27 */
	} B;
	int I;
	unsigned int U;

} ETH_OPERATION_MODE_type;
#define ETH_OPERATION_MODE	(*( ETH_OPERATION_MODE_type *) 0xf001f018u)	/* Register 6 - Operation Mode Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PWRDWN         : 1;	/* Power Down */
		unsigned int MGKPKTEN       : 1;	/* Magic Packet Enable */
		unsigned int RWKPKTEN       : 1;	/* Wake-Up Frame Enable */
		/* const */ unsigned int RESERVED_4_3   : 2;	/* RESERVED_4_3 */
		/* const */ unsigned int MGKPRCVD       : 1;	/* Magic Packet Received */
		/* const */ unsigned int RWKPRCVD       : 1;	/* Wake-Up Frame Received */
		/* const */ unsigned int RESERVED_8_7   : 2;	/* RESERVED_8_7 */
		unsigned int GLBLUCAST      : 1;	/* Global Unicast */
		/* const */ unsigned int RESERVED_30_10 : 21;	/* RESERVED_30_10 */
		unsigned int RWKFILTRST     : 1;	/* Wake-Up Frame Filter Register Pointer Reset */
	} B;
	int I;
	unsigned int U;

} ETH_PMT_CONTROL_STATUS_type;
#define ETH_PMT_CONTROL_STATUS	(*( ETH_PMT_CONTROL_STATUS_type *) 0xf001e02cu)	/* Register 11 - PMT Control and Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int PPSCTRL_PPSCMD : 4;	/* PPSCTRL0 or PPSCMD0 */
		/* const */ unsigned int PPSEN0         : 1;	/* Flexible PPS Output Mode Enable */
		/* const */ unsigned int TRGTMODSEL0    : 2;	/* Target Time Register Mode for PPS0 Output */
		/* const */ unsigned int RESERVED_7     : 1;	/* RESERVED_7 */
		/* const */ unsigned int PPSCMD1        : 3;	/* Flexible PPS1 Output Control */
		/* const */ unsigned int RESERVED_12_11 : 2;	/* RESERVED_12_11 */
		/* const */ unsigned int TRGTMODSEL1    : 2;	/* Target Time Register Mode for PPS1 Output */
		/* const */ unsigned int RESERVED_15    : 1;	/* RESERVED_15 */
		/* const */ unsigned int PPSCMD2        : 3;	/* Flexible PPS2 Output Control */
		/* const */ unsigned int RESERVED_20_19 : 2;	/* RESERVED_20_19 */
		/* const */ unsigned int TRGTMODSEL2    : 2;	/* Target Time Register Mode for PPS2 Output */
		/* const */ unsigned int RESERVED_23    : 1;	/* RESERVED_23 */
		/* const */ unsigned int PPSCMD3        : 3;	/* Flexible PPS3 Output Control */
		/* const */ unsigned int RESERVED_28_27 : 2;	/* RESERVED_28_27 */
		/* const */ unsigned int TRGTMODSEL3    : 2;	/* Target Time Register Mode for PPS3 Output */
		/* const */ unsigned int RESERVED_31    : 1;	/* RESERVED_31 */
	} B;
	int I;
	unsigned int U;

} ETH_PPS_CONTROL_type;
#define ETH_PPS_CONTROL	(*( ETH_PPS_CONTROL_type *) 0xf001e72cu)	/* Register 459 - PPS Control Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESERVED_1_0   : 2;	/* RESERVED_1_0 */
		unsigned int RDESLA_32bit   : 30;	/* Start of Receive List */
	} B;
	int I;
	unsigned int U;

} ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_type;
#define ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS	(*( ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_type *) 0xf001f00cu)	/* Register 3 - Receive Descriptor List Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RIWT           : 8;	/* RI Watchdog Timer Count */
		/* const */ unsigned int RESERVED_31_8  : 24;	/* RESERVED_31_8 */
	} B;
	int I;
	unsigned int U;

} ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_type;
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER	(*( ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_type *) 0xf001f024u)	/* Register 9 - Receive Interrupt Watchdog Timer Register */

typedef volatile union
{
	struct
	{ 
		unsigned int RPD            : 32;	/* Receive Poll Demand */
	} B;
	int I;
	unsigned int U;

} ETH_RECEIVE_POLL_DEMAND_type;
#define ETH_RECEIVE_POLL_DEMAND	(*( ETH_RECEIVE_POLL_DEMAND_type *) 0xf001f008u)	/* Register 2 - Receive Poll Demand Register */

typedef volatile union
{
	struct
	{ 
		unsigned int WKUPFRMFTR     : 32;	/* WKUPFRMFTR */
	} B;
	int I;
	unsigned int U;

} ETH_REMOTE_WAKE_UP_FRAME_FILTER_type;
#define ETH_REMOTE_WAKE_UP_FRAME_FILTER	(*( ETH_REMOTE_WAKE_UP_FRAME_FILTER_type *) 0xf001e028u)	/* Register 10 - Remote Wake-Up Frame Filter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXICMPERRFRM   : 32;	/* RXICMPERRFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXICMP_ERROR_FRAMES_type;
#define ETH_RXICMP_ERROR_FRAMES	(*( ETH_RXICMP_ERROR_FRAMES_type *) 0xf001e244u)	/* Register 145 - Receive ICMP Error Frame Counter Register */

