svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXICMPERROCT   : 32;	/* RXICMPERROCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXICMP_ERROR_OCTETS_type;
#define ETH_RXICMP_ERROR_OCTETS	(*( ETH_RXICMP_ERROR_OCTETS_type *) 0xf001e284u)	/* Register 161 - Receive ICMP Error Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXICMPGDFRM    : 32;	/* RXICMPGDFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXICMP_GOOD_FRAMES_type;
#define ETH_RXICMP_GOOD_FRAMES	(*( ETH_RXICMP_GOOD_FRAMES_type *) 0xf001e240u)	/* Register 144 - Receive ICMP Good Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXICMPGDOCT    : 32;	/* RXICMPGDOCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXICMP_GOOD_OCTETS_type;
#define ETH_RXICMP_GOOD_OCTETS	(*( ETH_RXICMP_GOOD_OCTETS_type *) 0xf001e280u)	/* Register 160 - Receive ICMP Good Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4FRAGFRM  : 32;	/* RXIPV4FRAGFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_FRAGMENTED_FRAMES_type;
#define ETH_RXIPV4_FRAGMENTED_FRAMES	(*( ETH_RXIPV4_FRAGMENTED_FRAMES_type *) 0xf001e21cu)	/* Register 135 - Receive IPV4 Fragmented Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4FRAGOCT  : 32;	/* This field indicates the number of bytes received in fragmented IPv4 datagrams. The value in the IPv4 headers Length field is used to update this counter. */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_FRAGMENTED_OCTETS_type;
#define ETH_RXIPV4_FRAGMENTED_OCTETS	(*( ETH_RXIPV4_FRAGMENTED_OCTETS_type *) 0xf001e25cu)	/* Register 151 - Receive IPV4 Fragmented Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4GDFRM    : 32;	/* RXIPV4GDFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_GOOD_FRAMES_type;
#define ETH_RXIPV4_GOOD_FRAMES	(*( ETH_RXIPV4_GOOD_FRAMES_type *) 0xf001e210u)	/* Register 132 - Receive IPV4 Good Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4GDOCT    : 32;	/* This field indicates the number of bytes received in good IPv4 datagrams encapsulating TCP, UDP, or ICMP data. The Ethernet header, FCS, pad, or IP pad */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_GOOD_OCTETS_type;
#define ETH_RXIPV4_GOOD_OCTETS	(*( ETH_RXIPV4_GOOD_OCTETS_type *) 0xf001e250u)	/* Register 148 - Receive IPV4 Good Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4HDRERRFRM: 32;	/* RXIPV4HDRERRFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_HEADER_ERROR_FRAMES_type;
#define ETH_RXIPV4_HEADER_ERROR_FRAMES	(*( ETH_RXIPV4_HEADER_ERROR_FRAMES_type *) 0xf001e214u)	/* Register 133 - Receive IPV4 Header Error Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4HDRERROCT: 32;	/* This field indicates the number of bytes received in the IPv4 datagrams with header errors (checksum, length, or version mismatch). The value in the Length field of IPv4 header is used to update this counter. */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_HEADER_ERROR_OCTETS_type;
#define ETH_RXIPV4_HEADER_ERROR_OCTETS	(*( ETH_RXIPV4_HEADER_ERROR_OCTETS_type *) 0xf001e254u)	/* Register 149 - Receive IPV4 Header Error Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4NOPAYFRM : 32;	/* RXIPV4NOPAYFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_NO_PAYLOAD_FRAMES_type;
#define ETH_RXIPV4_NO_PAYLOAD_FRAMES	(*( ETH_RXIPV4_NO_PAYLOAD_FRAMES_type *) 0xf001e218u)	/* Register 134 - Receive IPV4 No Payload Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4NOPAYOCT : 32;	/* This field indicates the number of bytes received in IPv4 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv4 headers Length field is used to update this counter. */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_NO_PAYLOAD_OCTETS_type;
#define ETH_RXIPV4_NO_PAYLOAD_OCTETS	(*( ETH_RXIPV4_NO_PAYLOAD_OCTETS_type *) 0xf001e258u)	/* Register 150 - Receive IPV4 No Payload Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4UDSBLFRM : 32;	/* RXIPV4UDSBLFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_type;
#define ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES	(*( ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_type *) 0xf001e220u)	/* Register 136 - Receive IPV4 UDP Checksum Disabled Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV4UDSBLOCT : 32;	/* RXIPV4UDSBLOCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_type;
#define ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS	(*( ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_type *) 0xf001e260u)	/* Register 152 - Receive IPV4 Fragmented Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV6GDFRM    : 32;	/* RXIPV6GDFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV6_GOOD_FRAMES_type;
#define ETH_RXIPV6_GOOD_FRAMES	(*( ETH_RXIPV6_GOOD_FRAMES_type *) 0xf001e224u)	/* Register 137 - Receive IPV6 Good Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV6GDOCT    : 32;	/* Thsi field indicates the number of bytes received in good IPv6 datagrams encapsulating TCP, UDP or ICMPv6 data. */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV6_GOOD_OCTETS_type;
#define ETH_RXIPV6_GOOD_OCTETS	(*( ETH_RXIPV6_GOOD_OCTETS_type *) 0xf001e264u)	/* Register 153 - Receive IPV6 Good Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV6HDRERRFRM: 32;	/* RXIPV6HDRERRFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV6_HEADER_ERROR_FRAMES_type;
#define ETH_RXIPV6_HEADER_ERROR_FRAMES	(*( ETH_RXIPV6_HEADER_ERROR_FRAMES_type *) 0xf001e228u)	/* Register 138 - Receive IPV6 Header Error Frame Counter Register */

