svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV6HDRERROCT: 32;	/* This field indicates the number of bytes received in IPv6 datagrams with header errors (length or version mismatch). The value in the IPv6 headers Length field is used to update this counter. */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV6_HEADER_ERROR_OCTETS_type;
#define ETH_RXIPV6_HEADER_ERROR_OCTETS	(*( ETH_RXIPV6_HEADER_ERROR_OCTETS_type *) 0xf001e268u)	/* Register 154 - Receive IPV6 Header Error Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV6NOPAYFRM : 32;	/* RXIPV6NOPAYFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV6_NO_PAYLOAD_FRAMES_type;
#define ETH_RXIPV6_NO_PAYLOAD_FRAMES	(*( ETH_RXIPV6_NO_PAYLOAD_FRAMES_type *) 0xf001e22cu)	/* Register 139 - Receive IPV6 No Payload Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXIPV6NOPAYOCT : 32;	/* This field indicates the number of bytes received in IPv6 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv6 headers Length field is used to update this counter. */
	} B;
	int I;
	unsigned int U;

} ETH_RXIPV6_NO_PAYLOAD_OCTETS_type;
#define ETH_RXIPV6_NO_PAYLOAD_OCTETS	(*( ETH_RXIPV6_NO_PAYLOAD_OCTETS_type *) 0xf001e26cu)	/* Register 155 - Receive IPV6 No Payload Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXTCPERRFRM    : 32;	/* RXTCPERRFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXTCP_ERROR_FRAMES_type;
#define ETH_RXTCP_ERROR_FRAMES	(*( ETH_RXTCP_ERROR_FRAMES_type *) 0xf001e23cu)	/* Register 143 - Receive TCP Error Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXTCPERROCT    : 32;	/* RXTCPERROCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXTCP_ERROR_OCTETS_type;
#define ETH_RXTCP_ERROR_OCTETS	(*( ETH_RXTCP_ERROR_OCTETS_type *) 0xf001e27cu)	/* Register 159 - Receive TCP Error Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXTCPGDFRM     : 32;	/* RXTCPGDFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXTCP_GOOD_FRAMES_type;
#define ETH_RXTCP_GOOD_FRAMES	(*( ETH_RXTCP_GOOD_FRAMES_type *) 0xf001e238u)	/* Register 142 - Receive TCP Good Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXTCPGDOCT     : 32;	/* RXTCPGDOCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXTCP_GOOD_OCTETS_type;
#define ETH_RXTCP_GOOD_OCTETS	(*( ETH_RXTCP_GOOD_OCTETS_type *) 0xf001e278u)	/* Register 158 - Receive TCP Good Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXUDPERRFRM    : 32;	/* RXUDPERRFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXUDP_ERROR_FRAMES_type;
#define ETH_RXUDP_ERROR_FRAMES	(*( ETH_RXUDP_ERROR_FRAMES_type *) 0xf001e234u)	/* Register 141 - Receive UDP Error Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXUDPERROCT    : 32;	/* RXUDPERROCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXUDP_ERROR_OCTETS_type;
#define ETH_RXUDP_ERROR_OCTETS	(*( ETH_RXUDP_ERROR_OCTETS_type *) 0xf001e274u)	/* Register 157 - Receive UDP Error Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXUDPGDFRM     : 32;	/* RXUDPGDFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RXUDP_GOOD_FRAMES_type;
#define ETH_RXUDP_GOOD_FRAMES	(*( ETH_RXUDP_GOOD_FRAMES_type *) 0xf001e230u)	/* Register 140 - Receive UDP Good Frame Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXUDPGDOCT     : 32;	/* RXUDPGDOCT */
	} B;
	int I;
	unsigned int U;

} ETH_RXUDP_GOOD_OCTETS_type;
#define ETH_RXUDP_GOOD_OCTETS	(*( ETH_RXUDP_GOOD_OCTETS_type *) 0xf001e270u)	/* Register 156 - Receive UDP Good Octet Counter Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX1024_MAXOCTGB: 32;	/* RX1024_MAXOCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_type;
#define ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD	(*( ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_type *) 0xf001e1c0u)	/* Register 112 - Receive Frame Count for Good and Bad 1,024 to Maxsize Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX128_255OCTGB : 32;	/* RX128_255OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD	(*( ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e1b4u)	/* Register 109 - Receive Frame Count for Good and Bad 128 to 255 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX256_511OCTGB : 32;	/* RX256_511OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD	(*( ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e1b8u)	/* Register 110 - Receive Frame Count for Good and Bad 256 to 511 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX512_1023OCTGB: 32;	/* RX512_1023OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD	(*( ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e1bcu)	/* Register 111 - Receive Frame Count for Good and Bad 512 to 1,023 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX64OCTGB      : 32;	/* RX64OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_64OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_RX_64OCTETS_FRAMES_GOOD_BAD	(*( ETH_RX_64OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e1acu)	/* Register 107 - Receive Frame Count for Good and Bad 64 Byte Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RX65_127OCTGB  : 32;	/* RX65_127OCTGB */
	} B;
	int I;
	unsigned int U;

