svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
} ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD	(*( ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e1b0u)	/* Register 108 - Receive Frame Count for Good and Bad 65 to 127 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXALGNERR      : 32;	/* RXALGNERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_ALIGNMENT_ERROR_FRAMES_type;
#define ETH_RX_ALIGNMENT_ERROR_FRAMES	(*( ETH_RX_ALIGNMENT_ERROR_FRAMES_type *) 0xf001e198u)	/* Register 102 - Receive Frame Count for Alignment Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXBCASTG       : 32;	/* RXBCASTG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_BROADCAST_FRAMES_GOOD_type;
#define ETH_RX_BROADCAST_FRAMES_GOOD	(*( ETH_RX_BROADCAST_FRAMES_GOOD_type *) 0xf001e18cu)	/* Register 99 - Receive Frame Count for Good Broadcast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXCTRLG        : 32;	/* RXCTRLG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_CONTROL_FRAMES_GOOD_type;
#define ETH_RX_CONTROL_FRAMES_GOOD	(*( ETH_RX_CONTROL_FRAMES_GOOD_type *) 0xf001e1e4u)	/* Register 121 - Receive Frame Count for Good Control Frames Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXCRCERR       : 32;	/* RXCRCERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_CRC_ERROR_FRAMES_type;
#define ETH_RX_CRC_ERROR_FRAMES	(*( ETH_RX_CRC_ERROR_FRAMES_type *) 0xf001e194u)	/* Register 101 - Receive Frame Count for CRC Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXFIFOOVFL     : 32;	/* RXFIFOOVFL */
	} B;
	int I;
	unsigned int U;

} ETH_RX_FIFO_OVERFLOW_FRAMES_type;
#define ETH_RX_FIFO_OVERFLOW_FRAMES	(*( ETH_RX_FIFO_OVERFLOW_FRAMES_type *) 0xf001e1d4u)	/* Register 117 - Receive Frame Count for FIFO Overflow Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXFRMGB        : 32;	/* RXFRMGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_FRAMES_COUNT_GOOD_BAD_type;
#define ETH_RX_FRAMES_COUNT_GOOD_BAD	(*( ETH_RX_FRAMES_COUNT_GOOD_BAD_type *) 0xf001e180u)	/* Register 96 - Receive Frame Count for Good and Bad Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXJABERR       : 32;	/* RXJABERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_JABBER_ERROR_FRAMES_type;
#define ETH_RX_JABBER_ERROR_FRAMES	(*( ETH_RX_JABBER_ERROR_FRAMES_type *) 0xf001e1a0u)	/* Register 104 - Receive Frame Count for Jabber Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXLENERR       : 32;	/* RXLENERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_LENGTH_ERROR_FRAMES_type;
#define ETH_RX_LENGTH_ERROR_FRAMES	(*( ETH_RX_LENGTH_ERROR_FRAMES_type *) 0xf001e1c8u)	/* Register 114 - Receive Frame Count for Length Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXMCASTG       : 32;	/* RXMCASTG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_MULTICAST_FRAMES_GOOD_type;
#define ETH_RX_MULTICAST_FRAMES_GOOD	(*( ETH_RX_MULTICAST_FRAMES_GOOD_type *) 0xf001e190u)	/* Register 100 - Receive Frame Count for Good Multicast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXOCTG         : 32;	/* RXOCTG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_OCTET_COUNT_GOOD_type;
#define ETH_RX_OCTET_COUNT_GOOD	(*( ETH_RX_OCTET_COUNT_GOOD_type *) 0xf001e188u)	/* Register 98 - Receive Octet Count for Good Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXOCTGB        : 32;	/* RXOCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_OCTET_COUNT_GOOD_BAD_type;
#define ETH_RX_OCTET_COUNT_GOOD_BAD	(*( ETH_RX_OCTET_COUNT_GOOD_BAD_type *) 0xf001e184u)	/* Register 97 - Receive Octet Count for Good and Bad Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXOUTOFRNG     : 32;	/* RXOUTOFRNG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_type;
#define ETH_RX_OUT_OF_RANGE_TYPE_FRAMES	(*( ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_type *) 0xf001e1ccu)	/* Register 115 - Receive Frame Count for Out of Range Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXOVERSZG      : 32;	/* RXOVERSZG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_OVERSIZE_FRAMES_GOOD_type;
#define ETH_RX_OVERSIZE_FRAMES_GOOD	(*( ETH_RX_OVERSIZE_FRAMES_GOOD_type *) 0xf001e1a8u)	/* Register 106 - Receive Frame Count for Oversize Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXPAUSEFRM     : 32;	/* RXPAUSEFRM */
	} B;
	int I;
	unsigned int U;

} ETH_RX_PAUSE_FRAMES_type;
#define ETH_RX_PAUSE_FRAMES	(*( ETH_RX_PAUSE_FRAMES_type *) 0xf001e1d0u)	/* Register 116 - Receive Frame Count for PAUSE Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXRCVERR       : 32;	/* RXRCVERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_RECEIVE_ERROR_FRAMES_type;
#define ETH_RX_RECEIVE_ERROR_FRAMES	(*( ETH_RX_RECEIVE_ERROR_FRAMES_type *) 0xf001e1e0u)	/* Register 120 - Receive Frame Count for Receive Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXRUNTERR      : 32;	/* RXRUNTERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_RUNT_ERROR_FRAMES_type;
#define ETH_RX_RUNT_ERROR_FRAMES	(*( ETH_RX_RUNT_ERROR_FRAMES_type *) 0xf001e19cu)	/* Register 103 - Receive Frame Count for Runt Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXUNDERSZG     : 32;	/* RXUNDERSZG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_UNDERSIZE_FRAMES_GOOD_type;
#define ETH_RX_UNDERSIZE_FRAMES_GOOD	(*( ETH_RX_UNDERSIZE_FRAMES_GOOD_type *) 0xf001e1a4u)	/* Register 105 - Receive Frame Count for Undersize Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXUCASTG       : 32;	/* RXUCASTG */
	} B;
	int I;
	unsigned int U;

} ETH_RX_UNICAST_FRAMES_GOOD_type;
#define ETH_RX_UNICAST_FRAMES_GOOD	(*( ETH_RX_UNICAST_FRAMES_GOOD_type *) 0xf001e1c4u)	/* Register 113 - Receive Frame Count for Good Unicast Frames */

