svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXVLANFRGB     : 32;	/* RXVLANFRGB */
	} B;
	int I;
	unsigned int U;

} ETH_RX_VLAN_FRAMES_GOOD_BAD_type;
#define ETH_RX_VLAN_FRAMES_GOOD_BAD	(*( ETH_RX_VLAN_FRAMES_GOOD_BAD_type *) 0xf001e1d8u)	/* Register 118 - Receive Frame Count for Good and Bad VLAN Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RXWDGERR       : 32;	/* RXWDGERR */
	} B;
	int I;
	unsigned int U;

} ETH_RX_WATCHDOG_ERROR_FRAMES_type;
#define ETH_RX_WATCHDOG_ERROR_FRAMES	(*( ETH_RX_WATCHDOG_ERROR_FRAMES_type *) 0xf001e1dcu)	/* Register 119 - Receive Frame Count for Watchdog Error Frames */

typedef volatile union
{
	struct
	{ 
		unsigned int TI             : 1;	/* Transmit Interrupt */
		unsigned int TPS            : 1;	/* Transmit Process Stopped */
		unsigned int TU             : 1;	/* Transmit Buffer Unavailable */
		unsigned int TJT            : 1;	/* Transmit Jabber Timeout */
		unsigned int OVF            : 1;	/* Receive Overflow */
		unsigned int UNF            : 1;	/* Transmit Underflow */
		unsigned int RI             : 1;	/* Receive Interrupt */
		unsigned int RU             : 1;	/* Receive Buffer Unavailable */
		unsigned int RPS            : 1;	/* Receive Process Stopped */
		unsigned int RWT            : 1;	/* Receive Watchdog Timeout */
		unsigned int ETI            : 1;	/* Early Transmit Interrupt */
		/* const */ unsigned int RESERVED_12_11 : 2;	/* RESERVED_12_11 */
		unsigned int FBI            : 1;	/* Fatal Bus Error Interrupt */
		unsigned int ERI            : 1;	/* Early Receive Interrupt */
		unsigned int AIS            : 1;	/* Abnormal Interrupt Summary */
		unsigned int NIS            : 1;	/* Normal Interrupt Summary */
		/* const */ unsigned int RS             : 3;	/* Received Process State */
		/* const */ unsigned int TS             : 3;	/* Transmit Process State */
		/* const */ unsigned int EB             : 3;	/* Error Bits */
		/* const */ unsigned int GLI            : 1;	/* GMAC Line interface Interrupt */
		/* const */ unsigned int GMI            : 1;	/* GMAC MMC Interrupt */
		/* const */ unsigned int GPI            : 1;	/* GMAC PMT Interrupt */
		/* const */ unsigned int TTI            : 1;	/* Timestamp Trigger Interrupt */
		/* const */ unsigned int GLPII          : 1;	/* GMAC LPI Interrupt (for Channel 0) */
		/* const */ unsigned int RESERVED_31    : 1;	/* RESERVED_31 */
	} B;
	int I;
	unsigned int U;

} ETH_STATUS_type;
#define ETH_STATUS	(*( ETH_STATUS_type *) 0xf001f014u)	/* Register 5 - Status Register */

typedef volatile union
{
	struct
	{ 
		unsigned int SSINC          : 8;	/* Sub-second Increment Value */
		/* const */ unsigned int RESERVED_31_8  : 24;	/* RESERVED_31_8 */
	} B;
	int I;
	unsigned int U;

} ETH_SUB_SECOND_INCREMENT_type;
#define ETH_SUB_SECOND_INCREMENT	(*( ETH_SUB_SECOND_INCREMENT_type *) 0xf001e704u)	/* Register 449 - Sub-Second Increment Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSHWR          : 16;	/* Timestamp Higher Word Register */
		/* const */ unsigned int RESERVED_31_16 : 16;	/* RESERVED_31_16 */
	} B;
	int I;
	unsigned int U;

} ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_type;
#define ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS	(*( ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_type *) 0xf001e724u)	/* Register 457 - System Time - Higher Word Seconds Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TSSS           : 31;	/* Timestamp Sub Seconds */
		/* const */ unsigned int RESERVED_31    : 1;	/* RESERVED_31 */
	} B;
	int I;
	unsigned int U;

} ETH_SYSTEM_TIME_NANOSECONDS_type;
#define ETH_SYSTEM_TIME_NANOSECONDS	(*( ETH_SYSTEM_TIME_NANOSECONDS_type *) 0xf001e70cu)	/* Register 451 - System Time - Nanoseconds Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSSS           : 31;	/* Timestamp Sub Second */
		unsigned int ADDSUB         : 1;	/* Add or subtract time */
	} B;
	int I;
	unsigned int U;

} ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_type;
#define ETH_SYSTEM_TIME_NANOSECONDS_UPDATE	(*( ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_type *) 0xf001e714u)	/* Register 453 - System Time - Nanoseconds Update Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TSS            : 32;	/* Timestamp Second */
	} B;
	int I;
	unsigned int U;

} ETH_SYSTEM_TIME_SECONDS_type;
#define ETH_SYSTEM_TIME_SECONDS	(*( ETH_SYSTEM_TIME_SECONDS_type *) 0xf001e708u)	/* Register 450 - System Time - Seconds Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSS            : 32;	/* Timestamp Second */
	} B;
	int I;
	unsigned int U;

} ETH_SYSTEM_TIME_SECONDS_UPDATE_type;
#define ETH_SYSTEM_TIME_SECONDS_UPDATE	(*( ETH_SYSTEM_TIME_SECONDS_UPDATE_type *) 0xf001e710u)	/* Register 452 - System Time - Seconds Update Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TTSLO          : 31;	/* Target Timestamp Low Register */
		/* const */ unsigned int TRGTBUSY       : 1;	/* Target Time Register Busy */
	} B;
	int I;
	unsigned int U;

} ETH_TARGET_TIME_NANOSECONDS_type;
#define ETH_TARGET_TIME_NANOSECONDS	(*( ETH_TARGET_TIME_NANOSECONDS_type *) 0xf001e720u)	/* Register 456 - Target Time Nanoseconds Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSTR           : 32;	/* Target Time Seconds Register */
	} B;
	int I;
	unsigned int U;

} ETH_TARGET_TIME_SECONDS_type;
#define ETH_TARGET_TIME_SECONDS	(*( ETH_TARGET_TIME_SECONDS_type *) 0xf001e71cu)	/* Register 455 - Target Time Seconds Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSAR           : 32;	/* Timestamp Addend Register */
	} B;
	int I;
	unsigned int U;

} ETH_TIMESTAMP_ADDEND_type;
#define ETH_TIMESTAMP_ADDEND	(*( ETH_TIMESTAMP_ADDEND_type *) 0xf001e718u)	/* Register 454 - Timestamp Addend Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TSENA          : 1;	/* Timestamp Enable */
		unsigned int TSCFUPDT       : 1;	/* Timestamp Fine or Coarse Update */
		unsigned int TSINIT         : 1;	/* Timestamp Initialize */
		unsigned int TSUPDT         : 1;	/* Timestamp Update */
		unsigned int TSTRIG         : 1;	/* Timestamp Interrupt Trigger Enable */
		unsigned int TSADDREG       : 1;	/* Addend Reg Update */
		/* const */ unsigned int RESERVED_7_6   : 2;	/* RESERVED_7_6 */
		unsigned int TSENALL        : 1;	/* Enable Timestamp for All Frames */
		unsigned int TSCTRLSSR      : 1;	/* Timestamp Digital or Binary Rollover Control */
		unsigned int TSVER2ENA      : 1;	/* Enable PTP packet Processing for Version 2 Format */
		unsigned int TSIPENA        : 1;	/* Enable Processing of PTP over Ethernet Frames */
		unsigned int TSIPV6ENA      : 1;	/* Enable Processing of PTP Frames Sent Over IPv6-UDP */
		unsigned int TSIPV4ENA      : 1;	/* Enable Processing of PTP Frames Sent over IPv4-UDP */
		unsigned int TSEVNTENA      : 1;	/* Enable Timestamp Snapshot for Event Messages */
		unsigned int TSMSTRENA      : 1;	/* Enable Snapshot for Messages Relevant to Master */
		unsigned int SNAPTYPSEL     : 2;	/* Select PTP packets for Taking Snapshots */
		unsigned int TSENMACADDR    : 1;	/* Enable MAC address for PTP Frame Filtering */
		/* const */ unsigned int RESERVED_23_19 : 5;	/* RESERVED_23_19 */
		/* const */ unsigned int ATSFC          : 1;	/* Auxiliary Snapshot FIFO Clear */
		/* const */ unsigned int ATSEN0         : 1;	/* Auxiliary Snapshot 0 Enable */
		/* const */ unsigned int ATSEN1         : 1;	/* Auxiliary Snapshot 1 Enable */
		/* const */ unsigned int ATSEN2         : 1;	/* Auxiliary Snapshot 2 Enable */
		/* const */ unsigned int ATSEN3         : 1;	/* Auxiliary Snapshot 3 Enable */
		/* const */ unsigned int RESERVED_31_29 : 3;	/* RESERVED_31_29 */
	} B;
	int I;
	unsigned int U;

} ETH_TIMESTAMP_CONTROL_type;
#define ETH_TIMESTAMP_CONTROL	(*( ETH_TIMESTAMP_CONTROL_type *) 0xf001e700u)	/* Register 448 - Timestamp Control Register */

