svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TSSOVF         : 1;	/* Timestamp Seconds Overflow */
		/* const */ unsigned int TSTARGT        : 1;	/* Timestamp Target Time Reached */
		/* const */ unsigned int AUXTSTRIG      : 1;	/* Auxiliary Timestamp Trigger Snapshot */
		/* const */ unsigned int TSTRGTERR      : 1;	/* Timestamp Target Time Error */
		/* const */ unsigned int TSTARGT1       : 1;	/* Timestamp Target Time Reached for Target Time PPS1 */
		/* const */ unsigned int TSTRGTERR1     : 1;	/* Timestamp Target Time Error */
		/* const */ unsigned int TSTARGT2       : 1;	/* Timestamp Target Time Reached for Target Time PPS2 */
		/* const */ unsigned int TSTRGTERR2     : 1;	/* Timestamp Target Time Error */
		/* const */ unsigned int TSTARGT3       : 1;	/* Timestamp Target Time Reached for Target Time PPS3 */
		/* const */ unsigned int TSTRGTERR3     : 1;	/* Timestamp Target Time Error */
		/* const */ unsigned int RESERVED_15_10 : 6;	/* RESERVED_15_10 */
		/* const */ unsigned int ATSSTN         : 4;	/* Auxiliary Timestamp Snapshot Trigger Identifier */
		/* const */ unsigned int RESERVED_23_20 : 4;	/* RESERVED_23_20 */
		/* const */ unsigned int ATSSTM         : 1;	/* Auxiliary Timestamp Snapshot Trigger Missed */
		/* const */ unsigned int ATSNS          : 5;	/* Number of Auxiliary Timestamp Snapshots */
		/* const */ unsigned int RESERVED_31_30 : 2;	/* RESERVED_31_30 */
	} B;
	int I;
	unsigned int U;

} ETH_TIMESTAMP_STATUS_type;
#define ETH_TIMESTAMP_STATUS	(*( ETH_TIMESTAMP_STATUS_type *) 0xf001e728u)	/* Register 458 - Timestamp Status Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int RESERVED_1_0   : 2;	/* RESERVED_1_0 */
		unsigned int TDESLA_32bit   : 30;	/* Start of Transmit List */
	} B;
	int I;
	unsigned int U;

} ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_type;
#define ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS	(*( ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_type *) 0xf001f010u)	/* Register 4 - Transmit Descriptor List Address Register */

typedef volatile union
{
	struct
	{ 
		unsigned int TPD            : 32;	/* Transmit Poll Demand */
	} B;
	int I;
	unsigned int U;

} ETH_TRANSMIT_POLL_DEMAND_type;
#define ETH_TRANSMIT_POLL_DEMAND	(*( ETH_TRANSMIT_POLL_DEMAND_type *) 0xf001f004u)	/* Register 1 - Transmit Poll Demand Register */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TX1024_MAXOCTGB: 32;	/* TX1024_MAXOCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_type;
#define ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD	(*( ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_type *) 0xf001e138u)	/* Register 78 - Transmit Octet Count for Good and Bad 1024 to Maxsize Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TX128_255OCTGB : 32;	/* TX128_255OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD	(*( ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e12cu)	/* Register 75 - Transmit Octet Count for Good and Bad 128 to 255 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TX256_511OCTGB : 32;	/* TX256_511OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD	(*( ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e130u)	/* Register 76 - Transmit Octet Count for Good and Bad 256 to 511 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TX512_1023OCTGB: 32;	/* TX512_1023OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD	(*( ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e134u)	/* Register 77 - Transmit Octet Count for Good and Bad 512 to 1023 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TX64OCTGB      : 32;	/* TX64OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_64OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_TX_64OCTETS_FRAMES_GOOD_BAD	(*( ETH_TX_64OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e124u)	/* Register 73 - Transmit Octet Count for Good and Bad 64 Byte Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TX65_127OCTGB  : 32;	/* TX65_127OCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_type;
#define ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD	(*( ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_type *) 0xf001e128u)	/* Register 74 - Transmit Octet Count for Good and Bad 65 to 127 Bytes Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXBCASTG       : 32;	/* TXBCASTG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_BROADCAST_FRAMES_GOOD_type;
#define ETH_TX_BROADCAST_FRAMES_GOOD	(*( ETH_TX_BROADCAST_FRAMES_GOOD_type *) 0xf001e11cu)	/* Register 71 - Transmit Frame Count for Good Broadcast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXBCASTGB      : 32;	/* TXBCASTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_BROADCAST_FRAMES_GOOD_BAD_type;
#define ETH_TX_BROADCAST_FRAMES_GOOD_BAD	(*( ETH_TX_BROADCAST_FRAMES_GOOD_BAD_type *) 0xf001e144u)	/* Register 81 - Transmit Frame Count for Good and Bad Broadcast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXCARR         : 32;	/* TXCARR */
	} B;
	int I;
	unsigned int U;

} ETH_TX_CARRIER_ERROR_FRAMES_type;
#define ETH_TX_CARRIER_ERROR_FRAMES	(*( ETH_TX_CARRIER_ERROR_FRAMES_type *) 0xf001e160u)	/* Register 88 - Transmit Frame Count for Carrier Sense Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXDEFRD        : 32;	/* TXDEFRD */
	} B;
	int I;
	unsigned int U;

} ETH_TX_DEFERRED_FRAMES_type;
#define ETH_TX_DEFERRED_FRAMES	(*( ETH_TX_DEFERRED_FRAMES_type *) 0xf001e154u)	/* Register 85 - Transmit Frame Count for Deferred Frames */

