svn2github/ERIKA-Enterprise/pkg/mcu/infineon_tc27x/inc/ee_tc27x_gnu_sfr.h
typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXEXSCOL       : 32;	/* TXEXSCOL */
	} B;
	int I;
	unsigned int U;

} ETH_TX_EXCESSIVE_COLLISION_FRAMES_type;
#define ETH_TX_EXCESSIVE_COLLISION_FRAMES	(*( ETH_TX_EXCESSIVE_COLLISION_FRAMES_type *) 0xf001e15cu)	/* Register 87 - Transmit Frame Count for Excessive Collision Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXEXSDEF       : 32;	/* TXEXSDEF */
	} B;
	int I;
	unsigned int U;

} ETH_TX_EXCESSIVE_DEFERRAL_ERROR_type;
#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR	(*( ETH_TX_EXCESSIVE_DEFERRAL_ERROR_type *) 0xf001e16cu)	/* Register 91 - Transmit Frame Count for Excessive Deferral Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXFRMG         : 32;	/* TXFRMG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_FRAME_COUNT_GOOD_type;
#define ETH_TX_FRAME_COUNT_GOOD	(*( ETH_TX_FRAME_COUNT_GOOD_type *) 0xf001e168u)	/* Register 90 - Transmit Frame Count for Good Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXFRMGB        : 32;	/* TXFRMGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_FRAME_COUNT_GOOD_BAD_type;
#define ETH_TX_FRAME_COUNT_GOOD_BAD	(*( ETH_TX_FRAME_COUNT_GOOD_BAD_type *) 0xf001e118u)	/* Register 70 - Transmit Frame Count for Good and Bad Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXLATECOL      : 32;	/* TXLATECOL */
	} B;
	int I;
	unsigned int U;

} ETH_TX_LATE_COLLISION_FRAMES_type;
#define ETH_TX_LATE_COLLISION_FRAMES	(*( ETH_TX_LATE_COLLISION_FRAMES_type *) 0xf001e158u)	/* Register 86 - Transmit Frame Count for Late Collision Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXMCASTG       : 32;	/* TXMCASTG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_MULTICAST_FRAMES_GOOD_type;
#define ETH_TX_MULTICAST_FRAMES_GOOD	(*( ETH_TX_MULTICAST_FRAMES_GOOD_type *) 0xf001e120u)	/* Register 72 - Transmit Frame Count for Good Multicast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXMCASTGB      : 32;	/* TXMCASTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_MULTICAST_FRAMES_GOOD_BAD_type;
#define ETH_TX_MULTICAST_FRAMES_GOOD_BAD	(*( ETH_TX_MULTICAST_FRAMES_GOOD_BAD_type *) 0xf001e140u)	/* Register 80 - Transmit Frame Count for Good and Bad Multicast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXMULTCOLG     : 32;	/* TXMULTCOLG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_type;
#define ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES	(*( ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_type *) 0xf001e150u)	/* Register 84 - Transmit Frame Count for Frames Transmitted after Multiple Collision */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXOCTG         : 32;	/* TXOCTG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_OCTET_COUNT_GOOD_type;
#define ETH_TX_OCTET_COUNT_GOOD	(*( ETH_TX_OCTET_COUNT_GOOD_type *) 0xf001e164u)	/* Register 89 - Transmit Octet Count for Good Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXOCTGB        : 32;	/* TXOCTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_OCTET_COUNT_GOOD_BAD_type;
#define ETH_TX_OCTET_COUNT_GOOD_BAD	(*( ETH_TX_OCTET_COUNT_GOOD_BAD_type *) 0xf001e114u)	/* Register 69 - Transmit Octet Count for Good and Bad Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXOSIZG        : 32;	/* TXOSIZG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_OSIZE_FRAMES_GOOD_type;
#define ETH_TX_OSIZE_FRAMES_GOOD	(*( ETH_TX_OSIZE_FRAMES_GOOD_type *) 0xf001e178u)	/* Register 94 - Transmit Frame Count for Good Oversize Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXPAUSE        : 32;	/* TXPAUSE */
	} B;
	int I;
	unsigned int U;

} ETH_TX_PAUSE_FRAMES_type;
#define ETH_TX_PAUSE_FRAMES	(*( ETH_TX_PAUSE_FRAMES_type *) 0xf001e170u)	/* Register 92 - Transmit Frame Count for Good PAUSE Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXSNGLCOLG     : 32;	/* TXSNGLCOLG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_type;
#define ETH_TX_SINGLE_COLLISION_GOOD_FRAMES	(*( ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_type *) 0xf001e14cu)	/* Register 83 - Transmit Frame Count for Frames Transmitted after Single Collision */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXUNDRFLW      : 32;	/* TXUNDRFLW */
	} B;
	int I;
	unsigned int U;

} ETH_TX_UNDERFLOW_ERROR_FRAMES_type;
#define ETH_TX_UNDERFLOW_ERROR_FRAMES	(*( ETH_TX_UNDERFLOW_ERROR_FRAMES_type *) 0xf001e148u)	/* Register 82 - Transmit Frame Count for Underflow Error Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXUCASTGB      : 32;	/* TXUCASTGB */
	} B;
	int I;
	unsigned int U;

} ETH_TX_UNICAST_FRAMES_GOOD_BAD_type;
#define ETH_TX_UNICAST_FRAMES_GOOD_BAD	(*( ETH_TX_UNICAST_FRAMES_GOOD_BAD_type *) 0xf001e13cu)	/* Register 79 - Transmit Frame Count for Good and Bad Unicast Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int TXVLANG        : 32;	/* TXVLANG */
	} B;
	int I;
	unsigned int U;

} ETH_TX_VLAN_FRAMES_GOOD_type;
#define ETH_TX_VLAN_FRAMES_GOOD	(*( ETH_TX_VLAN_FRAMES_GOOD_type *) 0xf001e174u)	/* Register 93 - Transmit Frame Count for Good VLAN Frames */

typedef volatile union
{
	struct
	{ 
		/* const */ unsigned int SNPSVER        : 8;	/* SNPSVER */
		/* const */ unsigned int USERVER        : 8;	/* USERVER */
		/* const */ unsigned int RESERVED_31_16 : 16;	/* RESERVED_31_16 */
	} B;
	int I;
	unsigned int U;

} ETH_VERSION_type;
#define ETH_VERSION	(*( ETH_VERSION_type *) 0xf001e020u)	/* Register 8 - Version Register */

typedef volatile union
{
	struct
	{ 
		unsigned int VL             : 16;	/* VLAN Tag Identifier for Receive Frames */
		unsigned int ETV            : 1;	/* Enable 12-Bit VLAN Tag Comparison */
		unsigned int VTIM           : 1;	/* VLAN Tag Inverse Match Enable */
		unsigned int ESVL           : 1;	/* Enable S-VLAN */
		/* const */ unsigned int VTHM           : 1;	/* VLAN Tag Hash Table Match Enable */
		/* const */ unsigned int RESERVED_31_20 : 12;	/* RESERVED_31_20 */
	} B;
	int I;
	unsigned int U;

} ETH_VLAN_TAG_type;
#define ETH_VLAN_TAG	(*( ETH_VLAN_TAG_type *) 0xf001e01cu)	/* Register 7 - VLAN Tag Register */

#endif /*_REGTC27X_H*/
